{"title":"Discovery Channel The Red Bomb 3of3 In the Name of Peace XviD AC","uid":8610010,"size":746475520,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:001acf4b0feb7e32b9f69f66e8b72b582201e3db&amp;dn=Discovery+Channel+The+Red+Bomb+3of3+In+the+Name+of+Peace+XviD+AC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":-1,"time":1372112075,"description":"The Red Bomb\n\nHistory Documentary hosted by Sean Barrett, published by Discovery Channel in 1994 - English narration\n\n\nInformation\n------------------------------\n\nThe Red Bomb chronicles Russia's staggering transformation from lagging also-ran into nuclear superpower, as the USA and USSR battled it out for possession of the ultimate weapon. \n90-year-old Yuly Khariton is a reclusive man with gentle eyes, who appears to spends many an evening lost in thought, as his female companion plays old songs on the piano. But Khariton's simple lifestyle belies his unbelievable past, and the part he played in the nuclear arms race - a vast and complex web of intrigue that was the crux of the Cold War. For over thirty years, he was one of the leading figures in the Soviet nuclear weapons programme; even now, he still travels in his own private train carriage, complete with personal housekeeper - a privilege shared by few other nonagenarians.\nIn Soviet Russia, scientific research allowed no margin for error: if the survival of the communist regime depended on the success of the bomb project, so too did the lives of its researchers. Asked what would happen in the event of failure, Stalin replied: &quot;Shoot the scientists.&quot; But though the USA poured the equivalent of 20-30 billion roubles into the creation of the bomb, the USSR achieved the same result at much less expense - largely thanks to its intelligence network that spanned all the world's research hotspots, from the university of Cambridge to the deserts of New Mexico.\nProgress on the Soviet side of the Iron Curtain was top secret: the wider world relied on whispers, and the occasional shockwave reaching Washington from test sites in the remote Kazakh steppe. While America was broadcasting its nuclear prowess in triumphant newsreels, few in the West suspected how close Russia was to retaliation.\nWith Khariton as senior scientific consultant, filmmaker Jamie Doran gains unprecedented access to a cast of fascinating characters, including pilots and Red Guards, eminent physicsts and NKVD spies. Filmed in the early 1990s, and deftly interweaving archive footage and eyewitness accounts, The Red Bomb is itself a snapshot of a unique moment in history, as a Russia on its way out of Stalin's shadow offers a glimpse of its arsenal of Cold War secrets.\n\nExecutive Producers for Discovery : Tomi Bednar Landis &amp; Nancy LeBrun\nProduced and Directed by Jamie Doran\nA Rapide Production for Discovery Communications 1994\n\n\n\n3)  In the Name of Peace \nThis final episode addresses the legacy of the Red Bomb, and the steady stream of scientists who became disenchanted with the project after seeing the potential devastation it could cause.\n\n\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1744 kbps\nVideo Resolution: 720x536\nVideo Aspect Ratio: 1.343:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 50:53.000\nNumber Of Parts: 3\nPart Size: 700 MB (average)\nRipped by: DocFreak08\n\n\n","torrent":{"xt":"urn:btih:001acf4b0feb7e32b9f69f66e8b72b582201e3db","amp;dn":"Discovery+Channel+The+Red+Bomb+3of3+In+the+Name+of+Peace+XviD+AC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"001acf4b0feb7e32b9f69f66e8b72b582201e3db","infoHashBuffer":{"type":"Buffer","data":[0,26,207,75,15,235,126,50,185,246,159,102,232,183,43,88,34,1,227,219]},"announce":[],"urlList":[]}}