{"title":"AUSTRALIA - Aboriginal - Songs from the Northern Territory cd2","uid":4389624,"size":60384320,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:00470244273d9bb12b7457ba1175175794dcdcfd&amp;dn=AUSTRALIA+-+Aboriginal+-+Songs+from+the+Northern+Territory+cd2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starinar","files":14,"time":1221095917,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\nSongs From the Northern Territory 2: Music From Eastern Arnhem Land \nArtist/Collector: \nAlice Moyle \nLabel Information: \nAustralian Institute of Aboriginal and Torres Strait Islander Studies (AIATSIS): AIAS 2 CD \nMedia Type: \nCD \nYear: \nRecorded 1963; Released 1997 \nAvailability: \nAIATSIS \n\n\nNotes: For the purpose of music description, Eastern Arnhem Land of the \nNorthern Territory is divided here as follows: the north-eastern sector \nincluding offshore islands; the eastern sector extending along the coast \nas far south as the Roper River; and the Groote Eylandt archipelago \nnorth-west of the Gulf of Carpentaria. \nField recordings reproduced on this compact disc were collected in the \neastern sector at Numbulwar, an Aboriginal settlement at the mouth of \nthe Rose River where the Aboriginal language spoken is Nunggubuyu. They \ninclude a few samples of songs by Djapu-speaking Yolngu people who were \nliving temporarily on this same settlement, their own territory being \nsituated at Caledon Bay further north. \nSongs heard on disc 2 represent the music of some of the last groups of \nAboriginal people to live in continuous contact with a white settlement. \nA mission station (Church Missionary Society) was established at Numbulwar \nas recently as 1952. \nSince the 1970s, however, there have been many changes in the places of \nAboriginal settlement. Mission stations and government settlements are \nnow Community Centres administered by the Aboriginal people themselves, \nand many have preferred to live more or less permanently on outstations \nsituated within traditional territories or homelands. \nItem characteristics of Eastern Arnhem Land clan songs performed and recorded \nin 1960s-all of which were sung by men-are summarised here as follows: \n(1) a didjeridu accompaniment which utilises two tones differing widely in \npitch (the interval between the higher or overblown tone and the fundamental \noften sounding close to a tenth but varying according to the shape and length \nof the hollowed branch); (2) a narrow vocal range of pitch (compare them, for \ninstance, with Western Arnhem Land songs) which rarely exceeds a fifth or sixth \nand may be less than a second; (3) song words which are translatable, meaningful \nand appropriate to relevant clan territories and related myths; and (4) the \noccurrence of an unaccompanied vocal termination (UVT), or termination of a song \nitem by voice or voices alone after the accompanying instruments have ceased. \nGood examples of this fourth item characteristic are to be heard on discs 3 \n(Track 11) and 4 (Track 1). \nSong refrains may consist of repeated strings of words and syllables; a prolonged \nsingle syllable; or a repeated pattern of vocal sounds (for example, bird calls). \nThese calls are incorporated into the particular sectional or phraselike structure \nof many item sequences performed in Eastern Arnhem Land. \nAll but one of the Nunggubuyu items on disc 2 were referred to as 'New Brolga' \nitems. Ngardhangi (Track 9), was said to have been the first to introduce into \nthe New Brolga style the preliminary 'cry' or opening vocalised glide. This 'cry', \nwhich covers a notably wide pitch range (approximately a twelfth), was interpreted \nas the brolga bird's longing for its home country. It is followed by two song \nsections, each taken at a lively pace and ending with chirping calls such as durrk \nand so on. In the breaks between the vocal sections, the didjeridu and stickbeating \naccompaniments maintain the item's continuity. \nClan items in the 'Old Brolga' style (Track 7i), though rarely performed at the \ntime, exhibited the four characteristics stated above. \nDivided into five tracks for the convenience of listeners, the first five tracks \nconsist of a continuous recording of a complete dance event or corroboree. The \ntwenty-two items were contributed by members of two clans of the Mandhayung \nmoiety: the Ngalmi clan represented by Brolga singers Gulundu (b. 1922), Ngardhangi \n(b. 1933) and Arrama (b. 1938); and the Murungun clan who contributed Fish and \nFeathered String items sung by Larangana (b. 1910) assisted by Djingudi. \nDidjeridu accompaniments for both clans were played almost without falter by Rimili \n(b. 1938), Nunggargalug clan, Mandirritja moiety. Throughout the performance there \nwas regular alternation between the singers of each clan as follows: \nITEMS BY NGALMI SINGERS \nITEMS BY MURUNGUN SINGERS \ni. The Brolgas come in \nii Yambirrigu (fish) \niii Another flock arrives \niv Yambirrigu (fish) \nv Another flock arrives \niv Yambirrigu (fish) \nvii Daybreak \nviii. Dhambul (feathered strings) \nix Daybreak \nx Dhambul (feathered strings) \nxi* Brolgas coming from Warkala \nxii Dhambul (feathered strings) \nxiii Still coming from Warkala, Ramiyu and Karangarri \nxiv Dhambul (feathered strings) \nxv Daybreak \nxvi* Dhambul ('stand them up', that is hold up the sticks by which the \nfeathered strings are hoisted) \nxvii Brolgas coming from Warkala \nxviii Dhambul \nxix Brolgas coming from Warkala \nxx* Dhambul \nxxi Brolgas coming ('finish') \nxxii Dhambul ('finish') \nAsterisks mark the first items in tracks 1-5. \nDancers performed solo, in pairs and more often as a group. Fifteen or more men could \nbe seen following one another in circular formation or advancing, side by side, in a \nline with bird-like hops, arms outstretched like wings. Their chirping sounds intermingle \nwith the bird-call refrains of the singers. \nWomen and girls watched but did not take part in the performance. \nMany bystanders contributed to the general atmosphere of excitement and their asides \nand high-pitched communications are to be heard in the recording. \nAfter the concluding items by each clan ( xxi and xxii), voices can be heard calling \nout that the performance had finished. In answer to my inquiry, after the corroboree \nwas over, I was told that there was 'no special song to finish; they just leave it'. \nThis remark is to be contrasted with the information given to me concerning the last \nitem or manbadjan in the Western Arnhem Land Blue Tongue corroboree. See disc 1, Track 2. \nThe three men who sang for the Brolga corroboree (Tracks 1-5) are heard to better advantage \nas soloists in tracks 6, 7 and 9. \nAmong these New Brolga 'finders' there appeared to be a free exchange of songs. On Groote \nEylandt in 1962 Arrama performed some of Ngardhangi's songs. The following year at Numbulwar, \nGulundu sang Brolga songs composed or 'found' by Ngardhangi, Arrama and another singer, Dabulu.\n\nManikay.com","torrent":{"xt":"urn:btih:00470244273d9bb12b7457ba1175175794dcdcfd","amp;dn":"AUSTRALIA+-+Aboriginal+-+Songs+from+the+Northern+Territory+cd2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00470244273d9bb12b7457ba1175175794dcdcfd","infoHashBuffer":{"type":"Buffer","data":[0,71,2,68,39,61,155,177,43,116,87,186,17,117,23,87,148,220,220,253]},"announce":[],"urlList":[]}}