{"title":"The Vampire Diaries (novel series) {Rahul Pr.}","uid":8155616,"size":13099594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01256e280486ae278cc3985f88eb5f0e15c072fb&amp;dn=The+Vampire+Diaries+%28novel+series%29+%7BRahul+Pr.%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rahul4631","files":10,"time":1361157034,"description":"The Vampire Diaries was a young adult vampire horror series of novels created by L. J. Smith. The story centers on Elena Gilbert, a young high school girl who finds herself eventually torn between two vampire brothers, Stefan and Damon Salvatore. The series was originally a trilogy published in 1991, but pressure from readers led Smith to write a fourth volume, Dark Reunion, which was released the following year in 1992. The entire series revolves around Stefan and Elena as the two main protagonists. The first three novels in the original series: The Awakening, The Struggle, and The Fury all feature Stefan Salvatore and Elena Gilbert as the narrators of the series. The first three novels in the original series are both from Stefan and Elena's point of view, but the last book in the original series, Dark Reunion, is from Bonnie McCullough's viewpoint.\nAfter taking a long hiatus from writing Smith announced a new spin off trilogy in 2007 entitled The Vampire Diaries: The Return which featured Damon as the protagonist. The first installment of The Return trilogy, Nightfall, was released on February 10, 2009. Shadow Souls, the second book of The Return trilogy, was released on March 16, 2010. The third and final book of The Return trilogy, Midnight, was released on March 15, 2011.\nThe trilogy after The Hunters trilogy, The Return, will be written by a ghostwriter. The trilogy goes back to featuring Stefan and Elena as the narrators and main protagonists. Smith signed a &quot;work for hire&quot; contract back when she had written the original Vampire Diaries novel trilogy, which means Alloy owns the copyrights to the series. Many speculations have been made to why Smith was fired, but no official statement has been made by author or publisher. Smith had originally intended to call the books in The Hunters trilogy Phantom, Evensong and Eternity, but she retained the name Eternity and will be writing a book unrelated to the series called Eternity: A Vampire Love Story. The title of the third book in The Hunters trilogy is Destiny Rising, according to GoodReads.com.\nThe new trilogy of The Hunters will focus mainly on Stefan and Elena, their life in college and all the events surrounding it. Phantom was released on October 25, 2011. Moonsong was released on March 13, 2012. Destiny Rising, the final book of The Hunters trilogy and also, the final book of the entire series, was released on October 23, 2012.\nA television series, which is loosely based on the book series (The first three novels in the original series as well as Dark Reunion), premiered on September 10, 2009, on The CW.[1]","torrent":{"xt":"urn:btih:01256e280486ae278cc3985f88eb5f0e15c072fb","amp;dn":"The+Vampire+Diaries+%28novel+series%29+%7BRahul+Pr.%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01256e280486ae278cc3985f88eb5f0e15c072fb","infoHashBuffer":{"type":"Buffer","data":[1,37,110,40,4,134,174,39,140,195,152,95,136,235,95,14,21,192,114,251]},"announce":[],"urlList":[]}}