{"title":"Time of Death,Decomposition and Identification-An Atlas{BBS}","uid":6649825,"size":14887139,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01674df6988926d8a7de4515443ee114fc82bff8&amp;dn=Time+of+Death%2CDecomposition+and+Identification-An+Atlas%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315095061,"description":"A postmortem X-ray of a male homicide victim reveals a bullet lodged next to his spine. That he was shot is clear. How recently? is what death investigators must determine. The answer: the absence of scar tissue surrounding the bullet proves the victim had been recently shot.\n\nAnd while the average person may find tattoos to be creative and aesthetic, to the trained death investigator, they can actually be the key to aiding in the eventual identification of a body.\n\nThey say the dead can't speak. But in the fascinating field of forensic pathology, the deceased can tell an elaborate story, especially when death investigators know what clues to look for.\n\nThe first volume in the new Forensic Pathology Atlases: Causes of Death Series, this book takes an in-depth look at the determination of the time of death, postmortem changes, and identification. In TIME OF DEATH, DECOMPOSITION AND IDENTIFICATION, you'll learn through the extensive use of photographs and discussion how estimating the time of death can rarely be accomplished with scientific accuracy. You'll learn about the numerous changes the body undergoes after death, and how positive and probable identifications are made.\n\nFor death investigators, law enforcement officers, attorneys, and anyone else involved in forensic death cases, TIME OF DEATH, DECOMPOSITION AND IDENTIFICATION is a &quot;must have&quot; resource.\nProduct Details\n\n    * Paperback: 120 pages\n    * Publisher: CRC Press; 1 edition (December 7, 1999)\n    * Language: English\n    * ISBN-10: 0849323673\n    * ISBN-13: 978-0849323676","torrent":{"xt":"urn:btih:01674df6988926d8a7de4515443ee114fc82bff8","amp;dn":"Time+of+Death%2CDecomposition+and+Identification-An+Atlas%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01674df6988926d8a7de4515443ee114fc82bff8","infoHashBuffer":{"type":"Buffer","data":[1,103,77,246,152,137,38,216,167,222,69,21,68,62,225,20,252,130,191,248]},"announce":[],"urlList":[]}}