{"title":"Weird Al Yankovic - Gump [promo].VOB","uid":12171739,"size":116320256,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:01a181b3fc7e11b40ca1b5765b2613f40334b6bb&amp;dn=Weird+Al+Yankovic+-+Gump+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":1,"time":1438219735,"description":"Weird Al Yankovic - Gump [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Gump&quot; is a song by American musical parodist &quot;Weird Al&quot; Yankovic. It is a parody of &quot;Lump&quot; by alternative rock group The Presidents of the United States of America and also parodies the 1994 movie Forrest Gump. It is one of several Yankovic songs describing the events of a movie, such as &quot;Jurassic Park&quot; and &quot;The Saga Begins.&quot;\n\nThe cover for the single is itself a parody of the Presidents of the United States of America's logo. This is one of Yankovic's shortest album parodies, second only to his remade version of &quot;My Bologna&quot; (a parody of The Knack's &quot;My Sharona&quot;). In the video for this song, Yankovic dons a bald cap. The The Presidents of the United States of America themselves praised the parody and has since often referred to the &quot;Weird Al&quot; song during live performances.\n\nThe music video for &quot;Gump&quot; is a double parody of both the movie Forrest Gump and the Presidents of the United States of America's music video for &quot;Lump&quot;. The single's cover art is directly taken from the video shoot.\n\nThe video begins with a feather blowing through the air, much like the beginning of the original movie.\n\nAndy Comeau appears as the titular character, Forrest Gump.\n\nYankovic appears as Chris Ballew, complete with bald head.\n\nJohn &quot;Bermuda&quot; Schwartz appears as Jason Finn, and Steve Jay appears as Dave Dederer. Yankovic has stated that originally his guitarist, Jim West, was supposed to play the part of Dederer, but his hair was too long. Jay later filled in.\n\nThroughout the video Forrest offers different people chocolates. He first offers Gladys Ormphby (Ruth Buzzi's Laugh-In character) some chocolates and she hits him with her purse. The second offer is to large, strong man Henry Reichenbach which results in Gump being spun around by his head. He then offers Pat Boone some chocolates. Boone greedily devours most of the box.\n\nThe instruments used in the song are over-simplified as a parody of the Presidents of the United States of America's actual instruments (a basitar, or 2 stringed guitar for bass, and a guitbass, which is a 3 stringed guitar). Al uses a one stringed bass in the video, while the guitarist uses a two stringed &quot;guitar&quot;.\n\nDuring the lyrics &quot;He's kind of square&quot;, Yankovic makes a square with his hand that appears on screen in dotted lines. This is a reference to Pulp Fiction, a film made the same year as Forrest Gump.\n\nIn the instrumential break of the song, it shows Forrest running (a parody of the scene where Forrest runs all around the country) across the street, in a horse race, and outer space. As he runs in the street again, he suddenly bumps into a pole and falls down to the ground, as the song says, &quot;Run...stop!&quot;\n\nAs mentioned before, half of the music video is also a parody of the &quot;Lump&quot; music video: Instead of singing in a bog/marsh, Al and his band are dancing in the water fountain in the middle of the park. The silhouette scene in the Lump music video is also parodied, with Al and his band making hand shadows against the background.\n\nAt 1:04, during the silhouette scenes, Yankovic can be seen bending his guitar. This is similar to the videos for &quot;Smells Like Nirvana&quot; and &quot;Money for Nothing/Beverly Hillbillies*.&quot;\n\nGump is digitally edited into existing footage tapping John F. Kennedy on the shoulder, standing behind Richard Nixon and waving to the camera, and roasting hot dogs at an atomic bomb drop, just like the movie which edited Gump into several newsreels so he appeared to be interacting with historical figures.\n\nThe song ends with, &quot;And that's all I have to say about that&quot;, which is the way Forrest Gump often ends his stories. Afterwards The Presidents Of the United States of America followed Weird Al's example and ended performances of &quot;Lump&quot; with that quote and they still continue to do so.\n\n\nAlfred Matthew &quot;Weird Al&quot; Yankovic (born October 23, 1959) is an American singer, songwriter, parodist, record producer, satirist, actor, music video director, film producer, and author. He is known for his humorous songs that make light of popular culture and often parody specific songs by contemporary musical acts, original songs that are style pastiches of the work of other acts, and polka medleys of several popular songs, featuring his favored instrument, the accordion.\n\nSince his first-aired comedy song in 1976, he has sold more than 12 million albums (as of 2007), recorded more than 150 parody and original songs, and has performed more than 1,000 live shows. His works have earned him four Grammy Awards and a further 11 nominations, four gold records, and six platinum records in the United States. Yankovic's first top ten Billboard album (Straight Outta Lynwood) and single (&quot;White &amp; Nerdy&quot;) were both released in 2006, nearly three decades into his career. His latest album, Mandatory Fun (2014), became his first number-one album on its debut week.\n\nYankovic's success comes in part from his effective use of music video to further parody popular culture, the song's original artist, and the original music videos themselves, scene-for-scene in some cases. He directed later videos himself and went on to direct for other artists including Ben Folds, Hanson, The Black Crowes, and The Presidents of the United States of America.\n\nWeird Al Yankovic's &quot;THE MANDATORY WORLD TOUR&quot; started on May 12 at Las Vegas' Planet Hollywood.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Gump_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Gump_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/qjapeo4u9/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/qjapeo4u9/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7500kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:02:18\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.9\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n*This is one of my first downloads when i got my first PC and got online soon after, downloaded through a site that allowed some free Usenet downloads at the time, and uploads of music videos. I have a few more from then i'm also posting today, they will also have this text","torrent":{"xt":"urn:btih:01a181b3fc7e11b40ca1b5765b2613f40334b6bb","amp;dn":"Weird+Al+Yankovic+-+Gump+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01a181b3fc7e11b40ca1b5765b2613f40334b6bb","infoHashBuffer":{"type":"Buffer","data":[1,161,129,179,252,126,17,180,12,161,181,118,91,38,19,244,3,52,182,187]},"announce":[],"urlList":[]}}