{"title":"Bob Mintzer Big Band - 2002 - Gently FLAC","uid":8687584,"size":392527053,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:01b311eaba4df97cad0ab07c6c6aff1f1bc3e786&amp;dn=Bob+Mintzer+Big+Band+-+2002+-+Gently+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1373833488,"description":"Bob Mintzer Big Band - 2002 - Gently\n\nThe Bob Mintzer Big Band has been a part-time affair for the past 18 years, but somehow the orchestra always manages to sound like a regularly working band. The premise behind Gently was to have the Mintzer Big Band playing at a lower volume, with lyrical arrangements by the leader, along with a greater use of muted brass and flutes. However the orchestra still romps in places and the tempos vary. The big band (which boasts impressive musicianship) features solos from Mintzer on tenor, trumpeters Scott Wendholt, and Michael Mossman, trombonist Michael Davis, pianist Phil Markowitz, altoist Pete Yellin and others, with drummer Peter Erskine driving the ensembles. The solo improvisations grow logically out of the arrangements, showing that Mintzer is expert at writing for specific soloists. Among the high points are the title cut (a harmonically advanced medium-tempo blues), &quot;Body and Soul,&quot; Thad Jones' &quot;Don't Ever Leave Me,&quot; and &quot;Who's Walking Who&quot; (one of Mintzer's six originals). The closing &quot;Saxophone Quartet #2&quot; is a complete change of pace, part of a suite that Mintzer wrote for four saxophones backed by Erskine. There are times when the Bob Mintzer Big Band sounds a bit like the orchestras of Gil Evans, Thad Jones-Mel Lewis, or Don Sebesky, but in general it displays its own personality thanks to the writing and solos of Bob Mintzer. Fans of modern big bands who enjoy hearing thoughtful music will want this set. (AllMusic)\n\nTrack list:\n01 - Gently\n02 - Timeless\n03 - Original People\n04 - Body and Soul\n05 - Who's Walkin' Who\n06 - Don't Ever Leave Me\n07 - Bright Lights\n08 - Saxophone Quartet #2\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:01b311eaba4df97cad0ab07c6c6aff1f1bc3e786","amp;dn":"Bob+Mintzer+Big+Band+-+2002+-+Gently+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01b311eaba4df97cad0ab07c6c6aff1f1bc3e786","infoHashBuffer":{"type":"Buffer","data":[1,179,17,234,186,77,249,124,173,10,176,124,108,106,255,31,27,195,231,134]},"announce":[],"urlList":[]}}