{"title":"Terence McKenna Videos Vol. Three","uid":3421400,"size":2567371248,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01e582a1434f4f2f48324eb2fedcae5b11c2ebe1&amp;dn=Terence+McKenna+Videos+Vol.+Three&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"smotchkic","files":5,"time":1134700257,"description":"NOTE: FOR SOME REASON the first time I upped this torrent, no one could leech from me, so I'm trying it again...   sorry, don't know whats wrong, only happens with pirate bay.\n________________________________________________________________________________\nThe last selection of Terence McKenna vids from me.  Some are lectures, some are more formal video productions. \n\nVideos are mostly ripped from vcd's (DAT files), so you either need to convert them or simply play them in VLC Media Player, free for all platforms. (Search google for VLC).\n\nVideos included in Volume Three:\n\nSeeking the Stone\nThe World and Its Double\nAlien Dreamtime (avi file)\n\nSeeking the Stone\nAn eloquent perspective by Terence McKenna on the idea of a spiritual path for all and an impending transformation of the human world. In his singularly lucid, prosaic style, McKenna presents profoundly compelling ideas that challenge our beliefs and encourage our participation in the creation of a new social reality. He champions the individual?s freedom of choice in deciding one?s own sexual and spiritual development and techniques. He highlights the role of hallucinogenic plants in shamanic societies and their impact on the evolution of human cultures. See why this cyber-techno-shaman is drawing freethinking crowds wherever he speaks and find out what role you may play in the unfolding of our ?post-historical future? as we approach a major ?concresence? in human history.\n\nThe World ...and Its Double\nA full day excursion into the questions he explores with unequaled imagination, where is life carrying us? What is the nature of that other world which co-exists with this one? What is the role of shamanic plants in shaping our consciousness? Hear WHAT IS TIME ALL ABOUT--The brief interval we call life: between the Unknown and the Unspoken. TRT 1:36.\n\nAlien Dreamtime\nfeaturing:\nWords - Terence McKenna\nVisuals - Rose X\nMusic - Spacetime Continuum\nDidgeridu - Stephen Kent\nAlien Dreamtime was produced as a live multi-media event in San Francisco, on the evenings of February 26 and 27, 1993.\nThe performance is divided into three movements, each reflective of Terence McKenna's ethnobotanical theories: Archaic Revival, Alien Love and Time Wave Zero.\n\nMcKenna's presence is combined with the neo-psychedelic visuals of Rose X and ambient techno improvisations by Space Time Continuum and didgeridusita, Stephen Kent.\n\nTake a trip without breaking the law.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:01e582a1434f4f2f48324eb2fedcae5b11c2ebe1","amp;dn":"Terence+McKenna+Videos+Vol.+Three","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01e582a1434f4f2f48324eb2fedcae5b11c2ebe1","infoHashBuffer":{"type":"Buffer","data":[1,229,130,161,67,79,79,47,72,50,78,178,254,220,174,91,17,194,235,225]},"announce":[],"urlList":[]}}