{"title":"Pedro and Me","uid":8369129,"size":43694347,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0246647f3587312ab86e289b64cf6e685e7c24f0&amp;dn=Pedro+and+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"data9724","files":-1,"time":1365861370,"description":"And here you go, anaward-winning, thought-provoking (and tear-provoking) book, Pedro and Me: Friendship, Loss, and What I Learned, by Judd Winick.\n\nFirst of all, half of you most likely hate Judd for introducing a HIV positive person into Green Arrow, and know nothing else about his works. I hope to change that.\n\nLets start with the info at the back of the book:\nPedro Zamora changed lives. When the HIV-positive AIDS educator appeared on MTV's The Real World: San Francisco, he taught millions of viewers about being gay and living with AIDS. Pedro's roommate on the show was Judd Winick, a cartoonist from Long Island. They soon became close friends. Judd created Pedro and Me, a book in words and pictures, to honor Pedro Zamora, his friend and teacher, and most of all, an unforgettable human being.\nThe book has won numerous awards, including being nominated for a Eisner for Best Original Graphic Novel (2000)\n\nI have read the book multiple times, and to say it is a gread book is a gross understatement. The art is cartoony, fairly similar to his works in Barry Ween (also a great read), but this book is all about the story, not the art. And not just the story, but the history, the history of a brilliant young man who gets hit hard by fate, but refuse to lie down and shows amazing courage first coming out to his classmates at school, and then becoming an AIDS educator. \nJust going though the book to find the preview pics actually had me crying a bit, I assume most people will, so you might as well get your Kleenex before you sit down to read it. I dare say that anyone who dont shed a tear at page 163-169 does not have a soul :D.  But it's not just a sad story, there are lots of funny moments, so you should have plenty of laughs too\nThe book of course cover a lot of AIDS material, so you will probably learn a few things about AIDS that you didn't know.\n\nPreview pics: &lt;a href=&quot;\nhttp://img217.imageshack.us/img217/6140/pedro000acover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img217.imageshack.us/img217/6140/pedro000acover.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img402.imageshack.us/img402/2860/pedro021.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img402.imageshack.us/img402/2860/pedro021.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img99.imageshack.us/img99/1220/068kq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img99.imageshack.us/img99/1220/068kq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img27.imageshack.us/img27/2152/pedro113.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img27.imageshack.us/img27/2152/pedro113.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0246647f3587312ab86e289b64cf6e685e7c24f0","amp;dn":"Pedro+and+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0246647f3587312ab86e289b64cf6e685e7c24f0","infoHashBuffer":{"type":"Buffer","data":[2,70,100,127,53,135,49,42,184,110,40,155,100,207,110,104,94,124,36,240]},"announce":[],"urlList":[]}}