{"title":"The Economical Environmentalist: My Attempt to Live","uid":12289527,"size":19962326,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02b2794d59552989d05ef3a7929e3f5acab3ee60&amp;dn=The+Economical+Environmentalist%3A+My+Attempt+to+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":1,"time":1440528830,"description":"The Economical Environmentalist: My Attempt to Live a Low-Carbon Life and What it Cost by Prashant Vaze\n\nOverview: Reducing your carbon emissions in an economic down-turn can be challenging, but saving the planet doesn't have to cost you more.\nTough economic times need not relegate concerns for the planet to the back burner. The author is an environmental economist trying to live a low-carbon life in London. He worked for 15 years in the UK's Office of Climate Change, the Prime Minister's Strategy Unit and the Department of the Environment. So far so good. But he has kids. A family to visit in India. A hectic job. In distilling and building on his own experience of trying to live a low carbon life, he helps us navigate the choices that confront us all - families, singletons, pensioners - when making decisions about what to eat, what to buy, how to travel and how to keep warm in the era of climate change and economic turmoil. He works out the sums and lets us know which choices will make the biggest difference, and which are false savings. His book is an irreverent but seriously rigorous reference guide to low-cost, low-carbon living for everyone - in any location - in tough times. It's brimming with up-to-date information on current and future technologies, tips and ideas for every budget on how to spend the least for the biggest carbon reduction gain and insight from the experiences of people trying to live low-carbon lives","torrent":{"xt":"urn:btih:02b2794d59552989d05ef3a7929e3f5acab3ee60","amp;dn":"The+Economical+Environmentalist%3A+My+Attempt+to+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02b2794d59552989d05ef3a7929e3f5acab3ee60","infoHashBuffer":{"type":"Buffer","data":[2,178,121,77,89,85,41,137,208,94,243,167,146,158,63,90,202,179,238,96]},"announce":[],"urlList":[]}}