{"title":"Success Kills - Wayne Goodall","uid":10350317,"size":575054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02fd4ddce4982325c863ada3f74553a3cd996a7a&amp;dn=Success+Kills+-+Wayne+Goodall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1402666842,"description":"SUCCESS - we crave it, work for it, dream of it, want it as a personal achievement, but how we each define it differs. Power, influence, wealth, fame, or a position of authority--the hallmarks of success we strive for can just as easily become the cause of our destruction, if we don't have a clear set of boundaries by which to live.\nCorporate and religious scandals of recent years have caused unprecedented havoc and heartache in the world's economy and in the church world. Executive and spiritual arrogance causes a toxic atmosphere in too many organizations. There are safegaurds and principles we must focus on to ensure balance with excellence in what we do. Core questions to be considered include:\n\n-Should you fear success?\n-Why do so many fail when they attain success?\n-Is failure considered a friend or foe?\n-Do you have a balanced ego or a pre-occupation with self?\n\nTake a discerning look at the concept of success in a personal, professional, and spiritual context in SUCCESS KILLS. Explore the gift of adversity, finding a moral &quot;north&quot;, learning from mistakes, and why some fear &quot;successful&quot; leaders. Discover a more important definition of success and the principles you can put in place today to achieve without compromising yourself or your future.\n\n\nAbout the author:\nDr. Wayde Goodall is Dean of the College of Ministry at Northwest University, Kirkland, Washington. Because of his extensive writing and pastoral experience internationally, he frequently teaches at colleges and seminaries. His discipleship tools are used in churches and training for pastors, and they have been utilized by Focus on the Family for marriage and counseling in the international community.\nDr. Goodall has written and co-authored 14 books. He has given lectures at The University of Vienna, Southwestern University, Trinity College, Duke University School of Theology, South Pacific Bible College, ATCEM-Malaysia (Singapore), and Asia Pacific Theological Seminary (Philippines, Fiji).\nAmong his consulting experiences are, pastors, church leadership, para-church executives, district leaders, and government leaders. Dr. Goodall is a certified Life, Leadership, and Team coach working with church leaders, executives, and men in balancing; spiritual, organizational, life balance and career. As a coach he has worked with national leaders, men in leadership, pastors, couples, organizations, and other executive coaches. ","torrent":{"xt":"urn:btih:02fd4ddce4982325c863ada3f74553a3cd996a7a","amp;dn":"Success+Kills+-+Wayne+Goodall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fd4ddce4982325c863ada3f74553a3cd996a7a","infoHashBuffer":{"type":"Buffer","data":[2,253,77,220,228,152,35,37,200,99,173,163,247,69,83,163,205,153,106,122]},"announce":[],"urlList":[]}}