{"title":"Marvel NOW! Week 96 (9/17/2014) (darkhomr) [ALL]","uid":11096292,"size":823217620,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0395927c2237c26fd1deb45d5cfe6d9b5f7479fd&amp;dn=Marvel+NOW%21+Week+96+%289%2F17%2F2014%29+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dadrkhomr","files":-1,"time":1411602937,"description":"Welcome to the 2014 version of Marvel NOW!  Week after week I will be bringing you the latest in comics in the Marvel NOW universe as well as the All-New Marvel NOW stories.  Can you believe we are 91 weeks in the Marvel NOW and they are putting out an ALL NEW version of the titles?  What will NOT be included is Disney stuff, TV stuff, Ultimate Universe, and kids books. Those will be included (when available) in my Total Marvel pack.\n\n\n\nThis weeks' release (September 17, 2014) includes 17 issues with 0 new #1s  \n\n\nMy release packs are as follows: \n\n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\n\n\nAll New X-Factor #14 (CBR 9/17/2014)\n\nQuicksilver is reunited with his daughter, Luna . . . But The Inhumans are not too happy about it! PLUS: could Warlock make a move on Danger?\n\nAll New X-Men #32 (CBR 9/17/2014)\n\nDimension-hopping is something of an X-Men rite of passage and it's about time the All-New X-Men took the plunge! I guess you don't always have to travel Miles away to visit a new place . . . But will the web they find themselves tangled in Ultimately bring about their end?\n\nAvengers #35 (CBR 9/17/2014)\n\nExtra-sized issue! IN 8 MONTHS . . . TIME RUNS OUT!\n\nAvengers World #13 (CBR 9/17/2014)\n\nThe UPRISING continues! The Gorgon and the Dragon Temple of The Hand attack China! The Avengers and The Ascendant answer the call.\n\nDaredevil #8 (CBR 9/17/2014)\n\nMatt Murdock takes on his first big case in his new hometown--and the opposition is killer! Daredevil is faced with a menace he has no idea how to fight--the Purple Children! \n\nDeadpool Bi-annual #1 (CBR 9/17/2014)\n\nWhen Deadpool is hired by WaterWorld to protect their theme park from activists, he has no idea he's going to wind up face to snout with Brute Force-protectors of the environment! Look 'em up! That's right-they're real! Written by star of The League and NTSF:SD:SUV Paul Scheer and Nick Giovannetti, this is one issue sure to make a splash*! *This joke was not written by them.\n\nEdge of Spider-Verse #2 (of 5) (CBR 9/17/2014)\n\nGWEN STACY: SPIDER-WOMAN! In one universe, it wasn't Peter Parker bitten by the radioactive Spider, but Gwen Stacy! She's smart, charming and can lift a car-- Just don't tell her Police Chief father! How is she involved in Spider-Verse? Seeds of Amazing Spider-Man #9 are planted here\n\nElektra #6 (CBR 9/17/2014)\n\nThe second arc of the critically-acclaimed ongoing Elektra series pits Elektra against an enraged Assassin's Guild. After her life-and-death battles with Cape Crow, Bloody Lips, Lady Bullseye and Scalphunter, Elektra vows to take the fight to the Guild itself. It's Elektra vs. the World as she begins hunting down the Guild's agents before they can find her and her allies. \n\nHulk #6 (CBR 9/17/2014)\n\nTHE OMEGA HULK!!! The surprising new direction continues after Original Sin! Can Rick Jones survive &quot;Doc Green's&quot; Gamma cure? A secret behind the &quot;antidote&quot; revealed!\n\nHulk Annual #1 (CBR 9/17/2014)\n\nSomeone close to HULK dies. What impact will this have on one of the most dangerous super beings on the planet?  And how does a ghost from the past threaten to haunt the world of the Hulk forever?\n\nNova #21 (CBR 9/17/2014)\n\nSpinning right out of the events of Original Sin, Sam has new information about his dad--both newly revealed and troubling secrets and his whereabouts! It's up to Sam to find his former-Nova father halfway across the universe and either give him salvation or justice! \n\nOriginal Sin #5.5 (CBR 9/17/2014)\n\nClassified\n\nSavage Hulk #4 (CBR 9/17/2014)\n\nThe Hulk is trapped and you won't believe where! What are the Leader's plans for Bruce Banner? The X-Men are under lock and key! All this in more in the THRILLING conclusion to Alan Davis's startling Savage Hulk story!\n\nSuperior Spider-Man #33 (CBR 9/17/2014)\n\nEDGE OF SPIDER-VERSE The Superior Spider-Man takes the fight to Karn, the man working his way through the multiverse, leaving a trail of dead spiders in his wake, but finds himself hopefully over-powered. Can Sup' Spidey find enough allies to make a dent in Karn? \n\nThor God of Thunder #25 (CBR 9/17/2014)\n\nRedefining the word &quot;epic,&quot; it's the god-sized 25th issue of Thor: God of Thunder featuring an amazing artistic line-up! Young Thor vs. Frost Giants! The untold origin of Malekith the Accursed! King Thor's granddaughters uncover a startling secret chapter from the history of the Thunder God! Thor deals with the shocking fall-out from Original Sin! \n\nUncanny Avengers #24 (CBR 9/17/2014)\n\nThe MARCH to AXIS continues! Havok and his team defeated at the hands of the sinister S-Men! A dark secret in Genosha! The Red Skull's revenge is now unstoppable. \n\nUncanny X-Men #26 (CBR 9/17/2014)\n\nScott Summers has swiftly become one of the world's most wanted men. With one simple act, he destroyed the life he knew and must now remain constantly vigilant in case of attack. But is the greatest threat to his safety lurking within the dark recesses of his own mind?\n\nWolverine and the X-Men #9 (CBR 9/17/2014)\n\nHappy Birthday, Quentin Quire! Party crasher Wolverine gets more than he bargained for when he realizes who Quentin's bouncers are\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:0395927c2237c26fd1deb45d5cfe6d9b5f7479fd","amp;dn":"Marvel+NOW%21+Week+96+%289%2F17%2F2014%29+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0395927c2237c26fd1deb45d5cfe6d9b5f7479fd","infoHashBuffer":{"type":"Buffer","data":[3,149,146,124,34,55,194,111,209,222,180,93,92,254,109,155,95,116,121,253]},"announce":[],"urlList":[]}}