{"title":"Human Evolution: A Very Short Introduction","uid":8888052,"size":2117845,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03a74b74ba9e897d8c55dd8c6d2e3399a4bb3066&amp;dn=Human+Evolution%3A+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1378512712,"description":"Description:\n\nThe recent discovery of the diminutive Homo floresiensis (nicknamed &quot;the Hobbit&quot;) in Indonesia has sparked new interest in the study of human evolution. In this Very Short Introduction, renowned evolutionary scholar Bernard Wood traces the history of paleoanthropology from its beginnings in the eighteenth century to today's latest fossil finds. Along the way we are introduced to the lively cast of characters, past and present, involved in evolutionary research. Although concentrating on the fossil evidence for human evolution, the book also covers the latest genetic evidence about regional variations in the modern human genome that relate to our evolutionary history. Wood draws on over thirty years of experience to provide an insiders view of the field, and demonstrates that our understanding of human evolution is critically dependent on advances in related sciences such as paleoclimatology, geochronology, systematics, genetics, and developmental biology. This is an ideal introduction for anyone interested in the origins and development of humankind.","torrent":{"xt":"urn:btih:03a74b74ba9e897d8c55dd8c6d2e3399a4bb3066","amp;dn":"Human+Evolution%3A+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03a74b74ba9e897d8c55dd8c6d2e3399a4bb3066","infoHashBuffer":{"type":"Buffer","data":[3,167,75,116,186,158,137,125,140,85,221,140,109,46,51,153,164,187,48,102]},"announce":[],"urlList":[]}}