{"title":"On The Beach","uid":10733277,"size":163613040,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:03e3308effae44771296e0ef056794f221e91b67&amp;dn=On+The+Beach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Pigman58","files":2,"time":1407656862,"description":"2 x 60 mins\n\nA dramatisation of one of Nevil Shute's best known novels.\n\nIt is 1963 and the northern hemisphere has been devastated by a nuclear exchange between NATO and he Warsaw Pact, caused entirely by a misunderstanding. All human life north of the equator has been destroyed, but Commander Dwight Towers and the crew of the submarine USS Scorpion have sought sanctuary in Melbourne, Australia.\n\nEverybody knows that a cloud of atomic fall out is slowly drifting south and eventually everybody will die, but Towers and his crew continue to do their duty, including making an expedition to the US western seaboard to check for any signs of life, but there is none. They return to Australia to spend what time there is left with friends they have made in Australia, everybody meting their end in their own way.\n\nBeing written in the late 1950s, the stiff upper lip is well to the fore, there is no breakdown in social order and life goes on as normal, notwithstanding the shadow that hangs over everybody, but notwithstanding that, it remains a very moving and effective story. ","torrent":{"xt":"urn:btih:03e3308effae44771296e0ef056794f221e91b67","amp;dn":"On+The+Beach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03e3308effae44771296e0ef056794f221e91b67","infoHashBuffer":{"type":"Buffer","data":[3,227,48,142,255,174,68,119,18,150,224,239,5,103,148,242,33,233,27,103]},"announce":[],"urlList":[]}}