{"title":"[MommysGirl] Cherie DeVille , Alli Rae - The Birds And The Bees","uid":12159470,"size":356356986,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0407a1e142508a1325b57b76d1294273dcc81018&amp;dn=%5BMommysGirl%5D+Cherie+DeVille+%2C+Alli+Rae+-+The+Birds+And+The+Bees&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pornboy89","files":1,"time":1437853319,"description":"[MommysGirl] Jul , 2015 - Cherie DeVille &amp; Alli Rae - The Birds And The Bees, Part One - 400p\n\n.......:::Screenshots:::.......\n &lt;a href=&quot;\nhttp://imgnemo.com/?v=910172&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?v=910172&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=949441&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=949441&lt;/a&gt;\n\nDescription:\n\nBeing a stepmother with a teenage daughter in the house can be difficult, especially when you're trying to win their trust. But in this case, Cherie Deville needs to consult her friend regarding her stepdaughter Alli Rae; you see, Allie's father never spoke to her about sex and Cherie feels obliged as the mother figure to have this talk. Cherie notices Alli outside sunbathing, so she undresses and puts on her bikini to join her step daughter and find the courage to have 'the talk'.\n\nObserving Alli from afar, Cherie smiles, proud that she has such a beautiful stepdaughter whom she's grown so close to. Allie welcomes her mother to join her beside the pool. Cherie was careful choosing her words not to scare Alli and ruin her whole plan. Alli admitted she was very comfortable talking to Cherie and confided in her that she had a crush on a girl but was scared telling her dad afraid of his disapproval.\n\nCherie reassured Alli that there was nothing to be afraid of and liking girls was perfectly normal. Now that Cherie felt she gained her daughter's trust, she manipulates her, by removing Alli's bikini top, insisting there was nothing wrong seeing her daughter's breasts.Cherie wanted to know more about this girl Alli was interested in, but Alli knew very little about the birds and the bees. Cherie saw this as a great opportunity to show everything Alli needed to know. Alli was scared the neighbors would catch them but Cherie was insistent that everything was going to be alright. How can it not be with Cherie Deville teaching her all she needs know?! Watch today and Enjoy!","torrent":{"xt":"urn:btih:0407a1e142508a1325b57b76d1294273dcc81018","amp;dn":"%5BMommysGirl%5D+Cherie+DeVille+%2C+Alli+Rae+-+The+Birds+And+The+Bees","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0407a1e142508a1325b57b76d1294273dcc81018","infoHashBuffer":{"type":"Buffer","data":[4,7,161,225,66,80,138,19,37,181,123,118,209,41,66,115,220,200,16,24]},"announce":[],"urlList":[]}}