{"title":"BABEL 2006 DVD Rip XVID by vladtepes3176.avi","uid":5300969,"size":734363648,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0448720929809968be288b5f4371e765657a7206&amp;dn=BABEL+2006+DVD+Rip+XVID+by+vladtepes3176.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vladtepes3176","files":-1,"time":1264220771,"description":"This is an Excellent DVD rip to XVID at 700MB of BABEL 2006. (I follow a guide to Rip like AXXo (PAKG) when ripping ) PLEASE COMMENT.\n\nI have a fast Fiber connection and am seeding all the time so please download, and SEED this great, award winning film.\n\nMy thoughts r that in this time in history when great torrent sites are being shut down and people targeted for their great work like AXXO there should be more than one possibility for upload. That's why I ripped this (and did so like AXXO)\n\nenjoy!\n\nPLEASE SEED and help this spread!\n\nWill also be taking requests as I have a good connection and time on my hands. Feel free to request. I will also put out a list of my DVDs soon.\n\nThanks,\nby: vladtepes3176\n\nPLEASE SEED  \n\nBabel 2006\n\nDirected by:Alejandro GonzÃƒÂ¡lez IÃƒÂ±ÃƒÂ¡rritu/starring: Brad Pitt, Cate Blanchett and a brilliant art house film star:Rinko Kikuchi\n\nPLOT:4 interlocking stories all connected by a single gun all converge at the end and reveal a complex and tragic story of the lives of humanity around the world and how we truly aren't all that different. In Morocco, a troubled married couple are on vacation trying to work out their differences. Meanwhile, a Moroccan herder buys a rifle for his sons so they can keep the jackals away from his herd. A girl in Japan dealing with rejection, the death of her mother, the emotional distance of her father, her own self-consciousness, and a disability among many other issues, deals with modern life in the enormous metropolis of Tokyo, Japan. Then, on the opposite side of the world the married couple's Mexican nanny takes the couple's 2 children with her to her son's wedding in Mexico, only to come into trouble on the return trip. Combined, it provides a powerful story and an equally powerful looking glass into the lives of seemingly random people around the world and it shows just how connected we really are.\n\n","torrent":{"xt":"urn:btih:0448720929809968be288b5f4371e765657a7206","amp;dn":"BABEL+2006+DVD+Rip+XVID+by+vladtepes3176.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0448720929809968be288b5f4371e765657a7206","infoHashBuffer":{"type":"Buffer","data":[4,72,114,9,41,128,153,104,190,40,139,95,67,113,231,101,101,122,114,6]},"announce":[],"urlList":[]}}