{"title":"Summoner (GOG)","uid":10145516,"size":821899441,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:04618d010bd12913ba4fe07be2c29643dbfba696&amp;dn=Summoner+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sarah116","files":-1,"time":1400047934,"description":"Hey guys, here &quot;Summoner&quot;. It includes all the bonus content that included in the gog version. Hope you guys enjoy and please help seed.\n\n\n-------------------------\n\n\nBonus content included for FREE with purchase:\n\n- Manual (English) \n\n- Artwork \n\n- Avatar \n\n- Geeks video\n\n---------------------------\n\n\nSummoner Patch (by Timeslip)\n\nThis patch fixes many issues in the PC version of the game, also it enables you to set widescreen resolutions like 1920x1080:  &lt;a href=&quot;\nhttp://timeslip.users.sourceforge.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://timeslip.users.sourceforge.net&lt;/a&gt; (second from the bottom) \n\nJust extract the files from the zip into your Summoner folder, to set a custom resolution by opening the &quot;dinput&quot; file in notepad and editing the resolution part. \n\nTested and works with the GOG version. All credits go to Timeslip for the patch.\n\n\n----------------------------\n\nSummoner Mod \n\n\n &lt;a href=&quot; http://www.atomicgamer.com/files/18387/summonermodv10-zip&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.atomicgamer.com/files/18387/summonermodv10-zip&lt;/a&gt;\n\n\n- Much more interesting and detailed item descriptions (where possible) \n\n- A greater variety of items available for sale in shops, in all the towns and cities of the game. You can now buy \nreasonably decent weapons and armour earlier on, and some interesting magic items, providing you've got the money! \n\n- Tweaked item costs, armour protection, weapon damage/speed, damage types, etc, for improved balance. \n\n- Plate armour and Orenian Bougou-Dou armour gives much more protection, to compensate for the fact that you can't wear leg armour with it \n(previously, chainmail armour and chainmail leggings together provided more protection than any suit plate armour, despite being much cheaper) \n\n- Longswords and maces are now one-handed and can be used with a shield. All katanas, battleaxes and claymore-type swords are now 2-handed. \n\n- Magic items can only be worn by characters with the skills that they affect. E.g only Flece can wear the Thief's Torque, only Joseph and Rosalind \ncan wear the Elemental Necklace, and only Joseph can wear rings of summoning. \n\n- New or modified textures for some items, such as spell scrolls and unique weapons (like the Fiery Falchion and Logaros Longsword). \nfor all unique weapons \n\n- Most enemies have a much larger detection radius (if they can see you). \n\n- Tweaked resistances and weaknesses for some enemies (e.g elemental creatures like Fire Imps are always immune to or healed by their element and vulnerable \nto their opposite, and golems and skeletons are vulnerable to blunt weapons and resistant/immune to piercing). \n\n- Enemies now drop &quot;loot&quot; such as weapons slightly more often, and drop a greater variety of items in some cases. \n\n- Enabled a few previously &quot;monster-only&quot; weapons such as the Bone Sword, Kothudin Lance and Bacite Staff. They now have \ndescriptions, proper costs (i.e not 20gp) and slightly tweaked damage/speed for balancing purposes. They can be bought from \nsome merchants or picked up from the enemies that carry them (e.g Bone Servants and Bacite Shamans) \n\n- Fixed a few minor typos/bugs with item names in shop \n\n\n-----------------------------\n\n\nWhat's cool about it:\n\n- Traverse a beautiful, completely original world spanning two continents.\n\n- Up to 16 different creatures to summon and control in combat, such as minotaurs, golems, dragons, and original fantastical creatures.\n\n- Cast spectacular spells. Wield an arsenal of weapons. Clad yourself in the armour of a warrior.\n\nOverview:\n\nSummoners have toppled empires and challenged gods. They are venerated as saviours and feared as destroyers. With rings crafted by the ancient Khosani, the gifted can call forth demons, dragons, and elementals, but only the strongest can control the forces they unleash.\n\nBorn with the mark of the Summoner, Joseph possesses a power greater than emperors and gods. As a child, he summoned a demon to save his village, and watched in horror as those he loved were destroyed. Nine years later, the armies of Orenia invade, and Joseph must confront the prophecy he was born to fulfill.\n\nMultiplayer notice: The game's multiplayer servers have been taken offline, however, multiplayer over LAN is still available.\n &lt;a href=&quot;\nhttp://www.gog.com/game/summoner&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/summoner&lt;/a&gt;","torrent":{"xt":"urn:btih:04618d010bd12913ba4fe07be2c29643dbfba696","amp;dn":"Summoner+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04618d010bd12913ba4fe07be2c29643dbfba696","infoHashBuffer":{"type":"Buffer","data":[4,97,141,1,11,209,41,19,186,79,224,123,226,194,150,67,219,251,166,150]},"announce":[],"urlList":[]}}