{"title":"Jill Taylor - My Stroke of Insight - unabridged mp3","uid":5121763,"size":330086400,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0498d9b2984ed18a5680a27234c2ffbe28e235c9&amp;dn=Jill+Taylor+-+My+Stroke+of+Insight+-+unabridged+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Phobos2005","files":64,"time":1255384224,"description":"Read by the author.\n\nMy Stroke of Insight - Jill Taylor\n\nBit Rate : 128kbps   \nChannels : 2(stereo)   \nAudio Sample Rate 44 kHz\n\nA brain scientistas journey from a debilitating stroke to full recovery becomes an inspiring exploration of human consciousness and its possibilities\n\nOn the morning of December 10, 1996 Jill Bolte Taylor, a thirty-seven-year-old Harvard-trained brain scientist experienced a massive stroke when a blood vessel exploded in the left side of her brain. A neuroanatomist by profession, she observed her own mind completely deteriorate to the point that she could not walk, talk, read, write, or recall any of her life, all within the space of four brief hours. As the damaged left side of her brain a the rational, grounded, detail and time-oriented side a swung in and out of function, Taylor alternated between two distinct and opposite realties: the euphoric nirvana of the intuitive and kinesthetic right brain, in which she felt a sense of complete well-being and peace; and the logical, sequential left brain, which recognized Jill was having a stroke, and enabled her to seek help before she was lost completely.\n\n\nIn &quot;My Stroke of Insight,&quot; Taylor shares her unique perspective on the brain and its capacity for recovery, and the sense of omniscient understanding she gained from this unusual and inspiring voyage out of the abyss of a wounded brain. It would take eight years for Taylor to heal completely. Because of her knowledge of how the brain works, her respect for the cells composing her human form, and most of all an amazing mother, Taylor completely repaired her mind and recalibrated her understanding of the world according to the insights gained from her right brain that morning of December 10th.\n\nToday Taylor is convinced that the stroke was the best thing that could have happened to her. It has taught her that the feeling of nirvana is never more than a mere thought away. By &quot;stepping to the right of our left brains,&quot; we can all uncover the feelings of well-being and peace that are so often sidelined by our own brain chatter. A fascinating journey into the mechanics of the human mind, &quot;My Stroke of Insight&quot; is both a valuable recovery guide for anyone touched by a brain injury, and an emotionally stirring testimony that deep internal peace truly is accessible to anyone, at any time.\n\n\n\n","torrent":{"xt":"urn:btih:0498d9b2984ed18a5680a27234c2ffbe28e235c9","amp;dn":"Jill+Taylor+-+My+Stroke+of+Insight+-+unabridged+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0498d9b2984ed18a5680a27234c2ffbe28e235c9","infoHashBuffer":{"type":"Buffer","data":[4,152,217,178,152,78,209,138,86,128,162,114,52,194,255,190,40,226,53,201]},"announce":[],"urlList":[]}}