{"title":"Actual Window Manager v8.2","uid":11106793,"size":11833551,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:061041b9a660e9e95b949262020b244f7c5881c0&amp;dn=Actual+Window+Manager+v8.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZarkBit","files":1,"time":1411691725,"description":"Actual Window Manager v8.2\n\n[!] Important\n[+] New\n[-] Fixed error\n[*] Changes\n\n---------------------------------------------------------------------------\nActual Window Manager 8.2 (22.09.2014)\n---------------------------------------------------------------------------\n[!] The Configuration Module now can run multiple windows at once.\n\n    For example, you can open several Window Settings windows using the\n    &quot;Manage window settings&quot; title button (separate window for each settings).\n\n    When several configuration windows are open at once, changes made within\n    a particular window are isolated there until you click the Apply button\n    in that window.\n\n[!] Changes made in the Default Window Settings now are propagated automatically\n    to all existing specific window settings (provided that the old value\n    was the same in both Default and particular specific settings).\n\n[+] Quick Setup wizard is added. It allows to tune up quickly the most\n    frequently used features (according to collected and analyzed usage\n    statistics) without diving into details.\n\n[+] Compact mode for extra title buttons is now available: it displays the small\n    narrow button instead of the full list of active buttons.\n\n    Click on this button expands the list of active buttons so they can be used\n    as usual. Second click on this button or click somewhere else collapses the\n    list of active buttons so they do not block the view (this can be especially\n    useful in non-standard windows like Google Chrome or Mozilla Firefox).\n \n    The compact mode activates either automatically (when the extra buttons\n    do not fit the title bar) or it can be set permanently for particular\n    windows in the Window Settings options (see the &quot;Title Buttons - Options&quot;\n    group).\n\n[+] In addition to a right click on extra title buttons, now you can hold\n    the left mouse button on them for some time to invoke their extended\n    abilities (like context menus or special dialogs).\n\n[+] The ability is added to specify exact secondary display position (see the\n    &quot;Display Position&quot; group in the &quot;Multiple Monitors - Monitors' Layout\n    and Settings&quot; panel).\n\n[+] Windows 8/8.1: Option to cancel the replacement of the system Alt-Tab\n    Task Switcher is added.\n\n[+] The &quot;Popular&quot; filter is added in the &quot;Hotkeys - Actions&quot; panel and set as\n    default filter there. It lists the most frequently used key combinations\n    based on the usage statistics analysis.\n\n[*] Compatibility with Windows 8.1 Service Pack 1 has been improved.\n\n[*] Windows 8/8.1: Actual Alt-Tab Switcher is improved:\n    - now it respects the system &quot;Repeat delay&quot; and &quot;Repeat rate&quot; values\n    - it does not activate Aero Peek until the switching is stopped for\n      at least 1 second\n    - it can't be moved using the Easy Window Dragging/Sizing feature\n    - CPU load is reduced significantly when moving a mouse over its window\n    - redundant redraws are fixed\n\n[*] Monitors' layout preview in the &quot;Multiple Monitors - Monitors' Layout and\n    Settings&quot; panel now properly aligns the disabled monitors.\n\n[*] After disabling the cloning of displays, they both are automatically set to\n    their preferred resolutions.\n\n[*] The &quot;Arrange Monitors&quot; feature now takes into account the enabled displays\n    only (so that if there is just a single display enabled then the &quot;Arrange\n    Monitors&quot; button gets grayed).\n\n[*] Compatibility of the Ignore Deactivation feature with League of Legends\n    and Final Fantasy XIV is restored.\n\n[*] Windows 7+: The speed of Desktop Divider layouts switching has been\n    increased significantly and the system load has been reduced.\n\n[*] Now it's possible to select several picture files in the &quot;Add File&quot; dialog\n    while configuring the Slideshow screen saver.\n\n[*] The &quot;Move the mouse pointer along with window&quot; option now works even if\n    there are no modifier keys specified.\n\n[*] Manage Window Settings button is a regular button now: it can be enabled\n    or disabled in window settings on a per-window basis as any other button.\n\n[*] Compatibility of the Scroll Inactive Windows feature with old versions\n    of Google Chrome is restored.\n\n[*] The window invoked by the &quot;Copy Settings from...&quot; command now does not\n    display the target Window Settings item.\n\n[-] Downloaded setups of newer versions were installed automatically even if\n    the automatic updates were disabled (which prevented the rolling back to\n    any previous version if a newer version setup was available).\n\n[-] In some cases Start menu submenus might appear invisible, having only\n    a shadow.\n\n[-] Numerous fixes in Actual Taskbar's Jump Lists:\n\n    - some kinds of links did not open properly (e.g. sessions in PuTTY)\n\n    - improper items could be dragged out of Jump List\n\n    - items in custom categories could not be pinned/unpinned\n\n    - some items could not be unpinned (e.g. sessions in PuTTY)\n\n    - Windows x64: in some apps (e.g. PuTTY, Mozilla Firefox), links dragged out\n      of Jump List did not work\n\n[-] Windows x64: Mirror windows showed white rectangle instead of mirrored\n    content when monitor or part of desktop was mirrored and the hardware\n    acceleration was disabled.\n\n[-] In some cases, Actual Taskbar displayed the wrong icon for a window in its\n    taskbar button (e.g. for the Google Hangouts app).\n\n[-] Actual Taskbar always displayed on top of Firefox windows, even if they\n    were fullscreen.\n\n[-] On some configurations, cloned displays showed the wrong list of\n    available resolutions in the &quot;Multiple Monitors - Monitors' Layout and\n    Settings&quot; panel.\n\n[-] Desktop Divider: Switching the layouts quickly with the mouse wheel got\n    stuck after some scrolls and even might cause a crash of the active app.\n\n[-] Desktop Divider: In some cases tile size could not be set exactly in pixels\n    using the Resize button while editing a layout.\n\n[-] Windows 8.1: A workaround for a system bug has been added to reduce\n    the memory leaks in Windows Explorer when using the Favorite Folders and/or\n    Recent Folders title button.\n\n[-] The Ignore Deactivation feature made apps crash if it was activated via\n    hotkey with the &quot;Compatibility mode&quot; option enabled.\n\n[-] After being pressed, user-added title buttons affected the state of\n    the factory title button of the same kind and displayed the wrong hint.\n\n[-] In some cases extra title buttons in Microsoft Word 2013 might disappear.\n\n[-] Extra title buttons did not work in Autodesk Design Review 2013.\n\n[-] In the Aero visual theme, Visual Studio 2012 got hung upon closing.\n\n[-] Extra title buttons did not appear in X1 Search.\n\n[-] NuSphere PhpEd 12 crashed when trying to scroll the File Explorer view.\n\n[-] Windows 7: Tooltips did not display in command prompt windows.\n\n[-] Avast! notification area popup did not close in the Actual Taskbar.\n\n[-] Unloading 1st Clock right after restoring from hibernation\n    made Windows Explorer hung.\n\n[-] Drag to Scroll feature worked inconsistently in Process Explorer,\n    Process Lasso, system Window Firewall applet and the latest version of\n    Google Chrome.\n\n[-] The &quot;Use hardware acceleration&quot; option did not switch in the Configuration\n    window for mirroring-related title button/window menu/startup actions.\n\n[-] In some cases hotkey combinations worked twice although being pressed once\n    (for example, Ctrl-C worked like Ctrl-C-C and triggered the appearance of\n    the ABBYY Lingvo window).\n\n[-] In some cases, clipboard template did not paste into a current active\n    window.\n\n[-] In some cases, after switching the Virtual Desktops mode in either way\n    (classic to independent, or vice versa), windows got duplicated on all\n    virtual desktops despite their current selection.\n\n[-] Unwanted extra buttons of Microsoft Excel/PowerPoint or Adobe Acrobat\n    appeared in the Virtual Desktops Switcher after switching the desktops\n    with those programs running.\n\n[-] Canceling the download in the &quot;Check for Updates&quot; dialog caused an error.\n\n[-] Pressing Enter in the &quot;Check for Updates&quot; dialog after the download was\n    started caused the restart of downloading.\n\n[-] In the Configuration window, multi-line edit fields reset their scroll bars\n    to the beginning after typing a character when the content exceeded the size\n    of the edit field.\n\n &lt;a href=&quot;\nhttp://actualtools.com/images/aim/intro.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://actualtools.com/images/aim/intro.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s19.postimg.org/uw6hogmhv/Actual_Window_Manager.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/uw6hogmhv/Actual_Window_Manager.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s19.postimg.org/49u0zhiar/screenshot_146.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/49u0zhiar/screenshot_146.png&lt;/a&gt;","torrent":{"xt":"urn:btih:061041b9a660e9e95b949262020b244f7c5881c0","amp;dn":"Actual+Window+Manager+v8.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"061041b9a660e9e95b949262020b244f7c5881c0","infoHashBuffer":{"type":"Buffer","data":[6,16,65,185,166,96,233,233,91,148,146,98,2,11,36,79,124,88,129,192]},"announce":[],"urlList":[]}}