{"title":"Leslie Howsam - An Orientation to Book and Print Culture (2006)","uid":8532450,"size":1887668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06aea4d774e2ade061b7d18c4ec93c00a52149a7&amp;dn=Leslie+Howsam+-+An+Orientation+to+Book+and+Print+Culture+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"workerbee","files":-1,"time":1370189336,"description":"Leslie Howsam - Old Books and New Histories: An Orientation to Studies in Book and Print Culture (University of Toronto Press, 2006).\n\nISBN: 9780802091963 | 128 pages | PDF\n\n\nStudies in the culture and history of the book are a burgeoning academic specialty. Intriguing, rigorous, and vital, they are nevertheless rooted within three major academic disciplines -- history, literary studies, and bibliography - that focus respectively upon the book as a cultural transaction, a literary text, and a material artefact. &quot;Old Books and New Histories&quot; serves as a guide to this rich but sometimes confusing territory, explaining how different scholarly approaches to what may appear to be the same entity can lead to divergent questions and contradictory answers. \n\nRather than introduce the events and turning points in the history of book culture, or debates among its theorists, Leslie Howsam uses an array of books and articles to offer an orientation to the field in terms of disciplinary boundaries and interdisciplinary tensions. Howsam's analysis maps studies of book and print culture onto the disciplinary structure of the North American and European academic world.\n\n&quot;Old Books and New Histories&quot; is also an engaged statement of the historical perspective of the book. In the final analysis, the lesson of studies in book and print culture is that texts change, books are mutable, and readers ultimately make of books what they need.\n","torrent":{"xt":"urn:btih:06aea4d774e2ade061b7d18c4ec93c00a52149a7","amp;dn":"Leslie+Howsam+-+An+Orientation+to+Book+and+Print+Culture+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06aea4d774e2ade061b7d18c4ec93c00a52149a7","infoHashBuffer":{"type":"Buffer","data":[6,174,164,215,116,226,173,224,97,183,209,140,78,201,60,0,165,33,73,167]},"announce":[],"urlList":[]}}