{"title":"Great Wars and Great Leaders - Mantesh","uid":7154681,"size":1651983,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0725eff34ce8dfec56997b1de4d30f5a26da93ec&amp;dn=Great+Wars+and+Great+Leaders+-+Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MANTESH","files":3,"time":1333419438,"description":"[img]http://ecx.images-amazon.com/images/I/51q1eo-p-xL.jpg[/img]\n\n[b][quote][color=Green]\n\nGreat Wars and Great Leaders\n\n\nPublisher: Ludwig von Mises Institute\nRalph Raico\nEnglish \n2010 \nISBN: 1610160967 \n265 pages\nPDF \n1.57 MB\n\n\n The great historian of classical liberalism strips away the veneer of exalted leaders and beloved wars. Professor Ralph Raico shows them to be wolves in sheep's clothing and their wars as attacks on human liberty and human rights.\n\n In the backdrop of this blistering and deeply insightful and scholarly history is the whitewashing of &quot;great leaders&quot; like Woodrow Wilson, Winston Churchill, FDR, Truman, Stalin, Trotsky, and other collectivists.\n\n They are highly regarded because they were on the &quot;right side&quot; of the rise of the state. But do they deserve adulation? Raico says no: these great leaders were main agents in the decline of civilization in the 20th century, all of them anti-liberals who used their power to celebrate and enhance state power.\n\n Robert Higgs writes the introduction and cheers this powerful expose as a necessary corrective.\n\n &quot;For Ralph Raico,&quot; writes Robert Higgs in the foreword, &quot;it would be not only unseemly but foolish to quiver obsequiously in the historical presence of a Churchill, a Roosevelt, or a Truman. He knows when he has encountered a politician who lusted after power and public adulation, and he describes the man accordingly. He does not sweep under the rug the crimes committed by the most publicly revered Western political leaders. If they ordered or acceded to the commission of mass murder, he tells us, without mincing words, that they did so. The idea that the United States has invariably played the role of savior or &quot;good guy&quot; in its international relations Raico recognizes as state propaganda, rather than honest history.\n\n &quot;Thus, in these pages, you will find descriptions and accounts of World War I, of the lead-up to formal U.S. belligerence in World War II, and of Churchill, Roosevelt, and Truman, among others, that bear little resemblance to what you were taught in school. Here you will encounter, perhaps for the first time, compelling evidence of how the British maneuvered U.S. leaders and trick\n\n[/color][/quote][/b]\n\n\n\n\n[img]http://torrent-stats.info/7b1d/db24b3d3.png[/img]","torrent":{"xt":"urn:btih:0725eff34ce8dfec56997b1de4d30f5a26da93ec","amp;dn":"Great+Wars+and+Great+Leaders+-+Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0725eff34ce8dfec56997b1de4d30f5a26da93ec","infoHashBuffer":{"type":"Buffer","data":[7,37,239,243,76,232,223,236,86,153,123,29,228,211,15,90,38,218,147,236]},"announce":[],"urlList":[]}}