{"title":"Middle Eastern Cookery - Arto der Haroutunian - Epub+Mobi - Yeal","uid":9436151,"size":1373953,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:074138da941d4eebddf860e7d4c9db1900bf4445&amp;dn=Middle+Eastern+Cookery+-+Arto+der+Haroutunian+-+Epub%2BMobi+-+Yeal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KhushSidhu","files":2,"time":1388906343,"description":"\n\nMiddle Eastern Cookery\n\nBy Arto der Haroutunian\n\nPaperback: 384 pages - Publisher: Grub Street Cookery; Reprint edition \n(March 2011) - Language: English\nISBN-10: 1906502943 - ISBN-13: 978-1906502942\n\nAll Arto der Haroutunian's twelve cookbooks written in the 1980s became classics; it was his belief that the rich culinary tradition of the Middle East is the main source of many of our Western cuisines and his books were intended as an introduction to that tradition.\n\nHis Middle Eastern Cookery is regarded as the seminal work on the subject but it has been out of print for twenty years with second hand copies on offer for over four hundred pounds, such was its scarcity and popularity. At last here in a new redesigned edition is the Middle Eastern cookbook that everyone wants. It is a book containing every possible recipe from the Middle East -there are dishes from the plains of Georgia, from Afganistan, Egypt, Syria, Lebanon, Israel, Persia and Armenia.\n\nIt is written in the same wonderful style as his other classic cookbooks; peppered with anecdotes on life, food and culture. He guides us first round the mezze table and then leads us on to recipes for soups, salads, savouries, pilaffs, kebabs, casseroles and grills that make the best use of meat, fish and poultry. He teaches the cook about the different spices that are favoured by different countries - mint for Armenia, cumin for Iran and with each recipe comes a piece of history or a fable which makes this a book to read as well as an unequalled collection of recipes. Arto der Haroutunian was born in Aleppo, Syria in 1940 and grew up in the Levant, but came to England as a child and remained here for most of his life. In 1970, in partnership with his brother, he opened the first Armenian restaurant in Manchester which eventually became a successful chain of six restaurants and two hotels. He died in 1987 at the untimely age of 47 but is survived by his wife and son who still live in Manchester. As well as his passion for cooking, Arto was a painter of international reputation, a composer and translator of Turkish, Arab, Persian and Armenian authors. He was a true polymath.\n\n","torrent":{"xt":"urn:btih:074138da941d4eebddf860e7d4c9db1900bf4445","amp;dn":"Middle+Eastern+Cookery+-+Arto+der+Haroutunian+-+Epub%2BMobi+-+Yeal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"074138da941d4eebddf860e7d4c9db1900bf4445","infoHashBuffer":{"type":"Buffer","data":[7,65,56,218,148,29,78,235,221,248,96,231,212,201,219,25,0,191,68,69]},"announce":[],"urlList":[]}}