{"title":"Theological Studies, Volume 1-2 - Dr. Peter S. Ruckman","uid":11773664,"size":1702145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0780bc598d6ab53b4bdd614ff69cb44ffabbb908&amp;dn=Theological+Studies%2C+Volume+1-2+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":2,"time":1427179855,"description":"These studies are taken from a series of radio broadcasts done by Dr. Ruckman called &quot;The Theological Seminar of the air.&quot; They compose what is known as a &quot;systematic theology&quot;: a systematized study of Bible doctrines.\n\nVolume one covers the doctrine of Theology proper; that is, the study of God. Included in this book are the doctrines of Christology (the doctrines concerning Jesus Christ) and Pneumatology (the study of the Holy Spirit). All these doctrines are defined not by any church or institution, but by what the Bible says about the subjects at hand. This series is ideal for grounding the young believer in Christ in the basic doctrines of the Christian faith.\n\nVolume two covers the doctrines associated with the Bible, Man, Angels, Satan, and Salvation. But unlike other systematic theologies, Dr. Ruckman goes on to include studies in the practical aspects of Christian living: Sanctification, Christian Suffering, Temptation, Backsliding, Finding the Lord?s Will, Prayer, the Victorious Christian Life, Worship, Christian Giving, Separation, Confessing Christ before Men, the Offense of the Cross, Soulwinning, Law and Grace, and Heaven and Hell. This volume will leave the young believer with the scriptures as his final authority in all matters of faith and practice, without attacking or correcting them to prop up some teachings of a denomination or sect.\n\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy scriptures","torrent":{"xt":"urn:btih:0780bc598d6ab53b4bdd614ff69cb44ffabbb908","amp;dn":"Theological+Studies%2C+Volume+1-2+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0780bc598d6ab53b4bdd614ff69cb44ffabbb908","infoHashBuffer":{"type":"Buffer","data":[7,128,188,89,141,106,181,59,75,221,97,79,246,156,180,79,250,187,185,8]},"announce":[],"urlList":[]}}