{"title":"The Black Death - An Intimate History - BBC Radio Audiobook","uid":6768633,"size":65801199,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0797c67fa7eb051cb87808be7bf3e7553f210014&amp;dn=The+Black+Death+-+An+Intimate+History+-+BBC+Radio+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"neil1966hardy","files":9,"time":1319492736,"description":"The Black Death - An Intimate History - NEW BBC Radio Audiobook - cheops\n------------------------------------------------------------------------\n\nBy John Hatcher - Published in June 2008.\n\nRead by Robert Glenister, abridged by Polly Coles.\n\nThe Black Death remains the greatest disaster to befall humanity, killing about half the population of the planet in the 14th century. John Hatcher examines everyday medieval life in a parish in Suffolk, from which an exceptional number of documents survive.\n\nWith scrupulous attention to historical accuracy, John Hatcher describes what the parishioners experienced, what they knew and what they believed. His narrative is peopled with characters developed from the villagers named in the actual townsÃ‚Â¿ records and a series of dramatic scenes portray how contemporaries must have experienced the momentous events.\n\n`Professor Hatcher cannot be faulted on his devotion to the detail, or his convincing portrayal of the village of Walsham... Individual men\nand women are painstakingly described.... The Black Death conveys with great effectiveness the intensity of medieval English devotions and their deep preoccupation with the business of dying. Reading this book I was reminded time and again of the Tibetan Book of the Dead.` ( Will Self - The Evening Standard )\n\n`A historical recreation of what happens when the plague strikes a typical 14th-century town... hardhitting` ( Scotland on Sunday )\n\nFive episodes of approximately 15 minutes each.\n\nEpisode 1:\n----------\nRumours abound in the Suffolk village of Walsham that a terrible pestilence has devastated the lands at the edge of the known world.\n\nEpisode 2:\n----------\nAs the people of Walsham realise the plague is fast approaching the shores of England, they embark on a pilgrimage to the holy shrine of Walsingham. They hope to entreat the Virgin Mary to stay the hand of God.\n\nEpisode 3:\n----------\nJohn Chapman is among the first to be struck down by the pestilence. His wife Agnes nurses him as death begins to stalk the village.\n\nEpisode 4:\n----------\nBy the last week of April 1349, the bells of Walsham ring unceasingly for each new soul that falls foul of the ravaging plague. Normal life for all the villagers has fallen apart.\n\nEpisode 5:\n----------\nAs the plague recedes, it becomes clear that life in rural England will never be the same again.\n\nProduced by Clive Brill.\n\n---------------------\nType : mpeg 1 layer III\nBitrate : 128\nMode : joint stereo\nFrequency : 48000 Hz\nEncoder : Lame 3.96\n---------------------\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:0797c67fa7eb051cb87808be7bf3e7553f210014","amp;dn":"The+Black+Death+-+An+Intimate+History+-+BBC+Radio+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0797c67fa7eb051cb87808be7bf3e7553f210014","infoHashBuffer":{"type":"Buffer","data":[7,151,198,127,167,235,5,28,184,120,8,190,123,243,231,85,63,33,0,20]},"announce":[],"urlList":[]}}