{"title":"Runaway Trilogy (PC)","uid":13183453,"size":9704540560,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:07aca16cf7548896a16ed3e901788463f2cfcd5c&amp;dn=Runaway+Trilogy+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"annuaireweb","files":7,"time":1452346736,"description":"Runaway A Road Adventure: New York, 2000...\r\n...Sans savoir comment ni pourquoi, Brian, un étudiant à deux doigts d'obtenir son diplôme, est attaqué par des membres de la Mafia.\r\nDans sa fuite désespérée, en compagnie d'une mystérieuse strip-teaseuse, il rencontre toute une palette de personnages loufoques. Mais sont-ils là pour l'aider ou pour l'enfoncer ?\r\nIl vous faudra faire preuve d'ingéniosité pour le savoir, sans oublier que personne n'est vraiment ce qu'il prétend être dans ce cocktail détonnant de meurtre, d'argent, d'ambition, de rituels de Santeria et de trahison...beaucoup de trahison.\r\n\r\nRunaway The Dream of The Turtle: Voyagez aux quatre coins du globe avec Brian et Gina dans une histoire folle pleine de surprises. Vous allez croiser des pirates, des espions, des surfeurs, des soldats et même des extraterrestres. Tous réunis pour créer une expérience enrichissante et inoubliable à savourer !\r\nAvec des personnages adorables, un humour à tomber par terre, des énigmes à vous faire fumer les neurones et des graphismes époustouflants, Runaway, The Dream of the Turtle est un incontournable.\r\nRunaway, The Dream of the Turtle est un jeu d'aventure qui vous apportera énormément de plaisir.\r\n\r\nRunaway: A Twist of Fate est le jeu d'aventure de l'année ! Le jeu bénéficie d'une importante production, digne des films d'animation les plus prestigieux. L'aventure est pleine de rebondissement et de passages comiques. Plus de 200 énigmes pour une aventure que vous n'êtes pas prêt d'oublier.\r\n\r\nCertains disent que Brian a vu des extra-terrestres. Ils disent même qu'il aurait tuer quelqu'un. D'autres disent qu'il ère dans New-York ou qu'il fait la nouba à Hawaï. Certains le croient mort... Sa petite amie, Gina fera tout pour le retrouver. Aidez Brian et Gina à résoudre les mystères de cette aventure qui se termine forcément bien.\r\n\r\nInstructions pour installer le jeu:\r\n\r\n1. Double cliquer sur Setup.exe\r\n2. Choisir la langue de l'installateur (par défaut langue du système d'exploitation)\r\n3. Choisir le type d'installation (Défaut ou Personnalisée)\r\n(Défaut= Installera tout) (Personnalisée= Vous choisissez ce qui doit être installer)\r\n4. Choisir le(s) jeu(x) que vous voulez installer (Si vous avez choisi l'option Personnalisée)\r\n(Vous pourrez les réinstaller plus tard sans devoir a tout désinstaller)\r\n5. Lancer le jeu (icône du bureau)","torrent":{"xt":"urn:btih:07aca16cf7548896a16ed3e901788463f2cfcd5c","amp;dn":"Runaway+Trilogy+%28PC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07aca16cf7548896a16ed3e901788463f2cfcd5c","infoHashBuffer":{"type":"Buffer","data":[7,172,161,108,247,84,136,150,161,110,211,233,1,120,132,99,242,207,205,92]},"announce":[],"urlList":[]}}