{"title":"PBS Nova - S31E09 - Mars, Dead Or Alive","uid":8813786,"size":228474569,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:083bac3378372ebd4aacc2f98c07e2475eabb60d&amp;dn=PBS+Nova+-+S31E09+-+Mars%2C+Dead+Or+Alive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Arrrrrrrrrr","files":-1,"time":1376527827,"description":"&quot;Two-thirds of all spacecraft previously launched to Mars never reached their destination. Now, in a pioneering and risky mission, twin rovers named Spirit and Opportunity hurtle toward Mars at 12,000 miles per hour, with Spirit scheduled to touch down first. In the final &quot;six minutes of terror&quot; a parachute will open, giant protective airbags will inflate around the lander, and retrorockets will fire for a few seconds before Spirit is cut loose, bouncing its way to what everyone hopes will be a safe landing. To survive, Spirit will have to function perfectly. It will also have to be lucky, since there's no way of knowing when a sharp rock or a gust of wind will ruin your day on Mars. Only then will Spirit be able to roll off the lander and begin its mission as a robot geologist, searching for clues that can tell us whether this harsh and barren planet was ever a place that could have supported life. Join NOVA for a tense and dramatic behind-the-scenes chronicle of the $820 million Mars Exploration Rover (MER) project, developed at NASA's Jet Propulsion Laboratory in Pasadena, California. Beginning a year before launch, NOVA's cameras follow MER scientists and engineers through a gauntlet of potentially fatal problems such as shredding parachutes, punctured airbags, and short circuits, any one of which could scuttle the mission before the rovers ever reach the launchpad. Then, seven months after launch, re-join NOVA and the NASA team in mission control for the final nail-biting minutes of the journey, as Spirit successfully lands on Mars and begins sending back its first spectacular images of the Martian landscape.&quot;\nNarrated by Stacey Keach.\n\nFile: PBS.Nova.-.S31E09.-.Mars,.Dead.Or.Alive.mp4 (217MB, 56:10)\nResolution: 718x378 (native DVD), 16:9 aspect ratio\nAudio: AAC 48kHz 128kb/s stereo\nVideo: H-264 MPEG-4, 29.97fps\nSubtitles: English CC\nEncoding: Handbrake, RF=25\nOriginally broadcast: 2004-Jan.-04\n\nNotes:\n\n- The aspect ratio and resolution of the original DVD source were non-standard/letterboxed. I cropped out most of the letterboxing. The black bar at the bottom isn't erroneous; it is due to the program's overlays extending into the letterboxing so enough was left that they were not lost.\n\n- Wikipedia calls this episode S31E01 (all of their episode numbers seem to differ from here.)\n\n- Please seed to 100% or higher and do your part so free media will always be available. My upstream isn't the fastest (max. about 50kBps) so be patient and you'll get your file.\nIf everyone seeded to 101%, no torrent would ever die.","torrent":{"xt":"urn:btih:083bac3378372ebd4aacc2f98c07e2475eabb60d","amp;dn":"PBS+Nova+-+S31E09+-+Mars%2C+Dead+Or+Alive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"083bac3378372ebd4aacc2f98c07e2475eabb60d","infoHashBuffer":{"type":"Buffer","data":[8,59,172,51,120,55,46,189,74,172,194,249,140,7,226,71,94,171,182,13]},"announce":[],"urlList":[]}}