{"title":"Zombie Night Terror","uid":15361000,"size":529062800,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:08d00677c6fcb218ff2586888ac96f7c8b8fb040&amp;dn=Zombie+Night+Terror&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1469036289,"description":"About This Game\r\n\r\nPrepare yourself for the most thrilling night of your life! Something strange has happened and people everywhere are turning into blood thirsty walking corpses. But guess who’s the brains behind this hungry undead army? YOU! So spread this pandemic to wipe humanity of this planet. Because the only way to survive the zombie apocalypse, is to BE the apocalypse!\r\n\r\nBut the brainless undead are quite dumb… even dumber than you might expect given their lack of grey matter. Because when left to their own devises, they will just endlessly walk forward and fall into permanently deadly booby traps placed by not-so-helpless humans. So to accomplish your mission of world extermination, you will need to help guide them to their next yummy meal. Luckily you can utilize numerous special mutations to make your troops evolve and fulfil their appetite for flesh. But beware! Humans will not facilitate your dark will….they will fight to survive.\r\n\r\nSpread terror through 40 levels and enrol more zombies into your undead army. Along the way you’ll have to solve brain tingling puzzles, and fight increasingly powerful foes that are hell-bent on staying alive. The closer you get to total world extinction, the harder survivors will fight to put you in the ground….for good.\r\n\r\nBlood, tears, non-sexual moans, inappropriate laughter, and tons of puzzles that will literally blow your brains out... This is Zombie Night Terror!\r\n\r\n\r\n\r\n    Command a Zombie Horde: You are the brain, they are the muscles. Your zombie horde will obey your commands without any strike risk or complaints … On the downside; you can’t have any heated conversations about late night movies or cool books anymore tough!\r\n    Unique Mutation System: Having an army of deadly zombies is awesome. Having an army of mutated zombies is way better! Take advantage of our mutation system to overcome the enemy’s defences, by creating powerful new zombie types. Each has their unique power and abilities that can help you overcome different situations.\r\n    Combo System: Because you thought mutations were your only way to facilitate your meat feast, we spiced it up allowing you to combine those and see what your enemies are made of (literally). Let’s show those pesky humans how to have fun!\r\n    You are not alone: Having zombies is kind of like having a pet; it’s fun but you need to take care of them… That’s what humans are for, as they are the perfect way to keep your zombies well fed and busy. But beware! Humans are well armed and they do not appreciate the toothy company of the undead.\r\n    Contaminate: Don’t have enough company? Do you need a bigger horde? Well, just convert Humans to your cause then! You don’t necessary need to bring flowers and be charming, as a single bite right into the neck (or anywhere that pleases you) should be enough to do the trick!\r\n    Destructible Environments: In times of a zombie apocalypse, humans love to take their time playing hide and seek. However when the hunger for tasty flesh is this painful, you don’t have time for such childishness. So use the power or your horde to destroy their playground and spread terror among them… PEEKABOOM!","torrent":{"xt":"urn:btih:08d00677c6fcb218ff2586888ac96f7c8b8fb040","amp;dn":"Zombie+Night+Terror","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08d00677c6fcb218ff2586888ac96f7c8b8fb040","infoHashBuffer":{"type":"Buffer","data":[8,208,6,119,198,252,178,24,255,37,134,136,138,201,111,124,139,143,176,64]},"announce":[],"urlList":[]}}