{"title":"Stossel.2013.10.10.[Selling Victimhood].Fox Business.CF.avi","uid":9041640,"size":340320322,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:08f8f823cfbee6ac386e5a1cedb1b3a83cc8a2bd&amp;dn=Stossel.2013.10.10.%5BSelling+Victimhood%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1381642765,"description":"----------\n\nSTOSSEL - [Selling Victimhood] - Fox Business Network\n2013, October 10, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nAre you a victim?\n\nI'm a stutterer. Had today's disability laws existed when I began working, I wonder if I would have overcome my speech problem, or just given up and collected a government check.\n\nGovernment assistance is supposed to help people in need. But that's not what usually happens. Government assistance creates more victims.\n\nVICTIM TV: I won 19 Emmy awards for exposing sleazy companies. The public should be warned about scams, but the media always goes overboard. Gavin McInnes, columnist for Taki's Magazine, hates the media hype. However, former teacher Jedediah Bila says the media has done the right thing in raising awareness of bullying.\n\nMINIMUM WAGE: $7.25 an hour is the current federal minimum wage. California just raised its state minimum wage to $10 an hour, and most people around me in NYC say, &quot;that's not enough! It's not a living wage!&quot; Yaron Brook, President of the Ayn Rand Institute, says this is a foolish way to think - a minimum wage takes jobs away from the young, poor and uneducated.\n\nRACE CARD: Deneen Borelli, author of &quot;Blacklash,&quot; is upset about what victimhood has done to the black community. She argues that focusing on past abuses is terrible for blacks. Jennifer Gratz, XIV Foundation CEO, took her case all the way to the US Supreme Court after she was denied admission to the University of Michigan due to affirmative action. She won. But affirmative action continues.\n\nWELFARE: Welfare is supposed to help people in need; give them a chance to get back on their feet. But CURE Founder Star Parker, a former welfare recipient and author of &quot;Uncle Sam's Plantation,&quot; says that's not usually the case.\n\nUNFIT FOR WORK: With more disability laws, more Americans say they are disabled. Cato Institute budget analyst, Tad DeHaven, writes about the rising cost of social security disability insurance, and how the law encourages dependency by sending checks to people who claim to be unable to work because of ambiguous disabilities. When medicine is better, and fewer people do manual labor, how can so many more be disabled?\n\nRAP REMEDY: Ohio family physician, Dr. Anthony Atkins, created a rap album to try to reach young people with a positive message about safe sex and avoiding gangs.\n\nMY TAKE: America succeeded because it was founded by people who were the opposite of victims; they were people with grit. Overcoming obstacles is the route to prosperity and happiness.","torrent":{"xt":"urn:btih:08f8f823cfbee6ac386e5a1cedb1b3a83cc8a2bd","amp;dn":"Stossel.2013.10.10.%5BSelling+Victimhood%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08f8f823cfbee6ac386e5a1cedb1b3a83cc8a2bd","infoHashBuffer":{"type":"Buffer","data":[8,248,248,35,207,190,230,172,56,110,90,28,237,177,179,168,60,200,162,189]},"announce":[],"urlList":[]}}