{"title":"The Woman in White - Wilkie Collins (Unabridged)","uid":5077742,"size":342613979,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:09358400e2bf83cf090efc9255f70298e74bf7ed&amp;dn=The+Woman+in+White+-+Wilkie+Collins+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sheila6","files":34,"time":1252010049,"description":"Audio Books : Literary : Other quality : English\n\n\n\nUnabridged and read by Ian Holm. \n23 hours 47 mins duration. \n16 Cassettes. \n(Fraunhofer CBR 32 kbit/s 22050 Hz Mono, jetAudio 6.2+)\n\n\n\n\nThe story begins when the hero, art master Walter Hartright, encounters a mysterious woman dressed all in white on a moonlit road in Hampstead. She is in a state of confusion and distress, and Hartright helps her to find her way back to London. In return, she warns him against a certain (unnamed) baronet, &quot;a man of rank and title&quot;. Immediately after they part, Hartright learns that she may have escaped from an asylum.\n\nHe goes to Cumberland to take up a position as art tutor at Limmeridge House to two young women: Marian Halcombe and her wealthy half-sister, Laura Fairlie. He finds to his amazement that the story of the woman in white may be entangled with the lives of the two sisters. As a further complication, Walter and Laura fall rapidly in love. But she is already engaged, by her father's wish, to a man named Sir Percival Glyde. Walter and Marian together delve deeper into the mystery of the strange woman and engage in a battle of wits with Glyde's enigmatic Italian friend Count Fosco.\n\nThe Woman In White is an early example of a particular type of Collins narrative in which several characters in turn take up the telling of the story. This creates a complex web in which readers are unsure which narrators can, and cannot, be trusted. Collins used this technique in his other novels, including The Moonstone. This technique was copied by other novelists, including Bram Stoker, author of Dracula (1897), although by the end of the 19th century the technique was considered somewhat &quot;old fashioned&quot;.\n\n\n[This was transcribed from 16 cassettes - a long job. I am rather pleased with the sound quality though. I could only find a single copy of this audio book among all my sources]\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:09358400e2bf83cf090efc9255f70298e74bf7ed","amp;dn":"The+Woman+in+White+-+Wilkie+Collins+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09358400e2bf83cf090efc9255f70298e74bf7ed","infoHashBuffer":{"type":"Buffer","data":[9,53,132,0,226,191,131,207,9,14,252,146,85,247,2,152,231,75,247,237]},"announce":[],"urlList":[]}}