{"title":"Medicating Modern America: Prescription Drugs in History (2007)","uid":8363480,"size":1316374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09ed2dfede9fa2d96922613379cf8c041b36ed71&amp;dn=Medicating+Modern+America%3A+Prescription+Drugs+in+History+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1365701798,"description":"Andrea Tone and Elizabeth Siegel Watkins, editors - Medicating Modern America: Prescription Drugs in History (New York University Press, 2007).\n\nISBN: 9780814783009 | 262 pages | PDF\n\n&quot;Medicating Modern America&quot; examines the meanings behind the modern pharmaceutical revolution through the interconnected histories of eight of the most influential and important drugs: antibiotics, mood stabilizers, hormone replacement therapy, oral contraceptives, tranquilizers, stimulants, statins, and Viagra. All of these drugs have been popular, profitable, influential, and controversial, and the authors take a historical approach to studying their development, prescription, and consumption. This perspective locates the histories of prescription medicines in specific cultural contexts while revealing the extent to which contemporary debates about pharmaceutical drugs echo concerns voiced by Americans in the past.\n\nExploring the rich and multi-faceted history of pharmaceutical drugs in the United States, &quot;Medicating Modern America&quot; unveils the untold stories behind America's pharmaceutical obsession.\n\nContributors include: Robert Bud, Jennifer R. Fishman, Jeremy A. Greene, David Healy, Suzanne White Junod, Ilina Singh, Andrea Tone, and Elizabeth Siegel Watkins.\n\nReviews\n\n&quot;A well-edited collection of eight timely and provocative essays about the key prescription drugs that have, for better or worse, helped shape American consumer culture and health since World War I.&quot; -- Journal of the History of Medicine\n\n&quot;Their excellent example of balanced analysis should inspire other scholars to pursue further work in the new pharmaceutical history.&quot; -- Gregory J. Higby, Journal of American History\n\n&quot;These challenging essays mark the transformation of medication from a tradition of need assessed by physicians, to a culture that far exceeds a basic threshold for drugs on demand on the part of the public.&quot; -- Choice\n\n&quot;The most valuable role of Medicating Modern America is as a teaching text. There are currently very few texts available for undergraduate teachers that offer digestible and critical assessments of the role of prescription drugs in the history of twentieth-century biomedicine; Medical Modern America, by providing a series of highly accessible and engaging analyses of prescriptions drugs, superbly fills this gap.&quot; -- Social History of Medicine\n","torrent":{"xt":"urn:btih:09ed2dfede9fa2d96922613379cf8c041b36ed71","amp;dn":"Medicating+Modern+America%3A+Prescription+Drugs+in+History+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ed2dfede9fa2d96922613379cf8c041b36ed71","infoHashBuffer":{"type":"Buffer","data":[9,237,45,254,222,159,162,217,105,34,97,51,121,207,140,4,27,54,237,113]},"announce":[],"urlList":[]}}