{"title":"Naim NAT-01 audiophile tuner, Galaxy G17 FM antenna rips, FLAC","uid":12314074,"size":728401713,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0ab80a5bc80dbecbeabab36271f1dc186fe8c6df&amp;dn=Naim+NAT-01+audiophile+tuner%2C+Galaxy+G17+FM+antenna+rips%2C+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rontoolsie","files":11,"time":1440959918,"description":"All music was grabbed from the airwaves with two of the best sounding FM radio stations I have heard-both NPR stations in Chattanooga, TN. The tuner was the legendary Naim NAT 01 with its off board power supply. Signal was sourced from a roof mounted rotatable 17 element FM antenna- the Ron Smith Galaxy G-17. \n\nThe radio stations were only about 10-15 miles away with a clear line of sight to the transmitting towers. The output of the tuner was sent directly to the input of a Yamaha CD-recorder. All electronics were fed balanced power via a 300 lb Equitech transformer. \n\nThe tuner was slightly modified with 0.1 uF Cardas Golden Reference capacitors bypassing the output caps as well as the power supply filter caps. All the orignal tantalum capacitors were also recently replaced in all boards. \n\nThe fidelity that can be gotten from the airwaves is literally quite astounding. I urge you to listen to the Tuck Andress track (Reckless Precision) and wonder if this really was a HD source. It is not until the announcers voice comes in at the end that is provenance is revealed. This track was played at a Naim demo room in Toronto a few years ago, causing more than a few smiles at the very end. \n\nOne track included is an antenna comparison-the Naim approved Galaxy G17 antenna was swapped A-B-A-B-A-B with a 5m length of speaker wire, which also gave full strength signal on the display. But one sounds quite better than the other, so it is much more than just how strong the signal can be. That speake wire BTW was Naims very own NACA5. \n\nSo, if you doubt that FM radio can offer exceptional fidelity and be a genuine high end source, then take a listen to these tracks. Most people I know with this FM tuner use it as their primary music source-it is that good. \n\nUnfortunately, this wonderful tuner was discontinued back in 2002 as the tuner heads were no longer available, and the few remaining retained by the service department. At the time, the tuner retailed for around $3500 USD. If it were still a current product it would probably sell for close to $7000, and still be worth it. There is a reason why 20 year old models of this tuner still change hands for over $1000.\n\nI have also included a spectrum scan, showing real output all the way to 16kHz. You can also see the small spike in the circa 19.5 Khz carrier signal, that is admirably filtered by this tuner","torrent":{"xt":"urn:btih:0ab80a5bc80dbecbeabab36271f1dc186fe8c6df","amp;dn":"Naim+NAT-01+audiophile+tuner%2C+Galaxy+G17+FM+antenna+rips%2C+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab80a5bc80dbecbeabab36271f1dc186fe8c6df","infoHashBuffer":{"type":"Buffer","data":[10,184,10,91,200,13,190,203,234,186,179,98,113,241,220,24,111,232,198,223]},"announce":[],"urlList":[]}}