{"title":"The Vatican's Mafia - Rafael Rodriguez Guillen","uid":11773409,"size":1129864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b609484f200aae4ebe5c8e4b4e895480d2b8467&amp;dn=The+Vatican%27s+Mafia+-+Rafael+Rodriguez+Guillen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427166946,"description":"\nTo affirm that in the Vatican there exists a more dangerous sacred Mafia than the Sicilian or New York Mafias may appear to be monstrous or inverted by the atheist or most hardcore enemy of the Catholic Church. And even more so when the person saying it is a Monsenor and Vaticanist priest.\n\nWe should remember that the sacred Mafia of the Vatican is united to the International Mafia, and that its members, diplomats and hierarchical Nuncios are exempt from civil laws. They are considered to be members of the State of the Vatican, and their credentials as ambassadors makes it easier for them to avoid being brought before civil court or incarcerated.\n\nThe Vatican is effectively a Mafia of the Anti christ.\n\n\nAbout the author:\nRafael Rodriguez Guillen was born in Seville Spain on 28 March 1927. He studied Humanities, Philosophy and Theology in Spain and the United States. Fellow at Queen College and Hunter College USA, and the UPR and Institute of Hispanic Culture in Spain and Puerto Rico.\n\nHe graduated with honors of Doctor of Education Sciences at the Complutense University of Madrid and Doctor of Philosophy from the Pontifical University of Comillas in Madrid in 1981. Monsignor, Master In Div; Vatican expert researcher and historian.\n\nHe has excelled as a writer, he has lectured internationally, while he has taught at the universities prestigidas United States, Puerto Rico, Eng, Mexico and Chile. He has published 2 dozen bo","torrent":{"xt":"urn:btih:0b609484f200aae4ebe5c8e4b4e895480d2b8467","amp;dn":"The+Vatican%27s+Mafia+-+Rafael+Rodriguez+Guillen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b609484f200aae4ebe5c8e4b4e895480d2b8467","infoHashBuffer":{"type":"Buffer","data":[11,96,148,132,242,0,170,228,235,229,200,228,180,232,149,72,13,43,132,103]},"announce":[],"urlList":[]}}