{"title":"Legalizing Misandry by Paul Nathanson &amp; Katherine K. Young","uid":10314461,"size":933540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b62aa6a99ead31d0a5c1231f687d8c40c7f2e3f&amp;dn=Legalizing+Misandry+by+Paul+Nathanson+%26amp%3B+Katherine+K.+Young&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"joshua13","files":-1,"time":1402187152,"description":"Legalizing Misandry - From Public Shame to Systemic Discrimination Against Men (2006) by Paul Nathanson &amp; Katherine K. Young.epub\n\nLurid and sensationalized events such as the public response to Lorena Bobbitt after she cut off her abusive husband's penis, prurient fascination provoked by Anita Hill's allegations about Clarence Thomas, and the exploitation of the mass murder of fourteen women in Montreal have been processed through popular culture since the 1990s to produce pervasive misandry - contempt for men, the counterpart of misogyny. Paul Nathanson and Katherine Young believe that this reveals a shift in the United States and Canada to a worldview based on ideological feminism, which presents all issues from the point of view of women and, in the process, explicitly or implicitly attacks men as a class. They argue that ideological feminism is silently reshaping law, pubic policy, education, and journalism. Legalizing Misandry offers lively and compelling evidence to demonstrate the pervasiveness of this new thinking - from the courts, classrooms, government committees, and corporate bureaucracies to laws and policies affecting employment, marriage, divorce, custody, sexual harassment, violence, and human rights.\n\n650 pages\nPublisher: McGill-Queen's University Press; annotated edition edition (March 21, 2006)\nLanguage: English\nISBN-10: 0773528628\nISBN-13: 978-0773528628","torrent":{"xt":"urn:btih:0b62aa6a99ead31d0a5c1231f687d8c40c7f2e3f","amp;dn":"Legalizing+Misandry+by+Paul+Nathanson+%26amp%3B+Katherine+K.+Young","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b62aa6a99ead31d0a5c1231f687d8c40c7f2e3f","infoHashBuffer":{"type":"Buffer","data":[11,98,170,106,153,234,211,29,10,92,18,49,246,135,216,196,12,127,46,63]},"announce":[],"urlList":[]}}