{"title":"Atlas of Anatomy - Patrick W. Tank, Thomas R. Gest (Malestrom)","uid":4744423,"size":26262454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b8a79f2c0371f94692f2eeb224eeeebf962ac6e&amp;dn=Atlas+of+Anatomy+-+Patrick+W.+Tank%2C+Thomas+R.+Gest+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1235755692,"description":" &lt;a href=&quot;http://www.image-upload.net/images/qp9l37wqyxreflx1zxos.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/qp9l37wqyxreflx1zxos.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.image-upload.net/images/q0sytr1f0gabkbq1si3j.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.image-upload.net/images/q0sytr1f0gabkbq1si3j.jpeg&lt;/a&gt;\n\nFeaturing more than 750 new, modern images, the Lippincott Williams &amp; Wilkins Atlas of Anatomy is a vibrantly colored regional atlas of human anatomy offering an unprecedented combination of visual aesthetic appeal and anatomical accuracy. Many student-friendly features set this atlas apart from others on the market, including a unique art style featuring bright colors, color coding of anatomical elements, judicious use of labeling, and no extraneous text. Each plate teaches specific structures and relationships?displayed using artistic techniques such as &quot;ghosting,&quot; layering, and color selectivity?providing immediate focus and resulting in easier and faster comprehension. This unique pedagogy, in combination with the atlas' beautiful art style, will make this new anatomy atlas the preferred choice of teachers and students alike. Packaged with the atlas is an online interactive atlas with all of the images, including fully searchable legends and labels and &quot;zoom and compare&quot; features. Also included are electronic flash cards that permit students to test their knowledge of newly learned concepts and structures. Also available is an interactive atlas for faculty, which contains all of the images and the figures with slideshow and JPG export features. The image bank provides figures with labels and leaders on, labels off and leaders on, labels and leaders off, and JPG and PDF options. Faculty also have access to Moore: Clinically Oriented Anatomy's question test bank, which contains approximately 500 review questions with answers.","torrent":{"xt":"urn:btih:0b8a79f2c0371f94692f2eeb224eeeebf962ac6e","amp;dn":"Atlas+of+Anatomy+-+Patrick+W.+Tank%2C+Thomas+R.+Gest+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b8a79f2c0371f94692f2eeb224eeeebf962ac6e","infoHashBuffer":{"type":"Buffer","data":[11,138,121,242,192,55,31,148,105,47,46,235,34,78,238,235,249,98,172,110]},"announce":[],"urlList":[]}}