{"title":"L’ Affaire SK1 FRENCH DVDRIP AC3 2015","uid":13458903,"size":1469210514,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0bdac6250ec586d1346f56e11de35ba32fd79537&amp;dn=L%26rsquo%3B+Affaire+SK1+FRENCH+DVDRIP+AC3+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"annuaireweb","files":1,"time":1454873697,"description":"L.Affaire.SK1.2014.FRENCH.BRRip.XviD.AC3-S.V\r\n\r\nParis, 1991. Franck Magne, un jeune inspecteur fait ses premiers pas à la Police Judiciaire, 36 quai des Orfèvres, Brigade Criminelle. Sa première enquête porte sur l’assassinat d’une jeune fille. Son travail l’amène à étudier des dossiers similaires qu’il est le seul à connecter ensemble. Il est vite confronté à la réalité du travail d’enquêteur : le manque de moyens, les longs horaires, la bureaucratie… Pendant 8 ans, obsédé par cette enquête, il traquera ce tueur en série auquel personne ne croit. Au fil d’une décennie, les victimes se multiplient. Les pistes se brouillent. Les meurtres sauvages se rapprochent. Franck Magne traque le monstre qui se dessine pour le stopper. Le policier de la Brigade Criminelle devient l’architecte de l’enquête la plus complexe et la plus vaste qu’ait jamais connu la police judiciaire française. Il va croiser la route de Frédérique Pons, une avocate passionnée, décidée à comprendre le destin de l’homme qui se cache derrière cet assassin sans pitié. Une plongée au cœur de 10 ans d’enquête, au milieu de policiers opiniâtres, de juges déterminés, de policiers scientifiques consciencieux, d’avocats ardents qui, tous, resteront marqués par cette affaire devenue retentissante : « l’affaire Guy Georges, le tueur de l’est parisien »","torrent":{"xt":"urn:btih:0bdac6250ec586d1346f56e11de35ba32fd79537","amp;dn":"L%26rsquo%3B+Affaire+SK1+FRENCH+DVDRIP+AC3+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bdac6250ec586d1346f56e11de35ba32fd79537","infoHashBuffer":{"type":"Buffer","data":[11,218,198,37,14,197,134,209,52,111,86,225,29,227,91,163,47,215,149,55]},"announce":[],"urlList":[]}}