{"title":"[Leo_Dorst,_Daniel_Fontijne,_Stephen_Mann]Geometric Algebra for ","uid":11053554,"size":11039574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c75b68753c180a78231d37085cdc9f4f3b1ae19&amp;dn=%5BLeo_Dorst%2C_Daniel_Fontijne%2C_Stephen_Mann%5DGeometric+Algebra+for+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1411057797,"description":"Until recently, all of the interactions between objects in virtual 3D worlds have been based on calculations performed using linear algebra. Linear algebra relies heavily on coordinates, however, which can make many geometric programming tasks very specific and complex-often a lot of effort is required to bring about even modest performance enhancements. Although linear algebra is an efficient way to specify low-level computations, it is not a suitable high-level language for geometric programming. Geometric Algebra for Computer Science presents a compelling alternative to the limitations of linear algebra. Geometric algebra, or GA, is a compact, time-effective, and performance-enhancing way to represent the geometry of 3D objects in computer programs. In this book you will find an introduction to GA that will give you a strong grasp of its relationship to linear algebra and its significance for your work. You will learn how to use GA to represent objects and perform geometric operations on them. And you will begin mastering proven techniques for making GA an integral part of your applications in a way that simplifies your code without slowing it down.\n\n    Explains GA as a natural extension of linear algebra and conveys its significance for 3D programming of geometry in graphics, vision, and robotics.\n    Systematically explores the concepts and techniques that are key to representing elementary objects and geometric operators using GA.\n    Covers in detail the conformal model, a convenient way to implement 3D geometry using a 5D representation space.\n    Presents effective approaches to making GA an integral part of your programming.\n    Includes numerous drills and programming exercises helpful for both students and practitioners.\n    Companion web site includes links to GAViewer, a program that will allow you to interact with many of the 3D figures in the book, and Gaigen 2, the platform for the instructive programming exercises that conclude each chapter. \n\nPublisher: Morgan Kaufmann; 1 edition (April 6, 2007)\nLanguage: English\nISBN-10: 0123749425\nISBN-13: 978-0123749420\n\nEditorial Reviews\nReview\n\nWithin the last decade, Geometric Algebra (GA) has emerged as a powerful alternative to classical matrix algebra as a comprehensive conceptual language and computational system for computer science. This book will serve as a standard introduction and reference to the subject for students and experts alike. As a textbook, it provides a thorough grounding in the fundamentals of GA, with many illustrations, exercises and applications. Experts will delight in the refreshing perspective GA gives to every topic, large and small. -David Hestenes, Distinguished research Professor, Department of Physics, Arizona State University Geometric Algebra is becoming increasingly important in computer science. This book is a comprehensive introduction to Geometric Algebra with detailed descriptions of important applications. While requiring serious study, it has deep and powerful insights into GA's usage. It has excellent discussions of how to actually implement GA on the computer. -Dr. Alyn Rockwood, CTO, FreeDesign, Inc. Longmont, Colorado\nBook Description\nThe first book on a new technique in 3D graphics --This text refers to an out of print or unavailable edition of this title.","torrent":{"xt":"urn:btih:0c75b68753c180a78231d37085cdc9f4f3b1ae19","amp;dn":"%5BLeo_Dorst%2C_Daniel_Fontijne%2C_Stephen_Mann%5DGeometric+Algebra+for+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c75b68753c180a78231d37085cdc9f4f3b1ae19","infoHashBuffer":{"type":"Buffer","data":[12,117,182,135,83,193,128,167,130,49,211,112,133,205,201,244,243,177,174,25]},"announce":[],"urlList":[]}}