{"title":"SANTANA BORBOLETTA ALBUM-1974 IN FLAC M3U BY WINKER","uid":5501673,"size":308719236,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0cff01b4c2797ef0fa8a2c4eb29b21fdc88bf1cc&amp;dn=SANTANA+BORBOLETTA+ALBUM-1974+IN+FLAC+M3U+BY+WINKER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alanwatson","files":15,"time":1271580754,"description":"Although it isn't a concept album in the conventional sense, BORBOLETTA has the aesthetic and thematic continuity of one. The lyrical material deals with pop-sheened themes of spiritual and personal expansion, while the album's gorgeous jazz-spirited instrumentals make for more cerebral and challenging listening. The band seals a Brazilian fusion connection with the appearance of vocalist Flora Purim and rhythmist extraordinaire Airto Moreira, while soulman Leon Patillo and keyboardist Tom Coster make their first major appearances in the core Santana lineup.\n\n&quot;Spring Manifestations&quot; opens the album like a meditation in the jungle, with Flora and Airto conjuring up an atmospheric wilderness of sound effects. Elsewhere, the distinct soft groove of the '70s tempers the band's harder crunch of the '60s as the percussion section tames its spikes and the gentle strains of Fender-Rhodes piano dance alongside the sinewy grit of Hammond organ. &quot;One With the Sun&quot; features an urgent-sounding Patillo making declarations of solar harmony at the mic and Carlos shredding through a series of breathtaking guitar solos. His playing shows signs of blooming into greater subtlety and harmonic sophistication on cuts like &quot;Flor de Canela&quot; and &quot;Promise of a Fisherman&quot; with lightning-fast modal-rock runs.\n\n\n\n1. Spring Manifestastions (Sound Effects)\n2. Canot De Los Flores\n3. Life Is Anew\n4. Give And Take\n5. One With The Sun\n6. Aspirations\n7. Practice What You Preach\n8. Mirage\n9. Here And Now\n10. Flor De Canela\n11. Promise Of A Fisherman\n12. Borboletta","torrent":{"xt":"urn:btih:0cff01b4c2797ef0fa8a2c4eb29b21fdc88bf1cc","amp;dn":"SANTANA+BORBOLETTA+ALBUM-1974+IN+FLAC+M3U+BY+WINKER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cff01b4c2797ef0fa8a2c4eb29b21fdc88bf1cc","infoHashBuffer":{"type":"Buffer","data":[12,255,1,180,194,121,126,240,250,138,44,78,178,155,33,253,200,139,241,204]},"announce":[],"urlList":[]}}