{"title":"Stanley Meyer's Water Fuel Cell - The Birth of New Techno","uid":5264869,"size":1284580145,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0ebf3906cc7480cc4a901b6bbf9869007c2abacc&amp;dn=Stanley+Meyer%5C%27s+Water+Fuel+Cell+-+The+Birth+of+New+Techno&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ryba777","files":8,"time":1262860559,"description":"Stanley Meyer's Water Fuel Cell - The Birth of New Technology (Video Pack)\nExplaining the Hydrogen Fracturing Process on how to Use Water as a New Fuel-Source\n\n\n\nImagine running your car on water! That's correct, I said water. Stanley Meyer may have done exactly that, modifying his dune buggy to run on water alone using the hydrogen to run his dune buggy. The goal of these videos is to explain the science behind Stanley Meyers water fuel cell. We will study his theory, patents, and related information. The objective will be to replicate the water fuel cell. The completion of our work will be proof to the world of the validity of the water fuel cell. Have you ever thought about water as a fuel source? The atomic make up of water makes the molecule perfect for a fuel source. The water molecule is composed of two atoms of hydrogen and one atom of oxygen.  When the water molecule is separated into its component atoms (H and O) and oxidized as fuel, the resulting energy is two and one half times more powerful than gasoline. The byproduct of the combustion is water vapor. Making water as a fuel, powerful and pollution free! The problem has always been how to separate water economically. Traditional methods of separating the bond of the water molecule have resulted in failure. To power a car by these methods would not move the car very far. The car's electrical system could not recharge from the process quickly enough. The result would be a quickly drained battery. For many years Stanley Meyer researched this problem and found a way around it! There are many people, as you could well imagine, who would not like to see this technology appear in the market place. Stanley A. Meyer was murdered on March 27 1998 at the age of 57 after refusing an offer of one billion (!) dollars for destroying his inventions. It is vital that his research and resulting technological advances are not lost, but rather that his work is continued. Join in the creative spirit and challenge, that is not driven by greed, and help in an endeavor that will revolutionize the world. This effort will provide an efficient fuel source which is environmentally safe.\n\n\nThe WFC (Water Fuel Cell) based on the work of Stanley Meyer uses ordinary tap water or distilled water - this is not a common\nFaraday electrolysis process: The WFC uses the parametric resonance effect with High Voltage and Low Current to split the water\nmolecule with very little energy. The purpose of this WFC project is trying to replicate the results obtained by Stanley Meyer.\n\n\nHydrogen fracturing process... using water as fuel.\nOver the years man has used water in many ways to make his\nlife on earth more productive. Why not, now, use water as fuel to\npower our cars, heat our homes, fly our planes or propel\nspaceships beyond our galaxy? Biblical prophesy foretells this\nevent. \n\nAfter all, the energy contained in a gallon of water exceeds 2.5\nmillion barrels of oil when equated in terms of atomic energy.\nWater, of course, is free, abundant, and energy recyclable.\nThe Hydrogen Fracturing Process dissociates the water molecule\nby way of voltage stimulation, ionizes the combustible gases by\nelectron ejection and, then, prevents the formation of the water\nmolecule during thermal gas ignition ... releasing thermal\nexplosive energy beyond &quot;normal&quot; gas burning levels under\ncontrol state ... and the atomic energy process is environmentally\nsafe. \n\nStanley Meyer\n\n\n\n\nVideos:\n\n1.)\nThe Water Fuel Cell - House Meeting in New Zealand 1989 with Stanley Meyer \n1.13GB\nDivX 4 (Perian), 480 x 360, Millions\nMPEG Layer 3, Stereo, 44.100 kHz\n1044.65 kbits/s\napprox. 3 hours\n\n\n2.)\nStanley Meyer - Buggy Test - Water Fuel Cell\n18.7MB\n\n3.)\nStanley Meyer - It Runs on Water\n46.3MB\n\n\nText Files:\n\n4.)\nMeyer_WFC_Technical_Brief.pdf\n7.4MB\n220 pages\n\n","torrent":{"xt":"urn:btih:0ebf3906cc7480cc4a901b6bbf9869007c2abacc","amp;dn":"Stanley+Meyer%5C%27s+Water+Fuel+Cell+-+The+Birth+of+New+Techno","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ebf3906cc7480cc4a901b6bbf9869007c2abacc","infoHashBuffer":{"type":"Buffer","data":[14,191,57,6,204,116,128,204,74,144,27,107,191,152,105,0,124,42,186,204]},"announce":[],"urlList":[]}}