{"title":"Alex Haley - Korzenie [Polish]","uid":14127856,"size":426489323,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ed935ce7d24a41161e067c5ead4993deea93aba&amp;dn=Alex+Haley+-+Korzenie+%5BPolish%5D+MP3%4032&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"everdarksoul","files":63,"time":1459516502,"description":"Audiobook PL - 62 części /   \r\nrozmiar: 406 MB / czas: 29:29:03\r\nczyta: Andrzej Piszczatowski\r\n\r\nSaga rodzinna autorstwa Alexa Haleya, będąca rodzajem drzewa genealogicznego pisarza, od Kunta Kinte, żyjącego na terenach obecnej Gambii, po wiek XX. Książka została nagrodzona Pulitzerem, a na jej motywach powstał w 1977 - również kilkakrotnie nagradzony - amerykański serial telewizyjny &quot;Roots&quot; ze znakomitymi rolami LeVar Burton'a, Olivii Cole i Robert Reed'a. W roku 2016, kanał History Channel, rozpoczął emisję nowej wersji serialu, m.in. z Forestem Whitaker'em i Laurencem Fishburne'm w rolach głównych. 11 lutego ukazał się trailer, w którym premierę zapowiedziano na 30 maja, w dniu amerykańskiego święta Memorial Day.\r\n\r\nJako młody chłopiec, Alex Haley, uczył się o swym afrykańskim przodku - Kunta Kinte - podczas letnich dni spędzanych w Henning, słuchając rodzinnych historii opowiadanych przez dziadków. Zgodnie z tymi opowieściami Kunta Kinte z plemienia Mandinka został przywieziony wraz z innymi gambijskimi Murzynami do USA i sprzedany do pracy niewolniczej.\r\nAlex Haley postanowił więcej dowiedzieć się o swoich przodkach, czego wynikiem jest nagrodzona Pulitzerem książka &quot;Korzenie&quot; (ang. Roots: The Saga of an American Family), będąca swoistym drzewem genealogicznym autora oraz ukazująca znaczenie pracy niewolników dla budowy gospodarczej potęgi Stanów Zjednoczonych","torrent":{"xt":"urn:btih:0ed935ce7d24a41161e067c5ead4993deea93aba","amp;dn":"Alex+Haley+-+Korzenie+%5BPolish%5D+MP3%4032","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ed935ce7d24a41161e067c5ead4993deea93aba","infoHashBuffer":{"type":"Buffer","data":[14,217,53,206,125,36,164,17,97,224,103,197,234,212,153,61,238,169,58,186]},"announce":[],"urlList":[]}}