{"title":"Alan Stephens - Making Sense of War. Strategy for the 21st Centu","uid":10161635,"size":1986054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:109f0843459bbbcd7ce94577d94f5b4625ce12fb&amp;dn=Alan+Stephens+-+Making+Sense+of+War.+Strategy+for+the+21st+Centu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1400303536,"description":"Description\nProduct Details\nBook Title: Making Sense of War: Strategy for the 21st Century\t\nBook Author: Alan Stephens (Author), Nicola Baker (Author)\nPaperback: 306 pages\nPublisher: Cambridge University Press; 1 edition (November 13, 2006)\nLanguage: English\nISBN-10: 0521676649\nISBN-13: 978-0521676649\n\n===================================================================================\nBook Description\nMaking Sense of War provides a comprehensive and clear analysis of the complex business of waging war. It gives readers a thorough understanding of the key concepts in strategic thought, concepts that have endured since the Athenian general Thucydides and the Chinese philosopher/warrior Sun Tzu first wrote about strategy some 2500 years ago. It also examines the influence on strategic choice and military strategy of political, legal and technological change. This book discusses strategy at every level of competition, employing a thematic approach and using historical examples from 500 BCE to the present. It discusses the constraints and opportunities facing military commanders in the 21st century, and demonstrates that the formulation of military strategy will continue to be perhaps the single most important responsibility for senior security officials. Making Sense of War offers original insights into the imperatives of military success in the era of asymmetric warfare.\n\n===================================================================================\nReview\n&quot;This carefully crafted and well-researched book draws on Clausewitz, Jomini, Machiavelli and Sun Tzu and uses relevant historical events as examples.&quot;\nDavid A. Anderson, Military Review\n\n===================================================================================\nBook Description II\nMaking Sense of War provides a comprehensive and clear analysis of the complex business of waging war. Employing a thematic approach and using historical examples from 500 BCE to the present, it discusses the constraints and opportunities facing military commanders in the 21st century.\n\n===================================================================================\nAbout the Author\nAlan Stephens is a senior lecturer at the University of New South Wales Australian Defence Force Academy. Previous appointments include principal adviser to the Australian Federal Parliament's Joint Foreign Affairs and Defence Committee, official historian for the RAAF, contributing editor to Asia-Pacific Defence Reporter, military history commentator on ABC television, and RAAF pilot.\nNicola Baker is a lecturer on Strategic Studies at the University of New South Wales Australian Defence Force Academy. She has worked as a consultant to various Australian defence organisations and written on a range of military and strategic issues.\n===================================================================================","torrent":{"xt":"urn:btih:109f0843459bbbcd7ce94577d94f5b4625ce12fb","amp;dn":"Alan+Stephens+-+Making+Sense+of+War.+Strategy+for+the+21st+Centu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"109f0843459bbbcd7ce94577d94f5b4625ce12fb","infoHashBuffer":{"type":"Buffer","data":[16,159,8,67,69,155,187,205,124,233,69,119,217,79,91,70,37,206,18,251]},"announce":[],"urlList":[]}}