{"title":"Laurence shames [Key west] 8 books (Epub) {dwg]","uid":10971103,"size":4637308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10c1d13ea2b8187962b3a2482fbed82601a692e9&amp;dn=Laurence+shames+%5BKey+west%5D+8+books+%28Epub%29+%7Bdwg%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":8,"time":1409793434,"description":"oey Goldman's flying south for the winter. The second-string New York wiseguy just packed up his faithful girlfriend Sandra and took off for Key West -- land of sun, surf and sleaze -- where a small-time hustler in search of a racket can score the big one. If he can find it. Enter Joey's half brother Gino. On the lam from the mob after one of the most royally screwed-up jewel heists in Florida history, Gino's a man in need of a fall guy. Which is where Joey comes in . . .Suddenly, everyone's after Joey -- including the ruthless Miami don who wants his three million worth of uncut emeralds and who just dispatched his goons to deliver Joey a one-way ticket -- out. Now Joey's where he always wanted to be -- in the big time. All he has to do is find out where the stones are stashed. And for an unikely hero out to make a killing, this could be Paradise . . . if he lives long enough.\n\n\n\n\nWhen Augie Silver disappeared at sea during a sudden storm, it was a loss felt initially by his young wife and by his crew of drinking cronies. When word of his apparent drowning extended beyond the Key West world Augie had made his home, however, his loss was felt by a greater number of people. For Augie Silver was a painter, or more precisely an artist, waiting for recognition. And his death proved to be the event necessary to turn a lifetime of eccentricity into a career of genius. Suddenly Augie was hot. While his wife, Nina, continued to mourn, his friends began to awaken to the realization that all those paintings Augie had given them over the years might have been worth holding on to. In fact, according to the New York art dealer who was also Augie's agent, they might be worth a whole lot. So when Augie returns from the &quot;dead,&quot; having been shipwrecked on an island off Cuba, it is with somewhat mixed emotions that he is welcomed home. His wife is jubilant, but all those who had read dollar signs in Augie's obituary aren't too sure how happy they are to have him back, especially since each of them seems to need an influx of cash in the worst way. And when mysterious things start happening to Augie, little &quot;accidents&quot; that seem less than accidental, he's not too sure how happy he is to be back either. With the help, however, of his wife and their fiercely loyal houseboy, Reuben the Cuban, Augie fights for his life a second time around while seeking out the would-be killer. From the author of Florida Straits, a critically acclaimed story of suspense also set in Key West, Scavenger Reef is a funny, dark, and vastly entertaining novel all about life, death, and the stages in between, written with wit and charm, and filled with unforgettable characters.\n\n\n\n\nWhen Joey Goldman's illegitimate father, a nefarious godfather from New York, heads to Key West, Joey has the bright idea of letting a Kew West reporter help write his memoirs, a book that no onethe Mafia, the FBI, or the real heir to Delgatto's family businesswants to see published\n\n\n\n\nMurray Zemelman - lingerie mogul, a.k.a. the Bra King - wakes up one morning, starts his car in the confines of his airtight garage, and contemplates the worst. But instead of doing himself in, he pops a Prozac and hits the road, waving good-bye to his trophy wife, the thriving brassiere business, and the streets of New Jersey for good. He's headed to Florida, home of his first wife, Franny, whom he was stupid enough to leave all those years ago. But now he wants to start fresh. Is it a brilliant insight? A glitch in his Prozac dosage? Who cares? He's off to Key West. There, he meets Tommy Tarpon, a local Native American - beaten down and made bitter by the unfairness of life around him, and the last surviving member of his small Florida tribe. Together they cook up a plan: with Murray's business acumen and Tommy's ability to make the most of government statutes, Key West could very well get its first legal gambling parlor on Tommy's tribal grounds - a tiny, alligator-infested island just off the coast. But gambling in Key West isn't an original idea, and a whole other species of reptiles is interested in the plan. With the &quot;assistance&quot; of Key West's crookedest politician, a local Mafioso makes Murray and Tommy an offer they can't refuse. All Murray wanted was to woo his first wife away from her reading group and into the Jacuzzi - but he ends up getting her, himself, and Tommy into more hot water than he ever bargained for.\n\n\n\n\nMeet Angelina Amaro, the star-crossed daughter of Mafia capo Paul Amaro. For ten long years virginal Angelina has been carrying a secret torch for the stool pigeon who betrayed her father to the cops in exchange for a spot in the Witness Protection Program. When she recognizes her beloved's hands mixing drinks in a relative's Key West vacation video, Angelina stops pining and starts planning her escape from her family and reunion with her man Sal, who now goes by the name of Ziggy Maxx. Naturally, the course of true love never did run smoothly, and it isn't long before Papa is on her trail with hilarious results.\nPlaying the Mafia for laughs is a novel idea, and it works quite well in Laurence Shames' fifth book, Virgin Heat. In Angelina, Mr. Shames has found a sympathetic heroine, and in his collection of undercover cops, cross-dressing mafiosi, vengeful hit men, and long-suffering wives, he has created a memorable cast of supporting characters\n\n\n\n\nKey West seduces people--then asks them to leave in the morning. Take Aaron Katz. He shucked his nine-to-five to restore Mangrove Arms, a rotting wreck of a guest house. Suki Sperakis sees opportunity in Florida too. In the meantime she's peddling ad space for a third-rate freebie paper. Then she stumbles upon a nefarious plot revolving around a handsome Russian and his string of T-shirt shops. Can't a guy manufacture plutonium in peace? \n\nNow, with the Russian mafia on her trail, freewheeling Suki is running for her life--and right into the safety of Aaron's Mangrove Arms. As dead bodies sully the Key West scenery, a secret society of killers puts the squeeze on Suki and Aaron--and conspires to turn an island paradise into a tropical death-trap. . .\n\n\n\n\nBefore mild-mannered furniture salesman Al Tuschman left New Jersey for a week in Key West, he hadn't an enemy in the world. But a series of puzzling assaults on his privacy, his sanity, and his life has turned his stay at the tasteful Paradise Hotel into Tropical Hell. Maybe it's the humidity. Maybe the Sambuca. Or maybe it's the nickname emblazoned on his license plate: Big Al.\n\nFor Big Al Marracotta, Mafia capo, a Florida getaway means outrunning a career in crime and rancid calamari. For Katy Sansone it's a bid for sunshine and self-respect--until a case of mistaken identity pits the confused woman against a bafflement of Als and more danger than any one of them had reason to pack for. Now, if Tuschman doesn't watch his back, somebody's going to be reporting the death of another salesman. . .\n\n\n\n\n&quot;One of the new century's most entertaining mysteries&quot; (The Cleveland Plain Dealer), The Naked Detective introduces us to Pete Amsterdam-a detective so reluctant, he's never accepted a case . until the inevitable blond shows up. But this is Key West, where nothing is quite what is seems. Is the blonde really a woman? Are the death threats to be believed? Who's more dangerous-the gangsters or the yoga teacher? And does Amsterdam-who learned detective work from reading books, just like Don Quixote learned chivalry-have a snowball's chance in hell of solving this thing before it kills him?","torrent":{"xt":"urn:btih:10c1d13ea2b8187962b3a2482fbed82601a692e9","amp;dn":"Laurence+shames+%5BKey+west%5D+8+books+%28Epub%29+%7Bdwg%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10c1d13ea2b8187962b3a2482fbed82601a692e9","infoHashBuffer":{"type":"Buffer","data":[16,193,209,62,162,184,24,121,98,179,162,72,47,190,216,38,1,166,146,233]},"announce":[],"urlList":[]}}