{"title":"Jeffery Deaver ~ [Lincoln Rhyme 03] - The Empty Chair *** The fo","uid":15291635,"size":406825997,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:11181ae109e4e5922fc2971f7c7d770fce842acb&amp;dn=Jeffery+Deaver+%7E+%5BLincoln+Rhyme+03%5D+-+The+Empty+Chair+%2A%2A%2A+The+fo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":17,"time":1468426172,"description":"General Information\r\nBook............................The Empty Chair\r\nSeries Name................Lincoln Rhyme\r\nSeries No.....................03\r\nAuthor.........................Jeffery Deaver\r\nNarrator.......................Jeff Harding\r\nUnabridged..................Yes\r\nGenre..........................Psychological Crime Mystery Thriller\r\n\r\nFile Information\r\nSource.........................eDownload\r\n# of MP3 files...............11\r\nTotal Runtime..............14 Hours 6 Minutes\r\nEncoder.......................Lame 3.97\r\nConverted to................64 Kb | CBR | 44,100 Hz | Stereo\r\nTotal Size.....................387 MB\r\nConverted By...............OldScotsman\r\nDate Converted............03-May-2002\r\nID3 Tags......................Includes Image and all info shown on this page (Smart Phone Ready)\r\n\r\nIf you would like to try another Jeffery Deaver Audio Book I have uploaded, just click the title below.\r\nLincoln Rhyme 02 - The Coffin Dancer\r\nLincoln Rhyme 03 - The Empty Chair\r\n\r\nABOUT THE BOOK\r\nWhen criminalist Lincoln Rhyme travels to a world-famous spinal cord injuries centre in North Carolina for some experimental surgery, he hopes that the operation will give him slightly more movement He knows that it may kill him But before he has a chance to undergo surgery, Rhyme and his assistant are drafted in by the local police department to use their forensic skills to help find two women kidnapped by a psychotic young man known locally as the Insect Boy.\r\n\r\nimage\r\nABOUT THE AUTHOR\r\nJeffery Deaver was born outside of Chicago in 1950. His father was an advertising copywriter and his mother was a homemaker. Deaver worked as a magazine writer, then, to gain the background needed to become a legal correspondent for The New York Times or Wall Street Journal, he enrolled at Fordham Law School. In 1990 he started to write full time. Deaver has been nominated for six Edgar Awards from the Mystery Writers of America, an Anthony award, a Gumshoe Award, and is a three-time recipient of the Ellery Queen Reader's Award for Best Short Story of the Year. In 2001, he won the W.H. Smith Thumping Good Read Award for his Lincoln Rhyme novel The Empty Chair. In 2004, he was awarded the Crime Writers Association of Great Britain's Ian Fleming Steel Dagger Award for Garden Of Beasts and the Short Story Dagger for &quot;The Weekender.&quot;\r\n\r\nimage\r\nABOUT THE READER\r\nJeff Harding is an American actor from Andover, Massachusetts who attended college in Brunswick, Maine. He is most famed for his narration of popular books into audio format. Notably, he has read The Da Vinci Code, The Bourne Identity, Kane and Abel and Secrets Of The Code. His acting career as speaking extras is well documented, appearing in such high profile productions as Alfie and Tomorrow Never Dies, Hackers and (with Michael Caine) Bullseye!.\r\nNow living in the United Kingdom (since the late 1970s), he has appeared in notable UK comedies such as The Armando Iannucci Shows, The Fast Show and Father Ted. He is also remembered for his role as Orrin Hudson in the 1980s BBC drama series Howards' Way.\r\n\r\n\r\nAll the above information including the picture are inserted into the ID3 tags on the MP3 files.\r\n\r\nRemember, we have uploaded these books just for you because we wish to SHARE them. It is only right therefore, you SHARE them with others, and the only way you can do this, is to keep SEEDING. In other words, don't stop after you have finished the download. Check and make sure your torrent program is set to continue uploading even after the downloading has been completed. A ratio of 2.0 means you are giving back twice what you have received, the book won't die and all our efforts have not been wasted but 5.0 would be outstanding and shows you have really entered into the spirit of what we are about. WE DO OUR BIT AND YOU DO YOUR BIT, sounds fair, doesn't it. If you are new to this and don't understand, type a message at the bottom and if I can't help, I know someone who can. biggrin\r\n\r\nimage This Audiobook was converted and uploaded by OldScotsmanimage","torrent":{"xt":"urn:btih:11181ae109e4e5922fc2971f7c7d770fce842acb","amp;dn":"Jeffery+Deaver+%7E+%5BLincoln+Rhyme+03%5D+-+The+Empty+Chair+%2A%2A%2A+The+fo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11181ae109e4e5922fc2971f7c7d770fce842acb","infoHashBuffer":{"type":"Buffer","data":[17,24,26,225,9,228,229,146,47,194,151,31,124,125,119,15,206,132,42,203]},"announce":[],"urlList":[]}}