{"title":"This Sceptred Isle   (The History of Britain - epub/mobi - 2012)","uid":8641503,"size":2168252,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:111a741a59ab83c2bef08d32bc43c8be6a1afe3c&amp;dn=This+Sceptred+Isle+++%28The+History+of+Britain+-+epub%2Fmobi+-+2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":4,"time":1372890130,"description":"This Sceptred Isle - The Making of Britain\nAuthor:  Christopher Lee\nRetail epub/mobi\nRelease Date:  January 2012\n\nA companion to the celebrated 1999 BBC Radio series looking at the history of Britain from 55BC to 2000.\n\n\n\nWhat is Britishness? What allowed one small island group to rule a quarter of the world and, even today, to have the most spoken language after Chinese? What makes Americans admire the guts, traditions and loyalties of these island Anglo-Saxon and Celtic peoples? What is it that makes cynical Europeans and once-dominated Asians look to the British for opinion, literature, social norms and justice? The answers lie within the creation of British institutions, both Commoner and Aristocracy, during the past 2000 years. Following the thought-provoking style of the original This Sceptred Isle, this new volume brings to life the character and frustrations so carefully studied by allies and enemies for twenty-one centuries - from Romans to al-Qaeda. Here Lee makes all the connections with institutions and changing industrial and social characteristics that even show us that Britishness is not exclusively British. At a time when a major section of the British, the English, appear to be less and less sure who they are and who they are meant to be, This Sceptred Isle confirms who it is we really are.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:111a741a59ab83c2bef08d32bc43c8be6a1afe3c","amp;dn":"This+Sceptred+Isle+++%28The+History+of+Britain+-+epub%2Fmobi+-+2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"111a741a59ab83c2bef08d32bc43c8be6a1afe3c","infoHashBuffer":{"type":"Buffer","data":[17,26,116,26,89,171,131,194,190,240,141,50,188,67,200,190,106,26,254,60]},"announce":[],"urlList":[]}}