{"title":"Cynthia (1947) DVD5 - Elizabeth Taylor, George Murphy [DDR]","uid":10513879,"size":4318765056,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:114c7c7074585d732fd73383165be1e26f74bef1&amp;dn=Cynthia+%281947%29+DVD5+-+Elizabeth+Taylor%2C+George+Murphy+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"SaM","files":18,"time":1404881251,"description":"Cynthia (1947) DVD5 - Elizabeth Taylor, George Murphy [DDR]\n\n    CAST:-\n    Elizabeth Taylor as Cynthia Bishop\n    Mary Astor as Louise Bishop\n    George Murphy as Larry Bishop\n    S. Z. Sakall as Professor Rosenkrantz\n    Gene Lockhart as Dr. Fred Jannings\n    Spring Byington as Carrie Jannings\n    James Lydon as Ricky Latham\n    Scotty Beckett as Will Parker\n    Anna Q. Nilsson as Miss Brady\n    Minerva Urecal as Maid\n    Morris Ankrum as Mr. Phillips\n    Kathleen Howard as McQuillan\n    Shirley Johns as Stella Regan\n    Harlan Briggs as J.M. Dingle\n    Will Wright as Gus Wood\n\nDirector: Robert Z. Leonard\nProducer: Edwin H. Knopf\nMusic: Bronislau Kaper\nBW-98m. \n\nMOVIE REVIEW:- Cynthia (1947)\nCynthia (1947) was Elizabeth Taylor's coming-of-age film, the one in which the intense and determined young girl who had become a star at the age of 12 in National Velvet (1944) became an intensely lovely and just as determined young woman. Based on an unsuccessful Broadway play, Cynthia is the story of a sickly, sheltered teen who rebels against her parents' overprotectiveness, finds a boyfriend, goes to the prom, and gets her first kiss.\n\nAfter National Velvet, MGM was unable to come up with a satisfactory follow-up for its young star, and Elizabeth was off the screen for a year and a half. She kept busy, writing a children's book, Nibbles and Me (1946), about her pet chipmunk, and giving interviews to teen magazines. When she finally did make another film, Courage of Lassie (1946), she got star billing for the first time, but played a distinctly supporting role to a collie. Meanwhile, the pretty little girl was blossoming into a beautiful teenager. She also was developing a backbone, and an awareness of her importance to MGM. When studio head Louis B. Mayer decided that she would sing and dance in her next film, Sally in Her Alley, Elizabeth and her mother met with him to ask if Elizabeth could take singing and dancing lessons. Mayer began cursing and shouting at Mrs. Taylor, calling her stupid and meddlesome. Elizabeth, infuriated, shouted back, &quot;Don't you dare speak to my mother like that! You and your studio can both go to hell!&quot; She stormed out, leaving Mrs. Taylor to placate Mayer. Elizabeth refused to apologize, and never spoke to Mayer again. Sally in Her Alley was never made.\n\nInstead, Elizabeth made Cynthia, and the role suited her perfectly. Like Cynthia, the 15-year old Elizabeth had been sheltered and coddled by her mother and by the studio. Like Cynthia, she could not live a normal life, didn't have friends, and longed for independence and romance. According to production files, Cynthia's writers and director Robert Z. Leonard asked for the star's input for the character, and she gave Cynthia the traits that she had or that she admired, like honesty and compassion. And maybe something else, too: Kitty Kelley's biography, Elizabeth Taylor: the Last Star quotes a co-worker as saying, &quot;I think she might have carried her ill and ailing on-camera role into real life.&quot;\n\nMary Astor, who played Cynthia's mother, watched her young co-star closely, and made some astute observations. &quot;She was beginning to be conscious in a very normal, teen-age way of her own beauty. She was also bright. Very bright. Head-of-the-class type of brightness,&quot; Astor later wrote in her memoir, A Life on Film. &quot;Elizabeth was cool, and slightly superior. There was a look in those violet eyes that was somewhat calculating, as though she knew exactly what she wanted and was quite sure of getting it.&quot; Astor herself wasn't getting what she wanted. The OscarÂ®-winning actress was typecast as everybody's mother, and she was frustrated and battling alcoholism. When her MGM contract ended in 1949, Astor checked into rehab, but her personal struggles continued for several years. Eventually, she began writing as therapy, and produced two volumes of memoirs and several novels. She also resumed her acting career.\n\nCritics had praise for both Taylor's and Astor's performances. &quot;Miss Taylor does a brilliant job with the title role,&quot; wrote Howard Barnes in the New York Herald Tribune. &quot;She plays an unwilling invalid with grave charm.&quot; But they also dismissed the film. &quot;Cynthia is a synthetic morsel -- right out of the Metro candy box,&quot; according to Bosley Crowther of the New York Times. But more than 40 years later, British critic Alexander Walker re-evaluated, calling Cynthia one of Taylor's &quot;unjustly forgotten triumphs of tact, sympathy, pathos and insistent self-assertion; and the identification with Cynthia by the bobby-soxers who saw it must have been total. It is one of the most likeable movies of adolescent independence.&quot;\n\nSYNOPSIS:- Cynthis (1947)\nFifteen-year-old Elizabeth Taylor receives her first screen kiss in the innocuous MGM confection Cynthia. Taylor plays the title character, a sickly, sheltered young lady who is never permitted the companionship of other teenagers. Frustrated though Cynthia may be, she has nothing on her parents, Larry and Louise Bishop (George Murphy and Mary Astor), who feel they could have gotten a lot further in life had they remained childless Only by discovering that she has a gorgeous (albeit dubbed) singing voice is Cynthia able to break out of her shell and join the high school choir, under the benevolent leadership of cuddly Professor Rosencrantz (S. Z. Sakall). Along the way, the girl's parents overcome their resentment and learn to appreciate their daughter for the prize that she is. As a bonus, Cynthia also falls in love with Ricky Latham (James Lydon), who bestows that historic first kiss on her blushing cheek (Elizabeth Taylor and James Lydon would later be reteamed in Warner Bros.' Life with Father). Based on a play by Vina Delmar, Cynthia is a &quot;programmer&quot; by MGM standards, but an &quot;A&quot;-picture by any other studio's standards.\nLouise Bishop, a devoted wife and mother, fondly recalls the time, seventeen years earlier, when she was a freshman studying music at Wyandott College: At a party celebrating the school baseball team's victory, Louise falls in love with Larry Bishop, the player who hit the home-run that won the championship. A romance ensues, and one day Louise tells Larry her hopes of continuing her studies at the Vienna Conservatory. Larry tells her that he too plans to go to Vienna to study medicine. At the end of the school year, Louise goes to Michigan for the summer, while Larry returns to his hometown of Napoleon, Illinois, to work at J. M. Dingle's hardware store. Larry and Louise return to school in the fall, and a short time after they are married, Louise discovers that she is pregnant. After agreeing to postpone their plans for future studies, Larry and Louise move to Napoleon to raise a family. Cynthia is born frail and delicate, and when the doctor bills begin to mount, Louise and Larry realize that they may never be able to study in Vienna. Louise comes out of her reverie while recalling Cynthia's protected childhood and the beginning of her high school years in Napoleon. Cynthia, who is now fifteen years old and still prone to illness, is unaware that her parents made enormous sacrifices for her. One day, while walking home from school, Cynthia pays a visit to her uncle, Dr. Fred I. Jannings, who is treating her with various shots and immunizations. Cynthia then visits her voice instructor, Professor Rosenkrantz, who suggests that she audition for the next school opera. Meanwhile, Larry, who is still working at Dingle's hardware store, struggles to make ends meet for his family and is considering buying the house that they are renting. Fred, however, refuses to give his endorsement for Larry's bank loan, and Louise rejects the idea of buying the house because she sees it as an impediment to their future plans. Uable to participate in most of the school activities because of her health history, Cynthia begins to feel like an outcast and resents being treated as if she were always sick. Her despair soon fades, however, when her singing attracts the attention of the school's most popular student, Ricky Latham. A romance blossoms, much to the dismay of Cynthia's jealous cousin, Fredonia Jannings, and her friend, Stella Regan. Cynthia is eventually awarded the leading role in the school play, but Louise and Larry are concerned that she does not have the physical strength to perform in the show. Their fears are soon realized when Cynthia falls ill with the flu and is forced to bow out of the play. Fred later admonishes Louise for encouraging Cynthia beyond her capacity, but Louise wonders whether they have relied too heavily upon Fred's advice. Cynthia returns to school a few days before the spring prom, and Ricky asks her to be his date for the dance. The night of the dance, Louise deceives her husband and secretly allows Cynthia to attend the dance against his wishes. While Cynthia has a wonderful time at the ball, Larry learns that he was tricked and bitterly criticizes Louise. The following morning, Larry oversleeps and goes into work late for the first time in fifteen years. When Larry learns that Dingle is upset about his tardiness, he angrily accuses his boss of unfair treatment, quits his job and plans to move his family to Chicago. Louise is happy to see that her husband has finally stood up for himself, but Cynthia rejects her parents' plans to move. The Bishops decide to stay in Napoleon, and their financial troubles are solved when Dingle shows up to beg Larry to return to his job.  \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 98 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 98 mins","torrent":{"xt":"urn:btih:114c7c7074585d732fd73383165be1e26f74bef1","amp;dn":"Cynthia+%281947%29+DVD5+-+Elizabeth+Taylor%2C+George+Murphy+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"114c7c7074585d732fd73383165be1e26f74bef1","infoHashBuffer":{"type":"Buffer","data":[17,76,124,112,116,88,93,115,47,215,51,131,22,91,225,226,111,116,190,241]},"announce":[],"urlList":[]}}