{"title":"The Varangian Guard 988-1453","uid":11851239,"size":5739244,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1161bca3be36facec05318ecd71fdf98bf5ac366&amp;dn=The+Varangian+Guard+988-1453&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1430100255,"description":"The Varangian Guards were Viking mercenaries who operated far beyond their native shores as an elite force within the Byzantine Armies. Descendants from a legendary line of warriors, the Varangian Guard was formed after a group of Viking mercenaries made a major contribution to the Byzantine Emperor Basil II's victory over rebel forces in 988 AD. These 5,000 men were then retained as Basil's personal guard and would provide loyal service to many successive occupants of the imperial throne.\n\nCommonly referred to as 'foreigners' (Etaireia), they were nonetheless absorbed into a new Palatine regiment under command of an officer termed the Akolouthos, who was either a Norsemen or a Rus (Norsemen colonizers of Russia). The Varangians wore mixtures of their native clothing and armor together with a splendid formal Byzantine uniform. But most famously, they always wielded their own traditional battle-axes; this became a sign that the emperor was on the battlefield in person. This is an insightful look of one of the legendary guard units of the medieval world, complete with a dazzling array of artwork plates showing the Varangian Guard in an array of settings from court ceremonies to the battlefield","torrent":{"xt":"urn:btih:1161bca3be36facec05318ecd71fdf98bf5ac366","amp;dn":"The+Varangian+Guard+988-1453","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1161bca3be36facec05318ecd71fdf98bf5ac366","infoHashBuffer":{"type":"Buffer","data":[17,97,188,163,190,54,250,206,192,83,24,236,215,31,223,152,191,90,195,102]},"announce":[],"urlList":[]}}