{"title":"Confessions of a Stripper -- Tales from the VIP Room","uid":6090218,"size":366508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11a04e39c94885be24dc5d84bef1899cb6c6f3af&amp;dn=Confessions+of+a+Stripper+--+Tales+from+the+VIP+Room&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1294519770,"description":"Take a behind-the-scenes no-holds-barred tour of your neighborhood strip club in Confessions of a Stripper--Tales from the VIP Room. These adventures--both high and low--in the topless trade are culled from author Lacey Lane's seven years as an exotic dancer. This book takes you on an outlandish journey, from Lane's self-esteem issues, which provided the impetus for her entry into the skin biz, to the mysterious VIP Room, where anything and everything can happen. It's a parade through the screwy world of the strip club, where freaks, fetishists, scammers, high rollers, perverts, and even normal guys all congregate to partake in prurient fantasies of the flesh. Lane also provides a plethora of helpful hints for men--and women--who routinely frequent strip clubs, from tipping the bouncers and not getting suckered by roses and champagne to negotiating for services and yes, taking home a dancer.\n\nAbout the Author\n\nAfter seven years in the topless trade, Lacey Lane permanently retired her g-string. Now she divides her time between the serenity of Scottsdale and the insanity of Los Angeles.\n\n\nIn HTML format","torrent":{"xt":"urn:btih:11a04e39c94885be24dc5d84bef1899cb6c6f3af","amp;dn":"Confessions+of+a+Stripper+--+Tales+from+the+VIP+Room","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11a04e39c94885be24dc5d84bef1899cb6c6f3af","infoHashBuffer":{"type":"Buffer","data":[17,160,78,57,201,72,133,190,36,220,93,132,190,241,137,156,182,198,243,175]},"announce":[],"urlList":[]}}