{"title":"WHY OUR HEALTH MATTERS - Dr. Andrew Weil (2009)","uid":8687324,"size":261081449,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:133cc6fbb7aa4caa85285d4ed4bbb6d0a52e829f&amp;dn=WHY+OUR+HEALTH+MATTERS+-+Dr.+Andrew+Weil+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"leopardog","files":90,"time":1373828131,"description":"Why Our Health Matters: A Vision of Medicine That Can Transform Our Future by \nAndrew Weil M.D. \nMP3 FORMAT (6 CDs)\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/B004KAB3U2/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/B004KAB3U2/4353-20&lt;/a&gt;\n\nA landmark book that shows us exactly how we have let health and medicine become a crisis in our society and what we can all do to resolve it.\n\nHealthcare is no longer just a public issue; for millions of Americans it is now a crisis on their own doorstep. Cost of medical care today are a leading cause of personal bankruptcy. Although policy makers have weighed in on all sides, in this book, bestselling author Andrew Weil, M.D., identifies the root of the problem. He shows us exactly how we have become embroiled in the present situation and provides a solution that will not only make healthcare affordable, but will also put each one of us on the road to optimum health.\n\nDr. Weil states that we have a right to good healthcare that is effective, accessible, and affordable. Many Americans would be surprised to know that our national health is far from the best in the world, even though we spend more money on it than any other country. The World Health Organization recently rated America thirty-seventh in health outcomes, on par with Serbia. Tackling head-on the Three Major Myths of American Medicine, Dr. Weil shows how medical schools fail to give future doctors the education they need to care for patients, how insurance companies have destroyed our opportunity to get excellent care, and how pharmaceutical companies have come to rule our lives. The solution involves nothing less than the creation of a completely new culture of health and medicine in this country, one that we can each start building today. ","torrent":{"xt":"urn:btih:133cc6fbb7aa4caa85285d4ed4bbb6d0a52e829f","amp;dn":"WHY+OUR+HEALTH+MATTERS+-+Dr.+Andrew+Weil+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"133cc6fbb7aa4caa85285d4ed4bbb6d0a52e829f","infoHashBuffer":{"type":"Buffer","data":[19,60,198,251,183,170,76,170,133,40,93,78,212,187,182,208,165,46,130,159]},"announce":[],"urlList":[]}}