{"title":"Matthew Sweet-8 album","uid":5002719,"size":686323197,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:13fd8e42bd8234739c8bcbe2937ce531b0ac2b7e&amp;dn=Matthew+Sweet-8+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1247590511,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nVA-The Motown Story-25 Years Of Great Original Hits-cd 1-6\n\nSidney Matthew Sweet (born October 6, 1964, in Lincoln, Nebraska) is an American alternative rock/power pop musician. He was part of the burgeoning Athens, Georgia music scene in the early and mid-1980s before gaining commercial success during the early 1990s. He continues to release albums and tour.\nDecidedly out of the musical mainstream, Sweet would issue a few more albums in the second half of the decade and maintain a devoted core of fans, but critical acclaim and chart success would be hard to come by.\nSweet's international success had been somewhat limited by his fear of flying; however he gained a significant following in Japan and his 2003 album Kimi Ga Suki * Raifu, was initially a Japan-only release.\nIn early 2002, he formed the supergroup The Thorns with Shawn Mullins and Pete Droge. He released a new album of solo material, Living Things in late 2004, though the material on the album was recorded in 2002.\nIn April 2006 he partnered with Bangles rhythm guitarist-vocalist Susanna Hoffs to release a collection of 1960's classics, titled Under The Covers Vol. 1 featuring their take on such widely known '60s hits as &quot;Monday, Monday&quot; and &quot;The Kids Are Alright,&quot; the album represented a return to the accessible and melodic approach associated with Sweet's early breakthroughs.\nSweet's latest album, Sunshine Lies, was released on Shout! Factory on August 26, 2008. Accompanying the CD and download formats of the album is a 2-LP set featuring four previously unreleased songs. \n\n","torrent":{"xt":"urn:btih:13fd8e42bd8234739c8bcbe2937ce531b0ac2b7e","amp;dn":"Matthew+Sweet-8+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13fd8e42bd8234739c8bcbe2937ce531b0ac2b7e","infoHashBuffer":{"type":"Buffer","data":[19,253,142,66,189,130,52,115,156,139,203,226,147,124,229,49,176,172,43,126]},"announce":[],"urlList":[]}}