{"title":"Vangelis - Albedo 0.39 TQMP","uid":4867801,"size":236108269,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:140cbe100d93d2413dd674793b3c256bcdc6771a&amp;dn=Vangelis+-+Albedo+0.39+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"zootallure","files":20,"time":1240615852,"description":"Upon a request, here is Albedo 0.39, an album by the artist Vangelis, released in 1976. It is a concept album around space and space physics. Albedo 0.39 was the second album produced by Vangelis in Nemo Studios, London, which was his creative base until the late 1980s. It contrasts with his previous album, Heaven and Hell, which was classically inspired and choral, while Albedo 0.39 has blues and jazz overtones. Nevertheless, both albums share a classic, 1970's aura of intense electronic majesty.\nThe album title refers to the average albedo value of the planet Earth as it was in 1976. From the explanation on the back of the LP cover : &quot;The reflecting power of a planet or other non-luminous body. A perfect reflector would have an Albedo of 100%. The Earth's Albedo is 39%, or 0.39&quot;.\n\nDue to a variety of solar, atmospheric, electromagnetic, seasonal, and pollution issues, earth's albedo value is in constant flux.\nVangelis plays all instruments. Although it is uncertain which synthesizers Vangelis employs on this album, other instruments include acoustic drums, bass, percussion, a xylophone, a gamelan (track 2) and recordings of the speaking clock (courtesy of Post Office communications) and the Apollo moon landing (&quot;courtesy of NASA&quot;). It appears Vangelis alternates synthesizer and acoustic basses on different tracks.\n\nThe only vocal is the narrative on the title track, which is uncredited. It was later revealed to be the voice of Vangelis' sound engineer, Keith Spencer-Allen.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health","torrent":{"xt":"urn:btih:140cbe100d93d2413dd674793b3c256bcdc6771a","amp;dn":"Vangelis+-+Albedo+0.39+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"140cbe100d93d2413dd674793b3c256bcdc6771a","infoHashBuffer":{"type":"Buffer","data":[20,12,190,16,13,147,210,65,61,214,116,121,59,60,37,107,205,198,119,26]},"announce":[],"urlList":[]}}