{"title":"Nanotechnology and Photovoltaic Devices","uid":15406312,"size":37005904,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14601ee4e4d8353002d0f6938bc1b104235adba1&amp;dn=Nanotechnology+and+Photovoltaic+Devices&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469510178,"description":"Nanotechnology and Photovoltaic Devices - Jan Valenta, Salvo Mirabella (CRC, 2015).pdf\r\n\r\nSilicon is an abundant element and is produced in large quantities for the electronic industry. The falling price of this commodity also feeds the growth of solar photovoltaics (PV). However, solar cells (SCs) based on bulk semiconductors have quite limited maximum attainable performance. Therefore, new principles and materials are being investigated to build the third generation of SCs with improved conversion efficiency achieved by the optimized harvesting of the solar spectrum, improved carrier generation, better light management, etc. The unique properties of semiconductor nanostructures (tuning of optoelectronic properties by the quantum confinement effect, stronger interaction with light, etc.) can be exploited to fabricate novel types of high-efficiency solar cells. Here, again, silicon along with carbon and germanium (group IV elements) is about to play a major role.\r\n\r\nIn view of the increasing research effort devoted to nanostructures’ applications in PV, this book aims to provide a background to students and newcomer researchers as well as to point out some open questions and promising directions for future development. It presents a useful overview of group IV nanostructures for PV, which includes the theoretical background, presentation of main solar cell principles, technological aspects, and nanostructure characterization techniques, and finishes with the design and testing of prototype devices. It is not intended to be just a review of the most up-to-date literature, but the authors aim to provide an educative background of the field. All authors are renowned researchers and experienced teachers in the field of semiconductor nanostructures and photovoltaics","torrent":{"xt":"urn:btih:14601ee4e4d8353002d0f6938bc1b104235adba1","amp;dn":"Nanotechnology+and+Photovoltaic+Devices","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14601ee4e4d8353002d0f6938bc1b104235adba1","infoHashBuffer":{"type":"Buffer","data":[20,96,30,228,228,216,53,48,2,208,246,147,139,193,177,4,35,90,219,161]},"announce":[],"urlList":[]}}