{"title":"The Letters of Gabriela Mistral and Victoria Ocampo - This Ameri","uid":11602139,"size":5490038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14a0fb31bc91dce7bc7691b2e73307c81014cb82&amp;dn=The+Letters+of+Gabriela+Mistral+and+Victoria+Ocampo+-+This+Ameri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1417366680,"description":"Title: This America of Ours: The Letters of Gabriela Mistral and Victoria Ocampo\nAuthors: Gabriela Mistral and Victoria Ocampo\nPaperback: 389 pages\nPublisher: University of Texas Press (November 1, 2003)\nLanguage: English\nISBN-10: 0292705409\nISBN-13: 978-0292705401\n\nDescription:\nGabriela Mistral and Victoria Ocampo were the two most influential and respected women writers of twentieth-century Latin America. Mistral, a plain, self-educated Chilean woman of the mountains who was a poet, journalist, and educator, became Latin America's first Nobel Laureate in 1945. Ocampo, a stunning Argentine woman of wealth, wrote hundreds of essays and founded the first-rate literary journal Sur. Though of very different backgrounds, their deep commitment to what they felt was &quot;their&quot; America forged a unique intellectual and emotional bond between them.\n\nThis collection of the previously unpublished correspondence between Mistral and Ocampo reveals the private side of two very public women. In these letters (as well as in essays that are included in an appendix), we see what Mistral and Ocampo thought about each other and about the intellectual and political atmosphere of their time (including the Spanish Civil War, World War II, and the dictatorships of Latin America) and particularly how they negotiated the complex issues of identity, nationality, and gender within their wide-ranging cultural connections to both the Americas and Europe","torrent":{"xt":"urn:btih:14a0fb31bc91dce7bc7691b2e73307c81014cb82","amp;dn":"The+Letters+of+Gabriela+Mistral+and+Victoria+Ocampo+-+This+Ameri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14a0fb31bc91dce7bc7691b2e73307c81014cb82","infoHashBuffer":{"type":"Buffer","data":[20,160,251,49,188,145,220,231,188,118,145,178,231,51,7,200,16,20,203,130]},"announce":[],"urlList":[]}}