{"title":"AORTA - AORTA (1969) / AORTA 2 (1970) [Psychedelic Rock / Hard R","uid":4749800,"size":140359749,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:14b2e9e7abd02e710dd219576d841cad16a11109&amp;dn=AORTA+-+AORTA+%281969%29+%2F+AORTA+2+%281970%29+%5BPsychedelic+Rock+%2F+Hard+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Iron_Horse","files":32,"time":1236114517,"description":"AORTA - AORTA (1969) / AORTA 2 (1970) [Psychedelic Rock / Hard Rock]\nMp3 256 mbit/s - Mp3 192 mbit/s\nIncluded: CD Covers and this Info\n\nDuring the mid-'60s, the members of Aorta -- originally hailing from Rockford, IL -- had previously been in a group called the Exceptions. Early members of this group included Kal David (later of Illinois Speed Press and H.P. Lovecraft), Marty Grebb (the Buckinghams), and Peter Cetera (Chicago). The Exceptions were a soulful, if unremarkable, Top 40s cover group who were nevertheless acclaimed for their &quot;exceptional&quot; musicianship. They were one of the more popular acts on the greater Chicago local scene, and released a handful of singles on numerous Midwest labels -- Tollie, Cameo, Quill -- and for L.A.-based Capitol. For the last of these releases, the band dropped the &quot;s&quot; from their name and began calling themselves the Exception (a compilation for the Collectables label, The Quill Records Story, collects two of their singles). They also recorded an EP called &quot;A Rock &amp; Roll Mass for the Flair label; it featured six different rock songs with words taken from various religious prayers. As each member of the group -- with the exception of bassist Peter Cetera -- already had an eye toward expanding their original material to include a more &quot;psychedelic&quot; sound, they soon reconfigured themselves as Aorta, and, in late 1968, recorded a single for Atlantic. Eventually, producer Bill Traut (American Breed) approached them on behalf of Dunwich Productions, Inc., and -- with Bobby Jones taking over on bass after Cetera's departure -- they accepted his offer to record their debut album for Columbia in 1969. They recorded two albums under the name Aorta. The first of these, the self-titled Aorta, is today highly acclaimed as a lite-psych album of some minor renown, and though it managed to chart on Billboard's album charts, it failed to do what was expected. A revised version of the group -- still led by Jim Donlinger and now featuring Michael Been on bass/guitar/vocals -- recorded the drastically different second album, Aorta 2, for the Happy Tiger label. Jim Donlinger -- who along with his brother and Jim Nyeholt (during a brief period between the two albums), had all played in the Rotary Connection -- later left Aorta to join Lovecraft (formerly H.P. Lovecraft, who were signed to Reprise at the time), while Billy Herman would eventually move on to join New Colony Six. Michael Been later played with Moby Grape members Jerry Millerand Bob Mosley in Fine Wine, and ultimately achieved his biggest success with the Call. Been is also the father of Robert Turner of Black Rebel Motorcycle Club. The original Aorta later re-formed (joining another great Chicago-area group, the Cryan' Shames) to do promo spots for the U.S. Armed Forces on a very rare promotional LP. They've appeared on numerous compilations over the years. Aorta was re-issued on CD in 1996. ~ Bryan Thomas, All Music Guide\n \nFormed in Chicago, Illinois, USA, in 1967, Aorta initially consisted of Jim Donlinger (guitar, vocals), Jim Nyholt (piano, organ), Dan Hoagland (tenor saxophone), Bobby Jones (bass, vocals) and William Herman (drums). In February 1968, Hoagland left to join the Chicago Transit Authority, later known as Chicago. The remaining quartet was then signed to the local Dunwich production company who leased Aorta's first single, &quot;The Shape Of Things To Come&quot;, to Atlantic Records. The song, which provided the theme to the movie Wild In The Streets, was originally recorded by Max Frost And The Troopers. Aorta revealed a band fusing rock textures with melody, drawing comparisons with fellow Chicagoans H.P. Lovecraft. This stylish blend was equally apparent on the now dated Aorta 2, despite the defections of Herman, who joined the New Colony Six, and Jones. Michael Been (bass, guitar, vocals) and Tom Donlinger (drums) were featured on this second selection, but Aorta broke up soon after its release. Unsurprisingly, given their common musical styles, Jim Donlinger and Been quickly resurfaced in a revamped H.P. Lovecraft, now known simply as Lovecraft. Been formed several subsequent bands and during the 80s led the Call.  &lt;a href=&quot; http://www.nme.com/artists/aorta&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.nme.com/artists/aorta&lt;/a&gt;\n\nAORTA - AORTA (1969) Mp3 256 mbit/s\n01. Main Vein I - 2:17\n02. Heart Attack - 2:30\n03. What's in My Mind's Eye - 2:47\n04. Magic Bed - 2:37\n05. Main Vein II - 1:25\n06. Sleep Tight - 4:36\n07. Catalyptic - 3:32\n08. Main Vein III - 0:42\n09. Sprinkle Road to Cork Street - 3:05\n10. Ode to Missy Mxyzosptik - 3:08\n11. Strange - 4:18\n12. A Thousand Thoughts - 3:48\n13. Thoughts and Feelings/Main Vein IV - 4:07\nRunningtime: 39:53 min\n\nAORTA - AORTA 2 (1970) Mp3 192 mbit/s\n01. Willie Jean - 3:03\n02. Little Bonnie - 4:18\n03. Blythe Spirit - 2:48\n04. Beg For His Forgiveness - 4:55\n05. Egypt (instrumental) - 4:05\n06. His Faith In Man - 5:08\n07. Devil, Maggot &amp; Son - 2:50\n08. Sandcastles - 2:54\n09. Pickin' Blues - 3:12\n10. Fallin' Behind - 3:24\nRunningtime: 36:41 min\n\nLineup:\nMike Been - bass, guitar, backing vocals (replaced Billy Jones) (1970)\nPeter Cetera - vocals, bass (1968)\nJim Donlinger - vocals, lead guitar (1968-70)\nTom Dolinger - drums, percussion (replaced Billy Herman) (1970)\nBilly Herman - drums, backing vocals (1968-69)\nBilly Jones - bass, backing vocals (replaced Peter Cetera) (1968-69)\nJim Nyeholt - keyboards (1968-69) ","torrent":{"xt":"urn:btih:14b2e9e7abd02e710dd219576d841cad16a11109","amp;dn":"AORTA+-+AORTA+%281969%29+%2F+AORTA+2+%281970%29+%5BPsychedelic+Rock+%2F+Hard+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14b2e9e7abd02e710dd219576d841cad16a11109","infoHashBuffer":{"type":"Buffer","data":[20,178,233,231,171,208,46,113,13,210,25,87,109,132,28,173,22,161,17,9]},"announce":[],"urlList":[]}}