{"title":"Spider-Man: Web of Shadows","uid":7234552,"size":6310305391,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:14ca7c4f3fbaefcd38d43efc90833e0d24840969&amp;dn=Spider-Man%3A+Web+of+Shadows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SeregA_Lus","files":11,"time":1335950955,"description":"[b] Description: [/ b]\nIf you've always wanted to fly over the city, with easy jump on buildings and fight evil, you have a chance to bring fantasy to life! Spider-Man once again went on the warpath. Under your leadership, he will enter into an unequal battle with hordes of symbiotes - the monstrous creatures of the cosmos. These creatures are terrorizing the poor inhabitants of New York, many of the buildings in ruins, due to victims in the hundreds. Criminals and thugs, murderers and murderous maniacs again challenged superhero. Whether it will cope on their own or be forced to become a destroyer in the name of the final victory? You'll get an unprecedented level of interactivity and the unbridled action! The battle will unfold in the streets, rooftops and even on the walls of houses. Jumps and dizzying flights are woven into a coherent whole with the spectacular combo attacks. The more often the spider uses its power, the spectacular and deadly they become! Choose your style of passage - the dexterity and mobility of the Spider or the brutal power of his dark side, change clothes at will! Save lives or destroy the whole city in the present war with the symbiotes. Attracted to his side's favorite heroes or villains inveterate, learn new techniques and skills. Can you find the way to the light or be lost forever in the Web of Shadows?\n\n------------------------------------------------------------------------------------\nIt is based on license Activision\nVersion v.1.1 irgy\nRemoved logo, documentation / no recoded.\nInstallation of additional software (DirectX, Visual C + +)\nRelease from R.G. Element Arts | Author repack SeregA_Lus\n------------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:14ca7c4f3fbaefcd38d43efc90833e0d24840969","amp;dn":"Spider-Man%3A+Web+of+Shadows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14ca7c4f3fbaefcd38d43efc90833e0d24840969","infoHashBuffer":{"type":"Buffer","data":[20,202,124,79,63,186,239,205,56,212,62,252,144,131,62,13,36,132,9,105]},"announce":[],"urlList":[]}}