{"title":"POtHS - Conspiracy - 054 - Bio Warfare on Civilians","uid":11880924,"size":8178482885,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:15b2394b32a60ed152e16e95ee7036e870437329&amp;dn=POtHS+-+Conspiracy+-+054+-+Bio+Warfare+on+Civilians&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"POtHS11","files":100,"time":1430686741,"description":"Ancient Bible Codes, DNA and Bio Spiritual Warfare:\n(4-HOURS) Join Dr. Leonard Horowitz as he explores more than 3000 years of religious and political persecution by a secret cabal that has waged ceaseless wars, famines, plagues and propaganda campaigns against Earth's people. Includes the details about ancient musical and mathematical codes linked to creation, destruction, and miracles, including the repair frequency of DNA the genetic blueprint of life. Ancient knowledge and modern science collide in this amazing program presented back in 1999 that links modern conspiracy theories to ancient Bible Codes and their relation to End-Times events.\n\nNOW ON DVD - HEALING CODES FOR THE BIOLOGICAL APOCALYPSE - 4-HOUR 2-DVD SPECIAL EDITION, Cat# K476.  UFOTVÂ®, accept no imitations.  \nGo to http://www.UFOTV.com.\n----------------------------------------------------------------------\n\nBio-Weapons (Flu Radiation etc) Protection With Liposomal Vitamin C:\nWhat proactive steps are you taking to protect you and your family from Engineered Bio-Weapons being used against the population? Taking a Flu Vaccine and hoping for the best?\n\nThis video is simply 2 videos made by others a while back spliced together. In fact, I had uploaded this video to PowerVideoTube about a year ago, but that site crashed and went away, along with everyone's videos.\n\nThe first part is the amazing story of a man in New Zealand who had contracted H1N1, who was put on a ventilator, and then left to die, basically, by the Doctors and hospital. . . that is until his family found a way to force the hospital to intravenously give the man mega-dose Vitamin C. Then later, the hospital decided that, even though the man's condition had shown drastic improvement, the Vitamin C could not have been the reason, so they discontinued the treatment. Only through Liposomal Vitamin C was the man's family able to save him from not only the H1N1, but the hospital as well.\n\nThe 2nd video illustrates a VERY SIMPLE &amp; INEXPENSIVE WAY TO MAKE YOUR OWN LIPOSOMAL VITAMIN C. Here is a link to that video-maker's website with written instructions. on how to do it.\n\nIt seems that it might be a smart thing to get a jewelry cleaner, some Vitamin C, some soy lecithin (or alternative) and print out the directions on how to make it. (We may not always have the internet) We never know just how quickly things can change in this world, and where this kind of stuff can make a HUGE difference for ourselves or loved ones.\n\nLinks Source Videos: Living Proof Vitamin C Miracle Cure 60 Minutes Video 3 News*LIPOSOMAL ENCAPSULATED VITAMIN C\n----------------------------------------------------------------------\n\nGenetically Modified Food, Panacea or Poison?\nHuman safety programs have never been performed on these GMO products, no human studies - ever!  But if it all goes to hell, you can always grow your own food, right?  Not if Monsanto and friends in Big Pharma have their way.\n\nThey have already put a ticking time bomb of a law on the US books which essentially makes backyard gardening a FEDERALLY regulated activity.  Very recently, they succeeded is getting nutritional food supplements BANNED in the European Union.  What's next?\n\nHow about poisoning the agricultural system with genetically modified e coli?  Watch this video - you may be surprised.\n----------------------------------------------------------------------\n\nGMO Food Allergies &amp; Gluten Sensitivity:\nJeffrey Smith discusses many problems with GMO foods ranging from food allergies to reproductive complications and cancers.  This is serious business, not just for the GMO producers, but for public awareness.  Learn what the doctors treating patients are saying and the lessons learned from animal husbandry and empirical studies on animals and humans.  It's time to beter Educate yourselves.\n----------------------------------------------------------------------\n\nThe TOOLS of Global Population Reduction EXPOSED!\nForward this video to everyone because the social engineers are using this on US NOW. The proof is in the pudding or should I say from their own dark evil mouths and books. WAKE UP the elite are calling for a 80 to 90% population reduction. Everything Dr. Russel Blaylock discusses in this presentation is 100% documented. The drinking water is poisoned/a mass medication, with sodium fluoride. Aspartame a neuro-toxin is added to various food products. It goes on and on. It is done on purpose to chemically lobotomize, dumb down, and exterminate US (who elite call useless eaters) via cancers and other disease. Stay SAFE JESUS CHRIST IS THE WAY,THE TRUTH, AND THE LIFE.\n----------------------------------------------------------------------\n\nMartial Law in USA, what do you know about NDAA:\nApril 2014 Martial Law in USA what do you know about NDAA Last days final hour news prophecy,update September 2013 \n\nWASHINGTON -- A federal appeals judge gave the Obama administration the OK to keep enforcing its indefinite detention policy \nFebruary 2013 NDAA Indefinite Detention Provision Challenged In Federal Appeals Court 2013 \nObama signed into law unconstitutional NDAA Obama signs NDAA 2013 without objecting to indefinite detention of Americans National Defense Authorization Act for Fiscal Year 2013 \nNATIONAL DEFENSE AUTHORIZATION ACT FOR FISCAL YEAR 2013  &lt;a href=&quot;\nhttp://www.gpo.gov/fdsys/pkg/CRPT-112hrpt705/pdf/CRPT-112hrpt705.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gpo.gov/fdsys/pkg/CRPT-112hrpt705/pdf/CRPT-112hrpt705.pdf&lt;/a&gt;\nThe National Defense Authorization Act Is Unconstitutional &lt;a href=&quot;\nhttp://www.independent.com/news/2012/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.independent.com/news/2012/&lt;/a&gt; \nOctober 2013 Breaking News Signs of Total Global Financial Collapse Last Days News \nOctober 2013 USA GOVT shutdown USA owes 3.5 trillian $ 2 China call 4 A De Americanized World \nOctober 2013 NWO executive orders president Obama has strips every USA citizen of any rights \n October 2013 USA Second Revolution collapse American Dollar civil unrest Martial Law Police state  \nOctober 2013 Final Hour Biblical Prophecy Current Events New World Order one world Government \nOctober 2013 Breaking News Preparations for more Martial\n----------------------------------------------------------------------\n\nJapan's Secret World War II Death Lab:\nJapan's Dirty Secret: The truth about Japan's secret facility at Harbin, used to manufacture germs that infected and killed thousands of Chinese during World War II.\n\nMemories of Japanese war crimes continue to poison Japan's relations with its neighbours. Many Chinese are still suffering the effects of a vicious campaign of germ warfare.\n\n&quot;Our unit did things no human being should ever do,&quot; confesses Unit 731 member Yoshio Shinozuka. His unit developed the deadly pathogens which were used to infect 250,000 Chinese. Japan's refusal to apologise for its actions, or to acknowledge Unit 731's existence, has further upset its victims","torrent":{"xt":"urn:btih:15b2394b32a60ed152e16e95ee7036e870437329","amp;dn":"POtHS+-+Conspiracy+-+054+-+Bio+Warfare+on+Civilians","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15b2394b32a60ed152e16e95ee7036e870437329","infoHashBuffer":{"type":"Buffer","data":[21,178,57,75,50,166,14,209,82,225,110,149,238,112,54,232,112,67,115,41]},"announce":[],"urlList":[]}}