{"title":"Minimization of Climatic Vulnerabilities on Mini-hydro Power Pla","uid":15408889,"size":3872440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16a5f332cd3adb4ce7ceaea222390128ea128097&amp;dn=Minimization+of+Climatic+Vulnerabilities+on+Mini-hydro+Power+Pla&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469538301,"description":"Minimization of Climatic Vulnerabilities on Mini-hydro Power Plants - Mrinmoy Majumder (Springer, 2016).pdf\r\n\r\nThis Brief presents the multi criteria decision making (MCDM) techniques like Fuzzy Analytical Hierarchy Process (AHP) and Fuzzy Analytical Network Process (ANP) to find out the importance of the influencing factors to develop the Climatic Vulnerability Index (CVI) that will represent the vulnerability of the Hydro-Power Plant (HPP) to climatic abnormalities. The cognitive ability of neuro-genetic modeling is applied to minimize CVI so that the conditions required to reduce the effect of climate change on HPP can be identified. The results from the study are found to be encouraging. The scarcity and pollution potential of conventional sources of energy has enforced scientists worldwide to look for efficient, flexible, cost effective but reliable alternative energy resources. Among many available options the energy extracted from water was found to be the least expensive, most flexible and moderately reliable renewable energy source which has the potential to replace the dependency on conventional fuels","torrent":{"xt":"urn:btih:16a5f332cd3adb4ce7ceaea222390128ea128097","amp;dn":"Minimization+of+Climatic+Vulnerabilities+on+Mini-hydro+Power+Pla","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16a5f332cd3adb4ce7ceaea222390128ea128097","infoHashBuffer":{"type":"Buffer","data":[22,165,243,50,205,58,219,76,231,206,174,162,34,57,1,40,234,18,128,151]},"announce":[],"urlList":[]}}