{"title":"People Take Warning - Murder Ballads, Disaster Songs 1913-1938","uid":6849014,"size":223476030,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:16bfcd650a2ccef97db6dff119ca04e4d257ae7c&amp;dn=People+Take+Warning+-+Murder+Ballads%2C+Disaster+Songs+1913-1938&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"crashlan","files":73,"time":1322453646,"description":"People Take Warning!\nMurder Ballads and Disaster Songs 1913-1938 (2007)\n\nmp3 variable bitrate\n\nDISC 1:\n\n1. Titanic Blues - Hi Henry Brown/Charlie Jordan/Henry Brown (Man V Machine)\n2. Wreck of the Old '97 - The Skillet Lickers (Man V Machine)\n3. Bill Wilson - Birmingham Jug Band (Man V Machine)\n4. Crash of the Akron, The - Bobby Miller (Man V Machine)\n5. Fate of Talmadge Osborne, The - Ernest V. Stoneman (Man V Machine)\n6. Mole Rachmim, El (FÃƒÂ¼r Titanik) - Josef Rosenblatt (Man V Machine)\n7. Wreck of the Virginian, The - Alfred Reed (Man V Machine)\n8. Fate of Will Rogers &amp; Wiley Post - Bill Cox (Man V Machine)\n9. Down with the Old Canoe - The Dixon Brothers (Man V Machine)\n10. Wreck of Number 52 - Cliff Carlisle (Man V Machine)\n11. Kassie Jones, Pt. 1 - Furry Lewis (Man V Machine/Pt.1)\n12. Kassie Jones, Pt. 2 - Furry Lewis (Man V Machine/Pt.2)\n13. Brave Engineer, The - The Carver Boys (Man V Machine)\n14. Sinking of the Titanic, The - Richard Rabbit Brown (Man V Machine)\n15. Fate of Chris Lively and Wife - Blind Alfred Reed (Man V Machine)\n16. Wreck on the Mountain Road - Red Fox Chasers (Man V Machine)\n17. Unfortunate Brakeman, The - Kentucky Ramblers (Man V Machine)\n18. Altoona Freight Wreck - Riley Puckett (Man V Machine)\n19. Fatal Wreck of the Bus, The - Mainer's Mountaineers (Man V Machine)\n20. Last Scene of the Titanic - Frank Hutchison (Man V Machine)\n21. Casey Jones - The Skillet Lickers (Man V Machine)\n22. Wreck of the Westbound Airliner, The - Fred Pendleton (Man V Machine)\n23. Titanic, The - Ernest V. Stoneman (Man V Machine)\n24. When That Great Ship Went Down - William &amp; Versey Smith (Man V Machine)\n\nDISC 2:\n\n1. Story of the Mighty Mississippi, The - Ernest V. Stoneman (Man V Nature)\n2. Mississippi Heavy Water Blues - Robert Hicks (Man V Nature)\n3. Dixie Boll Weevil - Fiddlin' John Carson (Man V Nature)\n4. Mississippi Boweavil - Charley Patton (Man V Nature)\n5. Ohio Prison Fire - Bobby Miller (Man V Nature)\n6. Memphis Flu - Elder Curry (Man V Nature)\n7. Explosion in the Fairmount Mine - Blind Alfred Reed (Man V Nature)\n8. Storm That Struck Miami - Fiddlin' John Carson (Man V Nature)\n9. When the Levee Breaks - Kansas Joe/Memphis Minnie (Man V Nature)\n10. Alabama Flood - Andrew Jenkins (Man V Nature)\n11. Burning of the Cleveland School - J.H. Howell's Carolina Hillbillies (Man V Nature)\n12. High Water Everywhere, Pt. 1 - Charley Patton (Man V Nature/Pt.1)\n13. High Water Everywhere, Pt. 2 - Charley Patton (Man V Nature/Pt.2)\n14. Ryecove Cyclone - Martin &amp; Roberts (Man V Nature)\n15. McBeth Mine Explosion - Andy &amp; Flip Cap (Man V Nature)\n16. Dry Well Blues - Charley Patton (Man V Nature)\n17. Baltimore Fire - Charlie Poole (Man V Nature)\n18. Tennessee Tornado - Uncle Dave Macon (Man V Nature)\n19. Dry Spell Blues, Pt. 2 - Son House (Man V Nature/Pt.2)\n20. Santa Barbara Earthquake, The - Green Bailey (Man V Nature)\n21. Death of Floyd Collins, The - Vernon Dalhert (Man V Nature)\n22. Porto Rico Storm, The - Carson Trio Robison (Man V Nature)\n23. Boll Weavil - Alvin Condor/W.A. Lindsey (Man V Nature)\n24. Flood of 1927, The - The Elders McIntorsh &amp; Edwards' Sanctified Singers (Man V Nature)\n\nDISC 3:\n\n1. Peddler and His Wife - Hayes Shepherd (Man V Man (And Woman, Too))\n2. Little Grave in Georgia, The - Earl Johnson (Man V Man (And Woman, Too))\n3. Kenny Wagner's Surrender - Ernest V. Stoneman (Man V Man (And Woman, Too))\n4. Henry Clay Beattie - Kelly Harrell (Man V Man (And Woman, Too))\n5. Murder of the Lawson Family, The - The Carolina Buddies (Man V Man (And Woman, Too))\n6. Naomi Wise - Clarence Ashley (Man V Man (And Woman, Too))\n7. Railroad Bill - Will Bennett (Man V Man (And Woman, Too))\n8. Frankie - Dykes Magic City Trio (Man V Man (And Woman, Too))\n9. Trial of Richard Bruno Hauptmann, Pt. 1 - Bill Cox (Man V Man (And Woman, Too)/Pt.1)\n10. Trial of Richard Bruno Hauptmann, Pt. 2 - Bill Cox (Man V Man (And Woman, Too)/Pt.2)\n11. Lanse des Belaires - Dennis McGee/Ernest Fruge (Man V Man (And Woman, Too))\n12. Darling Cora - B.F. Shelton (Man V Man (And Woman, Too))\n13. Billy Lyons and Stack O' Lee - Furry Lewis (Man V Man (And Woman, Too))\n14. Tom Dooley - Grayson &amp; Whitter (Man V Man (And Woman, Too))\n15. Story of Freda Bolt, The - Floyd County Ramblers (Man V Man (And Woman, Too))\n16. Pretty Polly - John Hammond, Jr. (Man V Man (And Woman, Too))\n17. Fingerprints Upon the Windowpane - Bobby Miller (Man V Man (And Woman, Too))\n18. Bluefield Murder, The - Roy Harvey (Man V Man (And Woman, Too))\n19. Frankie Silvers - Ashley &amp; Foster (Man V Man (And Woman, Too))\n20. Fate of Rhoda Sweeten - Wilmer Watts (Man V Man (And Woman, Too))\n21. Dupree Blues - Willie Walker (Man V Man (And Woman, Too))\n22. Poor Ellen Smith - Dykes Magic City Trio (Man V Man (And Woman, Too))","torrent":{"xt":"urn:btih:16bfcd650a2ccef97db6dff119ca04e4d257ae7c","amp;dn":"People+Take+Warning+-+Murder+Ballads%2C+Disaster+Songs+1913-1938","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16bfcd650a2ccef97db6dff119ca04e4d257ae7c","infoHashBuffer":{"type":"Buffer","data":[22,191,205,101,10,44,206,249,125,182,223,241,25,202,4,228,210,87,174,124]},"announce":[],"urlList":[]}}