{"title":"Don Wilkerson - The Complete Blue Note Sessions CD2 (1962-63) [J","uid":6244846,"size":364109317,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:16c2c7c929d5d7da9c315f703abeb2f136e555fe&amp;dn=Don+Wilkerson+-+The+Complete+Blue+Note+Sessions+CD2+%281962-63%29+%5BJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":23,"time":1300201725,"description":"Don Wilkerson - The Complete Blue Note Sessions CD2\nYear: 1962-63\nReleased: 2001 - 24-bit remaster\nLabel:  Blue Note / Capitol\nQuality: flac + cue\n\nTHE COMPLETE BLUE NOTE SESSIONS contains the previously released albums PREACH BROTHER, ELDER DON , and SHOUTIN'.  Includes liner notes by Dudley Williams, Joe Goldberg and Robert Levin.  This is part of the Blue Note Limited Edition Connoisseur series.  Don Wilkerson may not attract much attention - either now or when he was recording in the early '60s - but he was an interesting character.  Like many tenor saxophonists of his era, the Texan followed in the hard-swinging soul-jazz that grew out of hard bop, but he didn't settle into an easy groove - he drove his music hard, injecting it with a healthy dose of the blues and an undercurrent of nascent black power.  An intriguing mix, to be sure, and on three albums for Blue Note between 1962 and 1963 - Elder Don, Preach, Brother!, Shoutin' - he was at his peak, and they're all included here on this double-disc The Complete Blue Note Sessions.\n\nOf course, he was at hispeak here partially because this was the only extended period of time he recorded as a leader; prior to this, he had a session for Riverside, but he never recorded before that or after this.  Even if he had recorded more, this music would still be quite distinctive since his combos - always featuring guitarist Grant Green, but also pianist Sonny Clark, drummer Billy Higgins, pianist Johnny Acea, and drummers Willie Bobo and Ben Dixon, depending on the date = were simultaneously gritty and supple.  Though they weren't as laid-back as, say, Green and Clark's duo sessions, they transferred that spirit to these sessions, meaning that this edgy soul-jazz and considerable musicality that resonates upon repeated plays.  It might not be major work, but it's fine music, especially for connoisseurs of hard bop and soul-jazz, and it's nice to see that Wilkerson is finally getting some attention with this set, which marks the first time his Blue Note work has been in print in the U.S., not just sisince his death in 1986, but since their original release.\n\nPersonnel:\nDon Wilkerson (tenor saxophone);\nGrant Green (guitar);\nJohn &quot;Johnny&quot; Adriano Acea, Sonny Clark (piano);\nBig John Patton (organ);\nWillie Bobo, Ben Dixon, Billy Higgins (drums);\nJual Curtis (tambourine)\n\nDon Wilkerson - The Complete Blue Note Sessions CD1 Tracks:\n01  Jeanie-Weanie\n02  Homesick Blues\n03  Dem Tambourines\n04  Camp Meetin'\n05  The Eldorado Shuffle\n06  Pigeon Peas\n07  Senorita Eula\n08  San Antonio Rose\n09  Scrappy\n\nDon Wilkerson - The Complete Blue Note Sessions CD2 Tracks:\n01  Lone Star Shuffle\n02  Drawin' A Tip\n03  Poor Butterfly\n04  Movin' Out\n05  Cookin' With Clarence\n06  Easy Living\n07  Happy Johnny\n08  Blues For J\n09  Sweet Cake","torrent":{"xt":"urn:btih:16c2c7c929d5d7da9c315f703abeb2f136e555fe","amp;dn":"Don+Wilkerson+-+The+Complete+Blue+Note+Sessions+CD2+%281962-63%29+%5BJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16c2c7c929d5d7da9c315f703abeb2f136e555fe","infoHashBuffer":{"type":"Buffer","data":[22,194,199,201,41,213,215,218,156,49,95,112,58,190,178,241,54,229,85,254]},"announce":[],"urlList":[]}}