{"title":"Gwen Stefani - What You Waiting For (Uncensored) (Xvid-2nafish)","uid":5333990,"size":155784056,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:18f8819193ab74ca42c6ca388d148d8eabadb4c3&amp;dn=Gwen+Stefani+-+What+You+Waiting+For+%28Uncensored%29+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1265263856,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:07:00\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 23.98\nBitRate : 1555 Kbps\nQuality Factor : 0.17 b/px\n\n[Audio]\nCodec : Microsoft PCM Format\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 1411 Kbps\n\n\nGwen Stefani - What You Waiting For (7 minute uncensored version)(Xvid-2nafish)\n\n\nThis video has no logos or titles.\n\n\n&quot;What You Waiting For?&quot; is a song written by Gwen Stefani and Linda Perry for Stefani's debut solo album, Love. Angel. Music. Baby. (2004). The song is the album's opening track, and was released as its lead single. &quot;What You Waiting For?&quot; details Stefani's lack of inspiration, fear of producing the album, as well as her reaction to pressures exerted by her record label. The song is primarily a New Wave song but also has influences from electropop, and introduces Stefani's four back-up dancers, the Harajuku Girls, who had a major input into the album's production.\n\n&quot;What You Waiting For?&quot; was released as the album's lead single; according to Stefani, as an &quot;explanation for doing the record&quot;. The single sold well, reached the top twenty in many countries, and topped the charts in both Argentina and Australia. It was certified gold in the United States, and was nominated for Best Female Pop Vocal Performance at the 47th Grammy Awards. It was well received by critics, and was frequently cited as a highlight of the album. The song has been remixed a number of times, and was covered by the indie rock band Franz Ferdinand.\n\nThe song's music video was directed by Francis Lawrence and produced by Caleb Dewart of DNA Inc. The video deals directly with the lyrics' theme of Stefani's search for inspiration in songwriting. It opens with a lengthy non-musical section in which Stefani arrives in Los Angeles off of No Doubt's Rock Steady tour. She receives several calls from manager Jimmy Iovine, who attempts to push her forward with her solo debut project, but she replies that she is tired and uninspired. After a failed studio attempt, Stefani sees a flyer advertising help for writer's block. Upon arrival she fills out an unusual questionnaire and is then told that she'll be billed when she is finished. She asks for clarification only to discover that she is already back in the studio by herself. When Stefani picks up an oversized pocket watch from the piano, a rabbit knick-knack jumps across the room. She throws the watch at the knick-knack, causing her to fall back on her chair and find herself transported to a fantasy world based on Alice's Adventures in Wonderland and Through the Looking-Glass.\n\nStefani portrays several characters from the books, including Alice, the White Queen and the Red Queen, in dresses by British-Gibraltarian fashion designer John Galliano. The video frequently cuts to Stefani back in the studio to show her singing and performing in semi-synchronization with her actions within her fantasy-world. As this transpires the song is recording itself. Stefani ultimately rediscovers her confidence, and her full awareness is transported back to the ordinary reality of the studio just as she dances in front of her four giggling Harajuku Girls. She then is presented with her bill by the consultant as a wooden chair topples to the floor.\n\nThere are four versions of the video. The full long version is one minute longer than the &quot;Making the Video&quot; version, while the cut version omits the scenes in which she leaves the airport and is sleepy and in which she fills out the questionnaire. The short version begins with Gwen practicing on the piano and her finding the watch just seconds after that. Her being billed is not shown in this version, so the video ends with the Japanese girls laughing at her performance.\n\nThe music video was well-received by many reviewers. Stylus Magazine referred to it as a short film, comparing it to Michael Jackson's &quot;Thriller&quot;, and commented &quot;I sigh with admiration and wish every video was this alive.&quot; The video debuted on MTV's Total Request Live on October 18, 2004 at number eleven. It reached the top of the chart and was there for three non-consecutive days, remaining over five weeks on the program. At the 2005 MTV Video Music Awards, the video was nominated for Best Editing and won the award for Best Art Direction. In Canada, it only reached number eleven on the MuchMusic's Countdown, though it remained on the chart for eight weeks. At the 2005 MuchMusic Video Awards, the video was nominated for Best International Video but lost to Usher's &quot;Caught Up&quot;. It won the award for Best Dressed Video at the first MTV Australia Video Music Awards.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:18f8819193ab74ca42c6ca388d148d8eabadb4c3","amp;dn":"Gwen+Stefani+-+What+You+Waiting+For+%28Uncensored%29+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18f8819193ab74ca42c6ca388d148d8eabadb4c3","infoHashBuffer":{"type":"Buffer","data":[24,248,129,145,147,171,116,202,66,198,202,56,141,20,141,142,171,173,180,195]},"announce":[],"urlList":[]}}