{"title":"Ben Goldacre - Bad Pharma (2012) mp3 Audio Book","uid":15045621,"size":478398137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1907f223dad3058ead6f4f76e6394fa089395375&amp;dn=Ben+Goldacre+-+Bad+Pharma+%282012%29+mp3+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":236,"time":1466634977,"description":"Bad Pharma: How Drug Companies Mislead Doctors and Harm Patients\r\n\r\nA rip from CD, file names are useful, and well tagged. In addition to many mp3 files there are a couple of pdfs to show graphs and other images from the book.\r\n\r\nFrom the Wikipedia article:\r\n\r\nBad Pharma: How Drug Companies Mislead Doctors and Harm Patients is a book by British physician and academic Ben Goldacre about the pharmaceutical industry, its relationship with the medical profession, and the extent to which it controls academic research into its own products. It was published in the UK in September 2012 by the Fourth Estate imprint of HarperCollins, and in the United States in February 2013 by Faber and Faber.\r\n\r\nGoldacre argues in the book that &quot;the whole edifice of medicine is broken,&quot; because the evidence on which it is based is systematically distorted by the pharmaceutical industry. He writes that the industry finances most of the clinical trials into its own products and much of doctors' continuing education, that clinical trials are often conducted on small groups of unrepresentative subjects and negative data is routinely withheld, and that apparently independent academic papers may be planned and even ghostwritten by pharmaceutical companies or their contractors, without disclosure. Describing the situation as a &quot;murderous disaster,&quot; he makes suggestions for action by patients' groups, physicians, academics and the industry itself.\r\n \nhttps://en.wikipedia.org/wiki/Bad_Pharma","torrent":{"xt":"urn:btih:1907f223dad3058ead6f4f76e6394fa089395375","amp;dn":"Ben+Goldacre+-+Bad+Pharma+%282012%29+mp3+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1907f223dad3058ead6f4f76e6394fa089395375","infoHashBuffer":{"type":"Buffer","data":[25,7,242,35,218,211,5,142,173,111,79,118,230,57,79,160,137,57,83,117]},"announce":[],"urlList":[]}}