{"title":"AUSTRALIA - Aboriginal - Songs from the Northern Territory cd1","uid":4389623,"size":56536995,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:198a32cb20bfbea53045dba72a2de9fda008b3b9&amp;dn=AUSTRALIA+-+Aboriginal+-+Songs+from+the+Northern+Territory+cd1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starinar","files":14,"time":1221095910,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\n\nSongs From the Northern Territory 1: Music From Western Arnhem Land \nArtist/Collector: \nAlice Moyle \nLabel Information: \nAustralian Institute of Aboriginal and Torres Strait Islander Studies (AIATSIS): AIAS 1 CD \nMedia Type: \nCD \nYear: \nRecorded 1963; Released 1997 \nAvailability: \nAIATSIS \n\nNotes: As defined here, Western Arnhem Land of the Northern Territory \nextends beyond the northern and western boundaries of the area formerly \nknown as the 'Arnhem Land Reserve'. To the north it includes the Coburg \nPeninsula, Croker and Goulburn Islands and the Liverpool River region; \nto the south, it extends from the west coast to Katherine and further east. \nMost of the recordings transferred to disc 1 were made at Oenpelli, \nnorth of Kakadu National Park. The remainder are from Bagot, near Darwin. \nWhite settlements were established at isolated places in Western Arnhem \nLand in the early years of the nineteenth century, increasing rapidly \nafter 1872, the year Darwin became linked by telegraph with Australian \ncapital cities and Britain. \nDespite the resulting dispersal and fragmentation of tribes and language \ngroups in this region and ultimate disruptions to ceremonial life, a few \nsong types have persisted, some of which are to be heard on this disc. \nAssociated with spectacular kinds of dancing which were often admired and \nreported in the writings of early observers, they are accompanied by the \ndidjeridu, a name which seems to have been used first by non-Aboriginal \npeople in the Darwin area. They are still sung by a diminishing number of \ncreative musicians whose presence is sought, over a large area, whenever \na corroboree is held. \nThe didjeridu of western Arnhem Land is used as a patterned, bassdrone \nwhich-at the time these recordings were made-varied according to song \ntype and to the singer's place of residence. There are many Aboriginal \nnames for this instrument, some of them now losing currency like the \nlanguages to which they belong. In the Oenpelli region the Aboriginal name \nfor didjeridu is magu; among groups in Darwin and surrounding districts, \nit is kanbi and kanbak. \nSingers heard here represent the following language groups: Gunwinggu, \nGunbalang and Djawan (tracks 1-6); also Yiwadja, and some of the smaller \ngroups traditionally located south of the Daly River which were referred \nto collectively in the 1960s, as Wagatj (tracks 7-13). \nIn Gunwinggu, a dance song is borg or gunborg, in the Daly River languages, \nit is wongga, also spelt wangga. \nWestern Arnhem Land singers either inherit their songs from their fathers \nand older male relatives, or they 'find' them for themselves in dreams. \nDreamed songs are believed to be communicated in this way by the spirit \nof a deceased singer. Whatever their believed origin, these songs are \nusually similar, stylistically, to others in the vicinity. \nCharacteristic of Western Arnhem Land dance songs is a comparatively wide \nvocal range of pitch (approximating sevenths, octaves, even twelfths) within \nwhich there are 'tiled' or overlapping descending passages many of them \nresembling scales or modes. \nA Western Arnhem Land singer prefers to select the pitch of his didjeridu \naccompaniment to match his song. A player, therefore, may have more than \none instrument lying near at hand. Dance songs in this region almost invariably \nbegin with the droning sound of the didjeridu to which the singer then adapts \nthe range of his song's melody. \nThe usual order of entry of the sound components into a Western Arnhem Land \ndance item is therefore: didjeridu first, then the singer's stick beats and \nfinally the singer's voice. At the end of the same song item, final stick beats \nsynchronise with calls and shouts from the dancers. \nAlso characteristic of this musical region is the behaviour of the onlookers \nwho clap their hands in time with the singer's stick beats and shout with approval \n(oi!) when the item finishes. \nIn Western Arnhem Land, the melodic lines or contours are divided into sections. \nWithin each section there may be contour variations, but each one follows a \ndescending path towards the pitch of the drone. During the breaks between the \nsections in the vocal part, the didjeridu and stick beating continue their binding \nweb of sounds. \nThe singers themselves do not always know the meaning of the words they sing and many of their song utterances appear to be little more than syllabic patterns with intervening glides. That there are exceptions, however, is demonstrated by the sample on this disc of Gunbalang singing (track 6a), song words of which are to found transcribed and translated below. \n\ntags: yirdaki yidaki didjeridu mago clapsticks corroboree\n\nManikay.com","torrent":{"xt":"urn:btih:198a32cb20bfbea53045dba72a2de9fda008b3b9","amp;dn":"AUSTRALIA+-+Aboriginal+-+Songs+from+the+Northern+Territory+cd1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"198a32cb20bfbea53045dba72a2de9fda008b3b9","infoHashBuffer":{"type":"Buffer","data":[25,138,50,203,32,191,190,165,48,69,219,167,42,45,233,253,160,8,179,185]},"announce":[],"urlList":[]}}