{"title":"Wendi Friesen - Bodybuilder Extreme Mastery ","uid":8741877,"size":45959013,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:19e7912d7b290ebaea43d7c0a35be5c564dbaceb&amp;dn=Wendi+Friesen+-+Bodybuilder+Extreme+Mastery+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"acer47x","files":4,"time":1374811581,"description":"What's in the sessions?\n\nBodybuilder - Intro to hypnosis for body building\n     Learn how to get the most out of this program.\n\nBodybuilder - Future Vision\n     Create the vision of yourself in the future, program the muscle growth and strength gains in your mind and body. Envisioning your accomplishments, competitions, body changes and strength helps create the mindset and belief that will make you stronger and more powerful.\n\nBodybuilder - Mental Workout\n    This imagery is done while in hypnosis. You can do it before you fall asleep or when you first wake up. You will be imagining in vivid detail all the elements of your workout, exceeding your previous weights and gaining more strength with each workout.\n\nEndurance - Ultimate Athlete\n     Your endurance in any sport is all about mindset and inner strength. This endurance session will give you more power in your cardio workout and in your competitions. You will find you are less fatigued and have much greater endurance and speed in any sport or workout.\n\nBodybuilder - Power State\n     In this session you will be conditioning your mind and body to go into trance quickly to achieve a powerful state of focus. This session is to be used BEFORE you use the Fast Focus session. After your conditioning you will be ready for the Fast Focus session.\n\nBodybuilder - Fast Focus\n     This is a 2 minute session to get you into your power state right before your workout or competition. After you create the deep instant trance session in the Power State session, you will be able to get into your focused state very quickly. \n\nBody Mastery - Intro to Targeted Healing\n     This introduction will give you the foundation for creating fast healing. You can use this for healing from an injury, or to speed up the repair and growth of specific muscle groups.\n     \nBody Mastery - Targeted Healing\n     This session takes you on a journey inside of your body where you will communicate in a very specific way with your cells. The cellular programming  will help muscle tissue to grow and heal. If you are using this for injuries or pain relief, you will notice a significant improvement in a very short time.\n\n\nSweet Dreams - Love to Workout\n     This is to be used before you fall asleep at night. The session will put you to sleep while embedding the suggestions that you love your workouts.\n\n\nSweet Dreams - Muscle Building\n     This session is a great one to fall asleep to. As you drift off your mind will be hearing the suggestions for enhanced muscle growth and strength. You will sleep deeply and soundly and get the most from your workouts.","torrent":{"xt":"urn:btih:19e7912d7b290ebaea43d7c0a35be5c564dbaceb","amp;dn":"Wendi+Friesen+-+Bodybuilder+Extreme+Mastery+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19e7912d7b290ebaea43d7c0a35be5c564dbaceb","infoHashBuffer":{"type":"Buffer","data":[25,231,145,45,123,41,14,186,234,67,215,192,163,91,229,197,100,219,172,235]},"announce":[],"urlList":[]}}