{"title":"Photoshop Retouching Cookbook for Digital Photographers - (Males","uid":4938740,"size":43101367,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c08783b7fb2ffafc99a30bb473d436c70d08369&amp;dn=Photoshop+Retouching+Cookbook+for+Digital+Photographers+-+%28Males&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1244371382,"description":"\n\nBarry Huggins &quot;Photoshop Retouching Cookbook for Digital Photographers: 113 Easy-to-follow Recipes to Adjust and Correct Your Photos&quot;\nIlex | English | 2005-09 | ISBN: 1904705596 | 176 pages | PDF \n\nThis is an excellent cookbook that follows the traditional format. Recipes are logically grouped into easy-to-understand categories, e.g. Strengthening Color, Saturating Color and Working with Color Casts (getting rid of those tints) are covered under the Color Correction category.\n\nThe categories cover a wide gamut including; Retouching Portraits, Retouching Landscapes, Exposure Correction, Color Effects and Photo Restoration.\n\nThe recipes for more common photo re-touching problems describe a spectrum of ways to fix the problem using different Photoshop tools, generally ranging from light re-touching to methods for fixing larger problems.\n\nOne of the main reasons I really liked this book is the selection of recipes covers just about everything I've ever wanted to fix in my own digital photos. I'm not a professional photographer but I have been using digital cameras for several years. I've bought a number of books on using Photoshop to retouch images. None of them are as complete as this one. All of the ways (that I remember) in which I've either screwed up a picture or wanted to touch one up are covered in the book.\n\nThese include; Removing red eye &amp; changing eye color, Enhancing lips, Removing skin blemishes and wrinkles, Removing unwanted objects, Removing dust and scratches (from old photos), to a large number of exposure and color related problems.\n\nThis book does not cover how to use Photoshop, but if you're slightly familiar with Photoshop you should be fine. I would recommend this book to anyone has taken a digital picture that would be perfect &quot;if only I could fix that one ...&quot;","torrent":{"xt":"urn:btih:1c08783b7fb2ffafc99a30bb473d436c70d08369","amp;dn":"Photoshop+Retouching+Cookbook+for+Digital+Photographers+-+%28Males","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c08783b7fb2ffafc99a30bb473d436c70d08369","infoHashBuffer":{"type":"Buffer","data":[28,8,120,59,127,178,255,175,201,154,48,187,71,61,67,108,112,208,131,105]},"announce":[],"urlList":[]}}