{"title":"Moby Dick - Herman Melville  (BBC Drama)","uid":6082783,"size":109123654,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1c8b6761b0a4471850d5799250cb2a1e61acfba8&amp;dn=Moby+Dick+-+Herman+Melville++%28BBC+Drama%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Lucy1948","files":5,"time":1294187594,"description":"  2 Episodes of app 58 mins each, cut in halves.\n \nCast:\n \n  Ishmael ..... Trevor White\n  Young Ishmael ..... PJ Brennan\n  Captain Ahab ..... Garrick Hagon\n  Peter Coffin ..... Howell Evans\n  Queequeg ..... Sani Muliaumaseali'i\n  Peleg ..... Mark Meadows\n  Elijahh/Captain Mayhew ..... Dorian Thomas\n  Starbuck/Gabriel ..... Richard Laing\n  Stubb ..... Simon Lee Phillips\n  Archy ..... Adam Redmayne\n  Daggoo ..... Kobna Holdbrook-Smith\n \n  Specially composed music by Stuart Gordon.\n  Directed at BBC/Cymru Wales by Kate McAll.\n \n* Episode 1\n \n  Stef Penney, author of the critically acclaimed The Tenderness of Wolves, has adapted this well known American novel by Herman Melville.\n \n  Moby Dick is a story, she says, that gets its hooks into you, even though it's one of the strangest books you'll ever read. It has very little narrative, no character development to speak of, and there's no dramatic conflict for over five hundred pages. And yet it's completely compelling, like a fevered dream or a horror film, and, of course, as soon as Moby Dick is mentioned, you know where you're going to end up. For anyone who has ever longed to escape, it is the ultimate trip - and the ultimate morality tale of why you shouldn't go! Captain Ahab is all our darknesses personified; not an evil figure, but a decent, intelligent, could-have-been-ordinary man who gives in to the tyranny of an obsessive dream, or in this case, nightmare.\n \n  In episode 1, Ishmael, now in middle age, looks back on his younger self and remembers how this voyage of a lifetime began.\n \n  Broadcasts\n  Sun 17 Oct 2010 15:00 BBC Radio 4\n  Sat 23 Oct 2010 21:00 BBC Radio 4\n \n* Episode 2\n \n  Herman Melville's classic tale of adventure on the high seas. In this last episode Ishmael comes to the end of the story of what he witnessed as a young man, a story that has haunted him ever since. Captain Ahab, himself now rarely sleeping or eating, ignores the need of the crew for rest and presses on in his obsessive quest for the white whale. After The Pequod is battered by a ferocious typhoon, first mate Starbuck is presented with an opportunity to prevent what seems an inevitable tragedy. To succeed he must overcome his milder nature and steel his nerve. But, in the end, it is Ahab's will that is the stronger, and it seems that nothing can prevent the boiling, wrenching climax, as the maddened whale turns on the ship.\n \n  Adapted by Stef Penney, winner of the Costa Award for Best First Novel and overall Costa Best Novel Award in 2007 with her first novel The Tenderness of Wolves.\n \n  Broadcasts\n  Sun 24 Oct 2010 15:00 BBC Radio 4\n  Sat 30 Oct 2010 21:00 BBC Radio 4\n  \n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1c8b6761b0a4471850d5799250cb2a1e61acfba8","amp;dn":"Moby+Dick+-+Herman+Melville++%28BBC+Drama%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c8b6761b0a4471850d5799250cb2a1e61acfba8","infoHashBuffer":{"type":"Buffer","data":[28,139,103,97,176,164,71,24,80,213,121,146,80,203,42,30,97,172,251,168]},"announce":[],"urlList":[]}}