{"title":"Voetbal Vrouwen - (Seizoen 3 - Disk 2) - 2Lions-Team","uid":5451232,"size":4681100216,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1c8cffdc02fec9f30b6a803888af70a60d2b65e7&amp;dn=Voetbal+Vrouwen+-+%28Seizoen+3+-+Disk+2%29+-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SAIMOR","files":-1,"time":1269191419,"description":"Nederland\n3 Dvd`s / 520:00 minuten \n\nDisk 2 / Aflevering 5 t/m Aflevering 8\n\nRegisseur: Hans Scheepmaker \n\nmet Sophie van Oers, Lone van Roosendaal, Yolanthe Cabau van Kasbergen, Nicolette van Dam, Marit van Bohemen, Bas Muijs, Mike Weerts, Leontine Ruiters\n \nBeschrijving:\n\nDe levens van Liz, Melanie, Renske en Solange komen flink onder druk te staan door de komst van de mooie Kate. \nKate is visagist en tijdens een fotoshoot bij voetbalclub Heros komen zij en Danny in contact. Renske en Danny zijn inmiddels uit elkaar. \nWaardoor niets Danny meer in de weg staat om Kate beter te leren kennen.De sexy Solange wordt met de dag dikker. \nDe blondine hoeft immers niet meer op haar figuur te letten nu ze getrouwd is met Italo, dit tot ergernis van de opvliegende voetballer.\nVoor Liz en voetbaltrainer Rutger luiden de huwelijksbellen. Rutger is eindelijk zo ver om met liz te trouwen en zij is dolgelukkig. \nMaar hun gelukt lijkt geen lang leven beschoren. Natuurlijk zit ook Melanie in de problemen. Haar zoon Diego doet alsof hij nog steeds in coma ligt. \nMelanie ziet het allemaal somber in en besluit dat euthanasie de enige oplossing is. \nTotdat tante Madonna in het ziekenhuis verschijnt en Diego zijn toneelspel niet langer kan volhouden. Ook op het voetbalveld is er van alles aan de hand. \nZo zijn er verschillende transfers geweest. De nieuwste aanwinst is de Afrikaan Kofi, die zorgt voor het nodige testosteron. \nNatuurlijk staan ook de bekende Heros spelers Italo, Danny en Gio op het veld. Bovendien wordt de voetbalclub gekocht door een Russische oliemiljardair. \nDe nieuwe clubeigenaar wil dat zijn vrouw wordt geaccepteerd door de andere voetbalvrouwen en gaat heel ver om zijn zin te krijgen.\n\nBeleef opnieuw de schaamteloze avonturen van deze knappe vrouwen die tot het uiterste gaan om te krijgen wat ze willen. \n\nBeeld: 16:9\nGeluid:Dolby Digital 2.0\nTaal:  Nederlands \n\n****************************************************************************\nNetherlands \n3 DVD `s / 520:00 minutes \n\nDisk 2 / Episode 5 t/m Episode 8\n\nDirector: Hans Scheepmaker\n\nwith Sophie van Oers, Lone van Roosendaal, Yolanthe Cabau van Kasbergen, Nicolette van Dam, Marit van Bohemen, Bas Muijs, Mike Weerts, Leontine Ruiters\n\nDescription: \n\nThe lives of Liz, Melanie, Renske and Solange are considerably strained by the arrival of the beautiful Kate. \nKate is a makeup artist and during a photo shoot she meet Danny by the Footbalclub Heros. Renske and Danny are now separated. \nSo Danny no longer in the way for to no Kate more. The sexy Solange is thicker by the day. \nThe blonde does not figure to look more like her now she is married to Italo, much to the annoyance of the irascible player. \nFor Liz and Rutger football following the wedding bubbles. Rutger has finally come to get married to Liz and she was overjoyed. \nBut their successful seems to prove sustainable. Of course Melanie is also the problem. Her son, Diego pretends he is still comatose. \nMelanie sees it all gloomy and decide that euthanasia is the only solution. \nUntil Madonna aunt in the hospital and appears Diego charade can no longer sustain. Also on the football field will have plenty to worry about. \nThere are been several transfers. The newest addition is the African Kofi, which provides the necessary testosterone. \nNaturally the players know Heros Italo, Danny and Gio on the field. Moreover, the football club bought by a Russian oil billionaire. \nThe new club owner wants his wife accepted by the other women and football are very far to get his way. \n\nRelive the adventures of this pretty shameless women who go to extremes to get what they want. \n \nImage:   16:9 \nSound:   Dolby Digital 2.0 \nLanguage:Dutch\n\n*****************************************************************************\nBrought to you by \nROMIAS\n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n****************************************************************************** \nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.\n\n******************************************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*******************************************************************************\t\n \n \n \n","torrent":{"xt":"urn:btih:1c8cffdc02fec9f30b6a803888af70a60d2b65e7","amp;dn":"Voetbal+Vrouwen+-+%28Seizoen+3+-+Disk+2%29+-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c8cffdc02fec9f30b6a803888af70a60d2b65e7","infoHashBuffer":{"type":"Buffer","data":[28,140,255,220,2,254,201,243,11,106,128,56,136,175,112,166,13,43,101,231]},"announce":[],"urlList":[]}}