{"title":"Secret Window, Secret Garden - Stephen King","uid":4226285,"size":65070356,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1caf20653416dd047cccf579d58b5bb4236d37b8&amp;dn=Secret+Window%2C+Secret+Garden+-+Stephen+King&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"captainelliotspencer","files":9,"time":1212845548,"description":"                   Secret Window, Secret Garden\n                          Stephen King\n\nSecret Window, Secret Garden is similar to King&amp;#039;s earlier novel The Dark Half. Both are about authors, in this case Mort Rainey, who is a thinly-veiled analogue of King himself. Mort is visited by a man who takes the name of John Shooter, with a manuscript which proves to be an almost exact copy of a story that Mort himself wrote and published some years earlier. The man claims that Mort stole it from him and demands that Mort write a story in his name as compensation or prove that he is innocent, or bad things will happen. As it turns out, the man is Mort&amp;#039;s alter ego who manifests himself and makes Mort&amp;#039;s life a living hell until Mort realizes it is himself performing the destructive tasks while he is asleep.\n\nIt is worth noting that King has been accused of plagiarism himself. A woman has claimed that he broke into her home and stole her manuscript for Misery. In another incident a deranged man broke into King&amp;#039;s home, and when discovered by King&amp;#039;s wife, claimed that King has stolen several of his novels and that he had a bomb in the shoebox he was holding. The dud bomb was made of erasers and straightened paperclips.\n\nThis story has been adapted into a movie Secret Window (2004), starring Johnny Depp. The novel and the movie end very differently.\n\n-----------------------------------------------\n\nPLEASE SEED WHEN YOU FINISH THE DOWNLOAD.\n\nEnjoy!!","torrent":{"xt":"urn:btih:1caf20653416dd047cccf579d58b5bb4236d37b8","amp;dn":"Secret+Window%2C+Secret+Garden+-+Stephen+King","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1caf20653416dd047cccf579d58b5bb4236d37b8","infoHashBuffer":{"type":"Buffer","data":[28,175,32,101,52,22,221,4,124,204,245,121,213,139,91,180,35,109,55,184]},"announce":[],"urlList":[]}}