{"title":"XDA Developers' Android Hacker's Toolkit","uid":9339874,"size":58643787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cf1ec03a12cac8ba28427495088ece84b86a9f6&amp;dn=XDA+Developers%27+Android+Hacker%27s+Toolkit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Blankstamped","files":1,"time":1386908701,"description":"The torrent that I got the pdf of this book from was a cluster-fuck of shitty ads, links and nested folders. I removed everything else, converted the pdf into EPUB and MOBI formats, and left the cover image. I can't do shit for the XDA-Dev guys, because I don't have any money, but hopefully you nice folks will go to their website at http://www.xda-developers.com and contribute to their ad-revenue. Or go buy the book, if you're making more than minimum wage.\n~Blankie\n\nFORWARD:\n\nThe XDA Developers (XDA) website was opened in 2003. Nine years may not seem like that long ago, but Facebook wasn't even a thing then. The iPhone and the first Android handset weren't released until 2007. So, in Internet time, XDA is old. In smartphone time, we're ancient. xda-developers. com is a strange URL-not as imaginative, short or catchy as most high-traffic sites. There's a simple reason for this: the site wasn't created for you. We never envisioned a smartphone revolution -or if we did, we never envisioned that millions would care so much about what was happening on our little developer-focused forum. XDA was created for developers and it is still a site for developers. They are incredibly smart,\ngenerally selfless, and hard-working individuals who share their creations (for free) with the world. When they see a book like this, they get concerned that their site will be overrun (more than it already is) by &quot;newbs&quot; with annoying questions and demands. They see the title of this book-with that overused &quot;H&quot;-word-and roll their eyes. So, why did XDA lend its name to this guide? Honestly? It's because we can't stop you all from coming and we'd rather you be a bit better educated when you arrive. People spend more time touching their phones than their spouses and many of those people want their phones to be completely customizable (even as their spouses are generally not). They want to remove\nrestrictions placed on the devices by carriers and OEMs and make the phone theirs.\nThis book was written by a member ofXDA. His goal was to share his enthusiasm about what he found on the site and across the Internet about the customizability of the Android operating system, to get you just as excited, and to show you the tools you need to put that excitement into action. As with most tech-related books, much of the text herein is outdated by the time it hits\nthe shelves. But that's OK. Even if the content is slightly stale, even if you don't have any of the devices listed in the tutorial chapters, we still urge you to read it carefully so that you are better prepared to understand as you explore XDA for your device. As a site for developers, XDA's goal is to make sure you have you respect for all those who have blazed the trail to make all this good stuff possible. We want you to use XDA responsibly-read everything before posting, understand the risks of rooting and customizing your device, and, as you learn, become a helpful, contributing member of the community.\n\n~The XDA Admin Team","torrent":{"xt":"urn:btih:1cf1ec03a12cac8ba28427495088ece84b86a9f6","amp;dn":"XDA+Developers%27+Android+Hacker%27s+Toolkit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf1ec03a12cac8ba28427495088ece84b86a9f6","infoHashBuffer":{"type":"Buffer","data":[28,241,236,3,161,44,172,139,162,132,39,73,80,136,236,232,75,134,169,246]},"announce":[],"urlList":[]}}