{"title":"Five Days at Memorial (audiobook) - Sheri Fink 2013 English","uid":9185786,"size":759182268,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1d60c35b21eb2dec7d5d7c8651ba3677dbcfd4d2&amp;dn=Five+Days+at+Memorial+%28audiobook%29+-+Sheri+Fink+2013+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":29,"time":1384299253,"description":"Five Days at Memorial: Life and Death in a Storm-Ravaged Hospital (Audiobook) By Sheri Fink, read by Kirsten Potter\nUnabridged edition 2013 | 17 hours and 33 mins | ISBN: 080412809X | MP3 96 kbps | 724 MB\n\nPulitzer Prize winner Sheri Fink's landmark investigation of patient deaths at a New Orleans hospital ravaged by Hurricane Katrina - and her suspenseful portrayal of the quest for truth and justice\nIn the tradition of the best writing on medicine, physician and reporter Sheri Fink reconstructs five days at Memorial Medical Center and draws the listener into the lives of those who struggled mightily to survive and to maintain life amidst chaos.\n\nAfter Katrina struck and the floodwaters rose, the power failed, and the heat climbed, exhausted caregivers chose to designate certain patients last for rescue. Months later, several health professionals faced criminal allegations that they deliberately injected numerous patients with drugs to hasten their deaths.\n\nFive Days at Memorial, the culmination of six years of reporting, unspools the mystery of what happened in those days, bringing the listener into a hospital fighting for its life and into a conversation about the most terrifying form of health care rationing.\n\nIn a voice at once involving and fair, masterful and intimate, Fink exposes the hidden dilemmas of end-of-life care and reveals just how ill-prepared we are in America for the impact of large-scale disasters - and how we can do better. A remarkable book, engrossing from start to finish, Five Days at Memorial radically transforms your understanding of human nature in crisis. ","torrent":{"xt":"urn:btih:1d60c35b21eb2dec7d5d7c8651ba3677dbcfd4d2","amp;dn":"Five+Days+at+Memorial+%28audiobook%29+-+Sheri+Fink+2013+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d60c35b21eb2dec7d5d7c8651ba3677dbcfd4d2","infoHashBuffer":{"type":"Buffer","data":[29,96,195,91,33,235,45,236,125,93,124,134,81,186,54,119,219,207,212,210]},"announce":[],"urlList":[]}}