{"title":"World Trade Center(2006)DVDRip.AC3(ENG)-DROCK","uid":6806506,"size":735597186,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e0dfbe47f3192025f5649ecb9440c9c35397240&amp;dn=World+Trade+Center%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drock232","files":-1,"time":1320882113,"description":"Director Oliver Stone once again offers a powerful and provocative story based on real-life events in this drama. Sargeant John McLoughlin (Nicolas Cage) and William J. Jimeno (Michael Pena) were two officers assigned to New York City's Port Authority who were working their beats on a quiet day in early fall when they received an emergency call. The day was September 11, 2001, and McLoughlin and Jimeno were among the policemen who attempted to evacuate the World Trade Center towers after they were struck by airliners piloted by terrorists. Both McLoughlin and Jimeno were inside the fifth building of the World Trade Center when the towers fell, and were two of the last people found alive amidst the wreckage. As McLoughlin and Jimeno struggled to hold on to their lives as rescuers sifted through the rubble, their spouses -- Donna McLoughlin (Maria Bello) and Allison Jimeno (Maggie Gyllenhaal) -- clung to the desperate hope that their husbands would survive and be found. As the McLoughlin and Jimeno families waited for word on the fate of the two men, they watched as a city and a nation came together with strength and compassion in the face of a tragedy. World Trade Center was based on the true story of John McLoughlin and William J. Jimeno, both of whom cooperated with producers in the making of this film.\n\nRipped with Handbrake.\n\nLength: 2 Hours 8 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:1e0dfbe47f3192025f5649ecb9440c9c35397240","amp;dn":"World+Trade+Center%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e0dfbe47f3192025f5649ecb9440c9c35397240","infoHashBuffer":{"type":"Buffer","data":[30,13,251,228,127,49,146,2,95,86,73,236,185,68,12,156,53,57,114,64]},"announce":[],"urlList":[]}}