{"title":"The Lost Kingdom by Matthew J. Kirby (retail) {dwg}","uid":11636448,"size":7035929,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f5eee96a57a8fcc6ac5a196b9c8ab9a89a9347f&amp;dn=The+Lost+Kingdom+by+Matthew+J.+Kirby+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1417738701,"description":"A remarkable adventure by award-winning author Matthew J. Kirby brings a fantastical American West filled with secrets and spies and terrifying creatures to vivid life.\n\nIn this extraordinary adventure story, Billy Bartram, his father, and a secret society of philosophers and scientists venture into the American wilderness in search of the lost people of the Welsh Prince Madoc, seeking aid in the coming war against the French. Traveling in a flying airship, the members of the expedition find their lives frequently endangered in the untamed American West by terrifying creatures, a party of French soldiers hot on their trail, and the constant threat of traitors and spies. Billy will face hazards greater than he can ever imagine as, together with his father, he gets caught up in the fight for the biggest prize of all: America.\n\nTHE LOST KINGDOM is an epic journey filled with marvelous exploits, courage and intrigue, and a bold reimagining of a mythical America. Matthew J. Kirby brings his signature storytelling prowess and superb craft to this astonishing story of fathers and sons, the beginnings of a nation, and wonder-filled adventure","torrent":{"xt":"urn:btih:1f5eee96a57a8fcc6ac5a196b9c8ab9a89a9347f","amp;dn":"The+Lost+Kingdom+by+Matthew+J.+Kirby+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f5eee96a57a8fcc6ac5a196b9c8ab9a89a9347f","infoHashBuffer":{"type":"Buffer","data":[31,94,238,150,165,122,143,204,106,197,161,150,185,200,171,154,137,169,52,127]},"announce":[],"urlList":[]}}