{"title":"Mahmoud Darwish - If I Were Another: Poems (2009)","uid":8953843,"size":5016877,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f6bcd06ac1ef9148acb9835fa807baf2303829d&amp;dn=Mahmoud+Darwish+-+If+I+Were+Another%3A+Poems+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1379959157,"description":"\nMahmoud Darwish - If I Were Another: Poems (Farrar, Straus &amp; Giroux, 2009).  Translated from the Arabic by Fady Joudah.\n\nISBN: 9780374174293 | 240 pages | PDF\n\n\nMAHMOUD DARWISH (1941-2008) was that rare literary phenomenon: a poet both acclaimed by critics as one of the most important poets in the Arab world and beloved by his readers.  His tender and lyrical language helped to transform modern Arabic poetry into a living metaphor for the universal experiences of exile, loss, and identity.  The poems in this collection, constructed from the cadence and imagery of the Palestinian struggle, shift between the most intimate individual experience and the burdens of history and collective memory.\n\nWinner of the PEN USA Literary Award for Translation, IF I WERE ANOTHER collects the greatest epic works of Darwish's mature years.  It is a powerful yet elegant work that demonstrates why Darwish was one of the most celebrated poets of his time and was hailed as the voice and conscience of an entire people.\n\n\nReviews\n\n&quot;No poet in our time has confronted the violent tides of history with greater humanity or greater artistic range than Mahmoud Darwish. This collection, masterfully edited and translated by Fady Joudah, bears witness to the unceasing development and deepening of Darwish's practice over the last two decades of his life.  Here the lyric, the elegiac, and the epic conjoin in one voice encompassing self and other, desire and memory, the olive's tang and the ashes of exile.&quot; -- Michael Palmer\n\n&quot;A world-class poet. . . Darwish has not only remade a national consciousness; he has reworked language and poetic tradition to do so.&quot; -- Fiona Sampson, The Guardian\n\n&quot;Poetry for Darwish provides not simply an access of unusual insight or a distant realm of fashioned order, but a harassing amalgam of poetry and collective memory, each pressing on the other. . . The conventional and the ethereal, the historical and the transcendently aesthetic combine to provide an astonishingly concrete sense of going beyond what anyone has ever lived through in reality.&quot; -- Edward Said, Grand Street\n\n&quot;Here we have in one glorious volume the reach and the depth of Darwish's lyric epics that individually, repeatedly, and cumulatively shifted our understanding of what poetry can accomplish.  In his lucid and compelling translations, Joudah offers us a gesture of unequaled fraternity in lines that mirror and move in loyalty to the birth of new poems.&quot; -- Breyten Breytenbach\n\n&quot;[Darwish's] best political poetry, because it is love poetry, is uncannily intimate. . .  At times it is frankly mystical, imagining a union that recalls the rapt ecstasies of Sufi saints.&quot; -- Robyn Cresswell, Harper's Magazine\n\n&quot;[Darwish] writes poetry of the highest and most intense quality--poetry that embodies epic and lyric both, deeply symbolic, intensely emotional. . . He has, in Joudah's startling and tensile English, expended into us a new vastness.&quot; -- Kazim Ali, The Kenyon Review\n\n_____________________________________________\n\nFor more poetry by Mahmoud Darwish, see:\n\nA River Dies of Thirst: Journals (2009) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8832813/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8832813/&lt;/a&gt;\n\nAlmond Blossoms and Beyond (2009) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8888446/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8888446/&lt;/a&gt;\n\nUnfortunately, It Was Paradise: Selected Poems (2003) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8836980/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8836980/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:1f6bcd06ac1ef9148acb9835fa807baf2303829d","amp;dn":"Mahmoud+Darwish+-+If+I+Were+Another%3A+Poems+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f6bcd06ac1ef9148acb9835fa807baf2303829d","infoHashBuffer":{"type":"Buffer","data":[31,107,205,6,172,30,249,20,138,203,152,53,250,128,123,175,35,3,130,157]},"announce":[],"urlList":[]}}