{"title":"Mechanic The (Charles Bronson) {Alien} [1972] .avi","uid":4511736,"size":510479480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f9737fb0df64b62e97d44aeefe1ad46b3330759&amp;dn=Mechanic+The+%28Charles+Bronson%29+%7BAlien%7D+%5B1972%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alien99","files":1,"time":1226800611,"description":"Another classic Bronson movie and not to be missed. This time Charles is Arthur Bishop, a merciless, unfeeling, uncaring and strictly by the book assassin who is the standard by which all other professional killers are measured. Meticulous to a fault and as calculatingly efficient as can be, Bishop systematically completes his missions and returns to his mansion each night. Soon after eliminating one of his old friends, he becomes attached to the dead man&amp;#039;s young and impertinent son Steve (John Michael Vincent), which quickly progresses from friendship to business relationship. Bishop agrees to mentor Steve in the tricks of the trade as an &quot;associate&quot; and after working with him he is free to do as he pleases. However, Bishop quickly discovers that is apt pupil is more nefarious than he appears as Steve has already accepted a contract on Bishop&amp;#039;s life. But what Arthur doesn&amp;#039;t realize yet is &quot;the organization&quot; to which Bishop belongs now wants him eliminated and will stop at nothing to achieve this goal. Bishop has broken a rule in taking Steve under his wing without first getting approval of &quot;The Man&quot; and is therefore marked for death. This film is filled with action, intrigue, and of course suspense as you continue to wonder the whole time which &quot;mechanic&quot; is gonna get his car fixed first. The ending is quite unpredictable for a 70&amp;#039;s Bronson movie but enjoyable to the last second. Also features a cameo by Bronson&amp;#039;s late wife Jill Ireland. One of Charles Bronson&amp;#039;s better accomplishments on the silver screen I sure was impressed\n\n704 X 384\n1:39:52\n160kbps\nDivX YV12","torrent":{"xt":"urn:btih:1f9737fb0df64b62e97d44aeefe1ad46b3330759","amp;dn":"Mechanic+The+%28Charles+Bronson%29+%7BAlien%7D+%5B1972%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f9737fb0df64b62e97d44aeefe1ad46b3330759","infoHashBuffer":{"type":"Buffer","data":[31,151,55,251,13,246,75,98,233,125,68,174,239,225,173,70,179,51,7,89]},"announce":[],"urlList":[]}}