{"title":"2014 - The Year In Christian Music (Bundle 28)","uid":10317026,"size":2152189141,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2042c20cd436abfc842631a01979974710c6ca2f&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+28%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"TorrentTracts","files":257,"time":1402259639,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nI heard a sermon this morning on the importance of living a debt free life.  The Pastor went on to say that when our attention is focused on debt, it robs the Lord of our eagerness to fully submit to His plan.  So it was important, as Christians, to pay off our own debts.  And equally important for us to forgive the debts we have of others.\n\nAs I sat there listening, I couldn't help but to think of an individual I loaned a great sum of money to many years ago.  She came to me with a hard luck story, an immediate financial need for her five children, and a detailed plan of action with the promise to repay me in two months.  But two months came and passed.  As did two years.  Then four years.  Then six years.\n\nPerhaps by year number two, I gave up.  Surely I could invest my time in matters that were more Godly driven then listening to this woman's lies, right?  By year number three, she told me she found the Lord.  Don't you just love it when someone tells you that?  Yeah right!  I had no doubt that what she found was just another reason to annoy me further.  By year number seven, to her credit, her apologies seemed a &quot;little&quot; more genuine.  But her desire to truly know God seemed more on target.  So she pleaded with me to teach her all about God.  To minister.  To help her find the same type of love in the Lord that she saw within myself.\n\nDuring all of those years I gave this person every opportunity to make right on that loan.  But there was always a reason.  Always an excuse.  At one point I told her if she paid me half the money, I would consider the debt paid in full.  Never happened.  At another point, I told her that that if she tithed any portion of that debt to her Church, I would consider the debt paid in full.  Never happened.  At another point, I told her if she paid me a penny for every dollar I loaned her, I would match each penny by $0.99 (equaling the original debt) and personally do something awesome for the Lord that she would certainly rejoice in.  Never happened.\n\nThis story is a long one.  With many layers.  But the truth is, by year number two, I turned that debt (and it's stresses) over to the Lord.  After all, it's all His money anyway.  Right?  Any wealth we enjoy comes from above.  From the talents and opportunities He has blessed us with.  Amen?  So I feel absolutely blessed to say I live a debt free life today.  My house, my vehicle, my toys, they're all paid in full.  But sometimes the hardest debt of all to rid our lives of is the debt others owe to us.  And just like in my story above, I hope that if some of you are owed money by others, money which you could perhaps live your life without, please do.  Pray on it, and if God is calling you to do so, please forgive that debt.  There's no greater joy that being truly committed and steadfast focused on God ... and not the distracting annoyances of this world.  Be it the frustration you feel about the omittance of some spare change in your pocket, a cup of sugar you loaned the neighbor last month, a relative who borrowed a tool and broke it, or some other such debt you feel deprived of.  It's all an absolutely meaningless distraction from the Lord above.\n\nROCK: Abandon, Ashes Remain, Jerry Fee, Tim Halperin.  CONTEMPORARY: Alberto And Kimberly Rivera, Mikeschair, Rush Of Fools.  SPOKEN WORD: Beleve.  HARDCORE/METAL: Beyond Never, Lambs Like Lions, Those Who Fear, War Of Ages,Wolves At The Gate.  JAZZ: Chris Reinhardt.  POP: Colton Dixon, Evan Craft. Imani Hutton.  HIP-HOP/RAP: Curt Kennedy, David Keigh, E-Sential, Joe Boss, Jus B, Triumfant Muzik, Uncle Reece.  GOSPEL: Darnell Davis And The Remnant, Jevon D Brock And Kingdom Citizens.  PRAISE &amp; WORSHIP: Glory Of Zion International Worship, Sean Feucht, Women Of Faith.  R&amp;B: Kelly Price, Michelle Williams.  ALTERNATIVE: WeAreGeneration.\n\nOur year-to-date count has now broken a 1,000 shares, and is sitting at 1,006.\n\nThere are 33 releases being offered in this 28th bundle today, including...\n\n * Abandon - 2014 - It Was Love - Single\n * Alberto And Kimberly Rivera - 2014 - The Explosion Inside\n * Ashes Remain - 2014 - Here For A Reason - Single\n * Beleve - 2014 - Jeremiah 19\n * Beyond Never - 2014 - One Thousand Years - Single\n * Chris Reinhardt - 2014 - InsideIdentity\n * Colton Dixon - 2014 - More Of You - Single\n * Curt Kennedy - 2014 - Chapter II\n * Darnell Davis And The Remnant - 2014 - Moving Forward\n * David Keigh - 2014 - Through It All\n * E-Sential - 2014 - Like That, Like This - Single\n * Evan Craft - 2014 - We Are Young - Single\n * Glory Of Zion International Worship - 2014 - Move Me\n * Glory Of Zion International Worship - 2014 - Once More Into The Breach\n * Imani Hutton - 2014 - Go The Right Way\n * Jerry Fee - 2014 - Mystery - Single\n * Jevon D Brock And Kingdom Citizens - 2014 - Jevon D Brock And Kingdom Citizens, Music Series 1\n * Joe Boss - 2014 - I Am Joe Boss\n * Jus B - 2014 - Illustrious\n * Kelly Price - 2014 - Sing Pray Love, Vol 1 - Sing\n * Lambs Like Lions - 2014 - Lambs Like Lions\n * Michelle Williams - 2014 - Say Yes - Single\n * Mikeschair - 2014 - All Or Nothing - Family Christian Exclusive\n * Rush Of Fools - 2014 - Carry Us Now\n * Sean Feucht - 2014 - Kingdoms\n * Those Who Fear - 2014 - Ego Trip - Single\n * Tim Halperin - 2014 - Heart Tells Your Head\n * Triumfant Muzik - 2014 - The Power Project\n * Uncle Reece - 2014 - Bold\n * War Of Ages - 2014 - From Ashes - Single\n * WeAreGeneration - 2014 - Live At Spoto EP, Vol 2\n * Wolves At The Gate - 2014 - VxV\n * Women Of Faith - 2014 - Gateway Worship Revival\n\nBlessings,\nTorrentTracts, June 2014\n","torrent":{"xt":"urn:btih:2042c20cd436abfc842631a01979974710c6ca2f","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+28%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2042c20cd436abfc842631a01979974710c6ca2f","infoHashBuffer":{"type":"Buffer","data":[32,66,194,12,212,54,171,252,132,38,49,160,25,121,151,71,16,198,202,47]},"announce":[],"urlList":[]}}