{"title":"Encyclopedia of Pollution (2 Vols){BBS}","uid":6838509,"size":72037894,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20c6e895f726769f7487fc2fcfc23df8fb547f4c&amp;dn=Encyclopedia+of+Pollution+%282+Vols%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322088516,"description":"Encyclopedia of Pollution is a new, two-volume color set designed to address all aspects of pollution and the global impact on the environment in a single source. Containing more than 300 entries and essays interspersed throughout, it uses the most current scientific data to explain the different types of pollutants including properties, production, uses, environmental release and fate, adverse health response to exposure, and environmental regulations on human exposure. It provides the scientific background on the water, soil, and air of environments where the pollutants are released. Coverage also includes pollution regulation, the function of federal regulatory agencies and environmental advocacy groups, and the technology and methods to reduce pollution and to remediate existing pollution problems.\n\nNumerous case studies explore the most infamous of pollution events such as the Exxon Valdez oil spill, the Gulf Storm oil well fires, the Chernobyl disaster, Hurricane Katrina, the World Trade Center disaster, and the Love Canal in New York, among many others including those that had great impact on legislation or that were used in popular media such as the films Erin Brockovich and A Civil Action. Biographies are provided of some of the leaders and pioneers of pollution study and activism. Other useful features include a detailed glossary, indexes, a timeline, and tables.\n\n\n# Hardcover: 1028 pages\n# Publisher: Facts on File (J) (July 1, 2011)\n# Language: English\n# ISBN-10: 0816070024\n# ISBN-13: 978-0816070022","torrent":{"xt":"urn:btih:20c6e895f726769f7487fc2fcfc23df8fb547f4c","amp;dn":"Encyclopedia+of+Pollution+%282+Vols%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20c6e895f726769f7487fc2fcfc23df8fb547f4c","infoHashBuffer":{"type":"Buffer","data":[32,198,232,149,247,38,118,159,116,135,252,47,207,194,61,248,251,84,127,76]},"announce":[],"urlList":[]}}