{"title":"YLE.The.Miracle.of.Ihantala.The.Battle.of.Tali-Ihantala.Summer.1","uid":6564841,"size":842303616,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:20cfc616fa24548858dc6896bb7d0945c87987c7&amp;dn=YLE.The.Miracle.of.Ihantala.The.Battle.of.Tali-Ihantala.Summer.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1311632571,"description":"The Continuation War between Finland and the Soviet Union had been fought for nearly three years when Red Army, superior in both personnel and materiel, started its massive offensive against Finland on 9th June 1944. The sovereignty and existence of Finland were at stake because Stalin had given the order to conquer the entire country. At the beginning of the offensive, there seemed to be no way of stopping the attack. The main defense line was broken and despite fierce battles, also the VT-line had to be given up. Losing Finland's second largest city Viipuri on 20th June seemed like an omen of the final result. On the Karelian Isthmus, there remained only one defense line. It was almost unfortified. In fact, this VKT-line existed only on maps. The strong appeal of the Commander Supreme, Marshal of Finland Mannerheim, to fight a rigorous defense battle started to bear fruit, the defense was tightened and the Russian offensive momentum grew weaker.\n\nThe village of Tali is situated some ten kilometers north-east of Viipuri, and Ihantala some twenty kilometers north of Viipuri. The greatest battle ever in the Nordic countries was fought in this 10 by 10 kilometers area. This grand battle of Tali-Ihantala was one of the largest battles of the Second World War and it was fought from 25th June to 5th July 1944. The total numbers of troops participating were about 50 000 Finnish and 150 000 Russian soldiers. The Russian supremacy in materiel was greater. The casualties in this battle were shocking. The Finns lost altogether 8800 men and the Russians 22 000 men as dead, missing and wounded.\n\nHow could this defensive victory be attained in general? How can we speak of the Miracle of Ihantala achieved by fighting?\n\nThis documentary film tells about the battle also as told by the Veterans who were there.\n\nThe documentary is a tribute to the men and women who saved Finland.\n\nManuscript and Direction : Tuomo Rysti\nNarrators : Joe Brady, Jonathan Hutchings\nProducer : Tuomo Rysti \n\nAV-Caesar &amp; Tykkimiehet Ry (2001)\n\n\n\nTechnical Specs\n----------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1793 kbps\nVideo Resolution: 576x448\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 256kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 54:32.480\nNumber Of Parts: 1\nPart Size: 842,303,616 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:20cfc616fa24548858dc6896bb7d0945c87987c7","amp;dn":"YLE.The.Miracle.of.Ihantala.The.Battle.of.Tali-Ihantala.Summer.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20cfc616fa24548858dc6896bb7d0945c87987c7","infoHashBuffer":{"type":"Buffer","data":[32,207,198,22,250,36,84,136,88,220,104,150,187,125,9,69,200,121,135,199]},"announce":[],"urlList":[]}}