{"title":"Bonhomme-What Voltaire Tries to Tell Us 1-Esoteric Substance of ","uid":4660705,"size":2227132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20e976b59414e8c268d6094cbfe7124494ea46ab&amp;dn=Bonhomme-What+Voltaire+Tries+to+Tell+Us+1-Esoteric+Substance+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1232383478,"description":"This is Denise Bonhomme's monumental book What Voltaire Tries to Tell Us 1 - The Esoteric Substance of Voltairian Thought (2000) which uncovers the veiled message concealed in the trilogy consisting of Zadig, Micromagas and Candide. The Voltairian &quot;contraband&quot; which is the core of his writings was too explosive for overt publication during the author's lifetime. More dangerous to reveal than his well-known, subversive socio-political views was the spiritual source of his militancy. Accordingly, his veiled message was meant for the general reading public of the future but it never went unnoticed by other literary &quot;smugglers&quot;. Hints and clues to the presence of hidden material are many. Zadig, for instance, is described by its author as &quot;a story that says more than it seems to say,&quot; a massive understatement. Voltaire is &quot;only&quot; one star in a spectacular constellation of similarly inspired writers. Among such luminaries are Rabelais, Vigny, Ibsen, Proust, Sinclair Lewis and Saint-Exupery. In the words of Marcel Proust: &quot;The great writers have never done but one work...&quot; Leads are given to encourage the esoteric exploration of the vast domain of esoteric literature. What Voltaire Tries to Tell Us is a daring study and a tremendous work of scholarship that connects the dots between the works of Voltaire and the ancient esoteric thought. 570 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:20e976b59414e8c268d6094cbfe7124494ea46ab","amp;dn":"Bonhomme-What+Voltaire+Tries+to+Tell+Us+1-Esoteric+Substance+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20e976b59414e8c268d6094cbfe7124494ea46ab","infoHashBuffer":{"type":"Buffer","data":[32,233,118,181,148,20,232,194,104,214,9,76,191,231,18,68,148,234,70,171]},"announce":[],"urlList":[]}}