{"title":"Jimmy Buffett - Live at Fenway Park Disc 2 of 2 [Country][mp3 32","uid":4654307,"size":181326377,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20ecb94730f2aa17e9c07919a54b1acf468c94f4&amp;dn=Jimmy+Buffett+-+Live+at+Fenway+Park+Disc+2+of+2+%5BCountry%5D%5Bmp3+32&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"schon55","files":20,"time":1232151711,"description":"Jimmy Buffett - Live at Fenway Park Disc 2 of 2\nAudio CD: November 15, 2005 \nOriginal Release Date: November 15, 2005 \nFormat: Live \nLabel: Mailboat Records \nBitrate: mp3 320 kbps\n\nLet me say upfront that I am not particularly big on Jimmy Buffett, and I'm certainly no Parrothead. Yet I was intruiged by this CD/DVD combo set, among other reasons because of the timing of the concerts (Sept. 04), just 6 weeks before the Red Sox went on to win the World Series for the first time in 86 years. The fact that a &quot;bonus&quot; DVD was included added to my interest. \n\n&quot;Live at Fenway Park&quot; (32 tracks; 137 min.) was recorded over 2 shows at Fenway, and the show is nicely sequenced. The songs can roughly be categorized in 3 groups:\n(1) the &quot;classic&quot; Buffett songs such as &quot;Son of a Son of a Sailor&quot;, &quot;Cheeseburger in Paradise&quot;, &quot;Fins&quot;, and many others,\n(2) the more recent Buffett stuff such as &quot;License to Chill&quot; and &quot;It's Five O'Clock Somewhere&quot;, and\n(3) the cover songs, including &quot;Brown Eyed Girl&quot;, &quot;Respect&quot;, long-time staple &quot;Southern Cross&quot;, but also a surprising &quot;Scarlet Begonias&quot;, of which as a Dead fan I feared the worst, but it's not nearly as bad as that.\nBuffett closes the show with dedicating &quot;Defying Gravity&quot; to the 9/11 victims, a nice touch. ~ Paul Allaer\n\nI am heavily biased - as both a Parrothead for 25 years and a Red Sox fan, how could I NOT love this Double CD set? It's fun, it's lively, it's...Jimmy. Not every song is performed as well as it could be, but it's a live album with Jimmy having a good time, so I pretty much went into it expecting that. \n\nNow, if you're not a Red Sox fan - especially if you are a Yankees fan - you may tire quickly or possibly not always &quot;get&quot; all of the Red Sox and Boston references Jimmy makes here. That's understandable. But, well, I would expect to have the same problem if he had recorded this at Camden Yards, Busch Stadium or Wrigley Field. When it's live, the artist is gonna play to that audience. And, let's be honest, you have to expect that when he puts the stadium name in the title and photos of it all over the packaging. \n\nRegarding the song selection, I think it's a very good mix of his old songs (which I knew), a number of newer ones (which I mostly didn't), and some covers. That, again, is to be expected of ANY live album, and for me was a good introduction to those newer songs I hadn't heard. Check the song list above, if that matters to you. If you're tired of Jimmy's approach to the Carribean or to life, don't buy this -- it's that simple. But he's not whining, he's just having fun, so if you are in a similar mood, this is a fun, fun way to play along. ~ Greg Robertson\n \nJimmy Buffett - Live at Fenway Park Disc 2 Tracks;\n01 One Paticular Harbour\n02 Respect \n03 Gypsies in the Palace \n04 Grapefruit Juicy Fruit \n05 Come Monday \n06 Jolly Mon Sing \n07 Take Me Out to the Ballgame \n08 It's Five O'Clock Somewhere \n09 Cheeseburger in Paradise \n10 Coast of Carolina \n11 Cuban Crime of Passion \n12 A Pirate Looks at Forty \n13 Piece of Work \n14 Margaritaville \n15 Fins \n16 Scarlet Begonias \n17 Southern Cross \n  \n","torrent":{"xt":"urn:btih:20ecb94730f2aa17e9c07919a54b1acf468c94f4","amp;dn":"Jimmy+Buffett+-+Live+at+Fenway+Park+Disc+2+of+2+%5BCountry%5D%5Bmp3+32","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ecb94730f2aa17e9c07919a54b1acf468c94f4","infoHashBuffer":{"type":"Buffer","data":[32,236,185,71,48,242,170,23,233,192,121,25,165,75,26,207,70,140,148,244]},"announce":[],"urlList":[]}}