{"title":"Thread's Not Dead: The Designer's Guide to the Apparel Industry","uid":8640476,"size":5127473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21140a294a387139fb727803044467ce1156688b&amp;dn=Thread%27s+Not+Dead%3A+The+Designer%27s+Guide+to+the+Apparel+Industry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1372875462,"description":"\nJeff Finley, &quot;Thread's Not Dead: The Designer's Guide to the Apparel Industry&quot;\nISBN: 0615523471 | 2011 | EPUB\n\nWhat if the most prolific and influential people in the modern t-shirt design scene got together and discussed everything they wish they knew when they started?\n\nThat's exactly what we have here.\n\nThread's Not Dead is the essential strategy guide to the t-shirt design business. Written by successful graphic designer and diy entrepreneur Jeff Finley of the creative agency Go Media. Learn the secrets and strategies employed by the industry's most successful indie apparel designers and brands.\n\nWhether you want to design merchandise for your favorite bands and indie clothing companies or start your own fashion brand, this book has it all. Its goal is to help you dominate the apparel industry. Key topics include design, freelancing, band merchandise, personal branding, marketing, sales, printing &amp; production, retail, business strategy, and e-commerce. Featuring contributions from the people behind Threadless, Emptees, DesignByHumans, Big Cartel, I Am The Trend, Go Media, Jakprints, Glamour Kills, Paint the Stars, Cure Apparel, Fright-Rags, and more!","torrent":{"xt":"urn:btih:21140a294a387139fb727803044467ce1156688b","amp;dn":"Thread%27s+Not+Dead%3A+The+Designer%27s+Guide+to+the+Apparel+Industry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21140a294a387139fb727803044467ce1156688b","infoHashBuffer":{"type":"Buffer","data":[33,20,10,41,74,56,113,57,251,114,120,3,4,68,103,206,17,86,104,139]},"announce":[],"urlList":[]}}