{"title":"Cipriano de Rore - 5th Madrigal Bk - Csrt of Musicke [Philidor]","uid":15751671,"size":251460258,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:212d38b78dc7708b7ab83f5d2145fd5209034695&amp;dn=Cipriano+de+Rore+-+5th+Madrigal+Bk+-+Csrt+of+Musicke+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Philidor","files":20,"time":1473035333,"description":"From Gramophone:\r\n\r\nCipriano de Rore's Fifth Book of Madrigals was published posthumously in 1568, three years after the composer's death. Rore had established himself as an eminent composer of secular music 20 years earlier in Ferrara, where his exquisite treatment of the classic Franco-Flemish polyphonic tradition was discreetly transformed to serve a growing sensitivity to poetic nuance. His prescient understanding of the emotional potential of the madrigal was explored in both four- and five-part scorings. The four-part pieces are generally lighter-veined but the imagery and expressive range is no less detailed than the intensely wrought five-part madrigals, and in many ways they are more representative of the compendium of skills which were to blossom with Monteverdi and his contemporaries. Despite that, the contemplative and refined madrigals of the Fifth Book are emotionally couched in an intense and private world which, though less obviously progressive, divulges a deeper affective response to the text.\r\n\r\nThis is an imaginative first step in The Consort of Musicke's latest departure of 'encircling' Monteverdi with music by his predecessors and contemporaries. Having made a considerable contribution to Il Maestro's recorded oeuvre for both L'Oiseau-Lyre and Virgin Classics, Anthony Rooley and his loyal consort have ventured into new territory, not just by recording the likes of Rore and Marenzio but by starting their own label, Musica Oscura, ''for the bold, the progressive and discerning''.\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nA bio of Ciconia is enclosed. You can search on Philidor for all my classical downloads, or check out this thread:\r\n \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:212d38b78dc7708b7ab83f5d2145fd5209034695","amp;dn":"Cipriano+de+Rore+-+5th+Madrigal+Bk+-+Csrt+of+Musicke+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"212d38b78dc7708b7ab83f5d2145fd5209034695","infoHashBuffer":{"type":"Buffer","data":[33,45,56,183,141,199,112,139,122,184,63,93,33,69,253,82,9,3,70,149]},"announce":[],"urlList":[]}}