{"title":"Excel VBA 24-Hour Trainer - 2nd Ed (2015) (Pdf and Epub) Gooner","uid":12394719,"size":39511547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21a226aef8895306550f76822cce01c664df7ec2&amp;dn=Excel+VBA+24-Hour+Trainer+-+2nd+Ed+%282015%29+%28Pdf+and+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"GoonerTPB","files":2,"time":1441937104,"description":"Publisher: Wrox; 2 edition (March 30, 2015)\nLanguage: English\nISBN-10: 1118991370\nISBN-13: 978-1118991374\n\nMaster VBA automation quickly and easily to get more out of Excel\nExcel VBA 24-Hour Trainer, 2nd Edition is the quick-start guide to getting more out of Excel, using Visual Basic for Applications. This unique book/video package has been updated with fifteen new advanced video lessons, providing a total of eleven hours of video training and 45 total lessons to teach you the basics and beyond. This self-paced tutorial explains Excel VBA from the ground up, demonstrating with each advancing lesson how you can increase your productivity. Clear, concise, step-by-step instructions are combined with illustrations, code examples, and downloadable workbooks to give you a practical, in-depth learning experience and results that apply to real-world scenarios.\n\nThis is your comprehensive guide to becoming a true Excel power user, with multimedia instruction and plenty of hands-on practice. * Program Excel's newest chart and pivot table object models * Manipulate the user interface to customize the look and feel of a project * Utilize message boxes, input boxes, and loops to yield customized logical results * Interact with and manipulate Word, Access, PowerPoint, and Outlook from Excel\n\nIf you're ready to get more out of this incredibly functional program, Excel VBA 24-Hour Trainer, 2nd Edition provides the expert instruction and fast, hands-on learning you need","torrent":{"xt":"urn:btih:21a226aef8895306550f76822cce01c664df7ec2","amp;dn":"Excel+VBA+24-Hour+Trainer+-+2nd+Ed+%282015%29+%28Pdf+and+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21a226aef8895306550f76822cce01c664df7ec2","infoHashBuffer":{"type":"Buffer","data":[33,162,38,174,248,137,83,6,85,15,118,130,44,206,1,198,100,223,126,194]},"announce":[],"urlList":[]}}