{"title":"Hary Potter.(ebook)(collection).","uid":6048999,"size":15790426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2242956c0f1c222d2aa44cb04702f191c3136b2f&amp;dn=Hary+Potter.%28ebook%29%28collection%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zurera","files":-1,"time":1292660916,"description":"Harry Potter es una heptalogÃƒÂ­a de novelas fantÃƒÂ¡sticas escrita por la autora britÃƒÂ¡nica J. K. Rowling, en la que se describen las aventuras del joven aprendiz de mago Harry Potter y sus amigos Ron Weasley y Hermione Granger, durante los siete aÃƒÂ±os que pasan en el Colegio Hogwarts de Magia y HechicerÃƒÂ­a. El argumento se centra en la lucha entre Harry Potter y el malvado mago lord Voldemort, quien matÃƒÂ³ a los padres de Harry en su afÃƒÂ¡n de conquistar el mundo mÃƒÂ¡gico.\nDesde el lanzamiento de la primera novela, Harry Potter y la piedra filosofal en 1997, la serie logrÃƒÂ³ una inmensa popularidad, crÃƒÂ­ticas favorables y ÃƒÂ©xito comercial alrededor del mundo.1 Para diciembre de 2007, se habÃƒÂ­an vendido mÃƒÂ¡s de 400 millones de copias de los siete libros,2 los cuales han sido traducidos a mÃƒÂ¡s de 65 idiomas,3 entre los que se incluyen el latÃƒÂ­n4 y el griego antiguo.5 El sÃƒÂ©ptimo y ÃƒÂºltimo libro, Harry Potter y las Reliquias de la Muerte fue lanzado mundialmente en inglÃƒÂ©s el 21 de julio de 2007,6 mientras que en espaÃƒÂ±ol se publicÃƒÂ³ el 21 de febrero de 2008.7\nLa editora Bloomsbury Publishing tiene los derechos de publicaciÃƒÂ³n en inglÃƒÂ©s para el Reino Unido y el resto de Europa, mientras que la editorial Scholastic los tiene para Estados Unidos y la Editorial Salamandra los tiene para el idioma espaÃƒÂ±ol y su distribuciÃƒÂ³n por EspaÃƒÂ±a e HispanoamÃƒÂ©rica.\nEl ÃƒÂ©xito de las novelas ha hecho de la marca Harry Potter una de las mÃƒÂ¡s exitosas del mundo, con un valor de US$15.000 millones,8 y a Rowling la primera escritora de la historia en alcanzar US$1.000 millones en concepto de ganancias gracias a su trabajo.9 En 2005, ha sido la novena persona con el ingreso anual mÃƒÂ¡s alto del mundo.10\nEn 1999, la productora de cine Warner Bros. adquiriÃƒÂ³ los derechos para adaptar los siete libros a una serie de pelÃƒÂ­culas, de las cuales ya han sido estrenadas las seis primeras, resultando la franquicia mÃƒÂ¡s exitosa de la historia del cine. El sÃƒÂ©ptimo libro se adaptarÃƒÂ¡ en una pelÃƒÂ­cula de dos partes, estrenadas con un lapso de ocho meses. La primera parte se estrenarÃƒÂ¡ el 19 de noviembre de 2010, mientras que la segunda parte el 15 de julio de 2011.\n\n\n1.-Harry Potter y la piedra filosofal (30 de junio de 1997, fecha de publicaciÃƒÂ³n en Inglaterra)\n2.-Harry Potter y la cÃƒÂ¡mara secreta (2 de julio de 1998)\n3.-Harry Potter y el prisionero de Azkaban (8 de julio de 1999)\n4.-Harry Potter y el cÃƒÂ¡liz de fuego (8 de julio de 2000)\n5.-Harry Potter y la Orden del FÃƒÂ©nix (21 de junio de 2003)\n6.-Harry Potter y el misterio del prÃƒÂ­ncipe (16 de julio de 2005)\n7.-Harry Potter y las Reliquias de la Muerte (21 de julio de 2007)","torrent":{"xt":"urn:btih:2242956c0f1c222d2aa44cb04702f191c3136b2f","amp;dn":"Hary+Potter.%28ebook%29%28collection%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2242956c0f1c222d2aa44cb04702f191c3136b2f","infoHashBuffer":{"type":"Buffer","data":[34,66,149,108,15,28,34,45,42,164,76,176,71,2,241,145,195,19,107,47]},"announce":[],"urlList":[]}}