{"title":"The Stand - Steven King","uid":8416750,"size":476730972,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2373b39cc73e0346f1672b434e0461c2618a35e0&amp;dn=The+Stand+-+Steven+King&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ventricle","files":-1,"time":1367062933,"description":"\n&quot;This is the way the world ends: with a nanosecond of computer error in a Defense Department laboratory and a million casual contacts that form the links in a chain letter of death.\n\n&quot;And here is the bleak new world of the day after: a world stripped of its institutions and emptied of 99 percent of its people. A world in which a handful of panicky survivors choose sides -- or are chosen. A world in which good rides on the frail shoulders of the 108-year-old Mother Abagail -- and the worst nightmares of evil are embodied in a man with a lethal smile and unspeakable powers: Randall Flagg, the dark man.\n\n&quot;In 1978 Stephen King published The Stand, the novel that is now considered to be one of his finest works. \nThe Complete And Uncut Edition includes more than five hundred pages of material previously deleted, along with new material that King added as he reworked the manuscript for a new generation. It gives us new characters and endows familiar ones with new depths. It has a new beginning and a new ending. What emerges is a gripping work with the scope and moral complexity of a true epic.\n\n&quot;For hundreds of thousands of fans who read The Stand in its original version and wanted more, this new edition is Stephen King's gift. And those who are reading The Stand for the first time will discover a triumphant and eerily plausible work of the imagination that takes on the issues that will determine our survival.&quot;\n\n\nRead for you by Grover Gardner.\n\n\n\nEnjoy!\n-Ventricle","torrent":{"xt":"urn:btih:2373b39cc73e0346f1672b434e0461c2618a35e0","amp;dn":"The+Stand+-+Steven+King","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2373b39cc73e0346f1672b434e0461c2618a35e0","infoHashBuffer":{"type":"Buffer","data":[35,115,179,156,199,62,3,70,241,103,43,67,78,4,97,194,97,138,53,224]},"announce":[],"urlList":[]}}