{"title":"RPG Dead Dragons v1.1.0g  Mod (Unlimited Gold &amp; More &amp; N","uid":11206125,"size":22824664,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:23a6a75d49b31aaac4ce6720c695cda1f35dd9c9&amp;dn=RPG+Dead+Dragons+v1.1.0g++Mod+%28Unlimited+Gold+%26amp%3B+More+%26amp%3B+N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":".BONE.","files":-1,"time":1413219595,"description":"Who will survive, dragons or humans?\n100 years ago, dragons were defeated by humans, and the world became peaceful.\nHowever, one day, the main character in the story hears a rumor about the dragons which were supposed to be extinct, and comes across a mysterious young girl...\nA dragon-hunting RPG where you can enjoy freestyle battles, using a wide range of skills, and the unique 'Rotation' system!\nRotation Battles\nWhen choosing an action during battles, in addition to the standard commands, you can change the battle setting between 'Rotation' and 'Stay'. If you choose 'Rotation', at the end of the character's action, the positions of all the members of the party will change. If you choose 'Stay', the characters' positions will not change.\nWhen selecting actions, the order of the following turns is displayed on the right of the screen, so it is possible to change enemies' positions appropriately. For example, when an enemy is going to attack, you can bring a character with high defensive strength to the vanguard, and conversely, you can move a character with low defensive strength to the rearguard.\nRuin Mode\nIn a normal attack, you can launch a Downshot, in which you can choose one of three attack points. If you manage to hit the enemy's weakpoint, a critical attack is unleashed. In addition, if you succeed with a Downshot three times, your Ruin Gauge will reach its maximum value, and you will be able to make use of the powerful Ruin Mode.\nIn Ruin Mode, you can summon special sub-characters, and make use of powerful skills. If you use these well, it is possible to inflict huge damage in a single attack.\n\n*This game features some in-app-purchase content. While in-app-purchase content requires additional fees, by no means it is necessary for finishing the game.\n*The actual price might differ depending on the region.\n[Supported OS]\n- 2.2 to 4.4\n[Supported Screens]\n- WVGA(480x800) and up\n[Xperia(TM) PLAY]\n- Not optimized\n[SD Card Storage]\n- Enabled\n[Languages]\n- English, Japanese\n[Non-Supported Devices]\nThis app has generally been tested to work on any mobile device released in Japan. We cannot guarantee support on other devices","torrent":{"xt":"urn:btih:23a6a75d49b31aaac4ce6720c695cda1f35dd9c9","amp;dn":"RPG+Dead+Dragons+v1.1.0g++Mod+%28Unlimited+Gold+%26amp%3B+More+%26amp%3B+N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23a6a75d49b31aaac4ce6720c695cda1f35dd9c9","infoHashBuffer":{"type":"Buffer","data":[35,166,167,93,73,179,26,170,196,206,103,32,198,149,205,161,243,93,217,201]},"announce":[],"urlList":[]}}