{"title":"Dash Shaw - Bottomless Belly Button","uid":8752861,"size":376488809,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:23bd1b4a34484984189d16b88db3fd29c1081285&amp;dn=Dash+Shaw+-+Bottomless+Belly+Button&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1375075282,"description":"I gotta say, I don't like the look of the brown ink used in this book. Not in the print version or the scanned version. For some reason it's occasionally hard for me to focus on it. Like, my eyes actually get a little blurry. But, ya know, it's likely that's just me. Regardless, it's a very solid read, and it's a page turner. The 720 pages go by much faster than you expect.\n\n-----------------------------------------------------------------------------------------\n\n'Bottomless Belly Button'\n\nFantagraphics Books, 2008, 720 pages\n\nWritten and Illustrated by Dash Shaw\n\nBottomless Belly Button is a comedy-drama that follows the dysfunctional adventures of the Loony Family.\n\nAfter 40-some years of marriage, Maggie and David Loony shock their children with their announcement of a planned divorce. But the reason for splitting isn't itself shocking: they're &quot;just not in love anymore.&quot; The announcement sparks a week long Loony family reunion at Maggie and David's creepy (and possibly haunted) beach house.\n\nThe eldest child, Dennis, struggles with his parents' decision while facing difficulties of his own in his recent marriage. Believing that his parents are hiding the true reasons behind their estrangement, Dennis embarks on a quest to discover the truth and searches through clues, trap doors, and secret tunnels in attempt to find an answer. Claire, the middle child, is a single mother whose 16-year-old daughter, Jill, is apathetic to the divorce but confounded by Claire and troubled by her own &quot;mannish&quot; appearance. The youngest child, Peter, is a hack filmmaker suffering from paralyzing insecurities who establishes an unorthodox romance with a mysterious day care counselor at the beach.\n\nIn a six-day period rich with atmospheric sequences, these characters stumble blindly around one another, often ignoring their surroundings and consumed by their own daily conflicts. Visually, Shaw employs a leisurely storytelling pace that allows room for exploring the interconnecting relationships among the characters and plays to his strength as a cartoonist - small gestural details and nuanced expressions that bring the characters to vivid and intimate life. If the controversial R.D. Laing wrote an episode of The Simpsons, it might read something like Bottomless Belly Button.\n\nOfficial Selection, 2009 Festival International de la Bande Dessinee de Angouleme; named one of Publishers Weekly's 2008 &quot;Best Books of the Year: Comics;&quot; named one of Booklist's &quot;Top 10 Graphic Novels&quot; of the Year.&quot;\n","torrent":{"xt":"urn:btih:23bd1b4a34484984189d16b88db3fd29c1081285","amp;dn":"Dash+Shaw+-+Bottomless+Belly+Button","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23bd1b4a34484984189d16b88db3fd29c1081285","infoHashBuffer":{"type":"Buffer","data":[35,189,27,74,52,72,73,132,24,157,22,184,141,179,253,41,193,8,18,133]},"announce":[],"urlList":[]}}