{"title":"Hitler Beyond Evil and Tyranny -Stolfi- Epub [Slender]","uid":10161642,"size":2919136,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23e2ead7c183b210614601e77bd2fbcc8e2194ed&amp;dn=Hitler+Beyond+Evil+and+Tyranny+-Stolfi-+Epub+%5BSlender%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"K-Slender","files":3,"time":1400303761,"description":"Publisher: Prometheus Books (December 13, 2011)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00C4B2TSO\n\nCountless books, including five major biographies, have been devoted to the subject of Adolf Hitler. Yet, despite the mass of tantalizing detail uncovered over six decades, the man at the center of so much historical, psychological, and political analysis remains elusive. For some, he was evil personified, a diabolical tyrant driven by a lust for power; for others, he was a banal demagogue, an opportunist with a talent for propaganda and oration but little more than an empty vessel embodying the disappointments of a defeated Germany. Though we know many facts about Hitler, no coherent picture of his character or personality emerges. Instead, we are left with a cardboard cutout of an evil dictator whose life, in the end, no one can really explain. This fascinating and richly detailed new biography of Hitler reinterprets the known facts about the Nazi Fuehrer to construct a convincing, realistic portrait of the man. In place of the hollow shell others have made into an icon of evil, the author sees a complex, nuanced personality. Without in any way glorifying its subject, this unique revision of the historical Hitler brings us closer to understanding a pivotal personality of the twentieth century. ","torrent":{"xt":"urn:btih:23e2ead7c183b210614601e77bd2fbcc8e2194ed","amp;dn":"Hitler+Beyond+Evil+and+Tyranny+-Stolfi-+Epub+%5BSlender%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23e2ead7c183b210614601e77bd2fbcc8e2194ed","infoHashBuffer":{"type":"Buffer","data":[35,226,234,215,193,131,178,16,97,70,1,231,123,210,251,204,142,33,148,237]},"announce":[],"urlList":[]}}