{"title":"Blink-182 - California (2016) [16.44 CD FLAC]","uid":15171307,"size":325711927,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:24157497a0539743a5b0771c800a5e2df6e57875&amp;dn=Blink-182+-+California+%282016%29+%5B16.44+CD+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":18,"time":1467395473,"description":"\n  Blink-182 - California (2016) [16.44 CD FLAC]\r\n\r\n  Genre: Rock\r\n  Style: Punk\r\n  Source: CD\r\n  Codec: FLAC \r\n  Bit rate: ~ 1,000 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 Cynical (1:56)\r\n  02 Bored To Death (3:56)\r\n  03 She's Out Of Her Mind (2:43)\r\n  04 Los Angeles (3:03)\r\n  05 Sober (3:00)\r\n  06 Built This Pool (0:17)\r\n  07 No Future (3:46)\r\n  08 Home Is Such A Lonely Place (3:21)\r\n  09 Kings Of The Weekend (2:56)\r\n  10 Teenage Satellites (3:12)\r\n  11 Left Alone (3:10)\r\n  12 Rabbit Hole (2:36)\r\n  13 San Diego (3:13)\r\n  14 The Only Thing That Matters (1:58)\r\n  15 California (3:10)\r\n  16 Brohemian Rhapsody (0:30)\r\n\r\n  After a stretch of uncertainty and stagnation, blink-182 returned with their seventh LP, California, their best in 15 years. The debut from &quot;blink v3.0&quot; features new guitarist Matt Skiba, the Alkaline Trio frontman who replaced founding member Tom DeLonge in 2015. Skiba joins Mark Hoppus and Travis Barker on an album that is both a return to form and an admirable maturation of the band's classic pop-punk sound. Whereas 2003's self-titled album had its moments, the 2011 follow-up Neighborhoods was an uninspired, stale comeback from a trio that had lost its heart and sense of fun. In the end, they sounded like imitations of younger bands they helped inspire. With California, blink-182 are free from the drama, reinjecting much-needed vitality and spirit back into the catalog. Fortunately, this is not merely blink-meets-Alkaline. Skiba has assimilated, while introducing new angles to the longtime Hoppus-Barker relationship with deeper vocals and bolder guitar. Those trademark blink riffs and &quot;na-na-na&quot;s remain intact (&quot;Sober&quot;), which should please the faithful. While the loss of DeLonge's nasally whine is a departure -- for better or worse -- the harmonies remain tight between Hoppus and Skiba (&quot;Rabbit Hole,&quot; &quot;Los Angeles&quot;). Producer and Goldfinger frontman John Feldmann -- the first outside man since longtime producer Jerry Finn passed in 2008 -- received songwriting credit on every track and captured blink's essence and tightened their focus. Lead single &quot;Bored to Death&quot; kicked off the new era with a reminder of blink's appeal: sunny harmonies, a catchy melody, and a massive singalong chorus. The pogo-ing &quot;She's Out of Her Mind&quot; is &quot;The Rock Show&quot; redux, and &quot;The Only Thing That Matters&quot; is a raucous throwback for the fans who miss the Raynor-era. And yet, while these are all nods to the past, California doesn't wallow in by-the-numbers nostalgia. It's not a desperate grasp at youth and faded glory, but rather a reflective look back and an expert execution of what they do best. In addition to those quintessential blink hallmarks, there are many big moments on California conceived with outside collaborators. Faint turntable scratching courtesy of DJ Spider can be heard on &quot;Sober,&quot; an arena-ready anthem co-written by Fall Out Boy's Patrick Stump. David Hodges (Evanescence, Avril Lavigne) contributes to a trio of tracks in the album's mid-section, including another big tune, the pounding &quot;Kings of the Weekend.&quot; Boys Like Girls' Martin Johnson assists on the title track, a bittersweet love letter to their home state. Whether it's DeLonge's absence or an actual maturation, there's something less bratty and sophomoric about California. For the","torrent":{"xt":"urn:btih:24157497a0539743a5b0771c800a5e2df6e57875","amp;dn":"Blink-182+-+California+%282016%29+%5B16.44+CD+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24157497a0539743a5b0771c800a5e2df6e57875","infoHashBuffer":{"type":"Buffer","data":[36,21,116,151,160,83,151,67,165,176,119,28,128,10,94,45,246,229,120,117]},"announce":[],"urlList":[]}}