{"title":"Justice League Elite 01-12 (2004-2005|Digital-Empire)","uid":10061280,"size":278695348,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:245898968ff8ef584266bda4fe3a6103b3383cda&amp;dn=Justice+League+Elite+01-12+%282004-2005%7CDigital-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1398734210,"description":"Joe Kelly's covert ops Justice League saga is definitely one to check out if you are a fan of the group. \nFrom the Booklist Review:\n\n&quot;Kelly started the Elite to express annoyance at a fatalistic trend in modern comics. In the first story, Manchester Black and his superhero team--the Elite--announce a new world order in which heroism based on truth and justice is declared obsolete. The team will instead act immediately as judge, jury, and executioner. After reasoning with the new vigilantes fails, Superman plays hardball to put Black in his place without compromising the images of the hero and the leader. Well after Black's defeat, his sister Vera Lynn resurrects the Elite as a deep-cover team, vowing to play by the rules. Most team members have less-than-pristine pasts, yet Superman and the Justice League, though dubious of Elite espionage tactics, unofficially sanction it. Kelly's conception poses the piquant question, Can a superhero under deep cover and working with killers resist becoming a killer himself? Kelly presents the grays in his characters as well as their world with a realism that artwork distinguished by fluid, dynamic line work and bold inking crucially abets.&quot; - Tina Coleman\n\nIt's a fun series and worth reading IMHO. All twelve issues are digital copies by Empire proper. Thanks to them for their work, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:245898968ff8ef584266bda4fe3a6103b3383cda","amp;dn":"Justice+League+Elite+01-12+%282004-2005%7CDigital-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"245898968ff8ef584266bda4fe3a6103b3383cda","infoHashBuffer":{"type":"Buffer","data":[36,88,152,150,143,248,239,88,66,102,189,164,254,58,97,3,179,56,60,218]},"announce":[],"urlList":[]}}