{"title":"Josef Pieper - Thomist Philosopher - 9 books (epub, mobi) ","uid":8794105,"size":6102819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24d3a643eed05736c999c275487352a3e30c9851&amp;dn=Josef+Pieper+-+Thomist+Philosopher+-+9+books+%28epub%2C+mobi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":37,"time":1376028406,"description":"9 books by German thomist philosopher Josef Pieper. All are epub and mobi formats from a retail source.\n\nFor 17 books by the same author in pdf, see this: &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8782836&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8782836&lt;/a&gt;\n\nSome of the books in this new torrent are the same titles as the ones I uploaded on 6 August; most are not.\n\n---\n\nGerman philosophers are typically very hard to read; Thomas Aquinas is also at times very hard to read. But somehow the German thomist Josef Pieper is a pleasure to read. He explores thomist themes in a way that's lucid and inviting.\n\nThis is from a profile of Pieper written after his death in 1997:\n\nIn the mind and the writings of Josef Pieper the Greek philosophical tradition and the Christian theological tradition met and enriched each other. In one of his characteristically succinct formulations Pieper himself once stated the connection in a way especially fitting if we seek to contemplate the significance of his lifeÎ“Ã‡Ã–s work: &quot;The ultimate perfection attainable to us, in the minds of the philosophers of Greece, was this: that the order of the whole of existing things should be inscribed in our souls. And this conception was afterwards absorbed into the Christian tradition in the conception of the beatific vision: 'What do they not see, who see him who sees all things?' &quot;\n\n---\n\nMany thanks to the exceedingly spiffy original uploader.","torrent":{"xt":"urn:btih:24d3a643eed05736c999c275487352a3e30c9851","amp;dn":"Josef+Pieper+-+Thomist+Philosopher+-+9+books+%28epub%2C+mobi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24d3a643eed05736c999c275487352a3e30c9851","infoHashBuffer":{"type":"Buffer","data":[36,211,166,67,238,208,87,54,201,153,194,117,72,115,82,163,227,12,152,81]},"announce":[],"urlList":[]}}