{"title":"Pirates of Barbary by Adrian Tinniswood {dwg}","uid":11215085,"size":8246700,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:251ef189a886f5ca87367c7544b42ece4974d66b&amp;dn=Pirates+of+Barbary+by+Adrian+Tinniswood+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1413316717,"description":"Pirates of Barbary is an extraordinary record of the European renegades and Islamic sea-rovers who terrorised the Mediterranean and beyond throughout the seventeenth century. From the coast of Southern Europe to Morocco and the Ottoman states of Algiers, Tunis and Tripoli, Christian and Muslim seafarers met in bustling ports to swap religions, to battle and to trade goods and slaves - raiding as far as Iceland and New England in search of their human currency. Studying the origins of these men, their culture and practices - from pirate etiquette to intimidation tactics - Adrian Tinniswood expertly recreates the twilight world of the corsairs in fascinating detail, and uncovers a truly remarkable clash of civilisations.\n\n\n\n\n\nPirates of Barbary draws on an incredible wealth of material, from furious royal proclamations to the private letters of pirates and their victims, as well as recent Islamic accounts to provide a new perspective on the corsairs, both as criminals and as devout warriors engaged in a battle against European incursions. The result is a kaleidoscopic image of a wild and exotic people, place and time, and a fascinating insight into what it meant to sacrifice all you have for a life so violent, so uncertain, and so alien that it set you apart from the rest of mankind","torrent":{"xt":"urn:btih:251ef189a886f5ca87367c7544b42ece4974d66b","amp;dn":"Pirates+of+Barbary+by+Adrian+Tinniswood+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"251ef189a886f5ca87367c7544b42ece4974d66b","infoHashBuffer":{"type":"Buffer","data":[37,30,241,137,168,134,245,202,135,54,124,117,68,180,46,206,73,116,214,107]},"announce":[],"urlList":[]}}