{"title":"Petlust - Dog Cock For Guys 2.mpg","uid":4343770,"size":162635844,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2550bfe5c6cd59b0ed7b57648ceb10b957503d4e&amp;dn=Petlust+-+Dog+Cock+For+Guys+2.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"doggeral","files":1,"time":1218756794,"description":"M03 Dog Cock For Guys 2\n\n\t\nGuys getting humped and pumped by excited male dogs, guys sucking dog cock\nNumber of segments in movie: 4\n\nSegment 1: PC133 Frisky Rott\nLength of Segment: 15 minutes\nFeaturing Roxie and a very horny male Rottweiler\nDescription: Roxie loves dog cock. He can&amp;#039;t get enough of it. And this rottie is very frisky... this dog knows what he likes, and can&amp;#039;t wait to give it to Randy. Again and again and again. At one point, Randy thinks he can&amp;#039;t go on, but the rottie is rock hard, and thinks a blow job will do just fine. Randy is ready again, and does some gymnastics to make that cock go deep inside. After filling Randy&amp;#039;s ass with hot dog cum, the rottie licks himself clean.\n\nSegment 2: PC141 1 Guy 2 Dogs 3 Dicks\nLength of Segment: 16 minutes\nFeaturing Nelson and his two horny male dogs\nDescription: This movie has so much cock in it, it cums at you from every direction. These two dogs each have to wait their turn for a shot at Nelson&amp;#039;s ass. A couple times, one of the dogs can&amp;#039;t wait and tries to fuck the other dog while he is fucking Nelson. Just a little harmless growling. Nelson takes the knot on both of them, and pops it right back out. If you like lots of cock, this is one you will want to watch again and again.\n\nSegment 3: PC143 DoubleDanal\nLength of Segment: 15 minutes\nFeaturing Nelson, Derrick, and a very well hung Great Dane\nDescription: The Great Dane is known for his size, and this dog is no exception. First, the boys want to put their cocks into the Dane&amp;#039;s ass. One, then the other, then both at the same time! After that, Nelson gets drilled in the ass, knot and all, while Derrick does the Dane in the ass again. Triple sac shot, dog sandwich, you have not seen anything like this before. To top it all off, Nelson pushes out the knot in a gush of dog cum. We made it again in slow motion for you to enjoy every juicy moment.\n\nSegment 4: PC113 The Rottie Likes It Rough\nLength of Segment: 10 minutes\nFeaturing Hayseus and a very horny male Rottweiler\nDescription: Hayseus is giving a show to everyone in the room, taking this frisky Rottweiler in his ass. He can barely get his clothes off in time before the dog jumps him! The cam gets so close on this one, it even gets bumped around a bit by the flying feet, but not without reward, the well lit angles show you everything you want to see, angles so wild you could not even see them if you were in the room watching. \n","torrent":{"xt":"urn:btih:2550bfe5c6cd59b0ed7b57648ceb10b957503d4e","amp;dn":"Petlust+-+Dog+Cock+For+Guys+2.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2550bfe5c6cd59b0ed7b57648ceb10b957503d4e","infoHashBuffer":{"type":"Buffer","data":[37,80,191,229,198,205,89,176,237,123,87,100,140,235,16,185,87,80,61,78]},"announce":[],"urlList":[]}}