{"title":"Classics: A Very Short Introduction","uid":8888045,"size":3096058,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25cf7340bf2de2ea2df96da5f51c72f67384fea3&amp;dn=Classics%3A+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1378512639,"description":"Description:\n\nWe are all classicists--we come into touch with the classics on a daily basis: in our culture, politics, medicine, architecture, language, and literature. What are the true roots of these influences, however, and how do our interpretations of these aspects of the classics differ from their original reality? This introduction to the classics begins with a visit to the British Museum to view the frieze which once decorated the Apollo Temple a Bassae. Through these sculptures John Henderson and Mary Beard prompt us to consider the significance of the study of Classics as a means of discovery and enquiry, its value in terms of literature, philosophy, and culture, its source of imagery, and the reasons for the continuation of these images into and beyond the twentieth century. Designed for the general reader and student alike, A Very Short Introduction to Classics challenges readers to adopt a fresh approach to the Classics as a major cultural influence, both in the ancient world and twentieth-century--emphasizing the continuing need to understand and investigate this enduring subject.","torrent":{"xt":"urn:btih:25cf7340bf2de2ea2df96da5f51c72f67384fea3","amp;dn":"Classics%3A+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25cf7340bf2de2ea2df96da5f51c72f67384fea3","infoHashBuffer":{"type":"Buffer","data":[37,207,115,64,191,45,226,234,45,249,109,165,245,28,114,246,115,132,254,163]},"announce":[],"urlList":[]}}