{"title":"Amy Speace - Land Like a Bird [2011][ FLAC]","uid":8548318,"size":297062650,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:26324faa5e2694a67cf022c5d2c57894937cc46d&amp;dn=Amy+Speace+-+Land+Like+a+Bird+%5B2011%5D%5B+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":14,"time":1370574029,"description":"Artist: Amy Speace\nRelease: Land Like a Bird\nReleased: 2011\nLabel: Thirty Tigers\nCatalog#: 7061195\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: US\nStyle: folk,pop\n\nimage\n\n1. Drive All Night\t4:27\t\n2. Land Like A Bird\t3:46\t\n3. Ghost\t5:32\t\n4. Half Asleep And Wide Awake\t4:30\t\n5. Change For Me\t3:56\t\n6. It's Too Late To Call It A Night\t3:56\t\n7. Manila Street\t3:45\t\n8. Battened Hatches\t3:18\t\n9. Had To Lose\t3:26\t\n10. Galbraith Street\t2:47\t\n11. Vertigo\t5:14\t\n12. Real Love Song 4:11\n\nIn between Land Like a Bird and its predecessor, The Killer in Me, singer/songwriter Amy Speace moved her home base from the East coast to Nashville, and the songs contained here are born of that journey. But somewhere along the line, Speace seems to have lost a bit of the bite that helped make the tunes on her earlier album so resonant. In finding a new home that fits her comfortably, she may have lost track of the tension that informed some of her songs in the past. That's probably a great thing for her personal life, but it doesn't necessarily bode well for her evolution as a songwriter. It's not a turn toward an alt-country-tinged Americana approach that brings about a change on Land Like a Bird; that had already been Speace's stock in trade. Rather, there's a certain kind of soft-pedaling going on here, in terms of both the core of the material and the delivery. The edge that the East coast has been known to impart on the music of its residents may be what's missing here. At the same time, one of the most effective cuts on the album is &quot;It's Too Late to Call It a Night,&quot; which comes the closest to a traditional country feel; it's the middle ground between Eastern edge and Southern sway that seems to be a slippery slope. Then again, those who are coming to Speace's music for the first time, having never heard, for instance, the trenchant title cut of her previous album, might not be troubled by any of these contextual quibbles. Land Like a Bird is undoubtedly a well-crafted piece of work, on which Speace's vocals are unfailingly pretty and potent, and for those who are unbiased by her past work, it has the potential to make a substantive impact. In that sense, where the album takes you depends largely on where you started out to begin with.","torrent":{"xt":"urn:btih:26324faa5e2694a67cf022c5d2c57894937cc46d","amp;dn":"Amy+Speace+-+Land+Like+a+Bird+%5B2011%5D%5B+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26324faa5e2694a67cf022c5d2c57894937cc46d","infoHashBuffer":{"type":"Buffer","data":[38,50,79,170,94,38,148,166,124,240,34,197,210,197,120,148,147,124,196,109]},"announce":[],"urlList":[]}}