{"title":"Joseph Arthur - Redemption's Son [2002][EAC,log,cue. FLAC]","uid":8190422,"size":472500475,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:26aa4f60f9b87cf473324b8aae2965004d2e77e1&amp;dn=Joseph+Arthur+-+Redemption%27s+Son+%5B2002%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":19,"time":1361810822,"description":"Artist: Joseph Arthur\nRelease: Redemption's Son\nDiscogs: 1662878\nReleased: 2002-11-26 / 2002-05-20\nLabel: Real World Records, Enjoy Records / Real World Records\nCatalog#: 440 060 088-2 / CDRW103\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Europe\nStyle: Pop, Rock, Alternative Rock, Lo-Fi, Indie Rock\n\nTracklisting:\n\n01. Redemption's Son (4:34)\n02. Honey And The Moon (4:44)\n03. You Could Be In Jail (3:11)\n04. I Would Rather Hide (4:03)\n05. Innocent World (3:53)\n06. September Baby (4:51)\n07. Nation Of Slaves (5:54)\n08. Evidence (4:13)\n09. Buy A Bag (2:34)\n10. Termite Song (9:23)\n11. Permission (5:19)\n12. Favorite Girl (6:10)\n13. You Are The Dark (3:37)\n14. In The Night (2:20)\n15. Blue Lips (4:19)\n16. You've Been Loved (4:11)\n\n\nEven as you read this Joseph Arthur is making another record. Or sculpting or painting or tapping rows of Beat prose onto a PowerBook screen. It might have been two years since his Come To Where I'm From album had reviewers alluding to Kurt Cobain and the great New York songwriters, but Joseph and his ever-generous muse have kept near-daily appointments.\n\nThe result, for the moment at least, is Redemption's Son. Consistently inspired, occasionally frazzled, and often startlingly beautiful, it's the kind of record you can build a slow, sustainable love affair with, its rich textures, vulnerability and acute, poetic lyrics guaranteed to slacken jaws and raise goose bumps. Reassuringly, it was made by a man with a self-effacing sense of humour and a complete lack of pretension.\n\nRecorded in various locations over the last two years, the album was mixed by Tchad Blake (Sheryl Crow, Pearl Jam, Bonnie Raitt). Joseph plays most of the instruments himself, but a gold star is also due to Pat Sansone who contributed bass, piano and mellotron parts. Elsewhere, cellist Nadia Lanman appears on Favourite Girl. &quot;Tchad rediscovered it among a bunch of my old recordings,&quot; says Joseph.\n\nIn truth it's pretty hard to get Joseph to talk about who and what the songs on Redemption's Son are about, perhaps because he feels he's already laid himself bare in their lyrics. &quot;I think vulnerability in art is a really attractive thing,&quot; he told Rolling Stone in 2000, &quot;...but it still feels risky to me.&quot; His new record, he says, is &quot;honest&quot; and &quot;real. It would be good if people liked the words and thought it was soulful,&quot; he adds.\n\nListening to Redemption's Son, you'll soon recognise themes of dislocation, loss and lost innocence. You should note too, however, that album-closer You've Been Loved was written &quot;for various friends and for myself in reaction to self-pity. It's like you have been loved, so what more do you want?&quot; says Joseph emphatically. He doesn't want your sympathy, just your ears.\n","torrent":{"xt":"urn:btih:26aa4f60f9b87cf473324b8aae2965004d2e77e1","amp;dn":"Joseph+Arthur+-+Redemption%27s+Son+%5B2002%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26aa4f60f9b87cf473324b8aae2965004d2e77e1","infoHashBuffer":{"type":"Buffer","data":[38,170,79,96,249,184,124,244,115,50,75,138,174,41,101,0,77,46,119,225]},"announce":[],"urlList":[]}}