{"title":"Fastball - Little White Lies [2009]","uid":9690848,"size":297175105,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:27058444ceec767e3c35a16113f494a22d150a0e&amp;dn=Fastball+-+Little+White+Lies+%5B2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1393860637,"description":"Review by Stephen Thomas Erlewine\nFastball spent much of the 2000s rather quietly but they were hardly the only '90s alt rock band to be in seclusion. The fallout of the alt rock explosion led to lots of bands being written off as one-hit wonders -- sometimes fairly, sometimes not -- and the vagaries of the music business sometimes suggest that a band had faded out when they're just taking a break, as Fastball did during the bulk of the decade. Once they left the major leagues, they released Keep Your Wig On on Rykodisc in 2004 then took an extended break, reconvening in 2009 for Little White Lies, an album that suggests that the band might be better off now that the spotlight isn't shining directly upon them. Little White Lies is stripped-down and simple, a brisk, muscular guitar pop record that showcases their melodic strengths in a way none of their other records do. More than ever, Fastball sounds like a classicist pop band in the best possible sense: they build upon tradition without being beholden to it, and the unadorned production draws attention to their nicely structured tunes and finely honed performances. This might not be a knockout; it's something better -- a quietly assured record that finds Fastball confident and mature, reaching a new pop peak. (4/5)","torrent":{"xt":"urn:btih:27058444ceec767e3c35a16113f494a22d150a0e","amp;dn":"Fastball+-+Little+White+Lies+%5B2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27058444ceec767e3c35a16113f494a22d150a0e","infoHashBuffer":{"type":"Buffer","data":[39,5,132,68,206,236,118,126,60,53,161,97,19,244,148,162,45,21,10,14]},"announce":[],"urlList":[]}}