{"title":"Swim Fan(2002)DVDRip.AC3(ENG)-DROCK","uid":6699999,"size":735162356,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2743be130a6446c16b6f2bf9b9c913f25a950175&amp;dn=Swim+Fan%282002%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"drock232","files":-1,"time":1316936574,"description":"A moment of temptation leads to a high body count and untold regrets for a high-school swimming star in this thriller starring Bring It On\\'s Jesse Bradford and Traffic\\'s Erika Christensen. Despite a shady past involving drugs and the juvenile justice system, Ben Cronin (Bradford) seems to have it all: a loving mother, a devoted girlfriend (Shiri Appleby), and a shot at a college scholarship in California. But the same week that athletic scouts will be deciding his future, Ben finds himself embroiled in a flirtation with Madison Bell (Christensen), a bewitching transfer student who seduces him into supposedly strings-free sex during an impromptu swim lesson after hours in the school pool. When Ben takes Madison at her word and goes about his business as if nothing had happened, she insinuates herself into his life with sinister glee. Showing up at Ben\\'s house, befriending his girlfriend, and sending him naked pictures -- none of her strategies wins his heart. So Madison turns to other, more devious forms of courtship. Soon, Ben finds himself kicked off the swim team for supposed steroid use, suspected of murdering a rival (Clayne Crawford), and rejected by his girlfriend for his sexual indiscretions. Eventually, though, he receives help in uncovering the genesis of Madison\\'s uncanny fixation from an unexpected source. Originally titled \\&quot;Swimfan85\\&quot; (after Madison\\'s Internet screen name), the retitled Swimfan hit the top spot at the back-to-school box office when it was released September 6, 2002. Dan Hedaya co-stars as Ben\\'s stern but loving mentor, Coach Simkins. Actor-turned-director John Polson previously helmed Siam Sunset. \n\nRipped with Handbrake.\n\nLength: 1 Hour 25 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:2743be130a6446c16b6f2bf9b9c913f25a950175","amp;dn":"Swim+Fan%282002%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2743be130a6446c16b6f2bf9b9c913f25a950175","infoHashBuffer":{"type":"Buffer","data":[39,67,190,19,10,100,70,193,107,111,43,249,185,201,19,242,90,149,1,117]},"announce":[],"urlList":[]}}