{"title":"Duke Jordan Trio - Flight to Denmark (1973) [Jazz][flac][schon55","uid":5629946,"size":420609454,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:27672050e85dee6c3c5584eaf7f102190bc1bd98&amp;dn=Duke+Jordan+Trio+-+Flight+to+Denmark+%281973%29+%5BJazz%5D%5Bflac%5D%5Bschon55&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":21,"time":1276632521,"description":"Duke Jordan Trio - Flight to Denmark \nYear: 1973\nLabel: SteepleChase\nQuality: flac\n\nUpon Duke Jordan's initial visit to Copenhagen, Denmark, followed by his decision to make the move as an expatriate permanent, he was tempted to stay by playing with some extraordinary Scandinavian rhythm sections. Bassist Mads Vinding, one of many skilled Danish jazz bassists, is here on the date performing in fine style. Drummer Ed Thigpen, who left the U.S. to take up permanent residence in Europe, was an even bigger influence in making Jordan's decision a good one, and is an equally skillful musical partner on this date. This is an expanded edition from the previous original issue on the Steeplechase label; a Japanese import with several alternate takes. It's an understated session for the most part, equal parts melancholy and hopeful, as one might expect with the trepidation of leaving home for new, unknown horizons to be discovered in a foreign land. The upbeat songs, as the modal, popping, tom-tom driven &quot;No Problem&quot; (from the movie soundtrack Les Liason Dangereuses) and the famous bop flag-waver &quot;Jordu,&quot; bookend the CD. The bulk of the recording showcases the softer side of Jordan, with takes of the somber ballad &quot;Here's That Rainy Day,&quot; the slightly brighter &quot;Everything Happens to Me,&quot; and two versions of the polite waltz &quot;Glad I Met Pat,&quot; dedicated to a nine-year-old girl Jordan knew in New York City prior to her being kidnapped. The pianist employs chiming piano chords for &quot;How Deep Is the Ocean?,&quot; is lighthearted in his slight interpretation of the well worn &quot;On Green Dolphin Street,&quot; does two takes on the light, bluesy swinger &quot;If I Did, Would You?,&quot; and ramps up to midtempo the bluesy original &quot;Flight to Denmark,&quot; reflective of the insecurity and consequential optimism that followed his leaving the States. This is Duke Jordan at his most magnificent, with the ever-able Vinding and expert Thigpen playing their professional roles perfectly, producing perhaps the second best effort (next to Flight to Jordan from 13 years hence) from the famed bop pianist. [Originally released in 1973, Flight to Denmark was reissued as an import-only Japanese CD in 2002.] ~ Michael G. Nastos, All Music Guide \n\nPersonnel:\nDuke Jordan\nMads Vinding\nEd Thigpen \n\nDuke Jordan Trio - Flight to Denmark Tracks;\n01  No Problem (6:46)\n02  Here's That Rainy Day (7:27)\n03  Everything Happens to Me (5:44)\n04  Glad I Met Pat [Take 3] (5:45)\n05  Glad I Met Pat [Take 4] (5:29)\n06  How Deep Is the Ocean? (7:25)\n07  On Green Dolphin Street (8:24)\n08  If I Did - Would You? [Take 1] (3:43)\n09  If I Did - Would You? [Take 2] (3:52)\n10  Flight to Denmark (5:48 )\n11  No Problem [Take 2] (7:14)\n12  Jordu [Take 1] (4:54)\n\n","torrent":{"xt":"urn:btih:27672050e85dee6c3c5584eaf7f102190bc1bd98","amp;dn":"Duke+Jordan+Trio+-+Flight+to+Denmark+%281973%29+%5BJazz%5D%5Bflac%5D%5Bschon55","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27672050e85dee6c3c5584eaf7f102190bc1bd98","infoHashBuffer":{"type":"Buffer","data":[39,103,32,80,232,93,238,108,60,85,132,234,247,241,2,25,11,193,189,152]},"announce":[],"urlList":[]}}