{"title":"Ten Must Have Essential Punk Albums [-emidius-]","uid":11665384,"size":841531197,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:28369f1ae3bcec7f00c8dd62d75d44f7811d5cf4&amp;dn=Ten+Must+Have+Essential+Punk+Albums+%5B-emidius-%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"emidius","files":190,"time":1418048208,"description":"The included are considered by many to be some of the top essential Punk albums of all time. Regardless of any album rankings...these are truly MUST OWN albums for anyone interested in Punk. I hope you enjoy this collection and I will be releasing further collections in the near future.\n\n10. Descendents\n\nMilo Goes To College (1982)\n\nSouthern California has proven exceptionally fertile ground for punk rock music, and one of our finest moments came with the debut of South Bay maniacs The Descendents. Don't let the rapidfire 15 songs in just over 22 minutes fool you, Milo Goes To College's vulnerable (if occasionally snotty) lyrics courtesy of Milo Aukerman and its riffs at times feel like all-out assault. And for those of you wondering, yes, Milo did go to college. He has a PhD in biochemistry. --Daniel Kohn\n\n\n9. The Misfits\n\nWalk Among Us (1982)\n\nThe Misfits' first official full length consists of pummeling hardcore couched in the melodic style of late '50's and early '60s rock 'n roll. That these shout-alongs deal exclusively in B-movie guts and gore is an added bonus. Singer Glenn Danzig, whose voice is the most masculine in all of punk rock, compiled and edited this collection of songs from several different performances and recording sessions, stitching together The Misfits' strongest and spookiest record. --Emmett Shoemaker\n\n\n8. The Clash\n\nSelf-Titled (1977)\n\nThe late '70s weren't kind to England. The economy was in the pits and the outlook was bleak. Enter three lads from London, who managed to channel the collective anxiety of the country's disenchanted youth, courtesy of Joe Strummer's madder-than-hell, politically charged lyrics and Mick Jones' machine gun guitar riffs. The Clash was a major turning point for punk. For the first time, the establishment had to recognize the genre as a voice for social change. --Daniel Kohn\n\n\n7. Iggy &amp; The Stooges\n\nRaw Power (1973)\n\nThose who say The Stooges' Raw Power is not really punk should shut it. Never mind that the record was mixed like a high school basement tape by David Bowie, or that it was recorded as catharsis for the band's cresting drug-induced nightmare. This album is so punk that it would still terrify your mom a little bit if she just saw the album sleeve sitting on your coffee table, what with its ghost-like, shirtless Iggy Pop in face makeup. Even the ballads that the studio forced Iggy to put on the record (like &quot;Gimme Danger&quot;) exude strains of the dark emotional menace that would follow. --Paul T. Bradley\n\n\n6. Bad Religion\n\nSuffer (1988)\n\n&quot;I make a difference, too,&quot; sings Greg Graffin in the last line of opener &quot;You Are the Government.&quot; It's easy to imagine the words shouted by the kid on the cover art, raising his fist in enflamed rejection -- of Christianity, of Southern California, of suburbia. Suffer signaled a shift toward melody for Bad Religion and laid the groundwork for everything that the group (and a generation of lesser skate-punk acolytes) would ever write: oohs-and-ahhs, PSAT vocabulary words, and that forbidden beat. With each listen, you're 15 again, fist clenched and smiling. --Patrick James\n\n\n5. The Sex Pistols\n\nNever Mind the Bollocks (1977)\n\nThough not Britain's first punk album (The Damned's Damned Damned Damned appeared eight months earlier), Never Mind the Bollocks was the one that gatecrashed the nation's mainstream, debuting at number one despite being banned by major retailers. The Pistols' sole studio full-length is a mid-tempo rock record distinguished by belligerent, vitriolic hooks and Johnny Rotten's tremulous sneer. But on standouts like &quot;Anarchy in the U.K.&quot; and &quot;God Save the Queen,&quot; Bollocks' true refrains are anti-establishment cynicism and sarcasm widely welcomed in the class-ridden Britain that spawned it. --Paul Rogers\n\n\n4. Minor Threat\n\nComplete Discography (1989)\n\nThose who weren't into The Sex Pistols, or weren't quite satisfied by groups like the Dead Kennedys, The Ramones or Sham 69, were often able to find what they were looking for in Minor Threat. The 45-minute discography isn't just a blaze of white-hot hate -- though there is plenty of that (see &quot;Filler,&quot; &quot;I Don't Wanna Hear It&quot; and &quot;In My Eyes&quot;). It's also four phenomenal young musicians, growing from high school angst (&quot;Guilty of Being White&quot;) into more nuanced, and indeed mournful material (&quot;Cashing In&quot; and &quot;Salad Days&quot;). All of this pointed toward the shape of hardcore to come. --Nicholas Pell\n\n\n3. Dead Kennedys\n\nFresh Fruit For Rotting Vegetables (1980)\n\nLyricist/ vocalist Jello Biafra laced his political punk diatribes with a very dark sense of humor on Bay Area group Dead Kennedys' full-length debut. Tracks like &quot;Holiday in Cambodia&quot; and &quot;California Uber Alles&quot; spoke of horrific moments of history and imparted social commentary on the ills of modern society, all backed by a catchy blast of surf rock-infused punk guitars from East Bay Ray. The album enshrined Biafra as one of punk rock's most outspoken political activists, and he's only gotten feistier with age. --Jason Roche\n\n\n2. Black Flag\n\nDamaged (1981)\n\nBlack Flag had been a favorite in the L.A. scene for several years prior to the release of Damaged. But their legacy was cemented by the work, their first full-length release. Henry Rollins had begun as their lead singer, and the combined force of his vocal energy and the discordant noise of guitarist Greg Ginn's riffs made for a powerful explosion of punk rock and hardcore. The subject matter ranged from tortured introspection on songs like &quot;Depression&quot; and &quot;Life of Pain&quot; to charmingly irreverent humor on songs like &quot;TV Party&quot; and &quot;Six Pack.&quot; Meanwhile, we dare anyone to listen to opener &quot;Rise Above&quot; and not shout-along with the refrain. It can't be done.\n\n--Jason Roche\n\n\n1. The Ramones\n\nSelf-Titled (1976)\n\nForget about The Stooges, Patti Smith and The Dicatators: The Ramones' self-titled album is ground zero for punk rock. The opening chords of &quot;Blitzkrieg Bop&quot; are the first salvo of a takeover, even with nothing more than a simple &quot;Louie, Louie&quot; chord progression. &quot;Beat on the Brat&quot; and &quot;Judy Is a Punk&quot; show just how versatile this bare bones approach can be, while &quot;I Wanna Be Your Boyfriend&quot; acknowledges a debt to late-'60s bubblegum and girl group pop. &quot;Chain Saw,&quot; &quot;Now I Wanna Sniff Some Glue&quot; and &quot;I Don't Wanna Go Down to the Basement,&quot; showcase the band's sense of weirdo humor. A cover of the Chris Montez hit &quot;Let's Dance&quot; betrays the Ramones' revolution as a deeply conservative one, a return to form after years of &quot;progress.&quot; --Nicholas Pell\n\nDescriptions Source - LA Weekly - Top 20 Punk Albums in History: The Complete List","torrent":{"xt":"urn:btih:28369f1ae3bcec7f00c8dd62d75d44f7811d5cf4","amp;dn":"Ten+Must+Have+Essential+Punk+Albums+%5B-emidius-%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28369f1ae3bcec7f00c8dd62d75d44f7811d5cf4","infoHashBuffer":{"type":"Buffer","data":[40,54,159,26,227,188,236,127,0,200,221,98,215,93,68,247,129,29,92,244]},"announce":[],"urlList":[]}}