{"title":"Unholy Wars Afghanistan, America and International Terrorism By ","uid":4752866,"size":2701457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:283d3bf05443dfc9887b1be892daf0e542dcf261&amp;dn=Unholy+Wars+Afghanistan%2C+America+and+International+Terrorism+By+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dodgerblue","files":3,"time":1236285900,"description":"Unholy Wars: Afghanistan, America and International Terrorism By John K. Cooley-SHAREGO\nUnholy Wars: Afghanistan, America and International Terrorism By John K. Cooley-SHAREGO\nPublisher: Pluto Press (UK) 2000 | 288 Pages | ISBN: 0745316913 | PDF | 1.76 MB\n\n[IMG]http://i269.photobucket.com/albums/jj44/downarchive2/member2/UnholyWars-AfghanistanAmericaandInt.jpg[/IMG]\nTo oppose the Soviet invasion in Afghanistan in 1979, the United States formed an extraordinary anti-Communist alliance with militant Islamic forces in South Asia. John Cooley describes the development of U.S. foreign policy and CIA covert activity in the 1980s, which facilitated the training and arming of almost a quarter of a million Islamic mercenaries drawn from around the world. Cooley marshals a wealth of evidence to demonstrate the devastating consequences of this alliance between the U.S. government and radical Islam--from the assassination of Sadat, the destabilization of Algeria and Checnya and the emergence of the Taliban, to the bombings of the World Trade Center and the US embassies in Africa.\n\nCooleye examines the crucial role of Pakistan's military intelligence organization; uncovers China's involvement and its aftermath; the extent of Saudi financial support; the role of &quot;America's most wanted man.&quot; the guerrilla leader Osama bin Laden; the BCCI connection; and the CIA's cynical promotion of drug traffic to the Golden Crescent. UNHOLY WARS seeks out the lessons to be learned from this still unfolding drama.\n\nThis completely revised edition examines the new terrorist conspiracy network uncovered in the US and Canada, linked to Bin Laden since December 1999. It also covers the many important events in Pakistan since the military coup of October 1999 and the impact of this on Indo-Pakistani relations. Cooley also focuses on recent events in Algeria, which have been linked to the role of the &quot;Afghanis&quot; in the extremist GIA whose members are involved in the new US-Canada conspiracies.\n[img]http://1337x.org/torrentimg-13909.png[/img]","torrent":{"xt":"urn:btih:283d3bf05443dfc9887b1be892daf0e542dcf261","amp;dn":"Unholy+Wars+Afghanistan%2C+America+and+International+Terrorism+By+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"283d3bf05443dfc9887b1be892daf0e542dcf261","infoHashBuffer":{"type":"Buffer","data":[40,61,59,240,84,67,223,201,136,123,27,232,146,218,240,229,66,220,242,97]},"announce":[],"urlList":[]}}