{"title":"Baldur's Gate II v1.3 enhanced edition mod + data [apkpita]","uid":15168740,"size":2602227045,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:290c1fe5bee04756b0102187758012e90d6033f4&amp;dn=Baldur%27s+Gate+II+v1.3+enhanced+edition+mod+%2B+data+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tiropitaki","files":3,"time":1467373817,"description":"Kidnapped. Imprisoned. Tortured. The wizard Irenicus holds you captive in his stronghold, attempting to strip you of the powers that are your birthright.\r\n\r\nCan you resist the evil within you, forge a legend of heroic proportions, and ultimately destroy the dark essence that haunts your dreams? Or will you embrace your monstrous nature, carve a swath of destruction across the realms, and ascend to godhood as the new Lord of Murder?\r\n\r\nBaldur’s Gate II: Enhanced Edition includes the original Shadows of Amn campaign, as well as the following expansions:\r\n\r\n* Throne of Bhaal: Travel to Tethyr in this thrilling conclusion to the Bhaalspawn saga, and delve into the treasure-filled halls of Watcher’s Keep!\r\n* Fist of the Fallen: Help the Sun Soul Monk Rasaad find peace in his quest for vengeance, and determine the fate of a heretical sect.\r\n* The Black Pits II: Gladiators of Thay: Explore the tactical depth of high-level Dungeons &amp; Dragons combat. Turn your captors against each other while you dodge traps and battle for your life against Demi-Liches, Mind Flayers, and the legendary Githyanki.\r\n\r\nBaldur's Gate II: Enhanced Edition also offers the following premium content available in the torrent:\r\n\r\n* A Price Paid in Blood: Join the Blackguard Dorn in carving a swath of destruction across the Realms, as he struggles to appease the increasingly bloody demands of his dark patron.\r\n* A Voice in the Dark: Recruit the mysterious Thief Hexxat and take up her mission of retrieving long-lost artifacts from tombs as far away as Zakhara.\r\n* In Defense of the Wild: Protect the innocent and stand with Neera the Wild Mage against a ruthless school of Red Wizards.\r\n\r\nNote: All translations are text only. Voice-overs are played in English.\r\n\r\nWhat’s new:\r\nFixes Samsung lollipop black screen bug.\r\nFixed transparent water on OpenGL3\r\nFixed demogorgon crash\r\n\r\nRequirements: Android OS 3.0 and up\r\nInstall APK. Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:290c1fe5bee04756b0102187758012e90d6033f4","amp;dn":"Baldur%27s+Gate+II+v1.3+enhanced+edition+mod+%2B+data+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"290c1fe5bee04756b0102187758012e90d6033f4","infoHashBuffer":{"type":"Buffer","data":[41,12,31,229,190,224,71,86,176,16,33,135,117,128,18,233,13,96,51,244]},"announce":[],"urlList":[]}}