{"title":"Time Machine  BBC Documentary","uid":6770392,"size":202542962,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:293de88fe0314365e291a1bc8720ecbab3937047&amp;dn=Time+Machine++BBC+Documentary+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Oromia","files":1,"time":1319553984,"description":"\n\nDiscover the spectacular events that shaped the world - as if you were there. Time-lapse photography techniques are combined with cutting-edge graphics to condense millions of years into seconds, bringing the incredible history of Earth vividly to life.\n\nIn 'The World Shaped by Time', viewers witness the unseen forces that shape the great landscapes on our planet as only exposed by manipulating time. 'The Race Against Time' tells the story of how life is shaped by the natural rhythms of day, months and years. And in 'Masters of Time', the mystery of how we, as people, experience time is unravelled.\n\nLife is in a race against Time to survive: from the time of birth to death. Every living thing has to cram in growing up, feeding and reproducing throughout its lifetime. Caught in the cycle of sun and the moon, life adapts as a slave to these clock. From jellyfish that commute in their thousands to soldier crabs that march back and forth on a beach, they all move to the celestial timepiece of the planets.\n\nWhether it is daily opening of a flower's petals or the evolution of the hummingbird over thousands of years, life operates on many different time-scales. We explore how caribou struggle over thousands of kilometres in their race against the dramatically changing seasons. By playing with Time, we will distort your perception to reveal some of life's incredible strategies to global changes. But can anything conquer time and live forever -- is there a secret to eternal life? Well, something close to all of us may have the answer!","torrent":{"xt":"urn:btih:293de88fe0314365e291a1bc8720ecbab3937047","amp;dn":"Time+Machine++BBC+Documentary+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"293de88fe0314365e291a1bc8720ecbab3937047","infoHashBuffer":{"type":"Buffer","data":[41,61,232,143,224,49,67,101,226,145,161,188,135,32,236,186,179,147,112,71]},"announce":[],"urlList":[]}}