{"title":"Golden Age Comics: Fox - Feature","uid":3985374,"size":1193196703,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:29793b739f222394463d00fb7aa389832b57ddb3&amp;dn=Golden+Age+Comics%3A+Fox+-+Feature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"citaltras","files":64,"time":1200779734,"description":"FOX FEATURE COMICS\nGOLDEN AGE COMICS\nIncluding comics from the series:\n- Blue Beetle (1940)\n- Jo-Jo (1947)\n- Phantom Lady (1947)\n- Rulah (1948)\n- The Bouncer (1944)\n- The Flame (1940)\n- Wonderworld Comics (1939)\n- Zago (1948)\n- Zegra (1948)\n- Zoot (1947)\nand many more....\nEnjoy and seed\n\nFrom Wikipedia&gt;\n\n Victor A. Fox and business associate Bob Farrell launched Fox Feature Syndicate at 480 Lexington Avenue in New York City in the late 1930s. For content, Fox contracted with comics packager Eisner &amp; Iger, one of a handful of companies creating comic books on demand for publishers entering the field. Writer-artist Will Eisner, at Victor Fox&amp;#039;s request for a hero to mimic the newly created hit Superman, created the superhero Wonder Man for Fox&amp;#039;s first publication, Wonder Comics #1 (May 1939), signing his work &quot;Willis&quot;. Superman owner National Periodical Publications, the company that would evolve into DC Comics, cited copyright infringement and quickly obtained a permanent injunction. Wonder Man did not reappear. After Eisner testified against Fox at trial, Fox dropped the packager and hired his own stable of comic creators, beginning with a New York Times classified ad on Dec. 2, 1939. Joe Simon, a former Eisner &amp; Iger freelancer, became Fox Publications&amp;#039; editor. As one of the earliest companies in the emerging field, it employed or bought the packaged material of a huge number of Golden Age greats, many at the start of their careers. Lou Fine created the superhero The Flame in Wonderworld Comics; Dick Briefer created Rex Dexter of Mars&quot; in the eponymous series. George Tuska did his first comics work here with the features &quot;Zanzibar&quot; (Mystery Men Comics #1, Aug. 1939) and &quot;Tom Barry&quot; (Wonderworld Comics #4). Fletcher Hanks wrote and drew Stardust the Super Wizard in Fantastic Comics in 1939 to 1940. Matt Baker, one of the few African-American comic book artists of the Golden Age, revamped ? in more than one sense ? the newly acquired Quality Comics character Phantom Lady&amp;#039; in 1947, creating one of the most memorable and controversial examples of superhero &quot;good girl art&quot;. Future comics legend Jack Kirby, brought on staff here after freelancing for Eisner &amp; Iger, wrote and drew the syndicated newspaper comic strip The Blue Beetle (starting Jan. 1940), starring a character created by Charles Nicholas Wojtkowski in Mystery Men Comics #1 (Aug. 1939). Kirby retained the house name &quot;Charles Nicholas&quot; for the comic strip, which lasted three months. Kirby, additionally, created and did one story each of the Fox features &quot;Wing Turner&quot; (Mystery Men #10, May 1940) and &quot;Cosmic Carson&quot; (Science Comics #4, same month). Throughout the 1940s, Fox produced comics in a typically wide variety of genres, but was best known for superheroes and humor. With the post-war decline in superheroes&amp;#039; popularity, Fox, like other publishers, concentrated on horror and crime comics, including some of the most notorious of the latter. Following the establishment of Comics Code Authority in the mid-1950s, Fox went out of business, selling the rights to the Blue Beetle to Charlton Comics.\n\n\n\t\t\nTorrent Info\t\n\nEdit this .torrent\nDL Torrent\tFox Feature tbox.torrent\nInfo hash\t29793b739f222394463d00fb7aa389832b57ddb3\nCategory\tComics\nSize\t1.11 GB (1193196703 Bytes)\nAdded\t2008-01-19\nViews\t0\nHits\t0","torrent":{"xt":"urn:btih:29793b739f222394463d00fb7aa389832b57ddb3","amp;dn":"Golden+Age+Comics%3A+Fox+-+Feature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29793b739f222394463d00fb7aa389832b57ddb3","infoHashBuffer":{"type":"Buffer","data":[41,121,59,115,159,34,35,148,70,61,0,251,122,163,137,131,43,87,221,179]},"announce":[],"urlList":[]}}