{"title":"[Ruqian_Lu,_Songmao_Zhang]Automatic Generation of Computer Anima","uid":11047390,"size":3997318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a33a51f36fe0ba73d7a841c147e0615a775dbdd&amp;dn=%5BRuqian_Lu%2C_Songmao_Zhang%5DAutomatic+Generation+of+Computer+Anima&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410968825,"description":"We are both fans of watching animated stories. Every evening, before or after d- ner, we always sit in front of the television and watch the animation program, which is originally produced and shown for children. We find ourselves becoming younger while immerged in the interesting plot of the animation: how the princess is first killed and then rescued, how the little rat defeats the big cat, etc. But what we have found in those animation programs are not only interesting plots, but also a big chance for the application of computer science and artificial intelligence techniques. As is well known, the cost of producing animated movies is very high, even with the use of computer graphics techniques. Turning a story in text form into an animated movie is a long and complicated procedure. We came to the c- clusion that many parts of this process could be automated by using artificial - telligence techniques. It is actually a challenge and test for machine intelligence. So we decided to explore the possibility of a full life cycle automation of c- puter animation generation. By full life cycle we mean the generation process of computer animation from a children s story in natural language text form to the final animated movie. It is of course a task of immense difficulty. However, we decided to try our best and to see how far we could go.\n\nPublisher: Springer; 2002 edition (January 23, 2002)\nLanguage: English\nISBN-10: 3540431144\nISBN-13: 978-3540431145\n\n","torrent":{"xt":"urn:btih:2a33a51f36fe0ba73d7a841c147e0615a775dbdd","amp;dn":"%5BRuqian_Lu%2C_Songmao_Zhang%5DAutomatic+Generation+of+Computer+Anima","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a33a51f36fe0ba73d7a841c147e0615a775dbdd","infoHashBuffer":{"type":"Buffer","data":[42,51,165,31,54,254,11,167,61,122,132,28,20,126,6,21,167,117,219,221]},"announce":[],"urlList":[]}}