{"title":"The Moody Blues - I'm Just a Singer (In a Rock and Roll Band) [p","uid":12171746,"size":227774464,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2a6b50bf682f2a557a6e02c38196dc9cc97132f7&amp;dn=The+Moody+Blues+-+I%27m+Just+a+Singer+%28In+a+Rock+and+Roll+Band%29+%5Bp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":1,"time":1438219986,"description":"The Moody Blues - I'm Just a Singer (In a Rock and Roll Band) [promo].VOB\n\n\nHQ rare music video from a promo DVD. &quot;I'm Just a Singer (In a Rock and Roll Band)&quot; is a hit 1973 single by the English progressive rock band The Moody Blues. It was first released in 1972 as the final track on the album Seventh Sojourn. &quot;I'm Just a Singer (In a Rock and Roll Band)&quot; was later released as a single in 1973, with &quot;For My Lady&quot; on the B-side. It was the second single released from Seventh Sojourn, with the first being &quot;Isn't Life Strange&quot; (also written by John Lodge).\n\n&quot;I'm Just a Singer (In a Rock and Roll Band)&quot; was written by the Moody Blues' bassist John Lodge, who won an ASCAP songwriting award for it. It is one of John Lodge's signature high-energy rock and roll songs, and is one of his best-known compositions for the Moody Blues, along with &quot;Ride My See-Saw.&quot;\n\n&quot;I'm Just a Singer (In a Rock and Roll Band)&quot; was the final single by The Moody Blues to feature the use of the Chamberlin (which had recently replaced the similar instrument, the Mellotron). The Chamberlin would later be replaced by a more modern keyboard synthesizer.\n\nA promotional music-video was filmed for &quot;I'm Just a Singer (In a Rock and Roll Band)&quot;. This video showed The Moody Blues' flautist Ray Thomas playing a Baritone Saxophone. However, the saxophone was used just for effect in the video. The saxophone sound actually comes from the Chamberlin.\n\n&quot;I'm Just a Singer (In a Rock and Roll Band)&quot; reached #12 on the Billboard Hot 100 in the U.S., becoming one of their highest-charting hits in that country, but fared less well in their native UK, where it managed #36. It was also the final single released by the Moody Blues prior to their five year hiatus, which was agreed upon so each of the band members could pursue their own solo careers. Their next single would not be until 1978, with &quot;Steppin' in a Slide Zone.&quot;\n\n\nThe Moody Blues are an English rock band. Among their innovations was a fusion with classical music, as heard in their 1967 album Days of Future Passed.\n\nThe Moody Blues formed on 4 May 1964, in Erdington, Birmingham, Warwickshire. Ray Thomas, a juvenile John Lodge and (occasionally) Mike Pinder had been members of El Riot &amp; the Rebels. They disbanded when Lodge, the youngest member, went to technical college and Pinder joined the army. Pinder then rejoined Thomas to form the Krew Cats. Back from a disappointing spell in the Hamburg region a few months later,[6] the pair recruited guitarist/vocalist Denny Laine, band manager-turned-drummer Graeme Edge and bassist Clint Warwick. The five appeared as the Moody Blues for the first time in Birmingham in 1964. The name developed from a hoped-for sponsorship from the M&amp;B Brewery which failed to materialise, the band calling themselves both &quot;The M Bs&quot; and &quot;The M B Five&quot; and was also a subtle reference to the Duke Ellington song, &quot;Mood Indigo&quot;.[7] Around this time the band were the resident group at the Carlton Ballroom, later to become rock music venue Mothers on Erdington High Street.\n\nSoon, the band obtained a London-based management company, 'Ridgepride', formed by ex-Decca A&amp;R man Alex Murray (Alex Wharton), who helped them land a recording contract with Decca Records in the spring of 1964. Initially they were signed to a management company who then leased their recordings to Decca. They released a single, &quot;Steal Your Heart Away&quot;, that year which failed to chart. The Moody Blues appeared on the cult TV programme Ready Steady Go! singing the uptempo 'B' side &quot;Lose Your Money (But Don't Lose your Mind)&quot;. But it was their second single, &quot;Go Now&quot; (released later that year), which really launched their career, being promoted on TV with one of the first purpose-made promotional films in the pop era, produced and directed by Alex Wharton. The single became a hit in Britain (where it remains their only Number 1 single)[8] and in the United States, where it reached No.10. The band encountered management problems after the chart-topping hit and subsequently signed to Decca Records in the UK (London Records in the US) as actual recording artists. A four track extended play release titled: &quot;The Moody Blues&quot; featuring both sides of their first two Decca singles was issued in a colour picture sleeve in early 1965.\n\nThe Moody Blues continued extensive touring in 2015 in both the USA and an extensive UK tour in June of that year, culminating in a debut appearance at the 2015 Glastonbury Festival on 27 June 2015.\n\nThe Moody Blues have sold more than 70 million albums worldwide and have been awarded 18 platinum and gold discs. As of 2015 they remain active with one member from the original 1964 band (drummer Graeme Edge) and two more from the 1966 lineup (bassist John Lodge and guitarist Justin Hayward).\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/I%27m_Just_a_Singer_(In_a_Rock_and_Roll_Band)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/I%27m_Just_a_Singer_(In_a_Rock_and_Roll_Band)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/3yeti75g5/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/3yeti75g5/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25fps 5100kbps\n   Audio: DTS Digital 48000Hz 5 channels 1536kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:04:13\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.9\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:2a6b50bf682f2a557a6e02c38196dc9cc97132f7","amp;dn":"The+Moody+Blues+-+I%27m+Just+a+Singer+%28In+a+Rock+and+Roll+Band%29+%5Bp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a6b50bf682f2a557a6e02c38196dc9cc97132f7","infoHashBuffer":{"type":"Buffer","data":[42,107,80,191,104,47,42,85,122,110,2,195,129,150,220,156,201,113,50,247]},"announce":[],"urlList":[]}}