{"title":"How Yo Be A Graphic Designer, Without Losing Your Soul.zip","uid":4433628,"size":24179599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a994dc3fb1f49f2985f0cfed6de3a957aafbb84&amp;dn=How+Yo+Be+A+Graphic+Designer%2C+Without+Losing+Your+Soul.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mcfilthynasty","files":1,"time":1223419465,"description":"How To Be a Graphic Designer\n Info:\nCommunication Arts, November 23, 2005\nHis likable and generous voice guides young designers toward civility and integrity in their approach to a life in design.\n\n\n\n\n\n\nBook Description\nDesigners are quick to tell us about their sources of inspiration, but they are much less willing to reveal such critical matters as how to find work, how much they charge, and what to do when a client rejects three weeks of work and refuses to pay the bill. How to be a graphic designer without losing your soul addresses the concerns of young designers who want to earn a living by doing expressive and meaningful work, and who want to avoid becoming hired drones working on soulless projects. Written by a designer for designers, it combines practical advice with philosophical guidance to help young professionals embark on their careers.\nHow should designers manage the creative process? What&amp;#039;s the first step in the successful interpretation of a brief? How do you generate ideas when everything just seems blank? How to be a graphic designer offers clear, concise guidance for these questions, along with focused, no-nonsense strategies for setting up, running, and promoting a studio, finding work, and collaborating with clients.\nThe book also includes inspiring interviews with ten leading designers, including Rudy VanderLans (Emigre#, John Warwicker #Tomato#, Neville Brody #Research Studios#, and Andy Cruz #House Industries#. All told, How to be a graphic designer covers just about every aspect of the profession, and stands as an indispensable guide for any young designer.\n# 160 pages\n# Publisher: Princeton Architectural Press #September 22, 2005)\n# Language: English\n\n\nEnjoy","torrent":{"xt":"urn:btih:2a994dc3fb1f49f2985f0cfed6de3a957aafbb84","amp;dn":"How+Yo+Be+A+Graphic+Designer%2C+Without+Losing+Your+Soul.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a994dc3fb1f49f2985f0cfed6de3a957aafbb84","infoHashBuffer":{"type":"Buffer","data":[42,153,77,195,251,31,73,242,152,95,12,254,214,222,58,149,122,175,187,132]},"announce":[],"urlList":[]}}