{"title":"MAGNIFICO.DVDRip. niwreshy","uid":4383201,"size":734234624,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2ab939d22c74c595dcb427d36fe3f51d2e373ca7&amp;dn=MAGNIFICO.DVDRip.+niwreshy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"niwresh","files":1,"time":1220778160,"description":"Nang maospital at magkasakit ang kanyang lola (Gloria Romero), namulat ang musmos na kaisipan ni Magnifico (Jiro Manio) sa maraming komplikasyon ng buhay at kamatayan. Minsan ay narinig niyang nagtatalo ang kanyang nanay (Lorna Tolentino) at tatay (Albert Martinez) tungkol sa hirap ng buhay at gastos ng pagpapalibing kung sakaling mamatay ang kanyang lola. Nakadagdag pa sa kanilang suliranin ang pagkakaalis ng scholarship ng kanyang kuya (Danilo Barrios) at ang kapansanan ng nakababatang kapatid na si Helen ( Isabella de Leon) na hindi makalakad at di makapagsalita. Dahil dito'y nagsimulang mag-isip si Magnifico kung paano siyang makakatulong sa mga problema ng kanyang mga magulang.  Lingid sa kaalaman ng lahat, unti-unting binuo ni Magnifico ang kabaong na para sa kanyang lola sa tulong ng kanyang kalaro ( Joseph Robles). Nag-isip din sila ng paraan upang makalikom ng sapat na pera at puspusang inasikaso ni Magnifico ang bawat detalye sa magiging libing ng kanyang mahal na lola. Kasabay nito'y pawang pasan niya ang napakarami pang problema sa daigdig at sa kanyang munting paraan ay ninais niyang masolusyunan ang mga ito sa pagnanais niyang makatulong sa kabila ng kanyang kamusmusan.\n\nIsang matapat at masinop na cinema verite ang Magnifico na talaga namang aantig sa puso ng sinumang makakapanood nito. Hindi melodramatic ang takbo ng kuwento  na walang bida at kontrabida kundi mga tunay na tao lamang na nasadlak sa mga kani-kanilang sitwasyon. Ang punto de bista ng batang si Magnifico ay malinaw at hindi naligaw hanggang sa katapusan ng pelikula. Payak at hindi pilit ang pagkakaganap ng lahat ng tauhan lalong-lalo na ang mga batang sina Jiro Manio, Joseph Robles at Isabella de Leon.  Ang pawang eksperimental na pagtrato sa sinematograpiya ay nagpaantig pang lalo sa pagiging makatotohanang kuwento. May ilang gaspang lamang sa tunog na maaari namang palagpasin at ang anupamang kakulangang teknikal ay natabunan ng maayos na editing at mahusay na direksiyon. Ang resulta'y parang hindi pelikula kundi isang malaking bintana sa tunay na buhay na nabuksan sa mata ng isang paslit.\n\nHindi madalas na makapanood ng pelikulang kasingtapat at kasingpayak ng Magnifico na may layuning magsabog ng pag-asa at kabutihan sa kabila ng nagdadagsaang mga pelikulang kundi karahasan ay hubad na katawan ang pambenta. Labis na ikinagagalak ng CINEMA ang pagkakaroon ng isang pelikulang bagama't hindi nagsesermon ay malakas na kukurutin ang iyong puso na gumawa ng kabutihan sa kapwa ng walang hinihintay na kapalit. Para kay Magnifico, ang pagtulong, pagmamahal at pagbibigay ay likas sa puso ng bawat isa.  Kahanga-hangang bagama't madalas sa minsan ay hindi nasusuklian ang kabutihan ni Magnifico, patuloy pa rin siya sa kanyang mabuting hangarin. Hindi siya nawalan ng loob bagama't hindi parating umaayon ang kapalaran sa kanya. Mapagninilayan sa pelikula ang tunay na kahulugan ng buhay at kamatayan sa mata ng isang bata.  Sa bandang huli'y mapatutunayan na nagbubunga rin ang paggawa ng kabutihan.  Habang abala ang karamihan sa paghahangad ng yaman sa mundo, at sa pagsusubok na baguhin ang masalimuot na daigdig, narito ang  isang pelikulang nagsasabing ang mundo ay magbabago kung  makikita lamang ito ng mga tao sa mata ng isang batang tulad ni Magnifico.\n\nmaginfico... awardee.... filipino go!!!!!","torrent":{"xt":"urn:btih:2ab939d22c74c595dcb427d36fe3f51d2e373ca7","amp;dn":"MAGNIFICO.DVDRip.+niwreshy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ab939d22c74c595dcb427d36fe3f51d2e373ca7","infoHashBuffer":{"type":"Buffer","data":[42,185,57,210,44,116,197,149,220,180,39,211,111,227,245,29,46,55,60,167]},"announce":[],"urlList":[]}}