{"title":"Alfred Hitchcock Classics - Farmers Wife - Sorcerer's Apprentice","uid":9564640,"size":7152912384,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2abff2fa719c6e1aa131bd1426c827c75e1970eb&amp;dn=Alfred+Hitchcock+Classics+-+Farmers+Wife+-+Sorcerer%27s+Apprentice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"SaM","files":-1,"time":1391486571,"description":"Alfred Hitchcock Classics - Farmers Wife - Sorcerer's Apprentice - Blackmail - The Manxman - DVD9 [DDR]\n\nAlfred Hitchcock Classics - Farmers Wife (1928) Silent\n\nThe Farmer's Wife is a 1928 British silent romantic comedy film directed by Alfred Hitchcock and starring Jameson Thomas, Lillian Hall-Davis and Gordon Harker.\nIt was made by British International Pictures at Elstree Studios. It was based on a play of the same name by British novelist, poet and playwright Eden Phillpotts, best known for a series of novels based on Dartmoor, in Devon.\n\nCAST:-\nJameson Thomas - Samuel Sweetland\nLillian Hall-Davis - Araminta Dench, his Housekeeper\nGordon Harker - Churdles Ash: his Handyman\nGibb McLaughlin - Henry Coaker\nMaud Gill - Thirza Tapper\nLouie Pounds - Widow Windeatt\nOlga Slade - Mary Hearn: Postmistress\nRuth Maitland - Mercy Bassett\nAntonia Brough - Susan\nHaward Watts - Dick Coaker\n\nDirected by Alfred Hitchcock\nWritten by Eden Phillpotts, Eliot Stannard\nRunning time 129 minutes\n\nSYNOPSIS:- The Farmers Wife (1928) Silent\nTibby, the wife of Samuel Sweetland (Jameson Thomas) dies, and shortly afterwards his daughter marries and leaves home, leaving him on his own with his two servants. His wife had told him that he should remarry after her death, so he pursues some local spinsters who were at his daughter's wedding after he and his housekeeper Minta (Lillian Hall-Davis) make out a list of possibles.\n\nFirst is widow Louisa Windeatt, but Sweetland is shocked and mad when she rejects his advances and says she is too independent for him. Next, he attempts to court Thirza Tapper, a confirmed spinster and nervous wreck who almost collapses when Sweetland proposes to her. She, too, rejects him because she says she has no need for a man, and he is furious yet again. He wanders outside as other guests arrive for her party. His servant Ash is helping at the party and Ash steals the scene here as a bolshie butler wearing an ill-fitting coat and trying to keep his trousers up while doing his work at the party.\n\nWhile the others are outside listening to some singers, Sweetland proposes to Mary Hearn, but she rejects him as too old, but then goes into hysterics when he angrily tells her that she is &quot;full blown and a bit over.&quot;\n\nLater Sweetland tells Minta that he is not going to finish the list of women because he is so dejected. He leaves the room and Ash returns and tells Minta what an embarrassment to men that Sweetland is by going around and practically begging any woman to be his wife. Sweetland overhears this and orders Ash to saddle his horse because he is going to try number four, Mercy Bassett, a barmaid at a local inn. After he, Minta is in love with him. Bassett rejects him too and he comes home dejectedly. Meanwhile postmistress Hearn and Tapper compare notes and Hearn decides she should marry him after all and she goes to his house with Tapper.\n\nHaving run through the women who have turned him down, Samuel sees Minta for the first time as more than a housekeeper and decides that she is the woman for him, if she'll have him. He tells her he has got used to being rejected and will not be angry if she rejects him, too. She accepts him and he tells her to put on the dress Tibby gave her. As she goes to the room, Hearn and Tapper arrive. Hearn says she is now willing to be his wife. Samuel says all should drink a toast to his wife to be and Hearn is sure it is her till Minta comes down the stairs in an attractive dress. Hearn lapses into hysterics as the couple get together.\n\n===================================================================================\n\nAlfred Hitchcock Classics - Blackmail (1929)\n\nBlackmail is a 1929 British thriller drama film directed by Alfred Hitchcock and starring Anny Ondra, John Longden, and Cyril Ritchard. Based on the play Blackmail by Charles Bennett, the film is about a London woman who kills a man when he tries to rape her.\n\nAfter starting production as a silent film, British International Pictures decided to convert Blackmail into a sound film during filming. A silent version was released for theaters not equipped for sound (at 6740 feet), with the sound version (7136 feet) released at the same time. The silent version still exists in the British Film Institute collection.\n\nCAST:-\nAnny Ondra as Alice White\nSara Allgood as Mrs. White\nCharles Paton as Mr. White\nJohn Longden as Detective Frank Webber\nDonald Calthrop as Tracy\nCyril Ritchard as Mr. Crewe, an artist\nHannah Jones as the landlady\nHarvey Braban as the Chief Inspector (sound version)    \n\nDirected by Alfred Hitchcock\nProduced by John Maxwell\nScreenplay by Alfred Hitchcock (adaptation)\nMusic by \tJimmy Campbell and Reg Connelly\nRunning time 84 minutes\n\nSYNOPSIS:- Blackmail (1929)\nScotland Yard Detective Frank Webber (John Longden) escorts his girlfriend Alice White (Anny Ondra) to a tea house. They have an argument and Frank storms out. While reconsidering his action, he sees Alice leave with Mr. Crewe (Cyril Ritchard), a painter she had earlier agreed to meet.\n\nCrewe persuades a reluctant Alice into coming up to see his artists studio. She admires a painting of a laughing clown, and uses his palette and brushes to paint a cartoonish drawing of a face; he adds a few strokes of a feminine figure, and they both sign the &quot;work&quot;. He gives her a dancer's outfit and Crewe sings and plays &quot;Miss Up-to-Date&quot; on the piano.\n\nCrewe steals a kiss, to Alice's disgust, but as she is undressing and preparing to leave, he takes her dress from the changing area. He attempts to rape her, even though the police on the street below do not hear her cries for help. In desperation, Alice grabs a nearby bread knife and kills him. She angrily punches a hole in the painting of the clown, then leaves after attempting to remove any evidence of her presence in the flat, but forgets to take her gloves. She walks the streets of London all night in a daze.\n\nWhen the body is found, the killing is assumed to be murder. Frank is assigned to the case and finds one of Alice's gloves. He recognizes both the glove and the dead man, but conceals this from his superior. Taking the glove, he goes to speak with Alice at her father's tobacco shop, but she is still too distraught to speak.\n\nBut as they hide from her father in a telephone booth, Tracy (Donald Calthrop), the model for the clown, arrives. He had seen Alice go up to Crewe's flat, and gone in and taken one of the gloves. When he sees Frank with the other one, he attempts to blackmail the couple. His first demands are petty ones and they accede. Then Frank learns by phone that Tracy is wanted for questioning: he was seen near the scene and has a criminal record. Frank sends for policemen and tells Tracy he will pay for the murder.\n\nAlice is squeamish about Tracy being prosecuted for what she did, but still does not speak up. The tension mounts. When the police arrive, Tracy's nerve finally breaks and he flees. The chase leads to the British Museum, where he clambers onto the domed roof of the Reading Room, but slips, crashes through a skylight, and falls to his death inside. The police assume he was guilty of murder.\n\nUnaware of this, Alice finally feels compelled to give herself up and goes to New Scotland Yard. She writes a confession letter and goes to see the Chief Inspector. Before she can bring herself to confess, the inspector receives a telephone call and asks Frank to deal with Alice. She finally tells him the truth -- that it was self-defense against an attack she cannot bear to speak of -- and they leave together. As they do, a policeman walks past, carrying the damaged painting of the laughing clown and the canvas where Alice has painted over her name and Crewe's.\n\n===================================================================================\n\nAlfred Hitchcock Classics - The Manxman (1929) Silent\n\nThe Manxman is a 1929 British silent drama film directed by Alfred Hitchcock and starring Anny Ondra, Carl Brisson and Malcolm Keen. The film is based on a popular 1896 romantic novel The Manxman by Hall Caine, which had previously been made into a 1917 film. This was the last silent film Hitchcock directed before he made the transition to sound film with his next film Blackmail.\n\n    CAST:-\n    Carl Brisson - Pete Quilliam\n    Malcolm Keen - Philip Christian\n    Anny Ondra - Kate Cregeen\n    Randle Ayrton - Caesar Cregeen\n    Clare Greet - Mother (as Claire Greet)\n    Kim Peacock - Ross Christian (uncredited)\n    Nellie Richards - Wardress (uncredited)\n    Wilfred Shine - Doctor (uncredited)\n    Harry Terry - Man (uncredited)\n\nDirected by Alfred Hitchcock\nProduced by John Maxwell\nWritten by Hall Caine (novel), Eliot Stannard (scenario)\nRunning time 110 minutes\n\nSYNOPSIS:- The Manxman (1929 Silent\nThe film tells the story of two childhood friends, a poor fisherman, Pete Quilliam (Carl Brisson), and a lawyer, Philip Christian (Malcolm Keen). Pete is in love with Kate (Anny Ondra), but when her father, Old Caesar (Randle Ayrton), refuses to consent to their marriage, Pete sets off for Africa to make his fortune, asking Philip to take care of Kate until he returns.\n\nIn his absence, Kate and Philip fall in love. When news reaches them that Pete was killed, they begin planning their lives together, as Philip prepares to assume the position of Deemster, the island's chief magistrate. The news is false however, and Pete returns to the island a wealthy man. Old Caesar agrees to let Kate marry him, and neither she nor Philip have it in them to break Pete's heart. As the wedding party proceeds in an old mill, Old Caesar sternly warns the newlyweds to remember how serious the vows of marriage are.\n\nKate is still in love with Philip. Shortly after a daughter is born, she decides to leave Pete, leaving him both the child and a note saying that she loves another man. However, Philip is about to become the Deemster and is unwilling to give up his career for her. Frustrated, she returns to Pete to take the baby, telling him that he is not the father, but he refuses to believe her or hand the child over. Distraught, Kate leaves and attempts to commit suicide by throwing herself off the quay, a crime on the Isle of Man.\n\nKate is brought to trial on the first day that Philip serves as Deemster. He is reluctant to sentence her, and when Pete appears in the courtroom to plead for his wife, he agrees to hand her over to him. Kate refuses to go, and Old Caesar, who is watching, gets up and condemns Philip for being the &quot;other man&quot;. Philip admits this and leaves the court.\n\nIn the final scene, Philip and Kate prepare to leave the Isle of Man and come to Pete's house to pick up the baby. In a shot reminiscent of the theater, Kate picks up the child, while Philip and Pete stand at opposite ends of the room. She brings the child over to Pete to say one last goodbye, and he breaks down, having lost everything. Philip and Kate leave the cottage to the jeers of the villagers, who have been watching the scene.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 345 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 345mins","torrent":{"xt":"urn:btih:2abff2fa719c6e1aa131bd1426c827c75e1970eb","amp;dn":"Alfred+Hitchcock+Classics+-+Farmers+Wife+-+Sorcerer%27s+Apprentice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2abff2fa719c6e1aa131bd1426c827c75e1970eb","infoHashBuffer":{"type":"Buffer","data":[42,191,242,250,113,156,110,26,161,49,189,20,38,200,39,199,94,25,112,235]},"announce":[],"urlList":[]}}