{"title":"Mississippi John Hurt The Complete Studio Recordings (Vanguard)","uid":5440473,"size":642172443,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2b6659ab8273653a3a1f585bd2a635882870fe1a&amp;dn=Mississippi+John+Hurt+The+Complete+Studio+Recordings+%28Vanguard%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":51,"time":1268860517,"description":"Mississippi John Hurt\nThe Complete Studio Recordings\nVanguard Records\n181/83-2\n2000\n\n3 Disc Set containing the Vanguard studio albums:\n\nDisc 1: Today!\n\n01. Pay Day\n02. I'm Satisfied\n03. Candy Man\n04. Make Me A Pallet On Your Floor\n05. Talking Casey\n06. Corrinna, Corrinna\n07. Coffee Blues\n08. Louis Collins\n09. Hot Time In The Old Time Tonight\n10. If You Don't Want Me Baby\n11. Spike Driver Blues\n12. Beulah Land\n[Originally Released in 1966]\nGuitar/Vocals: Mississippi John Hurt\nComposed by Hurt, except 4,6,9,12 (Traditional)\n\n\nDisc 2: The Immortal\n\n01. Since I've Laid My Burden Down\n02. Moaning The Blues\n03. Stocktime (Buck Dance)\n04. Lazy Blues\n05. Richland Woman Blues\n06. Wise And Foolish Virgins (Tender Virgins)\n07. Hop Joint\n08. Monday Morning Blues\n09. I've Got The Blues And I Can't Be Satisfied\n10. Keep On Knocking\n11. The Chicken\n12. Stagolee\n13. Nearer My God To Thee\n[Originally Released in 1967]\nGuitar/Vocals: Mississippi John Hurt. 2nd Guitar on tracks 2 &amp; 8 only: Patrick Sky\nComposed by Hurt, except 1,2,13 (Traditional) and 12 (Hurt, Traditional)\n\n\nDisc 3: Last Sessions\n\n01. Poor Boy, Long Ways From Home\n02. Boys You're Welcome\n03. Joe Turner Blues\n04. First Shot Missed Him\n05. Farther Along\n06. Funky Butt\n07. Spider, Spider\n08. Waiting For You\n09. Shortnin' Bread\n10. Trouble, I've Had It All My Days\n11. Let The Mermaids Flirt With Me\n12. Good Morning, Carrie\n13. Nobody Cares For Me\n14. All Night Long\n15. Hey, Honey, Right Away\n16. You've Got To Die\n17. Goodnight Irene\n[Originally Recorded 1966]\nGuitar/Vocals: Mississippi John Hurt\nRecorded February, 1966 at Manhattan Towers Hotel, New York\nComposed by Hurt, except 1 (Bukka White), 8 (Barry, Elfman, Greenwich), 9 (Traditional), 12 (Bowman, McPherson, Smith),\n  14 (Chenier, Johnson, Lewis), 17 (Leadbetter).\n\n~Hurt passed away on November 2, 1966\n\n\nAbove info from liner notes (writing credits from allmusic.com and bmi.com).\nBelow are reviews from allmusic.com, which have a few factual errors- assuming the liner notes are correct.\n\n\n\nReview of 'Today!' by David Freedlander (from allmusic)\n\nToday is Mississippi John Hurt's first and finest studio release since his &quot;rediscovery&quot; on his \nAvalon farm by folklorist Tom Hoskins in 1963. Eclipsed possibly only by his earlier 1928 Sessions,\nthis album shows a more mature Hurt picking his way through standards and originals after the \nDepression years and Hurt's fall into obscurity before the folk revival of the 1960s. It shows, \nhowever, that all that the great bluesman has lost is years; his voice retains its characteristic \nBuddha-esque warmth and it is still difficult to believe that there is just one man playing on the \nseemingly effortless guitar work. The music on the album comes from a variety of different influences, \nfrom the fun and poppy &quot;Hot Time in Old Town Tonight&quot; and &quot;Coffee Blues,&quot; to the bluesy standards \n&quot;Candy Man&quot; (Hurt's most famous song) and &quot;Spike Driver's Blues&quot; to the soulful spirituals &quot;Louis Collins&quot; \nand &quot;Beulah Land.&quot; Hurt's tranquil guitar work -- mixing country, Scottish folk, and Delta blues -- strings \nall of the songs along the same simple and elegant thread. Hurt himself never could explain his guitar playing, \nas he used to say, &quot;I just make it sound like I think it ought to.&quot; Regardless, that sound, along with a mellow \nand heartfelt voice, wizened here by decades, combine to make Today an unforgettable whole. A truly essential \nalbum of the folk revival, unrivaled in its beauty and warmth. \n\n\nReview\tof 'The Immortal Mississippi John Hurt' by Brian Beatty (from allmusic)\n\nOne of the best albums of country blues ever recorded. The fingerpicking is delicate, the vocals \nmellow and sweet. Many tunes that remain associated with Hurt are included here in versions that \nrival his legendary recordings from the late '20s. &quot;Richland Woman Blues,&quot; &quot;Stagolee,&quot; &quot;The Chicken,&quot;\n and &quot;Since I've Laid My Burden Down&quot; sound as fresh as ever in these '60s versions. This album \nleaves little doubt as to why Hurt was so beloved after his rediscovery. \n\n\nReview\tof 'Last Sessoins' by Bruce Eder (from allmusic)\n\nRecorded in New York during February and July of 1966, the 17 songs on this collection represent \nMississippi John Hurt's final studio efforts. It is astonishing that this man, in the final months \nof his life, could do 17 songs that were the equal of anything he had done at his first sessions 45 \nyears earlier, his playing (supported on some tracks with producer Patrick Sky on second guitar) as\nalluringly complex as ever and his voice still in top form. Hurt is brilliant throughout, his voice \noverpowering in its mixture of warmth, gentleness, and power, and in addition to the expected crop \nof standards and originals, he covers songs by Bukka White (&quot;Poor Boy, Long Ways from Home&quot;) and \nLeadbelly (&quot;Goodnight Irene&quot;) -- all of it is worthwhile, with some tracks, such as &quot;Let the Mermaids \nFlirt with Me,&quot; especially haunting. \n\nReview of 'The Complete Studio Recordings' by Thomas Ward (from allmusic)\n\nAlthough not as consistently magnificent as Hurt's 1928 recordings, the performances the artist \nrecorded for Vanguard in the mid 1960's would be the zenith of many blues artist's entire careers. \nSongs like the opening &quot;Payday&quot; and &quot;Poor Boy, Long Ways From Home&quot; rank with any folk-blues song \never recorded. This fantastic set collects the three albums Vanguard released in Hurt's lifetime \nand as such is undeniably the package to go for to acquire these later gems. \n\n~doctorslist","torrent":{"xt":"urn:btih:2b6659ab8273653a3a1f585bd2a635882870fe1a","amp;dn":"Mississippi+John+Hurt+The+Complete+Studio+Recordings+%28Vanguard%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b6659ab8273653a3a1f585bd2a635882870fe1a","infoHashBuffer":{"type":"Buffer","data":[43,102,89,171,130,115,101,58,58,31,88,91,210,166,53,136,40,112,254,26]},"announce":[],"urlList":[]}}