{"title":"DJ Hell feat. Bryan Ferry - U Can Dance  (2nafish)","uid":5422041,"size":146386948,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2b722c49a2c311188b414199ccb0bf28a25c444b&amp;dn=DJ+Hell+feat.+Bryan+Ferry+-+U+Can+Dance++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1268121662,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nHelmut Josef Geier, professionally known as DJ Hell (born September 6, 1962 in Altenmarkt an der Alz) is a German house-techno DJ. He is the label boss of International DeeJay Gigolo Records and has been responsible for many of the big records to come out of the electroclash that emerged in Berlin in the mid-nineties. He is seen as the musical initiator of the 80's revival movement later known as electroclash popularizing the music from his hometown Munich from the mid to late 90's.\n\nIn 2006, DJ Hell was involved in a German Intel promotional campaign involving five renowned demogroups (Andromeda Software Development, Conspiracy, Fairlight, Farbrausch and mfx), who were set out to create 30-second demos using remixed versions of a DJ Hell track.\n\nDJ Hell's hit single &quot;Keep On Waiting&quot; released as a 12&quot; as Gigolo 122 reference with a remix by Tomas Andersson and a cover designed by French graphic artist Laurent Fetis &quot;Keep On Waiting&quot; was produced using samples as a basic track from a song titled &quot;Blurb&quot; by a New York based group known as Intense Molecular Activity. IMAs 4 track EP was released in 1980 on an independent label.\n\nIn September 2009, DJ Hell was at the centre of controversy when Felix da Housecat announced that DJ Hell's track &quot;The DJ Ft. P Diddy&quot;, from the album Teufelswerk, used content taken without the permission of Felix da Housecat or P Diddy.\n\nBryan Ferry (born 26 September 1945, Washington) is an English singer, musician, songwriter and occasional actor known for a suave visual and vocal style, earning him the epithet 'The Electric Lounge Lizard'. Ferry came to public prominence in the early 1970s as lead vocalist and principal songwriter for Roxy Music, which enjoyed a highly successful career with three number one albums and ten singles entering the top ten charts in the United Kingdom. He continues to have a successful solo career earning a Grammy nomination in 2001.\n\nFerry, Manzanera, Mackay and Thompson re-reformed Roxy Music in 2001 and toured extensively for a couple of years while not releasing any albums. With the help of Manzanera and Thompson, in 2002 Ferry returned with Frantic, the long-awaited follow-up for As Time Goes By; the final track is a collaboration with Brian Eno. The album Frantic mixed Ferry originals with covers - something that Ferry had not attempted on a solo album since The Bride Stripped Bare, twenty-four years before. Recently he has featured on Dj Hell newest record, 'U Can Dance' which he provides vocals on.\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2b722c49a2c311188b414199ccb0bf28a25c444b","amp;dn":"DJ+Hell+feat.+Bryan+Ferry+-+U+Can+Dance++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b722c49a2c311188b414199ccb0bf28a25c444b","infoHashBuffer":{"type":"Buffer","data":[43,114,44,73,162,195,17,24,139,65,65,153,204,176,191,40,162,92,68,75]},"announce":[],"urlList":[]}}