{"title":"Little Mix - DNA: The Deluxe Edition [EAC FLAC + CUE + LOG]","uid":8630760,"size":447594719,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2c89449ce1f6bc7204bb91284fc73ad7d0e5bfd0&amp;dn=Little+Mix+-+DNA%3A+The+Deluxe+Edition+%5BEAC+FLAC+%2B+CUE+%2B+LOG%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"CPU_Terminator","files":-1,"time":1372622930,"description":"Little Mix - DNA: The Deluxe Edition (2012) EAC Secure FLAC rip 44.1KHz/16-bit\n\n\nRipped by Exact Audio Copy V1.0 beta 3 using Secure Rip. Gaps appended to previous track. All files properly tagged (with album cover).\n\n\n\nDescription copied from Wikipedia:\n\nDNA is the debut album by British girl group Little Mix. The album was released on 19 November 2012 via Syco. The group began work recording the album in December 2011 and concluded in September 2012. Throughout the recording process, Little Mix worked with several producers, including TMS, Future Cut, Steve Mac, Jarrad Rogers, Richard &quot;Biff&quot; Stannard, Ash Howes, Jon Levine, Xenomania, Fred Ball and Pegasus. The album was co-written by Little Mix and they stated that they were involved in the development of the album as much as possible. Sonically, the album is primarily a mixture of Pop and R&amp;B records, with influences from dance-pop, pop rock and latin pop found on specific songs as well. The album's lyrical content explores empowerment, relationships and heartbreak. Songs on the album were also co-written by members of other girl groups, including Nicola Roberts of Girls Aloud, Shaznay Lewis of All Saints and T-Boz of American girl group TLC.\n\nDNA received mostly positive reviews from music critics, who complimented Little Mix. The album's lead single, &quot;Wings&quot;, was released on 26 August 2012, reaching number one in UK and Ireland as well as charting in Australia, New Zealand, Slovakia, Czech Republic, Hungary, Belgium, Canada and the USA. The second single, &quot;DNA&quot;, was released on 11 November 2012, peaking at number 3 in the UK. Two post-album singles were released - Change Your Life was released as the third single in 3 February, while How Ya Doin'? was released as the fourth and final single on 17 April; both songs reached the top 20 in the UK.\n\nThe album has subsequently placed in the top 5 in eight countries, most notably the USA where it became the first debut album from a girlgroup since 2006 to reach the top 5 - peaking at #4 on the Billboard Charts - as well as earning the highest Billboard chart position for a debut album by a British girl-group, breaking the record previously held by the Spice Girls' debut album &quot;Spice&quot;.\n\n\nTrack Listing:\n\n1.  Wings                 3:39\n2.  DNA                   3:56\n3.  Change Your Life      3:21\n4.  Always Be Together    4:26\n5.  Stereo Soldier        3:22\n6.  Pretend It's OK       3:44\n7.  Turn Your Face        3:41\n8.  We Are Who We Are     3:03\n9.  How Ya Doin'?         3:12\n10. Red Planet            3:46\n11. Going Nowhere         3:45\n12. Madhouse              3:49\n13. Love Drunk            3:35\n14. Make You Believe      3:41\n15. Case Closed           3:12\n16. DNA (Unplugged)       4:15","torrent":{"xt":"urn:btih:2c89449ce1f6bc7204bb91284fc73ad7d0e5bfd0","amp;dn":"Little+Mix+-+DNA%3A+The+Deluxe+Edition+%5BEAC+FLAC+%2B+CUE+%2B+LOG%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c89449ce1f6bc7204bb91284fc73ad7d0e5bfd0","infoHashBuffer":{"type":"Buffer","data":[44,137,68,156,225,246,188,114,4,187,145,40,79,199,58,215,208,229,191,208]},"announce":[],"urlList":[]}}