{"title":"De Niro: A Life - Shawn Levy - Audiobook MP3","uid":11692532,"size":337785681,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2c9a8d09befdd5cacc95180ef6e892180f92142a&amp;dn=De+Niro%3A+A+Life+-+Shawn+Levy+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Squiddy82","files":18,"time":1423594299,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nDe Niro: A Life\n\nWritten by: Shawn Levy\nNarrated by: Mark Deakins\nLength: 21 hrs and 37 mins\nUnabridged Audiobook\nRelease Date:10-28-14\n\nThere's little debate that Robert De Niro is one of the greatest, if not the greatest, screen actors of his generation, perhaps of all time. His work, particularly in the first 20 years of his career, is unparalleled. Mean Streets, the Godfather Part II, Taxi Driver, the Deer Hunter, and Raging Bull all dazzled moviegoers and critics alike, displaying a talent the likes of which had rarely - if ever - been seen. De Niro become known for his deep involvement in his characters, assuming that role completely into his own life, resulting in extraordinary, chameleonic performances.\nYet little is known about the off-screen De Niro - he is an intensely private man, whose rare public appearances are often marked by inarticulateness and palpable awkwardness. It can be almost painful to watch at times, in powerful contrast to his confident movie personae.\nIn this elegant and compelling biography, best-selling writer Shawn Levy writes of these many De Niros - the characters and the man - seeking to understand the evolution of an actor who once dove deeply into his roles as if to hide his inner nature, and who now seemingly avoids acting challenges, taking roles which make few apparent demands on his overwhelming talent.\nLevy has had unprecedented access to De Niro's personal research and production materials, creating a new impression of the effort that went into the actor's legendary performances. Levy also spoke to De Niro's collaborators and friends to depict De Niro's transition from an ambitious young man to a transfixing and enigmatic artist and cultural figure","torrent":{"xt":"urn:btih:2c9a8d09befdd5cacc95180ef6e892180f92142a","amp;dn":"De+Niro%3A+A+Life+-+Shawn+Levy+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c9a8d09befdd5cacc95180ef6e892180f92142a","infoHashBuffer":{"type":"Buffer","data":[44,154,141,9,190,253,213,202,204,149,24,14,246,232,146,24,15,146,20,42]},"announce":[],"urlList":[]}}