{"title":"Douglas Jackson - Sword of Rome","uid":10444528,"size":408176756,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2d00a09542a369f24233660e024f53860435624f&amp;dn=Douglas+Jackson+-+Sword+of+Rome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mustafa-crap","files":14,"time":1403933599,"description":"Noy my rip.\n\nThe Emperor Nero's erratic and bloody reign is in its death throes when Gaius Valerius Verrens is dispatched to Rome on a mission that will bring it to a close. With Nero dead, the city holds its breath and awaits the arrival his successor, Servius Sulpicius Galba, governor of Hispania. The Empire prays for peace, but it prays in vain. Galba promises stability and prosperity, but his rule begins with a massacre and ends only months later in chaos and carnage. This will become known as the Year of the Four Emperors, a time of civil war which will tear Rome apart and test Valerius's skills and loyalties to their very limit.\nFortunate to survive Galba's fall, Valerius is sent on a mission by Rome's new Emperor, Otho, to his old friend Vitellius, commander of the armies of the north. Vitellius's legions are on the march, and only Valerius can persuade him to halt them before the inevitable confrontation. In an epic adventure that will take him the length and breadth of a divided land, the one-armed Roman fights to stay alive and stave off a bloodbath as he is stalked by the most implacable enemy he has ever faced.","torrent":{"xt":"urn:btih:2d00a09542a369f24233660e024f53860435624f","amp;dn":"Douglas+Jackson+-+Sword+of+Rome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d00a09542a369f24233660e024f53860435624f","infoHashBuffer":{"type":"Buffer","data":[45,0,160,149,66,163,105,242,66,51,102,14,2,79,83,134,4,53,98,79]},"announce":[],"urlList":[]}}