{"title":"Mysterious Monuments - Texe Marrs","uid":11712230,"size":33011816,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d2fdd8db6ab261e92010f7e293588d0c3751541&amp;dn=Mysterious+Monuments+-+Texe+Marrs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424383836,"description":"\n\nA sinister and curious Architectural Colossus is exploding across every continent on earth. The United States of America is at the heart of this incredible surge. Monuments, statues, and buildings are being created everywhere with evil intent and magical purpose. Designed by visionary illuminist architects and based on knowledge of the occult wisdom, Masonic geometry and sacred numerology, this Architectural Colossus can be traced back to the antiquities of Mystery Babylon. Its secrets, once unlocked, point to an amazing and frightening future destiny for you, me, and the entire world. The builders of this strange architecture comprise an elite cryptocracy--a veritable who's who of the world's rich and famous. Are the mysterious monuments these men are building part of a Grand Design? Is there, in fact, a Master Plan to seduce men's minds and catapult humanity into a New Order of the Ages?\n\n\nAbout the author:\n Texe Marrs is author of 46 books, including The Personal Robot Book; Careers with Robots; The Great Robot Book; and Codex Magica: Secret Signs, Mysterious Symbols, and Hidden Codes of the Illuminati. A retired United States Air Force officer, he graduated Summa Cum Laude from Park University and earned his Masters Degree at North Carolina State University. Mr. Marrs is founder and president of powerofprophecy.com in Austin, Texas and is host of a popular radio program heard around the world","torrent":{"xt":"urn:btih:2d2fdd8db6ab261e92010f7e293588d0c3751541","amp;dn":"Mysterious+Monuments+-+Texe+Marrs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d2fdd8db6ab261e92010f7e293588d0c3751541","infoHashBuffer":{"type":"Buffer","data":[45,47,221,141,182,171,38,30,146,1,15,126,41,53,136,208,195,117,21,65]},"announce":[],"urlList":[]}}