{"title":"Running Blind by Lee Child","uid":4399597,"size":377936495,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2ddb932ec8adf93161af59f5b9306a78cf1062b6&amp;dn=Running+Blind+by+Lee+Child&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ripley5by5","files":269,"time":1221612377,"description":"Running Blind by Lee Child\n\nNarrated by Dick Hill\n\nUnabridged\n\n\n\nJack Reacher, the wandering folk hero of Child&amp;#039;s superb line of thrillers (Tripwire, etc.), faces a baffling puzzle in his latest adventure: who is the exceptionally crafty villain murdering women across the country, leaving the naked bodies in their bathtubs (which are filled with army camouflage green paint), escaping the scenes and leaving no trace of evidence? The corpses show no cause of death and Reacher&amp;#039;s sole clue is that all the victims thus far were sexually harassed while serving in the military. There&amp;#039;s got to be some sort of grand scheme behind the killings, but with no physical evidence, FBI agents bumble around until they finally question Reacher, a former military cop who handled each of the dead women&amp;#039;s harassment cases.\n\nAfter Reacher convinces investigators he&amp;#039;s innocent, they curiouslyv ask him to stay on as a case consultant. Reacher doesn&amp;#039;t like the idea--he&amp;#039;s too much of a lone wolf but he has little choice. The feds threaten him and his girlfriend, high-powered Manhattan attorney Jodie Jacob, with all sorts of legal entanglements if he doesn&amp;#039;t help. So Reacher joins the FBI team and immediately attacks the feds&amp;#039; approach, which is based solely on profiling. Then he breaks out on his own, pursuing enigmatic theories and hunches that lead him to a showdown with a truly surprising killer in a tiny village outside Portland, Oregon.\n\nSome of the concluding elements to Child&amp;#039;s fourth Reacher outing--how the killer gains access to the victims&amp;#039; homes, as well as the revelation of the elaborate MO fall into place with disappointing convenience.\n\nYet the book harbours two elements that separate it from the pack: a brain-teasing puzzle that gets put together piece by fascinating piece, and a central character with Robin Hood-like integrity and an engagingly eccentric approach to life.\n\nEnjoy the book.\n\nRipley5by5\n","torrent":{"xt":"urn:btih:2ddb932ec8adf93161af59f5b9306a78cf1062b6","amp;dn":"Running+Blind+by+Lee+Child","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ddb932ec8adf93161af59f5b9306a78cf1062b6","infoHashBuffer":{"type":"Buffer","data":[45,219,147,46,200,173,249,49,97,175,89,245,185,48,106,120,207,16,98,182]},"announce":[],"urlList":[]}}