{"title":"Sexually Broken--Selma Sins drilled down by 2 cocks, brutal chal","uid":10020081,"size":1401657932,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:2dfbf970b774206c256b1e5c35fe33e3eaba0807&amp;dn=Sexually+Broken--Selma+Sins+drilled+down+by+2+cocks%2C+brutal+chal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1398192218,"description":"\nSelma Sins drilled down by two cocks, brutal challenging deepthroat on 10 inch BBC multiple orgasms! | Selma Sins | Matt Williams\n\nApril 21, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nSelma Sins is an eager bundle of sex. This fresh faced Latina is a relative newbie to the industry, she brings both eagerness and enthusiasm to the table. We like a can do sort of attitude here at Sexuallybroken, and plan on rewarding it with cock. Lots and lots of rock hard cock jammed down her greedy little mouth hole. How will that can do attitude hold up under the unrelenting attention of multiple dicks? Let's find out, shall we?\n\nUsing a study wooden beam as a makeshift crucifix, Selma is shackled and spread out. A metal collar screwed into the wood holds her head and neck firmly in place. Thick metal cuffs keeps her arms spread out wide. A vibrator screwed down between her chained legs is the final touch. Her bound up breasts jut out proudly. It is go time. We step up and make ourselves at home. And by make ourselves at home, we mean reshape out her throat meat with cock. it is going to be an unrelenting training of her face pussy.\n\nSelma can not move or shift her face away, and takes every inch of the cocks that are running a train on her mouth. All the while, the vibrator is going on full blast between her legs. She can no more close her legs then she can shift her head. She cums, hard, while the dick is buried deep down her throathole. We add some nipple clamps to those tied up breasts and keep up the pace of the deepthroat. Drool flows out of her well used mouth as the cock plunges in. We add some weights to the nipple clamps to remind Selma or her place.\n\nAs the training intensifies, she becomes more and more unraveled. The face pounding, the bondage and orgasms, all serve to blast her into sexual subspace. For all the dick Selma has done, she has never experienced anything quite like this. Her chest is heaving, her eyes are glazed and deep throat spit coats her belly, running down to her pussy and coating the vibrator. Selma produces one of a kind throat lube, it it so thick and sticky you could bottle it. The vibrator rips another orgasm out of her bound pussy as her eyes roll into the back of her head. We leave her crucified and shackled, shiny with drool and the vibrator still going full blast. Welcome to Sexuallybroken Selma... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_21ssins/SexuallyBroken-Selma-Sins-Matt-Williams-Selma-Sins-drilled-down-by-two-cocks-brutal-challenging-deepthroat-on-10-inch-BBC-multiple-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_21ssins/SexuallyBroken-Selma-Sins-Matt-Williams-Selma-Sins-drilled-down-by-two-cocks-brutal-challenging-deepthroat-on-10-inch-BBC-multiple-orgasms.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:2dfbf970b774206c256b1e5c35fe33e3eaba0807","amp;dn":"Sexually+Broken--Selma+Sins+drilled+down+by+2+cocks%2C+brutal+chal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dfbf970b774206c256b1e5c35fe33e3eaba0807","infoHashBuffer":{"type":"Buffer","data":[45,251,249,112,183,116,32,108,37,107,30,92,53,254,51,227,234,186,8,7]},"announce":[],"urlList":[]}}