{"title":"Free Anti virus and spyware terminator","uid":4088547,"size":27612784,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2e1f262bc56ef72126e0da3eb67c20a4c949564f&amp;dn=Free+Anti+virus+and+spyware+terminator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"yboc2000","files":2,"time":1205950066,"description":"Avira personal edition-\nThis reliable application quickly scans drives for every form of virus, trojan, and worm, letting you delete or quarantine anything it finds. It lets you focus your search to specific types of scans, and select drives if you have a hunch about a particular problem. This application also offers a real-time guard, so you can stop a virus before it takes root. Like any antivirus program (or antispyware program for that matter) AntiVir will only remain a contender if they keep updating their virus definitions, and so far they are perfect.\n\nSpyware Terminator-\n It has a slick interface, performs relatively fast scans, and includes free real-time protection. So many antispyware demos scan, but don&amp;#039;t remove malware before you pay the registration, or they do scan and remove, but the real-time protection is locked. Spyware Terminator has all the features of the paid applications, but it&amp;#039;s absolutely free. One word of caution: I&amp;#039;m not fully sold on the real-time protection in Spyware Terminator because it seems to notify me a lot, even to the point of repeat notifications. Whether you choose to have real-time protection on or off, if you stick to a scan schedule, this application will keep your system clean","torrent":{"xt":"urn:btih:2e1f262bc56ef72126e0da3eb67c20a4c949564f","amp;dn":"Free+Anti+virus+and+spyware+terminator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e1f262bc56ef72126e0da3eb67c20a4c949564f","infoHashBuffer":{"type":"Buffer","data":[46,31,38,43,197,110,247,33,38,224,218,62,182,124,32,164,201,73,86,79]},"announce":[],"urlList":[]}}