{"title":"FSX/FS9 Lionheart Creations Trinidad &amp; Tobago Collection 2.0","uid":4402930,"size":144670736,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2e7f6f21010cd3473d2148330059c5007fbd1cd3&amp;dn=FSX%2FFS9+Lionheart+Creations+Trinidad+%26+Tobago+Collection+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Smarty595","files":1,"time":1221792897,"description":"Fly The Porsche Of General Aviation\n\nWith 250 Hp under the cowling, the (computer controlled turbo charger) turbo charged Trinidad TB-21 GT Turbo will lay you back in your seat and then have cruising as high as 20,000 feet at 190 knots. It's a rush! Her sister ship, the Tobago TB-200 GT will still get you there with a performance that's only slightly less but just as exhilarating. There are 12 paint schemes for you to choose from as you venture on your high performance cross country flights.\n\nThis package contains two high detail aircraft with elaborate Virtual Cockpits moderate animations through out. The aircraft come in 12 liveries each and are created from existing actual aircraft and factory paint schemes.\n\nWith guidance from actual Socata pilots and owners, extreme attention to details and animations within the exotic 'virtual cockpit', the Socata 'Experience' sets out to be an awesome and fun aircraft flight simulation package. \n\nModel Details\n\n\nOpening Gullwing Pilot and Passenger doors \nOpening Rear Cargo door \nAnimated pilot that scans the horizon and instrument panel \nFactory paint schemes from actual aircraft, 26 total between both models \nDynamic reflective 32 Bit high resolution exterior paint schemes \nDetail Virtual Cockpit that features; \nMoving control yokes that can hide for better visibility \nAnimated Engine Controls, rudder trim, fuel control knob, etc \nAnimated Passenger Seat, Ash tray, Rear Seat Arm Rest, animated Rudder Pedals, and dual directional Sun Visors as well. \nFunctioning suspension with high detail components replication on the RG model \nHigh detail propellor modelling \nTinted side glass as in the actual TB aircraft line \nHighly realistic airfile set that reflects each of the two different aircrafts flight characteristics and performance. \nAnimated Cowling that removes to allow you to see the extremely high detail Lycoming engine \nIncludes Garmin 330, 430 &amp; 530 GPS. \nFS9 KeyPad Quick Views that allow Belly-Cam view, Rudder-Cam view, Oil Check View, etc. \nFully FSX compatible.","torrent":{"xt":"urn:btih:2e7f6f21010cd3473d2148330059c5007fbd1cd3","amp;dn":"FSX%2FFS9+Lionheart+Creations+Trinidad+%26+Tobago+Collection+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e7f6f21010cd3473d2148330059c5007fbd1cd3","infoHashBuffer":{"type":"Buffer","data":[46,127,111,33,1,12,211,71,61,33,72,51,0,89,197,0,127,189,28,211]},"announce":[],"urlList":[]}}