{"title":"Run, Swim, Throw, Cheat: The Science Behind Drugs in Sport","uid":8223709,"size":3589069,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f51128cb8c3aec2359ec78f0049ca4f1c1f6ef6&amp;dn=Run%2C+Swim%2C+Throw%2C+Cheat%3A+The+Science+Behind+Drugs+in+Sport&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1362535335,"description":"Chris Cooper, &quot;Run, Swim, Throw, Cheat: The Science Behind Drugs in Sport&quot;\nISBN: 0199581460 | 2012 | EPUB\n\nDrugs in sport are big news and the use of performance-enhancing drugs in sport is common. Here, Chris Cooper, a top biochemist at the University of Essex, looks at the science behind drugs in sport. Using the performance of top athletes, Cooper begins by outlining the limits of human performance. Showing the basic problems of human biochemistry, physiology, and anatomy, he looks at what stops us running faster, throwing longer, or jumping higher. Using these evidence-based arguments he shows what the body can, and cannot, do. There is much curiosity about why certain substances are used, how they are detected, and whether they truly have an effect on the body. Cooper explains how these drugs work and the challenges of testing for them, putting in to context whether the 'doping' methods of choice are worth the risk or the effort.\nExploring the moral, political, and ethical issues involved in controlling drug use, Cooper addresses questions such as 'What is cheating?', 'What compounds are legal and why?', 'Why do the classification systems change all the time?', and 'Should all chemicals be legal, and what effect would this have on sport?'. Looking forward, he examines the recent work to study the physical limitations of rat and mice behaviour. He shows that, remarkably, simple genetic experiments producing 'supermice' suggest that there may be ways of improving human performance too, raising ethical and moral questions for the future of sport.","torrent":{"xt":"urn:btih:2f51128cb8c3aec2359ec78f0049ca4f1c1f6ef6","amp;dn":"Run%2C+Swim%2C+Throw%2C+Cheat%3A+The+Science+Behind+Drugs+in+Sport","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f51128cb8c3aec2359ec78f0049ca4f1c1f6ef6","infoHashBuffer":{"type":"Buffer","data":[47,81,18,140,184,195,174,194,53,158,199,143,0,73,202,79,28,31,110,246]},"announce":[],"urlList":[]}}