{"title":"Ananda Shankar - Ananda Shankar (Sitar-Rock Us/India 1970)","uid":3365596,"size":58465056,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2fdf2179c7de2d9e055b31ee163f2d157a3b5b60&amp;dn=Ananda+Shankar+-+Ananda+Shankar+%28Sitar-Rock+Us%2FIndia+1970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"test78","files":9,"time":1123224867,"description":"Search for test78 to find my other uploads.\n\nAnanda is the nephew of Ravi Shankar, so I guess sitarplaying runs in the family eh. THis is his debutalbum from 1970, featuring lots of swirling psychedelic sitar as he tackles famous tunes aswell as his own compostion. Totally cool stuff all of it, his version of Jumping Jack Flash` works surprisingly well. ^_^\n\nSure, this record really isn't more than an exploitation of the crossover between psychedelic music and Eastern sounds, but that shouldn't detract anyone from listening to it in its entirety; in fact, that would be a huge mistake. The opener, the sitar- and Moog-soaked take on &quot;Jumpin' Jack Flash,&quot; is performed perfectly, with every choice accent milked for maximum drama. Once the novelty of sitar-dosed covers of your favorite songs wears off, you really begin to notice how excellent the performances are on this record. Ananda Shankar manages to bridge the gap between kitsch and fine art on these tracks, from the opener all the way to the cover of &quot;Light My Fire.&quot; One minute he is playing simple notes like it was taking the place of a guitar, at other times utilizing the full reign of the sitar's sound possibilities. The originals on the album follow an equally impressive path. The dreamy, hazy bliss of tracks like &quot;Snow Flower&quot; and &quot;Mamata&quot; is both meditative and slinky -- light melodies with twisted atmospherics and tweaked Moogs. The drum breaks in the gurgling &quot;Metamorphosis&quot; are worth the price of the album alone. For the most part, the album rarely strays from the East-meets-West formula, with the Eastern rhythms getting the short shrift and the focus relying on Western funk and pop styles getting an Eastern makeover. Not that this is bad at all, but when the track &quot;Sagar&quot; ends, you realize that this record could have been much more than it was. This specific track guides the listener through a space/water odyssey over the course of 13 minutes. It's a slow build that gains momentum as the music progresses and flashes of acoustic guitar help the rhythm along. The final track is a great mixture of folk guitars that takes the focus away from the sitar for once, instead incorporating vocals and a chorus that manages to lock into a repeated chant that is the unexpected highlight of the album. ~ Jon Pruett, All Music Guide\n\n192kbs\n\nTracklist:\n\n1. Jumpin' Jack Flash\t(3:35)\t  \t  \t\n2. Snow Flower\t\t(2:49)\t  \t  \t\n3. Light My Fire\t(3:32)\t  \t  \t\n4. Mamata (Affection)\t(3:09)\t  \t  \t\n5. Metamorphosis\t(6:50)\t  \t  \t\n6. Sagar (The Ocean)\t(13:16)\t  \t  \t\n7. Dance Indra\t\t(3:53)\t  \t  \t\n8. Raghupati\t\t(3:28)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:2fdf2179c7de2d9e055b31ee163f2d157a3b5b60","amp;dn":"Ananda+Shankar+-+Ananda+Shankar+%28Sitar-Rock+Us%2FIndia+1970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fdf2179c7de2d9e055b31ee163f2d157a3b5b60","infoHashBuffer":{"type":"Buffer","data":[47,223,33,121,199,222,45,158,5,91,49,238,22,63,45,21,122,59,91,96]},"announce":[],"urlList":[]}}