{"title":"Il Regno delle Ombre [pcgame Ita - Esp] [Tntvillage]","uid":5797360,"size":8429813760,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3007f12bbc6d29d65bcef3c3c4c3e342b5756900&amp;dn=Il+Regno+delle+Ombre+%5Bpcgame+Ita+-+Esp%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"l.diliberto","files":1,"time":1283116578,"description":"Il Regno delle Ombre [pcgame Ita - Esp] [Tntvillage]\n &lt;a href=&quot;\nhttp://img829.imageshack.us/img829/7121/cozr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img829.imageshack.us/img829/7121/cozr.jpg&lt;/a&gt;\n\nData di uscita: 07 novembre 2008\nSviluppato da Treyarch\nPubblicato da Activision\nDistribuito da Activision Blizzard\nGenere: Azione\nSupporto: 1 DVD59\nLingua: multi 2 (Italiano - Spagnolo)\n\nVisit this link: \n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=221576&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=221576&lt;/a&gt;\n\nVisit this link: http://translate.google.com/?hl=en&amp;sl=auto&amp;tl=en#\n\n.::.recensione.::.\n\nHanno ucciso l'Uomo Ragno...\nAlzi la mano chi non vorrebbe essere un supereroe! Io ad esempio: troppi impegni, e zero tempi morti...\nMa Peter Parker, si sa, ÃƒÂ¨ persona altruisticamente disposta a tutto pur di salvare il mondo dai cattivi. Ed ÃƒÂ¨ quindi in prima fila anche quando Venom, sempre lui, approda a Manhatthan scatenando il panico grazie ad una nuova, incredibile abilitÃƒÂ : quella di sdoppiarsi in un numero indefinito di copie!\nCon l'aiuto, quindi, di un neonato esercito, fatto di passanti inermi, ed eroi posseduti, il nero alieno dalla lingua biforcuta arriva addirittura a &quot;contagiare&quot; il nostro amato Spidey, che oltre alla consueta calzamaglia rosso-blu, sarÃƒÂ  quindi dotato anche della misteriosa (ma terribilmente piÃƒÂ¹ elegante) tenuta dark.\n &lt;a href=&quot;\nhttp://img411.imageshack.us/img411/7040/65117919.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img411.imageshack.us/img411/7040/65117919.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img828.imageshack.us/img828/557/83682584.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img828.imageshack.us/img828/557/83682584.jpg&lt;/a&gt;\n\nramite la semplice pressione della leva analogica destra, passerete istantaneamente da una all'altra versione, disponendo cosÃƒÂ¬ dell'agilitÃƒÂ  e versatilitÃƒÂ  del costume classico, oppure della potenza devastante di quello nero. Tutto ciÃƒÂ² ha ovviamente forti ripercussioni sul gameplay: starÃƒÂ  al gusto del giocatore affrontare i nemici in modo piÃƒÂ¹ canonico, approfittando delle acrobatiche doti di Spider-Man, oppure scegliere la via del &quot;Male&quot; potendo cosÃƒÂ¬ contare sulla forza bruta di Venon. In tal caso sarete addirittura in grado di lanciare automobili contro i malcapitati avversari, che non necessariamente saranno cattivi: la possibilitÃƒÂ  di switchare da un costume all'altro sarÃƒÂ  infatti fondamentale anche a livello di trama; se quindi nei precedenti capitoli esisteva una sola opportunitÃƒÂ  di risoluzione (leggasi, rigorosamente in rima: &quot;piazza pulita di ogni forza nemica&quot;), nel Regno delle Ombre potrete scegliere di sposare la malvagitÃƒÂ , e combattere contro quegli ideali che da sempre vi hanno guidato.\n &lt;a href=&quot;\nhttp://img841.imageshack.us/img841/6347/96136467.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img841.imageshack.us/img841/6347/96136467.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img829.imageshack.us/img829/5889/35845210.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img829.imageshack.us/img829/5889/35845210.jpg&lt;/a&gt;\n\nMorale della favola: a seconda delle vostre azioni, potrete imbattervi in quattro finali diversi, aumentando di fatto il fattore &quot;replay&quot; del titolo. Fattore, purtroppo, fortemente compromesso dalla ripetitivitÃƒÂ  dell'avventura. Il gioco non si distingue infatti per varietÃƒÂ  di azione: caratterizzato dalla consueta cornice Free Roaming, il gameplay ÃƒÂ¨ basato sul classico susseguirsi di missioni. Purtroppo, queste saranno scialbe e banali, e mancano nella quasi totalitÃƒÂ  dei casi di mordente. Se si fa infatti eccezione per gli scontri con i Boss, resi adrenalinici dall'ottimo sistema di combattimento di cui parleremo in seguito, per il resto del tempo sarete chiamati alle azioni piÃƒÂ¹ elementari, come ad esempio eliminare dei cecchini appostati sui tetti, oppure fermare delle auto in fuga. Ad aggravare la situazione ci pensano le missioni secondarie (e quindi facoltative): queste si limitano unicamente al fermare un certi numero di criminali, oppure\n &lt;a href=&quot;\nhttp://img185.imageshack.us/img185/9213/38646764.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img185.imageshack.us/img185/9213/38646764.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img210.imageshack.us/img210/8456/30890557.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img210.imageshack.us/img210/8456/30890557.jpg&lt;/a&gt;\n\nal salvare i civili in difficoltÃƒÂ . Ancora, ancora, e ancora... Il tutto sarebbe probabilmente piÃƒÂ¹ sopportabile se il vostro girovagare in cerca di guai fosse accompagnato da una New York pulsante di vita; ed invece, vi accorgerete ben presto dell'assoluta mancanza di caratterizzazione della cittÃƒÂ . Palazzi tutti uguali, passanti fatti con lo stampino, e nessun luogo segreto. L'unica cosa che troverete sugli spogli tetti dei grattacieli sono dei ragni, che raccolti in un determinato numero permettono il potenziamento delle proprie abilitÃƒÂ .\nUna componente ruolistica, questa, che impreziosisce il titolo, e aiuta il giocatore a non usare il costosissimo blu-ray come esoso sottobicchiere.\nIl nostro alter ego ÃƒÂ¨ infatti dotato di tre tipi di tecniche: a terra, in volo e &quot;in arrampicata&quot;. Ogni tecnica ÃƒÂ¨ dotata di un gran numero di mosse, da eseguire tramite le combinazioni piÃƒÂ¹ disparate. Prima di sbloccare una nuova mossa sarÃƒÂ  perÃƒÂ² necessario il raggiungimento di un predefinito numero di punti esperienza, ottenibili in gran parte portando a termine le varie missioni. Ecco cosÃƒÂ¬ che i vostri combattimenti, inizialmente basati sull'utilizzo di due o tre combo di base, diventeranno spettacolari ed emozionanti, lasciandovi stampato sul viso un sorriso da nerd del quale andrete certamente fieri!\nPer soddisfare ulteriormente la vostra sete di fumetti, gli sviluppatori hanno pensato bene di inserire molte altre icone dell'universo Marvel: personaggi affascinanti quali Luke Cage e Wolwerine diverranno quindi colonne portanti della trama principale, e potranno addirittura essere chiamati sul campo di battaglia tramite la semplice pressione della croce digitale. Nel caso invece preferiate sposare la causa del Male... Beh, preparatevi a sudare le proverbiali sette camicie, perchÃƒÂ© ve li ritroverete sul vostro cammino!\n\nVisit thelink:\n\nInstallazione:\n1. montate o masterizzate il file immagine.\n2. installate il gioco.\n3. eseguite la patch v.1.1\n4. copiate il file che si trova nella cartella SPIDERMAN.WOS.V1.1.ALL.VITALITY.NOCD e lo incollate nella directory di installazione del gioco.\n\nnota: Se volete potete anche installare il gioco e curarlo con la v.1.0\n\nIl gioco ÃƒÂ¨ stato testato su windows XP SP3\n\nRequisiti Minimi:  \nWindows XP/Vista\nCPU AMD Athlon X2 4600+, Intel Core 2 Duo 2.13 Ghz\n8 Gb spazio libero su hard disk\n1 Gb di RAM\nScheda video 512 Mb Nvidia GeForce 7900GTX/ATI Radeon X1900XTX o superiore\nScheda audio compatibile DirectX 9.0c\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:3007f12bbc6d29d65bcef3c3c4c3e342b5756900","amp;dn":"Il+Regno+delle+Ombre+%5Bpcgame+Ita+-+Esp%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3007f12bbc6d29d65bcef3c3c4c3e342b5756900","infoHashBuffer":{"type":"Buffer","data":[48,7,241,43,188,109,41,214,91,206,243,195,196,195,227,66,181,117,105,0]},"announce":[],"urlList":[]}}