{"title":"The Vatican Moscow Washington Alliance - Avro Manhattan","uid":11714288,"size":6142530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:302f911e58f6bc259260a9a43fa89f40b4f04bc2&amp;dn=The+Vatican+Moscow+Washington+Alliance+-+Avro+Manhattan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1424482534,"description":"\nThe Vatican plays a vital part in history and world politics, as well as Biblical prophecy. God reveals her true identity in chapters 17 and 18 of the book of Revelation. All true Christians should carefully watch her activities. The Vatican is currently playing along with both Russia and the United States. Historically, she has always gone with the winner, and always leaves an escape hatch for herself. The great prize for the Vatican is the U.S. she is closing in by preachint a Marxist gospel in Latin America and Mexico, and using immigration to flood this nation with Catholic adherents. But for Christians, this is actually a spiritual problem. We must be aware of the behind-the-scenes activity, but our response must be to win the Roman Catholics to Christ. There is probably no other person more qualified to write on the subject of Vatican politics than Avro Manhattan. He has authored many books and is one of the world-renowned authorities on Roman Catholic activities. The Lord tells us to be &quot;WISE AS SERPENTS&quot; (Mat 10:16). I cncourage you to read THE VATICAN MOSCOW WASHINGTON ALLIANCE. When you know what's going on, you will know both how to pray, and that we MUST win Roman Catholics to Christ.\n\nAbout the author:\nHaving covered various political topics throughout his career, Avro Manhattan is perhaps best remembered as the author of several works analyzing the Vatican's role in global affairs.\nManhattan is a world-renowned authority on Roman Catholicism in politics. During World War II, Manhattan was jailed in Italy for refusing to serve in Benito Mussolini's fascist army. Later during World War II he operated a radio station called &quot;Radio Freedom,&quot; broadcasting to occupied Europe. He also wrote political commentaries for the British Broadcasting Corporation (BBC).\nBesides lecturing and writing short stories, essays, articles, novels and plays, he has written several best-sellers.\nDespite having an intellectual outlook somewhat at odds with Christian fundamentalism, many of Manhattan's books were sold by Jack Chick, an American fundamentalist publisher","torrent":{"xt":"urn:btih:302f911e58f6bc259260a9a43fa89f40b4f04bc2","amp;dn":"The+Vatican+Moscow+Washington+Alliance+-+Avro+Manhattan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"302f911e58f6bc259260a9a43fa89f40b4f04bc2","infoHashBuffer":{"type":"Buffer","data":[48,47,145,30,88,246,188,37,146,96,169,164,63,168,159,64,180,240,75,194]},"announce":[],"urlList":[]}}