{"title":"Eggstone - Somersault [1994]","uid":9222900,"size":280444114,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:30455052d8a36e65b216d80f0b2504069916ba75&amp;dn=Eggstone+-+Somersault+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1384964624,"description":"Very few albums exist that exude more sappy wimpiness than Eggstone's Somersault -- and that's very much a compliment. Eggstone tackle the nexus of pure sugary power pop from all different sources and make it work charmingly almost in spite of itself. That one song is named &quot;Hang on to Your Eco&quot; isn't just a smart reference to the Beach Boys but a perfect excuse to whip up a charging, hooky blast with a killer lead guitar line. Having already built its reputation over an initial series of releases, Eggstone actually hit the big time (at least in certain parts of the world) with Somersault, specifically the cuddly-as-all-heck &quot;Water.&quot; On initial listen, such a song shouldn't exist -- it seems too fragile to live. Over soft strumming and chiming, Per Sunding sings about the good qualities of water (&quot;You can drink it with lime or with lemon/Water can turn into ice cubes&quot;), like a cotton-candy science lesson. But at the end of the chorus, it all suddenly connects when he sings &quot;Water can be found in your kiss/Water can be found in you/And your lips.&quot; Throughout the album, meanwhile, things just sparkle and charge with a pure zest. Sunding has an astonishingly pure and lovely voice, clean and clear without being overly polished, his soaring verses and wordless coos and sighs fitting with the music just right. The band itself isn't afraid to rock out on its own terms more than once, and often quite successfully, as in the punk energy-level start of &quot;Against the Sun.&quot; The album isn't quite perfect, one or two numbers just going and coming with little impact, but with such delights as the kicky '60s pop groove of &quot;Good Morning&quot; and the loud-riffing catalog of problems &quot;Luck,&quot; Somersault otherwise hits the mark. (4/5)","torrent":{"xt":"urn:btih:30455052d8a36e65b216d80f0b2504069916ba75","amp;dn":"Eggstone+-+Somersault+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30455052d8a36e65b216d80f0b2504069916ba75","infoHashBuffer":{"type":"Buffer","data":[48,69,80,82,216,163,110,101,178,22,216,15,11,37,4,6,153,22,186,117]},"announce":[],"urlList":[]}}