{"title":"Dracos- Fiend of Athens 1956","uid":6287843,"size":617190729,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3052da7811ffee9130ca0d961c4db6cd10e7fbc9&amp;dn=Dracos-+Fiend+of+Athens+1956&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fraxios","files":6,"time":1301678824,"description":"(Dracos - Fiend of Athens)  1956\n\nA peaceful, frightened little man (Dinos Iliopoulos) is mistakenly identified as &quot;the dragon&quot; (&quot;o drakos&quot;), a notorious criminal at large. He briefly and reluctantly rules the underworld until they realize their mistake and kill him.\n\nWhen the film opened in Greek cinemas in 1956, it was a disaster, both critically and commercially. It was international critical hailing of the film which changed its course. Now it is recognized as one of the 10 most important Greek films of all time. \n\nThis is the first Greek film of that &quot;Artistic&quot; nature, that years later would almost destroy the Greek cinema. But in the 50's it was a great novelty for the local production. On a first level, it's talking about the story of a little man who is tiered of being this little man and decides that he 'd rather have the short but glorious life of a famous criminal. His borrowed reputation, soon gets him the tragic but exceptional end that he almost is wishing for. Still, this is not really a crime movie! It's a political film, made in a time when this was not permited by the authorities. The wounds from the wars that passed, the 2nd world war and the Greek civil war (a taboo topic at the time), are obvious to the viewer with eyes open. The poverty that dooms the life of the nation and the influence of the USA in Greece, not by their model of life but with their unethical, political involvements, is underlined with the only way that it was possible for the Greek cinema of the time! A beautiful, lyrical tragedy, with a message to read between the lines. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0124437/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0124437/&lt;/a&gt;","torrent":{"xt":"urn:btih:3052da7811ffee9130ca0d961c4db6cd10e7fbc9","amp;dn":"Dracos-+Fiend+of+Athens+1956","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3052da7811ffee9130ca0d961c4db6cd10e7fbc9","infoHashBuffer":{"type":"Buffer","data":[48,82,218,120,17,255,238,145,48,202,13,150,28,77,182,205,16,231,251,201]},"announce":[],"urlList":[]}}