{"title":"Sunday's Best - Poised to Break (2000) [FLAC]","uid":9239786,"size":322948775,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:30a5bde2ac5c0ec57dd170b986c171ae14be7288&amp;dn=Sunday%27s+Best+-+Poised+to+Break+%282000%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1385240719,"description":"\n  Sunday's Best - Poised to Break (2000) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative, Emo\n  Source: CD \n  Codec: FLAC\n  Bit Rate: ~ 900 kbps \n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  Like a number of the bands on Polyvinyl Records, Sunday's Best play a type of indie pop/rock with prevalent punk roots and elements of emocore, particularly the naked emotion and tough-guy angst. And like the majority of those peers, they generally make a pretty competent racket. Unfortunately, Poised to Break ultimately isn't very interesting in any particular way. At this late stage in the game, it's difficult to bring anything new to the pop-punk template, considering literally hundreds of bands long ago strip-mined that particular vein until it was bled dry. With that particular cross to bear, Sunday's Best nevertheless try to climb the mountain once again. The results are expectedly tepid for most of the album, and surprisingly the band doesn't even manage to generate a whole lot of sonic excitement to cover for the lack of interesting ideas. They do manage a few fairly nice moments -- the new-wave guitars of &quot;Indian Summer&quot; and the solid &quot;In Beats Like Trains&quot; -- that you wish they had used as centerpieces from which to create their own personal niche, but on the whole they simply have a go at making the type of album that countless indie pop-punk bands made throughout the 1990s, and many of them much more successfully. The band neither writes particularly catchy hooks nor explores any of the potentially intriguing individualities within their chosen sound, and it leaves the music flat and lacking any sort of intensity. Labelmates Aloha and Pele have both released gorgeous albums full of exploratory music by throwing out the formula entirely and exploring styles such as jazz and progressive rock, but within a rock structure. Sunday's Best, however, doesn't seem to have the capacity to build upon their influences in any meaningful way, nor do they show a desire to. Hardcore fans of indie rock will inevitably find something they like on Poised to Break, but for the listener who needs more than a retread of already threadbare ground, it is best bypassed, perhaps for one of their more adventurous labelmates.\n","torrent":{"xt":"urn:btih:30a5bde2ac5c0ec57dd170b986c171ae14be7288","amp;dn":"Sunday%27s+Best+-+Poised+to+Break+%282000%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30a5bde2ac5c0ec57dd170b986c171ae14be7288","infoHashBuffer":{"type":"Buffer","data":[48,165,189,226,172,92,14,197,125,209,112,185,134,193,113,174,20,190,114,136]},"announce":[],"urlList":[]}}