{"title":"The Tetsuo Films (The Iron Man, Body Hammer &amp; The Bullet Man","uid":9366498,"size":8211527150,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:30eaa596f8da48e745d82057e4a31c852d8c7475&amp;dn=The+Tetsuo+Films+%28The+Iron+Man%2C+Body+Hammer+%26amp%3B+The+Bullet+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AbraMon","files":9,"time":1387428509,"description":"Tetsuo: The Iron Man is a 1989 Japanese cyberpunk Film by cult-film director Shinya Tsukamoto produced by Japan Home Video. This, his third film, is an extremely graphic but also strikingly-filmed fantasy shot in the same low-budget, underground-production style as his first two films. Tetsuo established Tsukamoto internationally and created his worldwide cult following.\n\n\nTetsuo II: Body Hammer is a 1992 Japanese science fiction/horror film directed by Shinya Tsukamoto. It is a bigger-budget reworking of the same director's 1989 movie Tetsuo: The Iron Man, utilizing similar themes and ideas to the earlier film (a Japanese salaryman, played by cult actor Tomorowo Taguchi, finds his body transforming into a weapon through sheer rage after his son is kidnapped by a gang of violent thugs.) It was not as well received as its predecessor but it did win the Critic's Award at the 3rd Yubari International Fantastic Film Festival in February 1992.\n\n\nTetsuo: The Bullet Man is the third film in Shinya Tsukamoto's cyberpunk film series, and the first to be filmed in English.","torrent":{"xt":"urn:btih:30eaa596f8da48e745d82057e4a31c852d8c7475","amp;dn":"The+Tetsuo+Films+%28The+Iron+Man%2C+Body+Hammer+%26amp%3B+The+Bullet+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30eaa596f8da48e745d82057e4a31c852d8c7475","infoHashBuffer":{"type":"Buffer","data":[48,234,165,150,248,218,72,231,69,216,32,87,228,163,28,133,45,140,116,117]},"announce":[],"urlList":[]}}