{"title":"Her Life and Letters  - Lucille Clifton (Women Writers of Color)","uid":11600093,"size":693365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3140834dbbc6804d7f8ff35448b42f47323bc82d&amp;dn=Her+Life+and+Letters++-+Lucille+Clifton+%28Women+Writers+of+Color%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1417330684,"description":"Title: Lucille Clifton: Her Life and Letters\nAuthor: Mary Jane Lupton\nSeries: Women Writers of Color\nHardcover: 192 pages\nPublisher: Praeger (June 30, 2006)\nLanguage: English\nISBN-10: 0275984699\nISBN-13: 978-0275984694\n\nDescription:\nWriting and composing with honesty and humanism, Lucille Clifton is known for her themes of the body, family, community, politics, womanhood, and the spirit. While much of her work deals with the African American experience, she does not limit herself to that perspective, addressing topics common to all women, to all people. This timely and important biography will give readers a glimpse into the life and work of this important and revered African American poet, writer, and educator, exploring themes that run throughout her writing, as well as the personal obstacles she faced and overcame.\n\nLucille Clifton was born in Depew, New York, in 1936. Today, she is one of the most important and revered African American poets, writers, and educators in the nation. In addition to several works of poetry, she has written more than 15 children's books. Her work has been nominated for three Pulitzer Prizes and two National Book Awards, one of which she won for Blessing the Boats: New and Selected Poems 1988-2000 in 2000. In 1999, she was appointed and remains a Chancellor of the American Academy of Poets, one of the most prestigious honors in American letters. Among her best known works is the poem miss rosie, anthologized many times over and a standard part of high school curriculums. She has won an Emmy award, a Lannan Literary Award, two fellowships from the National Endowmant for the the Arts, and many other prestigious awards. Writing and composing with honesty and humanism, Clifton is known for her themes of the body, family, community, politics, womanhood, and the spirit. While much of her work deals with the African American experience, she does not limit herself to that perspective, addressing topics common to all women, to all people. This biography covers Clifton's life and work, addressing themes that run throughout her writing as well as the personal obstacles she faced and overcame, including her own faultering health. This timely and important biography will give readers a glimpse into the life of one of America's most important, influential, and enduring writers","torrent":{"xt":"urn:btih:3140834dbbc6804d7f8ff35448b42f47323bc82d","amp;dn":"Her+Life+and+Letters++-+Lucille+Clifton+%28Women+Writers+of+Color%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3140834dbbc6804d7f8ff35448b42f47323bc82d","infoHashBuffer":{"type":"Buffer","data":[49,64,131,77,187,198,128,77,127,143,243,84,72,180,47,71,50,59,200,45]},"announce":[],"urlList":[]}}