{"title":"Joe Walsh - In My Car [promo].VOB","uid":12171747,"size":205869060,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:317dde05a7c8f86bf32637c3eda82626201ef94f&amp;dn=Joe+Walsh+-+In+My+Car+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":1,"time":1438220024,"description":"Joe Walsh - In My Car [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;In My Car&quot; is a single by The Beatles' former drummer, Ringo Starr. The track is credited as being written by Mo Foster, Kim Goody, Richard Starkey, and Joe Walsh, the track was included on Starr's ninth studio solo album, Old Wave, which was produced by the Eagles' lead guitarist, Joe Walsh in 1983.\n\nThe single was re-released, this time on yellow vinyl for Jukebox's only, with &quot;She's About a Mover&quot; as the B-side, on the label, The Right Stuff on 1 November 1994, 11 years after the first release.\n\nIn 1987, Joe Walsh the single's producer and co-songwriter, recorded a cover version for his eighth studio solo album Got Any Gum?, which was released as a single and became a moderate hit.\n\nGot Any Gum? is the eighth solo studio album by the American singer-songwriter and multi-instrumentalist Joe Walsh. The album was released in late 1987 on the Warner Brothers and Full Moon labels in the United States and the United Kingdom, this was the last album to be released by either of those labels. The album features eight original songs written by Walsh with others and by himself. the album also features two covers, including the song &quot;In My Car&quot;, which was co-written by Walsh with Ringo Starr, the former drummer for The Beatles (the song was originally released on Starr's ninth studio solo album Old Wave, in 1983). The album also features vocal contributions from J. D. Souther and Survivor's lead vocalist Jimi Jamison.\n\nIn an interview with David Letterman, on the Late Night with David Letterman in October 1987, Walsh, while intoxicated, was asked about whether the album's title had a background, to which Walsh immediately responded &quot;Yeah, a bum!, I saw a bum about a block away and I knew he was going to ask me for spare change, so I reach in I'm all ready but he gets up to me and I say here help yourself he says I don't need money ya got any gum?&quot;\n\nJoseph Fidler &quot;Joe&quot; Walsh (born November 20, 1947) is an American singer, songwriter, composer, multi-instrumentalist, and record producer. In a career spanning more than 40 years, Walsh has been a member of five successful rock bands: the Eagles, the James Gang, Barnstorm, The Party Boys, and Ringo Starr &amp; His All-Starr Band. In the 1990s, he was also a member of the short-lived supergroup The Best. He has also experienced success both as a solo artist and prolific session musician, being featured on a wide array of other artists' recordings. In 2011, Rolling Stone placed Walsh at the number 54 spot on its list of &quot;100 Greatest Guitarists of All Time.&quot;\n\nWalsh joined the Eagles in 1975 as the group's keyboardist and guitarist following the departure of their founding member Bernie Leadon, with Hotel California being his first album with the band. In 1998 Guitarist magazine selected the guitar solos on the track &quot;Hotel California&quot; by Walsh and Don Felder as the best guitar solos of all time, and eighth of the Top 100 Guitar Solos.\n\nWalsh pursued a solo career and released his debut album The Smoker You Drink, the Player You Get in 1973. Since then, he has released twelve studio albums, six compilation albums and two live albums. His solo hits include &quot;Rocky Mountain Way&quot;, &quot;Life's Been Good&quot;, &quot;All Night Long&quot;, &quot;A Life of Illusion&quot; and &quot;Ordinary Average Guy&quot;.\n\nAs a member of the Eagles, Walsh was inducted into the Rock and Roll Hall of Fame in 1998, and into the Vocal Group Hall of Fame in 2001. The Eagles are considered to be one of the most influential bands of the 1970s, and they remain the best-selling American band in the history of popular music. Walsh's creative contribution to music has received praise from many of the best rock guitarists, including Led Zeppelin's former guitarist Jimmy Page, who praised Walsh by saying &quot;He has a tremendous feel for the instrument. I've loved his style since the early James Gang.&quot; Cream's former guitarist, Eric Clapton said that &quot;He's one of the best guitarists to surface in some time. I don't listen to many records, but I listen to his.&quot; The Who's guitarist Pete Townshend, a friend of Walsh's, commented that &quot;Joe Walsh is a fluid and intelligent player. There're not many like that around.&quot;\n(video has a white semi-transparent &quot;vh1 classic&quot; logo at the bottom right)\n\n\n    &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/In_My_Car_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/In_My_Car_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Got_Any_Gum%3F&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Got_Any_Gum%3F&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/5titksb01/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/5titksb01/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: MPEG Digital Audio 48000Hz stereo 384kbps\n   Duration: 00:03:36\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.9\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n*This is one of my first downloads when i got my first PC and got online soon after, downloaded through a site that allowed some free Usenet downloads at the time, and uploads of music videos. I have a few more from then i'm also posting today, they will also have this text","torrent":{"xt":"urn:btih:317dde05a7c8f86bf32637c3eda82626201ef94f","amp;dn":"Joe+Walsh+-+In+My+Car+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"317dde05a7c8f86bf32637c3eda82626201ef94f","infoHashBuffer":{"type":"Buffer","data":[49,125,222,5,167,200,248,107,243,38,55,195,237,168,38,38,32,30,249,79]},"announce":[],"urlList":[]}}