{"title":"Paula Abdul - Shut Up and Dance Mixes 320cbr","uid":9370611,"size":120468545,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3192b3aa91e2508f55830ae9e8b027308535ac48&amp;dn=Paula+Abdul+-+Shut+Up+and+Dance+Mixes+320cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387518539,"description":"Source: 1990 CD\n-\nPaula Abdul - Shut Up and Dance-Dance Mixes 320cbr (Big Papi) 1990\n-\n-\nBy J. Derek\n.....If you are a fan of late 80s/early 90s music and you love the remixes of that era, this is the release for you. And the title couldn't be more perfect, 'cuz it really does make you Shut Up and Dance!\n\nThe release contains remixes of the singles Paula Abdul released off her debut Forever Your Girl. As a quick overall analysis, every remix on this release maintains the original integrity of the songs, but they go above and beyond by taking each song to a new and awesome level of excitement through the creative genius of the remixers. The Quiverin' 12&quot; mix of &quot;Coldhearted&quot; really slams and get you on the dance floor in a hurry, and you get to yell along with the bridge chant several times. The Ultimix Mix of &quot;Straight Up&quot; is also a really strong body-slammin' mix that I think is much better than the original. I thought the original of &quot;One or the Other&quot; was kinda cheesy, but this 1990 Mix actually fills in the song quite a lot and improves it to a really catchy and funky groove. The Frankie Foncett Mix of &quot;Forever Your Girl&quot; is very danceable, however I have a slight problem with its tone. The original is very upbeat, fun, and happy, whereas this remix takes a darker, almost industrial tone in its bass and beat (though it does lighten up with some orchestration). Then there's the Pettibone 12&quot; mix of &quot;Knocked Out.&quot; Shep Pettibone, in my mind, is the god of late 80s/early 90s remixing (work he did for Janet Jackson, Jane Child and Level 42 confirm this affirmation). This mix really gets you bobbin' and weavin' to this awesome dance track.\nIn looking through my reviews, you'll see that while I like remix releases like this one, they usually fail to deliver an outstanding performance. This release is one of the rare exceptions - Shut Up and Dance is an awesome release that actually surpasses the original! Each mix takes the song to a new level of excellence and danceability that blows my mind. Thus this is one of the few remix releases that I will ever give a strong 5 star rating; it actually falls within my top 100 releases of all time.\n\nIf you are familiar with Forever Your Girl, and/or if you really love to dance and love the vibe of late 80s/early 90s pop dance tunes, this CD is a must buy. I, in fact, am going to purchase it myself, since I only have this release on tape and thought it was out of print.","torrent":{"xt":"urn:btih:3192b3aa91e2508f55830ae9e8b027308535ac48","amp;dn":"Paula+Abdul+-+Shut+Up+and+Dance+Mixes+320cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3192b3aa91e2508f55830ae9e8b027308535ac48","infoHashBuffer":{"type":"Buffer","data":[49,146,179,170,145,226,80,143,85,131,10,233,232,176,39,48,133,53,172,72]},"announce":[],"urlList":[]}}