{"title":"The Ultimate Zumba Fitness Experience (7 DVDRips)","uid":8407018,"size":9474964217,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:31d14d31f73ec3e7264cef66ed7f7a5ab6986cab&amp;dn=The+Ultimate+Zumba+Fitness+Experience+%287+DVDRips%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"stockels99","files":-1,"time":1366825747,"description":"The Zumba Fitness Exhilarate DVDRip collection is revolutionizing the at-home fitness experience, combining raw energy with cutting edge design, lights and sounds to take you on an unforgettable, exhilarating journey to a healthy and happy lifestyle. Jam-packed with red-hot dance steps, pulsating Latin and international rhythms, and feel-it-to-the-core routines, this invigorating dance-fitness party will have you movin', rockin' and shakin' the weight off. \nThe seven-disc DVDRip collection features seven total-body workouts and each routine utilizes varying levels of intensity to deliver a body-energizing workout that you'll want to move to again and again. The set includes breakdowns of basic steps, a 20-minute &quot;Rush&quot; workout, a 45-minute &quot;Activate&quot; workout, the &quot;Ripped&quot; workout featuring the ZumbaÂ® Toning program and breakthrough Zumba Sentao program, a 60-minute &quot;Exhilarate&quot; dance-fitness party, the &quot;Mix&quot; workout featuring rhythms from all over the world, and a massive Zumbathon Fitness-Concert live class. \n\n1 Step-By-Step \nThis DVDRip breaks down the basic Zumba rhythms: merengue, salsa, reggaeton, calypso, cumbia. belly dance. The steps are broken down by Gina and Tanya. You have the option of viewing the moves from both the front and back. \n\n2 Activate \nFeatures a 45-minute workout with Gina and Tanya that applies all the moves learned in the previous DVDRip. An easy-to-follow class to get you started. \n\n3 Rush \nA high-energy workout with two different instructors, Kass and Loretta, for when you do not have much time. A 20-minute workout to amp you up. \n\n4 Exhilarate \nFull-length (60-minute) workout with Beto and another instructor, Melissa. The original full-length fitness-party experience. \n\n5 Ripped \n60-minute body-sculpting workout that's split up in two sections. The first is Toning which uses the sticks, and is hosted by Beto and two other instructors, Jani and Melissa. The second is Sentao which features chair routines, and is hosted by Beto and another instructor, Marcie. \n\n6 Mix \nA rhythmic journey around the world. This DVDRip more advanced, and is hosted by Tanya and Beto, along with experts from around the world. You have the option of seeing the routines broken down beforehand, which is really helpful because some of the moves are really complicated! \n\n7 Fitness Concert \n60-minute live concert starring Beto and several of the instructors featured in the other DVDRips. The concert was filmed in front of thousands of Zumba enthusiasts and has the same songs found in the Exhilarate DVD. Experience the party live. ","torrent":{"xt":"urn:btih:31d14d31f73ec3e7264cef66ed7f7a5ab6986cab","amp;dn":"The+Ultimate+Zumba+Fitness+Experience+%287+DVDRips%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31d14d31f73ec3e7264cef66ed7f7a5ab6986cab","infoHashBuffer":{"type":"Buffer","data":[49,209,77,49,247,62,195,231,38,76,239,102,237,127,122,90,182,152,108,171]},"announce":[],"urlList":[]}}