{"title":"IMAGE COMICS WEEK OF 2013.04.03","uid":8345063,"size":726247822,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3209875138213df6c5bdee4f5fdd2b6aea67bee3&amp;dn=IMAGE+COMICS+WEEK+OF+2013.04.03&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"STFmaryville","files":-1,"time":1365178755,"description":"The comments were positive last week, so I may do this every week. The one problem I have (as a completist) is -- and I already knew this -- that there are certain titles that aren't released as a .CBR for days or weeks after they hit the shops and Comixology. So anyway, I will wait until Friday morning for the stragglers, but no longer.\n\nThis week's SPAWN #230 and SUPER DINOSAUR #18 are unavailable, and will be included next week if they show up!\n\nPlease seed and share. --STFmaryville\n\n------\n\n'68: Jungle Jim #1 (of 4)\n\nVietnam, 1968: Behind enemy lines, Private Brian Curliss is alone. The enemy caged him, the dead want to devour him and the voices in his head are driving him to madness. A madness that emerges in the form of an unstoppable killing machine wrapped in burlap and bamboo...\n\nCurliss is a one-man-army, sworn to wade through a wet red jungle gone straight to hell in search of a ghost named Jungle Jim. To the Viet Cong, he's a nightmare. To POWs trapped in enemy hands, he's salvation. To the legions of shambling, hungry dead...He's the Grim Reaper in a gas mask.\n\nMeatGrinder Studios and Image Comics return to the grim world of '68 with an all-new, four-issue series continuing the story of Jungle Jim. The brutal sequel to the original one-shot, Jungle Jim #1 fleshes out the new dark star of the Vietnam/Zombie apocalypse. Scripted by Mark Kidwell with savage artwork by Jeff Zornow and Jay Fotos. Covers by Jeff Zornow, Nat Jones and Jay Fotos.\n\nGenre: Horror\t\n\n\nBedlam #6\n\n&quot;Confession.&quot;\n\n\nBlackacre #5\n\nThe stunning finale to arc one! A night of terror in the Hinterlands. A day of reckoning in BlackAcre. The mission's collapsed, but the fallout's just begun...\n\n\nGlory #34\n\n&quot;THE END&quot;\n\n100 Years Later. Goodbye.\n\nFINAL ISSUE\n\n\nGreat Pacific #6\n\n&quot;TRASHED!&quot; Conclusion\n\nThe United States Navy has come to drag fugitive, would-be Garbage Patch ruler Chas Worthington back to the America he left. But Chas has one more trick up his sleeve, and the future of New Texas will never be the same.\n\n\nThe Mice Templar IV: Legend #1\n\n&quot;A DANGEROUS FAITH&quot;\n\nLong ago, the valiant Templar destroyed themselves through a vicious civil war, allowing the bloodthirsty crusade of the tyrant king Icarus to destroy mouse culture. Yet the inspiring tale of the young mouse Karic promises to restore the fractured Templar and overthrow the mad king. But while some accept Karic as a prophecy for good, still others see his rising legend as an omen of evil.\n\nThus begins the climactic chapter in the epic saga of hope and despair, of tragedy and triumph, and where every secret will at last be revealed.\n\nGenres: Action/Adventure, Fantasy\t\n\n\nMind The Gap #9\n\n&quot;WISH YOU WERE HERE,&quot; Part Four\n\nA loss of life! A loss of innocence! A terrifying return! Actions are taken and consequences are so far reaching in this SILENT issue that will have you holding your breath &amp; leaving you speechless.\n\n\nRepossessed #4 (of 4)\n\nThe miniseries ends with a bang and a boom when the repo from Dee Agency learn way more than they bargained for and are left to decide on a trip to the West Coast to face the biggest threat they have ever encountered!\n\n\nSavage Dragon #186\n\n&quot;THE LONG GOODBYE&quot;\n\nThe next generation of the Vicious Circle is rising. The city of Chicago sits on the brink of destruction. With his world crashing around him, Malcolm Dragon loses the one person he needs the most: his adopted sister Angel. Now Malcolm Dragon faces his greatest challenge ever -- alone.\n\nGenres: Action/Adventure, Superhero\t\n\n\nSnapshot #3 (of 4)\n\nHunted by a ruthless killer who has framed them for murder, Jake and Callie try to infiltrate the mysterious gated community at the heart of the deadly conspiracy. But nothing can prepare them for what they will find there. Continuing the new thriller from the creators of The Losers and Green Arrow: Year One!\n\n\nSon of Merlin #3\n\nMorgana never anticipated that Merlin's bastard son, the MIT professor Simon Ambrose, would delay her plan to obtain the Stone of Giramphiel. But even with the power inherent in Merlin's diary, Simon isn't ready to face her in battle. To seek refuge from Morgana's grasp, Simon will need to call upon enchanters of old who have spent the past century hiding in plain sight in New York City.\n\n\nSpawn #230\n\nScan Not Yet Released\n\n\nSuper Dinosaur #18\n\nScan Not Yet Released\n\n\nWitchblade #165\n\n&quot;CRUMBLING&quot;\n\nSara Pezzini is no longer in the dark. She remembers her life the way it used to be, the family she used to have. A mother without a daughter, Sara also feels the full guilt for her actions committed during a different life. All she wants to do is hole up and grieve. But her investigation into the Chicago underbelly is catching up to her, and it's not concerned with the personal time she wants to take for herself.\n\nGenre: Supernatural\t\n","torrent":{"xt":"urn:btih:3209875138213df6c5bdee4f5fdd2b6aea67bee3","amp;dn":"IMAGE+COMICS+WEEK+OF+2013.04.03","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3209875138213df6c5bdee4f5fdd2b6aea67bee3","infoHashBuffer":{"type":"Buffer","data":[50,9,135,81,56,33,61,246,197,189,238,79,95,221,43,106,234,103,190,227]},"announce":[],"urlList":[]}}