{"title":"EXPLOITED COLLEGE GIRLS - Jen - Petite Hot Goodness 720p **NEW**","uid":10911732,"size":2083868634,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:326d56f73e7fc9c7ab320bfad41a8f34e60b44d2&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Jen+-+Petite+Hot+Goodness+720p+%2A%2ANEW%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"beta2008x","files":1,"time":1409273655,"description":" &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=t80fz_jen.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=t80fz_jen.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=e1pff_ecg_14_08_28_jen_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=e1pff_ecg_14_08_28_jen_s.jpg&lt;/a&gt;\n\n\nWhen you get a peek at 20 year old Jen you are probably going to have a few &quot;Holy shit, really?&quot; moments, like when you see her perfect perky A cup tits or her washboard flat abs, or maybe when you get a look at her perfect double handful bubble butt. Jaw open, you'll be staring and thinking, &quot;Holy shit, really? This girl has an ass THAT fine?&quot; But for real Ex Co Gi fans your best moment will come about 7 minutes into this update when we observe Jen unpacking her things and notice that everything she owns is packed tightly into zip top bags. Holy shit, really?\n\nAnyway, obvious OCD aside, Jen is a fine example of the female of the species. She's a little ever 5 feet tall and has as many curves as you can expect from a girl who clocks in at 100 lbs soaking wet. And, believe it, soaking wet she is. When she strips for Jay and spreads her legs, all of the important parts are already glistening.\n\nAfter giving her a nice warm up O with his fingers and then a second with a vibrator, things start to heat up. Jen gets to her knees and performs some great oral. It's good, but it's surprisingly good considering how hot Jen is. It's rare to see girls this attractive who love getting a thrustful of dick. Jen absolutely does and it shows. As a thanks, Jay pounds her tiny frame in every position he can think of: doggy, where he pulls her arms back and drills her deep enough to poke her stomach; face down and cowgirl where she bounces on his cock like they are fucking in zero gravity.\n\nThen to top things off, while Ex Co Gi facials are pretty legendary this one goes slightly awry in the best way possible. After Jen gets to her knees she takes control of Jay's firehouse she tugs and jacks him straight into her mouth where she managed to swallow almost everything with the cutest little smile. You can't help but think, as you watch, &quot;Holy shit, really?&quot;\n","torrent":{"xt":"urn:btih:326d56f73e7fc9c7ab320bfad41a8f34e60b44d2","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Jen+-+Petite+Hot+Goodness+720p+%2A%2ANEW%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"326d56f73e7fc9c7ab320bfad41a8f34e60b44d2","infoHashBuffer":{"type":"Buffer","data":[50,109,86,247,62,127,201,199,171,50,11,250,212,26,143,52,230,11,68,210]},"announce":[],"urlList":[]}}