{"title":"The Mar-Keys - The Great Memphis Sound (1966) [Jazz][mp3 320][h3","uid":4838875,"size":75603270,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:32e3b33b4691679c031462c5f2736a45aaff2a04&amp;dn=The+Mar-Keys+-+The+Great+Memphis+Sound+%281966%29+%5BJazz%5D%5Bmp3+320%5D%5Bh3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":16,"time":1239424902,"description":"The Mar-Keys - The Great Memphis Sound\nOriginal Release Date: 1966 \nAudio CD: November 5, 1991 \nLabel: Atlantic / Wea \nBitrate: 320 kbps\n\nA case of good time party music, albeit clearly overshadowed by its creators' historical importance.  Far beyond the novelty of 1961's &quot;Last Night,&quot; some of the Mar-Keys went on to immortalize themselves as the solid backbone of Southern soul in its prime. As can be learned from editor Robert Gordon's It Came from Memphis, most of the original members weren't allowed to play on the first two studio albums. Instead, these barely 18-year-olds were sent out on tour pretty much on a permanent basis. After two years they disbanded, fed up with each other and allegedly driving their tour bus into the sea. Fast forward to 1965 and the Mar-Keys Mach II. Booker T. &amp; the M.G.'s and the Memphis Horns were beginning to build a reputation, backing early Stax sides and releasing albums in their own right. Whether a payback or maybe just for good measure, the M.G.'s guitarist Steve Cropper and Wayne Jackson of the Memphis Horns decided to put together another Mar-Keys record. Bringing in respective bandmembers Al Jackson, Jr. and Andrew Love, they were joined by a third original Mar-Keys member Donald &quot;Duck&quot; Dunn, the bass player who was about to replace Lewis Steinberg in the M.G.'s. Also on board was Isaac Hayes helping out on organ, as he would regularly fill in for Booker T. whenever the band was booked twice in one night in different locations. The Great Memphis Sound easily stands out from its two predecessors, as it refrains from novelties inspired by a certain sailor man. Well intended instrumental versions of jazz and popular standards are also kept at a minimum. In its place are the tightly locked groove of &quot;Grab This Thing&quot; and &quot;Philly Dog,&quot; their slightly speeded up version of Rufus Thomas' &quot;The Dog.&quot; The latter managed to return them to the Top 20 of the R&amp;B charts and rounded off a James Brown medley, which works quite well as a showcase for the Memphis Horns. Without a doubt the albums' standout track is &quot;Plantation Inn.&quot; Named after the Memphis club which catered for some of the best black music to white audiences, this tribute is more than likely inspired by adolescent Mar-Keys regularly sneaking in and learning the trade from the legendary musicians. It practically begs to be used by Quentin Tarantino, in a similar way he employed the Meters' &quot;Cissy Strut&quot; for the movie Jackie Brown. ~ Quint Kik, All Music Guide\n\n&quot;The Mar-Keys, formed in 1958, were a studio session band for the Stax label from Memphis, Tennessee, in the 1960s.  As the first house band for the label, their backing music formed the foundation for the early 1960s Stax sound.  The Mar-Keys was a play on the word &quot;marquee&quot; referring to the marquee outside of Stax studios (at the time called Satellite Records).  They also recorded organ and saxophone oriented singles of their own, scoring a number three hit nationally with &quot;Last Night&quot; in 1961.  Keyboard was played by Jerry Lee &quot;Smoochy&quot; Smith.  Other singles of theirs from the early 1960s include &quot;Philly Dog&quot; and &quot;Pop-eye Stroll.&quot; Members of this rhythm section later formed other nationally prominent Memphis studio session groups, including the Memphis Horns, the Packers, and Booker T. &amp; the M.G.'s.  Each of these offshoot groups also recorded popular instrumental albums of their own, in addition to serving as the backing band on albums by dozens of rock, r&amp;b, and soul music stars on Stax, Volt and other national labels.  The legacy of the Mar-Keys and later groups was that of having been key players in the development of soul music styles like Southern soul and Memphis soul.  This 1966 out-of-print date is fun, feelgood music, perfect for those spring Sunday nights, enjoy. &quot; \n\nPersonel:\nSteve Cropper - guitar\nDonald &quot;Duck&quot; Dunn - bass\nCharles &quot;Packy&quot; Axton - tenor sax\nDon Nix - saxophone\nJames Terry Johnson - piano\nWayne Jackson - trombone, trumpet\nJerry Lee &quot;Smoochie&quot; Smith - keyboards\nBooker T. Jones - keyboards\nIsaac Hayes - organ\nJames Terry Johnson - drums\nAl Jackson - drums\n\nThe Mar-Keys - The Great Memphis Sound Tracks:\n01  Honey Pot\n02  Plantation Inn\n03  Loving You Too Long\n04  Cleo's Back\n05  Grab This Thing\n06  Philly Dog\n07  Walking With The Duke\n08  The Girl From Ipanema\n09  In The Mood\n10  &quot;Dear James&quot; Medley (Night Train, Papa's Got A Brand New Bag, I Got You, Good Loving, I'll Go Crazy)","torrent":{"xt":"urn:btih:32e3b33b4691679c031462c5f2736a45aaff2a04","amp;dn":"The+Mar-Keys+-+The+Great+Memphis+Sound+%281966%29+%5BJazz%5D%5Bmp3+320%5D%5Bh3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32e3b33b4691679c031462c5f2736a45aaff2a04","infoHashBuffer":{"type":"Buffer","data":[50,227,179,59,70,145,103,156,3,20,98,197,242,115,106,69,170,255,42,4]},"announce":[],"urlList":[]}}