{"title":"Albion (1995) - WIN-ALL ","uid":8798952,"size":292342705,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:32e64b54491433b7f9a6121a1a6deb6e891b9ae8&amp;dn=Albion+%281995%29+-+WIN-ALL+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1376148948,"description":"You are the commander of a small space shuttle which is making a reconnaissance flight for a big factory ship, when suddenly all your systems crash, you lose control, and are forced to land on a wild and unknown planet. I know the story doesn't seem very original so far, but it will get better very soon.\n\nYou are the pilot Tom Driscoll, and you have to prepare yourself for the space shuttle flight. The short prologue will introduce you to the character of Tom, and you'll also find out useful facts about your mission.\n\nHowever, something happened while your character was asleep: A crew member committed suicide. Since the officers and the captain want to find out what happened, a whole section of the ship has been cordoned off by the security guards. Now you have to make your first decision: Will you go to your shuttle and leave the ship, or will you snoop around, find out something about the murder, and discover some useful items? Your decision isn't crucial for the rest of the game, but you will learn more about the controls and how to solve problems in the game if you stay on the ship. Also, some items on the ship will make later adventures much easier.\n\nAnyway, when you embark on the shuttle, you will get to know Rainer, a scientist who should help you with any problems you might have on the flight. He is also a very important and helpful character. After you crash, your first overwhelming impressions of this strange jungle world will soon be crushed as your shuttle explodes.\n\nAfter you regain consciousness, you are surrounded by the strange but beautiful Iskai (cat creatures), who won't eat you - for now. Through skillful negotiations and good manners you will quickly earn the trust of the Iskai and a fantastic journey begins.\n\nAlbion is one of those RPGs for which I can only say the following: If you've never got around to playing it, then you don't know what a good RPG is! It doesn't have realistic 3D graphics or a big character menu like modern games, but Albion does have its own charm. The graphics are good (2D birds-eye perspective AND 3D first person perspective), the sounds are various and convey a great atmosphere, and the controls are simple and easy to learn.\n\nFights are round-based (don't scream), but nevertheless very exciting. As on a chessboard, you will have to move your characters and bring them into position. Also, you will have to react to the movements of the enemy. There is a large selection of weapons you can use. First of all, there are short-range weapons like swords, axes and staves, and also long-range weapons like bows, pistols (!) and crossbows. Since it's an RPG, there are of course also spells at your disposal. You can also choose among many types of armor.\n\nAnother very positive point is the quantity of items in the game. Every item has a function and a value. Always try out items that you find in your adventures. Be sure to take them with you if you think they could be important, or sell them at the next dealer. With the gold you receive, you can buy new equipment for your characters. (I'll give you one tip: It doesn't help if you store all your gold, because the total mass of items your characters can carry is limited, and so is the space in cupboards and chests. Make money and buy new and better equipment for your characters. This makes the game easier.)\n\nApart from armor and weapons, you will have to buy food. Because your characters become tired after only a couple of fights or long walks, let them rest periodically.\n\nHowever, all these great things are nothing compared to the story itself. It features many (and I mean MANY) surprises and is very gripping. After a few hours' playing and getting immersed in the storyline, you simply can't stop! But be careful. The game is long, and you won't finish it in a few hours (it took me 2 weeks). There are also some new surprises and things to discover if you play it several times.\n\nAll in all, Albion is one of the best RPGs ever. A gripping story, a wonderful world, interesting characters, and very good sounds and good graphics make this game a must-have for any RPG-fan, as well as any other player. It deserves a clear 5, though I would give it a 10 if I could.\n\n\n1.Extract anywhere.\n2.Press &quot;START THE GAME&quot; batch file.\n3.Play.\n\nCompatible with WIN-ALL\t","torrent":{"xt":"urn:btih:32e64b54491433b7f9a6121a1a6deb6e891b9ae8","amp;dn":"Albion+%281995%29+-+WIN-ALL+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32e64b54491433b7f9a6121a1a6deb6e891b9ae8","infoHashBuffer":{"type":"Buffer","data":[50,230,75,84,73,20,51,183,249,166,18,26,26,109,235,110,137,27,154,232]},"announce":[],"urlList":[]}}