{"title":"Pearl Divers DVDRip [Uncensored].mp4","uid":5908213,"size":669412153,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:33814775f4ca28705c5435d6d2f3f75b0cfec3cd&amp;dn=Pearl+Divers+DVDRip+%5BUncensored%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"1.No.1","files":-1,"time":1287962105,"description":"Pearl Divers DVDRip [Uncensored].mp4\n\nTags: All Girl, Asian, Hardcore, Uncensored, XXX, Adult\n\nResolution     640 x 480\n\nLength         01:50:00\n\nScene Breakdown\n\nPearl Divers, Scene 1\nLength: 23:29 minutes\n\nCategories: Asian, Cunnilingus, Gonzo, Japanese, Lesbians, Sex Toys, Threesome\n\nAll-Asian girl-on-girl-on-girl action reaches new depths as three lovely Japanese lasses get together on a queen-sized bed for a lesbian love-session of dynastic proportions. Nimble tongues and polished, pointed fingernails sample the mysteries of each girl's forbidden places as the three-woman muff-diving team slurp and stroke each other's little sailors. Then they break out the long, red and green dildoes, which look strangely like transparent pieces of bamboo, and a bulbous, black vibrator, for an anal penetration that will last us ten thousand years. Banzai!\n\nPearl Divers, Scene 2\nLength: 8:27 minutes\n\nCategories: Asian, Gonzo, Japanese, Lesbians, One-on-One, Sex Toys\n\nThis is a mini-scene, so the girls don't waste time; by the first frame, the green dildo is already inches deep in one girl's greasy asshole. Then a big, black vibrator makes an appearance as the girls share a suck on a huge, red double-dong (let's call it &quot;Godzilla&quot;). The ladies also share the massive plastic cock in their wet little pussies, inching closer and closer to each other before buzzing themselves over the edge with little green men.\n\nPearl Divers, Scene 3\nLength: 18:11 minutes\n\nCategories: All Girl, Asian, Cunnilingus, Gonzo, Japanese, Lesbians, One-on-One, Strap-On\n\nA couple of Japanese lesbi-hotties frolic on a bed, all by their lonesome. They don't need any wannabe Samurai joining in, but they do make use of a big, red, two-headed rubber sword (with only one set of nuts!). They're properly equipped for myriad oral and manual delights - heck, who knows how to lick and frig a pussy better than someone who owns one? But when they need that good, deep dickin', out comes the weaponry! A little, black robo-dong seals the deal, bringing their tangy twats together one last time. Thank you, Arigato, Mister Roboto!\n\nPearl Divers, Scene 4\nLength: 23:58 minutes\n\nCategories: Asian, Big Boobs, Gonzo, Japanese, Lesbians, One-on-One, Sex Toys\n\nIts been said that the homogeneity of Japanese society helps the islanders behave more harmoniously. Does that mean if a girl fucks another girl instead of a man, things go smoother? You be the judge - seems like these two lesbians are getting along pretty well. This young, gorgeous Asian tandem share a hot French kiss, then really get it on, good ol' American porno style. They lick each other's pussies, then Tora, Tora, Tora! It's time for the real surprise attack, with the two-headed, one scrotum-ed dildo. Lovely golden-white flesh intertwining makes for an epic sunset. \n\t\nSize\t       638.40 MB \n\nScreens\n &lt;a href=&quot;\nhttp://www.pixsor.com/share-651A_4CC4A163.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pixsor.com/share-651A_4CC4A163.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pixsor.com/share-5DE8_4CC4A163.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pixsor.com/share-5DE8_4CC4A163.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pixsor.com/share-45AD_4CC4A163.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pixsor.com/share-45AD_4CC4A163.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pixsor.com/share-E348_4CC4A163.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pixsor.com/share-E348_4CC4A163.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pixsor.com/share-8577_4CC4A163.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pixsor.com/share-8577_4CC4A163.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:33814775f4ca28705c5435d6d2f3f75b0cfec3cd","amp;dn":"Pearl+Divers+DVDRip+%5BUncensored%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33814775f4ca28705c5435d6d2f3f75b0cfec3cd","infoHashBuffer":{"type":"Buffer","data":[51,129,71,117,244,202,40,112,92,84,53,214,210,243,247,91,12,254,195,205]},"announce":[],"urlList":[]}}