{"title":"Samsung C300 Unlocker","uid":4936670,"size":12817956,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:33cc8e4bea4f314b7781ff9e2d88124b8f8f7007&amp;dn=Samsung+C300+Unlocker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shemyaza","files":1,"time":1244279324,"description":"Samsung C300 Unlock Software\n\nThis is an unlocker application for the Samsung SGH-C300 Mobile Phone.\n\nFirstly, you need a Samsung data cable in order to unlock your phone. I would suggest any one of the A300/D500/D600/E700/E800 serial cables. Avoid using a USB cable if at all possible as they tend to be unreliable for this type of operation.\n\nUnlocking this phone is a two stage process as you first need to downgrade the handset firmware in order to use the unlocker. The firmware downgrade is perfectly safe and in no way limits the functionality of the phone.\n\nTo unlock your phone see the following:\n\n1.  Copy the folder C300 to the root of your C: drive.\n\n2.  Switch off your phone and connect it via the data cable to your computer's serial port\n\n3.  In the C300 folder click on the Flash shortcut.\n\n4.  From the OptiFlash application, select the correct port: Options &gt; Settings &gt; COM Port using the drop down menu.\n\n5.  Click on Flash to begin the firmware downgrade.\n\n6.  You will then be instructed to power on the phone to complete the flash process.\n\n7.  Once this is complete you will see an All is well ! message.\n\n8.  close OptiFlash and click on the Unlock shortcut in the C300 folder.\n\n9.  Select the COM port and click Unlock.\n\n10. You will see the following messages in the information window:\n \n    Test Mode ...\n  \n    Test Mode OK\n \n    Unlocking ...\n \n    Unlock OK\n\n11. Disconnect the data cable from your phone and remove the battery.\n\n12. Replace the battery and power on the phone.\n\n13. Your phone is now unlocked.\n \nPlease note that the phone language will be changed to Turkish as a result of the firmware flash but you can change it back to the language of your choice by selecting Menu &gt; 9.Phone Settings &gt; 5.Language.","torrent":{"xt":"urn:btih:33cc8e4bea4f314b7781ff9e2d88124b8f8f7007","amp;dn":"Samsung+C300+Unlocker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33cc8e4bea4f314b7781ff9e2d88124b8f8f7007","infoHashBuffer":{"type":"Buffer","data":[51,204,142,75,234,79,49,75,119,129,255,158,45,136,18,75,143,143,112,7]},"announce":[],"urlList":[]}}