{"title":"Magicians - World's Greatest Magic - Three Card Monte vol.3 DVDR","uid":7549429,"size":732690663,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3417c67afd30db940d37f96b0e42c767bd632803&amp;dn=Magicians+-+World%27s+Greatest+Magic+-+Three+Card+Monte+vol.3+DVDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MagicManPC","files":4,"time":1345440598,"description":"\nWorld's Greatest Magic - The Last Word On Three Card Monte vol.3\n &lt;a href=&quot;\nhttp://www.llpub.com/zenshop/index.php?main_page=product_info&amp;cPath=27&amp;products_id=2708&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.llpub.com/zenshop/index.php?main_page=product_info&amp;cPath=27&amp;products_id=2708&lt;/a&gt;\n\nIn Volume 3, you'll see five skilled magicians each with a singular perspective on Three Card Monte as entertainment. \n\nJon Armstrong is first with a very commercial routine that has the spectator trying to find the one card they signed among blank cards. \n\nJohn Mendoza takes his audience back to an encounter with a carnival swindler.\n\nDarwin Ortiz displays the skills that have made him a world-class gambling consultant. \n\nDoc Eason teaches the ins and outs of what makes Three Card Monte such a great piece of card magic (along with super-practice sessions to help ensure mastery).\n\nDan Harlan brings the swindle to a real-world environment.\n\nFinally, as a bonus, Patrick Page gives up the real work on the legendary Three Card Trick - Patrick Page's handling of what has been called the Dutch Looper, the Kitson Miracle and, finally, just The Three Card Trick, is arguably one of the great effects in magic. It was the trick that he always carried with him and it became one of this legendary magician's signature effects. A completely in-the-hands monte effect, a Queen and two indifferent cards are shown. No matter how fairly the cards are fanned, the spectator is unable to find the Queen. What's more, the Queen seems to vanish and reappear repeatedly, all at the performer's whim. For the startling finale, the cards are laid on the table one at a time to show that the Queen has vanished for good. No extra cards - nothing to add or take away - just one very diabolical secret.\n\n----------------------------------------------\nYou can download the full DVDs and the rest \nof the series on Usenet at alt.binaries.magic \n(see the included pdf in this download).\n----------------------------------------------\n\nEnjoy\n","torrent":{"xt":"urn:btih:3417c67afd30db940d37f96b0e42c767bd632803","amp;dn":"Magicians+-+World%27s+Greatest+Magic+-+Three+Card+Monte+vol.3+DVDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3417c67afd30db940d37f96b0e42c767bd632803","infoHashBuffer":{"type":"Buffer","data":[52,23,198,122,253,48,219,148,13,55,249,107,14,66,199,103,189,99,40,3]},"announce":[],"urlList":[]}}