{"title":"WWE The Beast From The East 2015-07-04 720p AVCHD-SC-SDH","uid":12090326,"size":4349967994,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:342d5a9df0e0622b749721f877a57f7bdcab9f5d&amp;dn=WWE+The+Beast+From+The+East+2015-07-04+720p+AVCHD-SC-SDH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SCSA420","files":5,"time":1436027804,"description":"\n\nStoneCold420 presents another High Quality 720p H264 release for the wrestling fans around the world here exclusively on KickAss Torrents and The Pirate Bay.\n\n\nWWE The Beast From The East 2015-07-04 720p AVCHD-SC-SDH\n\nThis is the 1st WWE event to ever be broadcast live from Tokyo, Japan at 5:30AM in the USA on the 4th of July 2015  A.K.A.  Independence Day \n\n\nWWE The Beast From The East \nRyogoku Kokugikan\nSumida, Tokyo, Japan\nJuly 4, 2015\n\n\n\nKane and King Barrett \nvs\nDolph Ziggler and John Cena\n\n\nAppearances by Hideo Itami and WWE Hall of Famer Tatsumi Fujinami\n\n\nWWE NXT Championship Title Match\nFinn Balor \nvs\nKevin Owens\n\n\nBrock Lesnar\nvs \nKofi Kingston \n\n\nWWE Divas Title Match\nPaige \nvs\nNikki Bella\nvs\nTamina Snuka \n\n\nNeville \nvs\nChris Jericho\n\n\nMichael Cole and Byron Saxton call the action\n\n\n\nThis is SDH release #1,832 for the wrestling fans from a wrestling fan. First aired and captured from HDMI in H264 AVCHD at 8,000 kbps from the 16:9 widescreen 1280 x 720p resolution HD source on 07/04/2015 on the PS4 WWE Network. Framerate is 29.970 with an average Video Bitrate of 4,500 kbps in a High Quality 4.05 GB 720p H264 AVCHD MP4 release with 48khz 384 kbps AAC 2 channel stereo audio Part 1 is 50:56 and Part 2 is 1:07:58 \n\nThis is my 1,102nd official 720p H264 AVCHD-SC-SDH release. Enjoy the show WWE fans. \n\nThis release is 2 parts because the size is more then 4 GB. Part 1 is 1.73 GB and Part 2 is 2.31 GB. This release is in H264 AVCHD MP4 format with AAC 2 channel stereo audio. This release is playable with Sony Playstation 3, Xbox 360, Samsung Galaxy S III, SIV, S5, S6 smartphones, iPhone, iPad, VLC player as well as Media Player Classic, Windows Media Player, and any other devices capable of playing 720p HD MP4 video files with AAC 2 channel stereo audio.\n\n\nMy releases are in MP4 format with AAC 2 channel stereo audio so that they are playable with VLC player as well as Media Player Classic, Windows Media Player, Sony Playstation 3, Playstation 4, Xbox 360, Xbox One, Samsung Galaxy S III, S4, S5, S6 smartphones, iPhones, iPads, and any other devices capable of playing 720p HD MP4 video files. \n\nTo ensure that you can get proper playback be sure you have installed the K-lite codec pack full version or mega version both of which comes with Media Player Classic Home Cinema and configure it properly for .mkv and .mp4 playback. If you do not have it you can get it here below: \n  &lt;a href=&quot;\nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm&lt;/a&gt; \n\nOnce installed you can playback the .mp4 file with the following players:\n\nMedia Player Classic or Windows Media Player. \n\n\nEnjoy the WWE The Beast From The East show wrestling fans and thanks for downloading my WWE The Beast From The East 2015-07-04 720p AVCHD-SC-SDH release. \n\n\nUploaded by SCSA420 on ThePirateBay and KickAss Torrents\n\n\nATTENTION: PLEASE FEEL FREE TO UPLOAD MY RELEASES ANYWHERE BUT DON'T ADD YOUR NAME TO MY HARD WORK and IF this show is uploaded on XWT then please keep the folder and files as they are and DO NOT RENAME the files or retag them with another name!!! Thank You!!!\n\nI work on my own so that I get all the credit for my hard work each and every week!!! \n\nBest Played With Media Player Classic or VLC Player \n\nThis Release is brought to you by SCSA420 The &quot;VIP Uploader&quot; on ThePirateBay and &quot;Elite Uploader&quot; on Kickass Torrents where I have earned my VIP and Elite Uploader status by being on time consistently 1st and NEVER missing a wrestling show. Thank you Wrestling fans around the world for your support I appreciate it!!! Hey you F'N WWE Lawyer Jabroni's I don't make money doing this I do it simply for the love of sharing with other wrestling fans and if you aren't down with that then I got 2 words for ya SUCK IT and that's the bottomline cause SCSA420 said so!!!\n\n\nStoneCold420 \nSmackDownHotel\nJuly 4, 2015\n\n\n@SCSA420 on Twitter\n\n\nFor SC-SDH releases find me on KAT at: &lt;a href=&quot; https://kat.cr/user/SCSA420&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://kat.cr/user/SCSA420&lt;/a&gt;\nor on The Pirate Bay at: https://thepiratebay.mn/user/SCSA420\n\n\nPlease check out the WrestleReaction show at: http://WrestleReaction.net","torrent":{"xt":"urn:btih:342d5a9df0e0622b749721f877a57f7bdcab9f5d","amp;dn":"WWE+The+Beast+From+The+East+2015-07-04+720p+AVCHD-SC-SDH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"342d5a9df0e0622b749721f877a57f7bdcab9f5d","infoHashBuffer":{"type":"Buffer","data":[52,45,90,157,240,224,98,43,116,151,33,248,119,165,127,123,220,171,159,93]},"announce":[],"urlList":[]}}