{"title":"Asset Pricing, Revised Edition","uid":10123253,"size":3878600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34e7e0cf75ffa16af6246627796e32a6fdd6f1fa&amp;dn=Asset+Pricing%2C+Revised+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1399713503,"description":"ABOUT THIS BOOK\nWinner of the prestigious Paul A. Samuelson Award for scholarly writing on lifelong financial security, John Cochrane's Asset Pricing now appears in a revised edition that unifies and brings the science of asset pricing up to date for advanced students and professionals. Cochrane traces the pricing of all assets back to a single idea--price equals expected discounted payoff--that captures the macro-economic risks underlying each security's value. By using a single, stochastic discount factor rather than a separate set of tricks for each asset class, Cochrane builds a unified account of modern asset pricing. He presents applications to stocks, bonds, and options. Each model--consumption based, CAPM, multifactor, term structure, and option pricing--is derived as a different specification of the discounted factor.\n\nThe discount factor framework also leads to a state-space geometry for mean-variance frontiers and asset pricing models. It puts payoffs in different states of nature on the axes rather than mean and variance of return, leading to a new and conveniently linear geometrical representation of asset pricing ideas.\n\nCochrane approaches empirical work with the Generalized Method of Moments, which studies sample average prices and discounted payoffs to determine whether price does equal expected discounted payoff. He translates between the discount factor, GMM, and state-space language and the beta, mean-variance, and regression language common in empirical work and earlier theory.\n\nThe book also includes a review of recent empirical work on return predictability, value and other puzzles in the cross section, and equity premium puzzles and their resolution. Written to be a summary for academics and professionals as well as a textbook, this book condenses and advances recent scholarship in financial economics.","torrent":{"xt":"urn:btih:34e7e0cf75ffa16af6246627796e32a6fdd6f1fa","amp;dn":"Asset+Pricing%2C+Revised+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34e7e0cf75ffa16af6246627796e32a6fdd6f1fa","infoHashBuffer":{"type":"Buffer","data":[52,231,224,207,117,255,161,106,246,36,102,39,121,110,50,166,253,214,241,250]},"announce":[],"urlList":[]}}