{"title":"Advanced Synthesis of Gold and Zirconia Nanoparticles and Their ","uid":12015321,"size":2814461,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3513460db721b5c350f3e0ed7cbb86d7700e3aed&amp;dn=Advanced+Synthesis+of+Gold+and+Zirconia+Nanoparticles+and+Their+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1434296349,"description":"ISBN 978-3-8366-4199-9\n\nThe development of small and smallest particle is one of today's key features in modern science. The goal is to form materials with improved properties than their &quot;classical&quot; ancestors with just a fractional amount of raw material. However, the characterization of these particles is as important as their way of preparation. Different techniques with their origins in physics, inorganic, organic and physical chemistry have to be combined to reveal the secrets of this important field of science. This book gives a short overview of theoretical basics and synthesis methods to form and characterize gold and zirconia nanoparticles. Phenomenon like plasmon resonance self-assembly of surfactants and the different structures of ZnO2 are explained. Furthermore, analytical tools, like small angle X-ray scattering, X-ray powder diffraction and scanning electron microscopy are introduced. In addition, details on the synthesis of gold and zirconia nanoparticles are presented and are examined by the mentioned analytical and calorimetric methods","torrent":{"xt":"urn:btih:3513460db721b5c350f3e0ed7cbb86d7700e3aed","amp;dn":"Advanced+Synthesis+of+Gold+and+Zirconia+Nanoparticles+and+Their+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3513460db721b5c350f3e0ed7cbb86d7700e3aed","infoHashBuffer":{"type":"Buffer","data":[53,19,70,13,183,33,181,195,80,243,224,237,124,187,134,215,112,14,58,237]},"announce":[],"urlList":[]}}