{"title":"The Vibrators - Pure Mania (1978)-SHAREGO-{SECTION8}","uid":4391902,"size":42996701,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3514efb7ec46232cf21ad4b6532d6f6ac5daac2b&amp;dn=The+Vibrators+-+Pure+Mania+%281978%29-SHAREGO-%7BSECTION8%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dodgerblue","files":20,"time":1221180052,"description":"The Vibrators - Pure Mania (1978)-SHAREGO-{SECTION8}\n15 TRACKS@ 160KBS-SIZE 41 MB\nListen\t  1. Into The Future... (Album Version)\t 2:19\t\nListen\t  2. Yeah, Yeah, Yeah (Album Version)\t1:19\t\nListen\t  3. Sweet Sweet Heart (Album Version)\t2:36\t\nListen\t  4. Keep It Clean (Album Version)\t2:57\nListen\t  5. Baby, Baby (Live)\t3:43\nListen\t  6. No Heart (Live)\t1:51\nListen\t  7. She&amp;#039;s Bringing You Down (Live)\t\nListen\t  8. Petrol (Album Version)\t2:09\nListen\t  9. London Girls (Live)\t2:32\nListen\t10. You Broke My Heart (Album Version)\t3:29\nListen\t11. Whips And Furs (Album Version)\t2:13\nListen\t12. Stiff Little Fingers (Album Version)\t2:18\nListen\t13. Wrecked On You (Album Version)\t1:29\nListen\t14. I Need A Slave (Live)\t1:42\t\nListen\t15. Bad Time (Album Version)\n\n\nWith a career lasting thirty-one years, vocalist/guitarist IAN &quot;KNOX&quot; CARNOCHAN, bassist PAT COLLIER, guitarist JOHN ELLIS and drummer EDDIE originally formed the VIBRATORS in February 1976, and their first gig was supporting THE STRANGLERS at Hornsey Art College in North London. They supported THE SEX PISTOLS at the 100 CLUB and were one of the bands playing at the now legendary 100 CLUB PUNK ROCK FESTIVAL, where as well as doing their own set they supported guitar hero CHRIS SPEDDING. CHRIS recommended the band to his then record company, RAK. The band&amp;#039;s debut single &quot;WE VIBRATE&quot; came out in November (one of the first punk singles) and was followed two weeks later by CHRIS SPEDDING&amp;#039;S &quot;POGO DANCING&quot; single with the VIBRATORS as the band on that.\n\nEarly in 1977 the band supported IGGY POP (with DAVID BOWIE on keyboards) on a UK tour, then moved to EPIC RECORDS and released the classic &quot;BABY BABY&quot; single, followed by their first album &quot;PURE MANIA&quot; which spent five weeks in the UK Top 75, peaking at number 49. A second single from the album - but a live version - &quot;LONDON GIRLS&quot;, came out in the summer of 1977 and was promoted by a tour supporting ex-MOTT THE HOOPLE mainman IAN HUNTER. Bassist PAT COLLIER left soon after and was replaced by GARY TIBBS. The band released the single &quot;AUTOMATIC LOVER&quot; (March 1978), which not only reached 35 in the charts but also got the band on TOP OF THE POPS. A second LP, &quot;V2&quot; was released in April and reached number 33 in the British Charts, and is still regarded today as one of New Waves finest moments. JOHN ELLIS left soon after to follow a solo career and to work with PETER GABRIEL, and was replaced by DAVE BIRCH, whilst a fifth member was added with keyboard/saxophonist DON SNOW. However this line up of the band only recorded the &quot;JUDY SAYS (KNOCK YOU IN THE HEAD)&quot; single (a UK No 70 single in the summer of 1978). There then followed a new line up of the band: KNOX - guitar/vocals, EDDIE - drums, with new members BEN BRIERLY - bass, and GREG VAN COOK - guitar. This again proved to be short lived and KNOX left to have a go at being a solo artist towards the end of 1978.\n\nEDDIE carried on with the band, as well as drumming for THE INMATES (an R&amp;B band). In early 1980 a more successful line up : KIP - vocals, EDDIE - drums, IAN WOODCOCK (ex-EATER) - bass, PHIL RAM - guitar, ADRIAN WYATT - guitar, signed to RAT RACE RECORDS. They released two singles &quot;GIMME SOME LOVIN&amp;#039;&quot; and &quot;DISCO IN MOSCO&quot;, but the band split up at the end of the year.\n\nThe original line up reformed in mid 1982 (KNOX, EDDIE, PAT COLLIER and JOHN ELLIS) and signed to ANAGRAM RECORDS, releasing a new version of &quot;BABY BABY&quot;. This was followed by a single and album both called &quot;GUILTY&quot; before the band moved to RAM RECORDS, releasing the singles &quot;MX AMERICA&quot; and &quot;FLYING HOME&quot; and the LP &quot;ALASKA 127&quot; (named after PAT COLLIER&amp;#039;S studio). By mid 1985 the band had signed to CARRERE RECORDS for whom they recorded the &quot;BABY BLUE EYES&quot; single before moving back to RAM for the &quot;FIFTH AMENDMENT&quot; LP and &quot;BLOWN AWAY BY LOVE&quot; single. By the time the band signed to FM REVOLVER in mid 1986, PAT COLLIER had left to pursue a successful career producing bands, and was replaced by NOEL THOMPSON for the &quot;VIBRATORS LIVE&quot; LP. JOHN ELLIS then left (to become a full-time member of the STRANGLERS) and was replaced by MICKIE OWEN, and NOEL THOMPSON left and was replaced by MARK DUNCAN. The new line up released the &quot;RECHARGED&quot; album, the &quot;STRING HIM ALONG&quot; single and also the 1988&amp;#039;s &quot;MELTDOWN&quot; album. MICKIE OWEN left and was replaced by NIGEL BENNETT (ex-MEMBERS) for the 1990&amp;#039;s &quot;VICIOUS CIRCLE&quot; LP. This line up of the VIBRATORS toured regularly, and released a string of albums: &quot;VOLUME TEN&quot; (1990), &quot;THE POWER OF MONEY&quot; (a re-make compilation, 1993), &quot;HUNTING FOR YOU&quot; (1994), and &quot;UNPUNKED&quot; (an acoustic compilation album, 1996).\n\n1990 lineup (left to right) Mark Duncan (bass), Eddie (drums), Knox (guitar/vocals), Nigel Bennett (guitar)\n\nIn 1996, in their twentieth year, they started with a new line-up: KNOX - guitar/vocals, EDDIE - drums, with newcomers DARRELL BATH (ex- UK SUBS, CRYBABIES, DOGS D&amp;#039;AMOUR) - guitar, and NICK PECKHAM (ex- BIG BOY TOMATO) - bass, but by June that year they had become a three-piece (KNOX, NICK, and EDDIE). The band recorded the albums &quot;FRENCH LESSONS WITH CORRECTION!&quot; (1997) and &quot;BUZZIN&amp;#039;&quot; (1999). with the band doing extensive touring, (almost 100 gigs in 1999 - including the USA and Canada), plus the release of many albums. NICK PECKHAM (bass) left in Sepatember 1999 and was replaced by ROBBIE TART (ex- HEARTBREAK ANGELS). In 2002 the band released a new compilation of the first two albums the band recorded, closely followed by a new studio album ENERGIZE, both on Ian Grant&amp;#039;s TRACK RECORDS.\n\nIn September 2003 ROBBIE TART left and was replaced by PETE from Finnish band No Direction, and the band toured the UK and Europe with the UK Subs.\n\nIn 2005 the band released the LIVE ENERGIZE CBGB&amp;#039;S 2004 DVD and early the following year released a &amp;#039;77 punk covers album PUNK: THE EARLY YEARS.\n\nIn their long career the VIBRATORS have toured with the likes of IGGY POP, IAN HUNTER, THE FLAMING GROOVIES, DIE TOTEN HOSEN, and have had their songs covered by THE EXPLOITED, UK SUBS, GBH, REM, DIE TOTEN HOSEN, to name but a few. Now in 2007 the band celebrate THIRTY-ONE YEARS of making records and touring heavily, approaching 120 gigs a year. Get ready for another 31 years of PURE MANIA!\n[img]http://images1.filecloud.com/607500/Appriciation.gif[/img]\n","torrent":{"xt":"urn:btih:3514efb7ec46232cf21ad4b6532d6f6ac5daac2b","amp;dn":"The+Vibrators+-+Pure+Mania+%281978%29-SHAREGO-%7BSECTION8%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3514efb7ec46232cf21ad4b6532d6f6ac5daac2b","infoHashBuffer":{"type":"Buffer","data":[53,20,239,183,236,70,35,44,242,26,212,182,83,45,111,106,197,218,172,43]},"announce":[],"urlList":[]}}