{"title":"Ane Brun - A Temporary Dive 2004","uid":6887910,"size":222277652,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:353238abdafe008ac635b3ac2cba3f72f25806f7&amp;dn=Ane+Brun+-+A+Temporary+Dive+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1323897578,"description":"Ane Brun (born Ane Brunvoll on 10 March 1976 in Molde, Norway) is a songwriter, guitarist and vocalist. Since 2003 she has recorded eight albums, four of which are studio albums, a live DVD and a collection of duets. She has lived in Stockholm, Sweden since 2001, where she writes, records and runs her own label (Balloon Ranger Recordings) when not on tour.\n\n- - -\n\nA Temporary Dive is the second album by Ane Brun, initially released in Norway and Sweden on 7 February 2005. The album debuted at no.1 in her native Norway.\n\nThe track Song No. 6, features the Canadian singer-songwriter Ron Sexsmith and also appears on her Duets album. It was recorded at an after-show party following their performances at the StorsjÃƒÂ¶yran festival in Ostersund, Sweden. The track Balloon Ranger, was said by Ane to be analogous to her troubles learning the English language, or rather how she sometimes comes up with nonsense words that have no logical meaning, but nonetheless make for great songwriting. She later used the song's title for the name of her record label.\n\nVersions of the album were released in the UK and US in 2006, and in Japan in 2007, each with different tracklistings and different artwork. The original album was re-released on CD for the European market in spring 2010, featuring new artwork (the same as that used for the 2006 US release) and a bonus track, Half Open Door. (wikipedia)\n\n\nAne Brun - A temporary dive 2005\n(Stockholm DetErMine/VP)\n\n 1. To let myself go\n 2. Rubber &amp; soul\n 3. Balloon ranger\n 4. My lover will go\n 5. A temporary dive\n 6. Laid in earth\n 7. This voice\n 8. Where friend rhymes with end\n 9. Song no 6\n10. The fight song\n","torrent":{"xt":"urn:btih:353238abdafe008ac635b3ac2cba3f72f25806f7","amp;dn":"Ane+Brun+-+A+Temporary+Dive+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"353238abdafe008ac635b3ac2cba3f72f25806f7","infoHashBuffer":{"type":"Buffer","data":[53,50,56,171,218,254,0,138,198,53,179,172,44,186,63,114,242,88,6,247]},"announce":[],"urlList":[]}}