{"title":"The Killing House - Chris Mooney.epub","uid":9397226,"size":3703332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35848030559a1c2792b814a97dab8d3a37265a66&amp;dn=The+Killing+House+-+Chris+Mooney.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1388002682,"description":"For all fans of Michael Connelly and Dennis Lehane, The Killing House is the amazing first novel in a stunning new series by Chris Mooney, author of the popular CSI Darby McCormick thrillers. It introduces fallen angel and former profiler Malcolm Fletcher who is forced to take the law into his own hands in order to uncover the truth in his terrifying first case. 'If you want a thriller that will chill your blood, break your heart and make your pulse race, Chris Mooney is your man' Mark Billingham Rule #1: Don't Scream Four years ago, Theresa Herrera's ten-year-old son Rico was abducted. The police found little evidence and the case went cold. Theresa's husband has told her to move on, but she won't give up hope. Rule #2: Don't call the police Today a mysterious woman invaded Theresa's home and told her that Rico is alive. Theresa talks on the phone to a young man who is, without question, her son. Rule #3: Don't run. Don't fight The woman promises to reunite Theresa with Rico only if she will follow the rules. But it is the last rule that fills Theresa with horror . . . Rule #4: Kill your husband and your son will live. . . Malcolm Fletcher - a former FBI profiler and now the nation's Most Wanted fugitive - arrives in Colorado to help Theresa and her husband find their son. But his arrival coincides with a dangerous and shocking twist in the case. Barely surviving his first encounter with a suspect, Fletcher embarks on his own secret investigation, with the police just behind him every step of the way. Join Fletcher on his hunt and discover Chris Mooney's charismatic new series character in one of this year's most impressive new thriller series. Behind every door in The Killing House, death awaits you . . . Chris Mooney is the author of seven previous thrillers, of which Remembering Sarah was nominated for the prestigious Edgar Award for Best Novel. The Missing, The Secret Friend and The Soul Collectors are available as Penguin paperbacks. Chris lives in Boston with his wife and son.","torrent":{"xt":"urn:btih:35848030559a1c2792b814a97dab8d3a37265a66","amp;dn":"The+Killing+House+-+Chris+Mooney.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35848030559a1c2792b814a97dab8d3a37265a66","infoHashBuffer":{"type":"Buffer","data":[53,132,128,48,85,154,28,39,146,184,20,169,125,171,141,58,55,38,90,102]},"announce":[],"urlList":[]}}