{"title":"Your Business Brickyard","uid":6538484,"size":1107711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36e2e00883d5d856881956ca6d7c96c10a5c39d2&amp;dn=Your+Business+Brickyard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1310594061,"description":"Howard Mann, &quot;Your Business Brickyard: Getting back to the basics to make your business more fun to run&quot;\n Publisher: Jackson Business Press | 2008 | ISBN: 0980154308 | PDF | 33 pages | 1.05 MB\n\n The basics. That is what you lost when you went from feeling like, I am going to make my mark, to It is too hard to keep up so let us just try to survive. It is time to admit you re not having fun anymore. Only then can you find your way back to the beginning when your business was all promise and no misery. Only then can you build (and keep building on) the basics that will never let you down. This small book contains the secret basics to unlock the true power and potential of your business. Strategist, speaker and consultant Howard Mann has collected twelve bricks essential to any business foundation. Mann shows you how to get back to basics, reconnect with your purpose, and grow your business, instead of getting stuck following the latest trend or innovation. Most important of all, Your Business Brickyard provides a game plan for how to make your business fun to run again. You will learn how to Reconnect to Your Purpose and keep your goals uppermost in your mind. You will say goodbye to worries over competition when you Lose Your Nemesis. You ll appreciate the powerful simplicity of Pay Fast, Get Paid Even Faster. You will learn how to Goaljump and work backwards from your most ambitious goals to actionable tasks you can do today. Your Business Brickyard shows you how to eliminate whatever it is that hinders your ability as a business owner to enjoy your position properly. With practical, hands-on exercises and a fresh, concise format, The Brickyard will help you establish a brick solid foundation so your business can grow without limit while you enjoy the journey.","torrent":{"xt":"urn:btih:36e2e00883d5d856881956ca6d7c96c10a5c39d2","amp;dn":"Your+Business+Brickyard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36e2e00883d5d856881956ca6d7c96c10a5c39d2","infoHashBuffer":{"type":"Buffer","data":[54,226,224,8,131,213,216,86,136,25,86,202,109,124,150,193,10,92,57,210]},"announce":[],"urlList":[]}}