{"title":"CineSamples - Cinebrass [KONTAKT]","uid":9052639,"size":8618154406,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3731e04a9e42be52e45d2d4748f16464a8082070&amp;dn=CineSamples+-+Cinebrass+%5BKONTAKT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NewSky006","files":-1,"time":1381886842,"description":"Torrent Info:\n==============\n\nThis is not my own torrent! I did add some extra trackers though.\n\n\nTorrent Contents:\n==================\n\nKontakt library, packaged in multiple .rar's\n\n\nInstallation:\n==============\n\nUnrar &quot;ap-cscbnki.rar&quot;, then add the resulting &quot;cinebrass&quot; folder as a library to (cracked) Kontakt.\n\n\nProduct Info:\n==============\n\nCineBrass is Cinesamples orchestral brass sample library for Kontakt. Recorded at the world famous SONY Pictures Scoring Stage in Los Angeles, and mixed by veteran legend Dennis Sands (Captain America, Back to the Future, Forrest Gump, Shawshank Redemption, American Beauty).\nCineBrass is revolutionary in its power and simplicity for recreating the sound of the\norchestral brass section. The library was designed by composers, for composers, with direct\nfeedback from the film music community during its development. The result is a brass library\nthat is easy to use, composer-friendly, with unparalleled recording quality.\nCineBrass does not require you to purchase any sampling software, and is licensed to work with\nthe free Kontakt Player. All you need is a sequencer like Logic, Cubase, Digital Performer,\nLIVE, Cakewalk, or even Apple GarageBand and you?ll be up and running. You can also use\nCineBrass with your favorite notation software such as Sibelius or Finale.\nARTICULATIONS PATCHES\nAll of the Articulations Patches in CineBrass contain shorts of various lengths and dynamics,\nas well as sustains. We recorded multiple repetitions per note and multiple dynamics as follows\nEighths Staccato @ 8xRR p to ff\nQuarters Tenuto @ 4xRR p to ff\nHalves Marcato @ 2xRR p to ff\nSustains with smooth dynamic morphing\nAlso, all of the mapping in the Articulations Patches is dynamic, so you can select from 5\nintuitive presets in the user interface. A custom mapping grid is offered, for users who wish\nto customize the parameters beyond the presets. Every parameter and value is changeable, and\nnearly any combination is possible. Of course, if you are not a tweaker, you can stick with\none of the 5 preset mappings (recommended).\nWhat is True Legato? True legato means that we sampled all of the intervalic leaps throughout\nthe ranges, both upwards and downwards, for each brass section. When you play a True Legato\npatch, it instantly analyses the intervals you play, then plays the appropriate transitional\nleap between the notes. The result is a smooth and realistic legato performance. For all\nsections we did this at 2 dynamic levels, again using our dynamic morphing to blend seamlessly\nfrom piano to fortissimo.\nA key feature of our True Legato patches, is the Polyphonic Legato mode. This mode allows you\nto play lines of 2 or more notes simultaneously, while maintaining the appropriate transition\nsamples between all notes. This is especially effective when playing chords that need to\nconnect in a realistic way.\nSampling in Los Angeles is no easy task. Especially when you want to do it the right way. This\nlibrary is the first of its kind, because it is the first commercial library to be recorded\nunder a special AFM (American Federation of Musicians) Sampling Agreement. The product of this,\nis that for every purchase, a percentage of the sales go directly to the musicians who played\non the CineBrass session. Not only does it go to the musicians, but we?ve extended it to the\ncopyists, the engineers and everyone who had a critical role in producing the library.\nImportant to note that this does not effect the user agreement, and CineBrass can be used like\nany other Cinesamples library in your music productions.\nWhy do this? We want to keep recording here in Los Angeles, with the best musicians, at the\nbest scoring stages in the world. We are grateful to the AFM for having the vision to do this\nwith us, and we look forward to extending this to all our future libraries.\nBe sure to check out the screencast videos at the bottom to get a more detailed look at the\nlibrary!\nPatch List Multis \n01 Trumpets Ensemble Articulations\n02 Trumpets Ensemble True Legato\n03 Trumpet Solo True Legato\n04 Horns Ensemble Articulations\n05 Horns Ensemble True Legato\n06 Horn Solo True Legato\n07 Trombones Ensemble Articulations\n08 Tuba + Bass Trombone Articulations\n09 Cimbasso + Bass Tbn. Articulations\n10 Trumpets Ensemble FX\n11 Horns Ensemble Rips\n12 Low Brass Pads Tutti Brass Ens. Articulations\nTutti Brass Ens. Articulations u Minus Horns\nHorns + Tuba + Bass Tbn Articulations\nLow Brass Articulations\nTrumpets + Horns 8vb Articulations\nTrumpets + Horns 8vb True Legato\nTrumpets + Trombones 8vb Articulations\nTrumpets + Trombones 8vb True Legato\nTechnical Specifications\nKontakt Player 4.2.3 or higher\nKontakt (Player) 4 supports: Stand-alone, VST, Audio Units, RTAS\n(Pro Tools 8 and higher), DXi, ASIO, Core Audio, DirectSound, WASAPI\nNative 64-bit support for stand-alone and plug-in versions on both Mac &amp; PC\nCineBrass is compatible with all major DAWs and with music notation software.","torrent":{"xt":"urn:btih:3731e04a9e42be52e45d2d4748f16464a8082070","amp;dn":"CineSamples+-+Cinebrass+%5BKONTAKT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3731e04a9e42be52e45d2d4748f16464a8082070","infoHashBuffer":{"type":"Buffer","data":[55,49,224,74,158,66,190,82,228,93,45,71,72,241,100,100,168,8,32,112]},"announce":[],"urlList":[]}}