{"title":"Xonotic 0.5","uid":6669560,"size":988512100,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:375e8335ed1eef8ff6ecc0d8dbab4b2724fd4b06&amp;dn=Xonotic+0.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"divverent","files":-1,"time":1315823467,"description":"Welcome to Xonotic\n\nXonotic is a free (GPL), fast-paced first-person shooter that works on Windows, OS X and Linux. The project is geared towards providing addictive arena shooter gameplay which is all spawned and driven by the community itself. Xonotic is a direct successor of the Nexuiz project with years of development between them, and it aims to become the best possible open-source FPS (first-person-shooter) of its kind.\n\nThe game is based off the Darkplaces game engine which is originally a quake modification, though it is now far more advanced over the course of many years of development. Because of the features of this engine, Xonotic has incredibly good graphics for an opensource game and is on par with most commercial games from 2006-2007. The gameplay is of course slightly inspired by several other games, but it is essentially a unique mixture of mostly original and different ideas which really makes the game stand out. It could be considered most similar to Unreal Tournament and Quake at its heart, especially regarding teamplay and game mechanics.\n\nOn http://www.xonotic.org/, you can check out screenshots, videos, find related communities and websites, learn how to contribute and compile your own version here. Check out the Blog, Development Tracker, Forums and #xonotic on irc.quakenet.org or irc.freenode.org to get the skinny.","torrent":{"xt":"urn:btih:375e8335ed1eef8ff6ecc0d8dbab4b2724fd4b06","amp;dn":"Xonotic+0.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"375e8335ed1eef8ff6ecc0d8dbab4b2724fd4b06","infoHashBuffer":{"type":"Buffer","data":[55,94,131,53,237,30,239,143,246,236,192,216,219,171,75,39,36,253,75,6]},"announce":[],"urlList":[]}}