{"title":"The Pigeon Detectives - We Met At Sea (2013) [FLAC]","uid":8498934,"size":240073842,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:37920c49f913c3bff643ce2170ceeac1921da71a&amp;dn=The+Pigeon+Detectives+-+We+Met+At+Sea+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1369231855,"description":"\n  The Pigeon Detectives - We Met At Sea (2013) [FLAC]\n\n  Released: 2013\n  Duration: 31:24\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Garage Rock Revival\n  Country: England\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz  \n\n  01 Animal\n  02 I Won't Come Back\n  03 Hold Your Gaze\n  04 Light Me Up\n  05 Can't You Find Me\n  06 I Don't Mind\n  07 Day And Month\n  08 Unforgettable\n  09 No State To Drive\n  10 Where You Are\n\n  Five pals from Leeds, England, who play scruffy but energetic rock &amp; roll with no shortage of swagger, the Pigeon Detectives formed in 2002, but the group's members -- Matt Bowman on lead vocals, Oliver Main and Ryan Wilson on guitars, Dave Best on bass, and Jimmi Naylor on drums -- were mates from school and had known one another since they were 12. The Pigeon Detectives started earning press attention for their gigs in 2004, and in 2006 they made their recorded debut with a limited-edition vinyl 7,&quot; &quot;I'm Not Sorry.&quot; On the strength of the single, the Pigeon Detectives scored an opening slot on a British tour with Dirty Pretty Things, and a second limited-edition single, &quot;You Know I Love You,&quot; hit stores in July (though this time 1,000 copies were pressed, as opposed to 500 for the debut). \n\n  The Kaiser Chiefs invited the Pigeon Detectives to tour the U.K. and Europe with them in the fall of 2006, and the group's third single (and first for the noted indie label Dance to the Radio), &quot;I Found Out,&quot; was released in November, eventually reaching number one on the U.K. indie charts. Nick Baines of The Kaiser Chiefs began name-checking the Pigeon Detectives as his favorite new band, and noted British disc jockeys Steve Lamacq, Jo Whiley, and Zane Lowe championed the group as single number four, &quot;Romantic Type,&quot; became a Top 20 pop hit. Wait for Me, the band's first full-length album, was released on Dance to the Radio in mid-2007. It was followed a year later by Emergency, which was produced by Stephen Street. Following the nationwide tour of their second album, the five-piece took some time out and returned on tour with Manchester outfit James in 2010. They began work on their third effort Up, Guards and at 'Em! that year with producer Justin Gerrish (Vampire Weekend, Yeah Yeah Yeahs) in his Brooklyn, New York studio. The record arrived in 2011 and scored the band their third consecutive U.K. Top 40 release and a European tour. In 2013, their fourth album, We Met at Sea, was released to mixed reviews in the music press.","torrent":{"xt":"urn:btih:37920c49f913c3bff643ce2170ceeac1921da71a","amp;dn":"The+Pigeon+Detectives+-+We+Met+At+Sea+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37920c49f913c3bff643ce2170ceeac1921da71a","infoHashBuffer":{"type":"Buffer","data":[55,146,12,73,249,19,195,191,246,67,206,33,112,206,234,193,146,29,167,26]},"announce":[],"urlList":[]}}