{"title":"Water Security- The Water-food-energy-climate Nexus.pdf","uid":7597782,"size":3254826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37faba30ef26e6d2397aadce6eded9c8f86d1081&amp;dn=Water+Security-+The+Water-food-energy-climate+Nexus.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":-1,"time":1346739391,"description":"World Economic Forum, &quot;Water Security: The Water-food-energy-climate Nexus&quot;\nEnglish | ISBN 10: 1597267368 | 2011 | PDF | 288 pages | 3.1 MB\n\nThe world is on the brink of the greatest crisis it has ever faced: a spiralling lack of fresh water. Groundwater is drying up, even as water demands for food production, for energy, and for manufacturing are surging. Water is already emerging as a headline geopolitical issue - and worsening water security will soon have dire consequences in many parts of the global economic system.\n\nDirected by UN Secretary-General Ban Ki-Moon at the 2008 Davos Annual Meeting, the World Economic Forum assembled the world's foremost group of public, private, non-governmental-organisations, and academic experts to examine the water crisis issue from all perspectives. The result of their work is this forecast - a stark, non-technical overview of where we will be by 2025 if we take a business-as-usual approach to (mis)managing our water resources. The findings are shocking. Perhaps equally stunning are the potential solutions and the recommendations that the group presents. All are included in this landmark publication. &quot;Water Security&quot; contains compelling commentary from leading decision makers, past and present. The commentary is supported by analysis from leading academics of how the world economy will be affected if world leaders cannot agree on solutions. The book suggests how business and politics need to manage the water-food-energy-climate nexus as leaders negotiate the details of the climate regime that will replace the Kyoto Protocols","torrent":{"xt":"urn:btih:37faba30ef26e6d2397aadce6eded9c8f86d1081","amp;dn":"Water+Security-+The+Water-food-energy-climate+Nexus.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37faba30ef26e6d2397aadce6eded9c8f86d1081","infoHashBuffer":{"type":"Buffer","data":[55,250,186,48,239,38,230,210,57,122,173,206,110,222,217,200,248,109,16,129]},"announce":[],"urlList":[]}}