{"title":"What Is Relativity by Jeffrey Bennett","uid":9715948,"size":7365556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:383e6eab3ec2666dc70ab48b5b9eac9c7be4d15e&amp;dn=What+Is+Relativity+by+Jeffrey+Bennett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":2,"time":1394159989,"description":"\nWhat Is Relativity: An Intuitive Introduction to Einstein's Ideas, and Why They Matter by Jeffrey Bennett\n\nIt is commonly assumed that if the Sun suddenly turned into a black hole, it would suck Earth and the rest of the planets into oblivion. Yet, as prominent author and astrophysicist Jeffrey Bennett points out, black holes don't suck. With that simple idea in mind, Bennett begins an entertaining introduction to Einstein's theories of relativity, describing the amazing phenomena readers would actually experience if they took a trip to a black hole.\n\nThe theory of relativity also reveals the speed of light as the cosmic speed limit, the mind-bending ideas of time dilation and curvature of spacetime, and what may be the most famous equation in history: E = mc2. Indeed, the theory of relativity shapes much of our modern understanding of the universe. \n\nIt is not &quot;just a theory&quot; -- every major prediction of relativity has been tested to exquisite precision, and its practical applications include the Global Positioning System (GPS). Amply illustrated and written in clear, accessible prose, Bennett's book proves anyone can grasp the basics of Einstein's ideas. His intuitive, non-mathematical approach gives a wide audience its first real taste of how relativity works and why it is so important to science and the way we view ourselves as human beings.\n\nMeet the Author:\n\nJeffrey Bennett holds a B.A. in biophysics from the University of California, San Diego, and an M.S. and Ph.D. in astrophysics from the University of Colorado at Boulder. He is the lead author of best-selling textbooks in astronomy, astrobiology, mathematics, and statistics and numerous award-winning books for the general public and children.\n\nGenre: Non-Fiction | Science | Physics","torrent":{"xt":"urn:btih:383e6eab3ec2666dc70ab48b5b9eac9c7be4d15e","amp;dn":"What+Is+Relativity+by+Jeffrey+Bennett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"383e6eab3ec2666dc70ab48b5b9eac9c7be4d15e","infoHashBuffer":{"type":"Buffer","data":[56,62,110,171,62,194,102,109,199,10,180,139,91,158,172,156,123,228,209,94]},"announce":[],"urlList":[]}}