{"title":"A Textbook of Electrical Technology Volume II : {|T@rrentEngr|}","uid":5286104,"size":61530551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:388d8b723fab1980c4143993952b699cd3142040&amp;dn=A+Textbook+of+Electrical+Technology+Volume+II+%3A+%7B%7CT%40rrentEngr%7C%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"torrentengr","files":-1,"time":1263688788,"description":"Textbook of Electrical Technology\nBy B. Teraja\n\nPublisher: Chand (S.)&amp;Co Ltd ,India\nNumber Of Pages: 724\nPublication Date: 2006-06-01\nISBN-10 / ASIN: 8121924375\nISBN-13 / EAN: 9788121924375\n\n\nThis volume deals with AC and DC machines.\n\nAC and DC Machines Book in S.I. Units\n\nThe most basic and practical lessons on Energy Conversions ideal for both students and professors. The book covers Direct Current Machines (DC Machines) and Alternating Current Machines (AC Machines) comprises of motors and generators. It is of comprehensive approach to electrical dynamos using theories that deeply explain the concept. Rotating electrical machines -- generators and motors -- are devices that transform mechanical power into electrical power, and vice-versa. Electrical power from a central power station can be transmitted and subdivided very efficiently and conveniently. The operation of electrical machines is explained by four general principles, that will be briefly presented below. These principles are not difficult to understand, and illuminate most of the reasons for the stages in the historical development of electrical power, and especially of electric railways. This book discusses motors in general, but the specific application to electric locomotives is emphasized. Electricity is the medium that carries power from the prime mover, whether at a central power station or on the locomotive, to its point of application at the rail, and allows it to be controlled conveniently.\n\n","torrent":{"xt":"urn:btih:388d8b723fab1980c4143993952b699cd3142040","amp;dn":"A+Textbook+of+Electrical+Technology+Volume+II+%3A+%7B%7CT%40rrentEngr%7C%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"388d8b723fab1980c4143993952b699cd3142040","infoHashBuffer":{"type":"Buffer","data":[56,141,139,114,63,171,25,128,196,20,57,147,149,43,105,156,211,20,32,64]},"announce":[],"urlList":[]}}