{"title":"Pinky and the Brain Comics","uid":5359601,"size":240262863,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3891eee4607c5227d4f51a4849dd64f303d2d26c&amp;dn=Pinky+and+the+Brain+Comics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"brodahisou","files":-1,"time":1266061893,"description":"Comic book series based on the animated television series and spinoff of Animaniacs starring Pinky and the Brain.  Pinky and the Brain first appeared in 1993 as a recurring segment on the show Animaniacs.  From 1995 to 1998, Pinky and the Brain were spun-off into their own Emmy-award-winning show on The WB Television Network, Steven Spielberg Presents Pinky and the Brain, with 65 episodes produced by Steven Spielberg and Warner Bros. Animation.  Later, they appeared in the unsuccessful series, Steven Spielberg Presents Pinky, Elmyra &amp; the Brain.\n\nPinky and Brain are genetically enhanced laboratory mice who reside in a cage in the Acme Labs research facility.  Brain is self-centered and scheming; Pinky is good-natured but feebleminded.  In each episode, Brain devises a new plan to take over the world, which ultimately ends in failure, usually due to Pinky's idiocy or the impossibility of Brain's plan.  In common with many other Animaniacs shorts, many episodes are in some way a parody of something else, usually a film or novel.  Nearly every episode opens with the following dialogue:\n\n    Pinky: &quot;Gee, Brain, what do you want to do tonight?&quot;\n    The Brain: &quot;The same thing we do every night, Pinky - try to take over the world!&quot;\n\nEventually, the Pinky and the Brain comic was discontinued after 27 issues and a Christmas special, and was merged into the Animaniacs comic book series, which was then retitled as Animaniacs! featuring Pinky and the Brain. \n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:3891eee4607c5227d4f51a4849dd64f303d2d26c","amp;dn":"Pinky+and+the+Brain+Comics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3891eee4607c5227d4f51a4849dd64f303d2d26c","infoHashBuffer":{"type":"Buffer","data":[56,145,238,228,96,124,82,39,212,245,26,72,73,221,100,243,3,210,210,108]},"announce":[],"urlList":[]}}