{"title":"Rush Limbaugh An Army of One - Zev Chafets","uid":7079894,"size":694609921,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:38bac256c3ed8d36165d8ecdc5e55b12df7cffaa&amp;dn=Rush+Limbaugh+An+Army+of+One+-+Zev+Chafets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Annoyme","files":-1,"time":1330986409,"description":"Rush Limbaugh An Army of One - Zev Chafets 192kbps\n\n\n&quot;Chafets has seen more of the pundit's personal world than any other journalist.&quot; -The Washington Post\n\nPeople tend to remember the moment they first heard The Rush Limbaugh Show on the radio. For Zev Chafets, it was in a car in Detroit. The braggadocio, the outrageous satire, the slaughtering of liberal sacred cows performed with the verve of a rock and roll DJ-it seemed fresh, funny, and completely subversive. &quot;They're never going to let this guy stay on the air,&quot; he thought.\n\nAlmost two decades later Chafets met Rush and they spent hours together talking on the record about politics, sports, music, show business, religion, and modern American history. Rush opened his home and his world, introducing Chafets to his family, his closest friends, even his psychologist.\n\nWhat has emerged after months of correspondence revealing Rush Limbaugh's thoughts, fears, and ambitions, is a uniquely personal look at the man who is not only the most popular voice on the radio, but also one of the most influential figures in the conservative movement.\n\n&quot;I know the liberals call you 'the most dangerous man in America,' but don't worry about it, they used to say the same thing about me. Keep up the good work.&quot; -Ronald Reagan in a letter to Rush Limbaugh, December 11, 1992\n\nDo you remember your first time? People tend to remember the moment they first heard The Rush Limbaugh Show on the radio. For Zev Chafets, it was in a car in Detroit, driving down Woodward Avenue. Limbaugh's braggadocio, the outrageous satire, the slaughtering of liberal sacred cows performed with the verve of a rock-n-roll DJ-it seemed fresh, funny and completely subversive. &quot;They're never going to let this guy stay on the air,&quot; he thought. Almost two decades later Chafets met Rush for the first time, at Limbaugh's rarely visited &quot;Southern Command.&quot; They spent hours together talking on the record about politics, sports, music, show business, religion and modern American history. Rush opened his home and his world, introducing Chafets to his family, closest friends, even his psychologist. The result was an acclaimed cover-story profile of Limbaugh in The New York Times Magazine. But there was much more to say, especially after Limbaugh became Public Enemy Number One of the Obama Administration.\n\nAt first Limbaugh resisted the idea of a full-length portrait, but he eventually invited Chafets back to Florida and exchanged more than a hundred emails full of his personal history, thoughts, fears and ambitions. What has emerged is an uniquely personal look at the man who is not only the most popular voice on the radio, but the leader of the conservative movement and one of the most influential figures in the Republican Party. While Limbaugh's public persona is instantly recognizable, his background and private life are often misunderstood.","torrent":{"xt":"urn:btih:38bac256c3ed8d36165d8ecdc5e55b12df7cffaa","amp;dn":"Rush+Limbaugh+An+Army+of+One+-+Zev+Chafets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38bac256c3ed8d36165d8ecdc5e55b12df7cffaa","infoHashBuffer":{"type":"Buffer","data":[56,186,194,86,195,237,141,54,22,93,142,205,197,229,91,18,223,124,255,170]},"announce":[],"urlList":[]}}