{"title":"Opeth 24 Bit Vinyl Pack","uid":9629166,"size":17852445456,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:38d4edcd7db4a2e7c688e09833359f9ad2d6f618&amp;dn=Opeth+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1392645063,"description":"\n  Opeth 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Death Metal, Progressive Metal\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 3,000 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 KHz\n\n  1995 Orchid - Back on Black (2008)\n  1996 Morningrise - Back on Black (2008)\n  1998 My Arms Your Hearse - Back on Black (2008)\n  1999 Still Life - (Sweden)\n  1999 Still Life - Peaceville Records VILELP 78 (Remaster 2010)\n  2001 Blackwater Park - (Sweden)\n  2001 Blackwater Park - Sony Music on Vinyl MOVLP084 (2010)\n  2002 Deliverance - (Sweden)\n  2003 Damnation - (Sweden)\n  2005 Ghost Reveries - (Sweden)\n  2008 Watershed - (Sweden)\n  2011 The Throat of Winter - Roadrunner Records 1686-136677 (US)\n  2011 Heritage - Roadrunner Records 1686-177051 (US)\n\n  Brought together in Stockholm by guitarists Peter Lindgren and Mikael Ã…kerfeldt in 1990, Opeth added progressive influences and acoustic instrumentation to their brand of Swedish death metal. As the group progressed, it was very common for an Opeth live set to fly in several different musical directions -- and an average song lasted no less than ten minutes. Impressed by their originality, Candlelight Records released their debut full-length in 1995, which was titled Orchid, and featured a rhythm section of bassist Johan de Farfalla and drummer Anders Nordin. Edge of Sanity mastermind Dan Swano produced the band's ambitious second album Morningrise in 1996, after which they embarked on a brief tour with Morbid Angel. Century Media took notice and not only licensed Opeth's first two albums for the United States, but also planned on releasing their next album on both sides of the Atlantic. With the recruitment of bassist Martin Mendez and drummer Martin Lopez (ex-Amon Amarth) to replace the departed de Farfalla and Nordin, Opeth's third album, My Arms, Your Hearse, was released in 1998 to glowing reviews, establishing the band as a leading force in progressive metal with death roots.\n\n  Released in 1999, Still Life displayed even more of the band's prog rock influences, and the following year the band played its first U.S. concert at the Milwaukee Metalfest. Blackwater Park, titled after an obscure psychedelic prog outfit from the '70s, was released in early 2001. The album created a huge buzz among progressive metal fans, who had begun to lump the band in with other experimental metal bands like Tiamat. Instead of waiting until the buzz died down, the band released Deliverance in the fall of 2002. The following year, Opeth surprised fans with the release of Damnation, an album that was almost completely devoid of any heavy metal trappings and focused instead on acoustic instruments and traditional songwriting. Ghost Reveries arrived in 2005 and proved to be a return to form for the band. \n\n  Opeth returned in 2007 with Roundhouse Tapes: Opeth Live, and in 2008 with the all-new studio album Watershed. In 2010, the band followed up with another live album, In Live Concert at the Royal Albert Hall. The set was recorded at the famous London venue and featured the band playing their break-out album, Blackwater Park, in its entirety. Opeth shifted stylistic gears dramatically for 2011's Heritage. While writing for the album, Ã…kerfeldt fell under the spell of the music of Swedish folk music, Alice Cooper, and many spaces between. The sound, while remaining Opeth's, is also quite different, far more prog than death metal. In fact, if anything, this is the sound of the band leaving death metal behind. The album's cover is loaded with symbolism depicting the change. Heritage was also the last Opeth recording to feature keyboardist Per Wiberg. The album was released in September on Roadrunner.","torrent":{"xt":"urn:btih:38d4edcd7db4a2e7c688e09833359f9ad2d6f618","amp;dn":"Opeth+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d4edcd7db4a2e7c688e09833359f9ad2d6f618","infoHashBuffer":{"type":"Buffer","data":[56,212,237,205,125,180,162,231,198,136,224,152,51,53,159,154,210,214,246,24]},"announce":[],"urlList":[]}}