{"title":"Instauration - 1975 - 2000","uid":8325093,"size":2305636637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3999d482f9f24852e4cf7ff723f8a83101742f7d&amp;dn=Instauration+-+1975+-+2000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"the_instaurator","files":352,"time":1364775451,"description":"This torrent contains all issues of Instauration that are found here:\n &lt;a href=&quot;\nhttp://instaurationonline.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://instaurationonline.com/&lt;/a&gt;\n\nDownloadable in one package.\n\n\n\n\nFrom Wikipedia:\n\nInstauration was a monthly magazine published from December 1975, through February 2000, ending with volume 25, issue 3. It was published by Wilmot Robertson, who also wrote The Dispossessed Majority (1973)[1][2] and The Ethnostate (1992).[3] The Dispossessed Majority was decried as a white supremacist book when notice of it was mailed to students e.g. at the Marist School and the Lovett School.[4] The magazine and Robertson's books share much in common.\n\nInstauration was a magazine with diverse coverage, including economic theory, social commentary, international trends, literary pieces, letters to the editor, in all of which a high standard of writing was evident. However, many people found the subject matter distasteful, and as a result, authorship was often anonymous or pseudonymous. For those who approve of eugenics, historical revisionism, and discussions of the racial makeup of populations, the writing of Instauration was very pleasing. But many would characterize the publication as promoting racism and Holocaust denial. Instauration also published numerous articles arguing that Christianity was a contrived religion.\n\nMitch Berbrier, in an article titled &quot;Impression Management for the Thinking Racist&quot;, characterizes the effort embodied in the magazine as &quot;stigma transformation&quot;, intended &quot;to present an intellectualized rhetoric of racism and white supremacy&quot;.[5]\n\nThe divergence of opinion about Instauration can be seen in an article in the Orlando Sentinel, where the contrasting opinions of Stephen Chapman (Chicago Tribune) and Joseph Sobran are offered.[6][7] Sobran remarked that Instauration's &quot;nativism is so pure that it estranges most natives&quot;.[8]","torrent":{"xt":"urn:btih:3999d482f9f24852e4cf7ff723f8a83101742f7d","amp;dn":"Instauration+-+1975+-+2000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3999d482f9f24852e4cf7ff723f8a83101742f7d","infoHashBuffer":{"type":"Buffer","data":[57,153,212,130,249,242,72,82,228,207,127,247,35,248,168,49,1,116,47,125]},"announce":[],"urlList":[]}}