{"title":"Remote Control - Carl Kerby","uid":11715061,"size":240060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39add4016f256027e1886522252d1c046da504b8&amp;dn=Remote+Control+-+Carl+Kerby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424530600,"description":"\nFew would dispute the fact that entertainment - or more specifically, the entertainment community - influences our society in a big way. But how many understand the thread of evolutionary philosophy that runs through movies, television, and books?\n\nPopular speaker Carl Kerby has researched this point for years and challenges audiences all over the country to become better informed about the agenda that permeates our entertainment choices. In Remote Control, he highlights Hollywood icons that in some way peddle a Darwinian concept:\n\n*Are you aware that even Gilligan, the Skipper's goofy &quot;little buddy,&quot; discussed ancient &quot;caveman&quot; ideas?\n*Did you know the campy cult classic Creature from the Black Lagoon promoted evolutionary concepts?\n*Is a movie thriller like Jurassic Park just mindless fun?\n*Do classic children's cartoons pass the evolution test?\n\n\nAbout the author:\nCarl Kerby is a former air-traffic controller and a creation apologist speaker who teaches how to defend the Bible against scientific naturalism. He was one of the founding board members for Answers in Genesis, and has been described by AiG as one of their most dynamic lecturers on the Book of Genesis After serving with Answers in Genesis for over 15 years, Carl became the Founder and President of Reasons for Hope. He is a much sought-after speaker both in the United States and abroad, and has spoken in Bermuda, Canada, England, Greece, Israel, Jamaica, Japan, Mexico, the Philippines, Wales and others.\n\nHe grew up in a liberal church that taught evolution could be mixed with God's Word. In 1987 Carl Kerby became a Christian after attending a crusade in Salt Lake City, Utah. While an air-traffic controller and riding in the cockpit on a flight, the Creation vs. evolution issue came up during a conversation with the pilots. The co-pilot argued that the Bible and evolution were a totally different worldviews that could not be in harmonized. He then introduced Carl to Ken Ham's book The Lie: Evolution, which helped him trust in the Bible as authoritative on the issue of creation","torrent":{"xt":"urn:btih:39add4016f256027e1886522252d1c046da504b8","amp;dn":"Remote+Control+-+Carl+Kerby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39add4016f256027e1886522252d1c046da504b8","infoHashBuffer":{"type":"Buffer","data":[57,173,212,1,111,37,96,39,225,136,101,34,37,45,28,4,109,165,4,184]},"announce":[],"urlList":[]}}