{"title":"A Tiger in the Kitchen by Cheryl Lu-Lien Tan","uid":9625841,"size":2594475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a371beb629787de9c81db4d63e739314cf53bf1&amp;dn=A+Tiger+in+the+Kitchen+by+Cheryl+Lu-Lien+Tan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":2,"time":1392590353,"description":"\nAfter growing up in the most food-obsessed city in the world, Cheryl Lu-Lien Tan left home and family at eighteen for America--proof of the rebelliousness of daughters born in the Year of the Tiger. But as a thirtysomething fashion writer in New York, she felt the Singaporean dishes that defined her childhood beginning to call her back.\n\nWas it too late to learn the secrets of her grandmothers' and aunties' kitchens, as well as the tumultuous family history that had kept them hidden before In her quest to recreate the dishes of her native Singapore by cooking with her family, Tan learned not only cherished recipes but long-buried stories of past generations.\n\nA Tiger in the Kitchen, which includes ten authentic recipes for Singaporean classics such as pineapple tarts and Teochew braised duck, is the charming, beautifully written story of a Chinese-Singaporean ex-pat who learns to infuse her New York lifestyle with the rich lessons of the Singaporean kitchen, ultimately reconnecting with her family and herself.\n\nGenre: Non Fiction, Biography/Memoir","torrent":{"xt":"urn:btih:3a371beb629787de9c81db4d63e739314cf53bf1","amp;dn":"A+Tiger+in+the+Kitchen+by+Cheryl+Lu-Lien+Tan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a371beb629787de9c81db4d63e739314cf53bf1","infoHashBuffer":{"type":"Buffer","data":[58,55,27,235,98,151,135,222,156,129,219,77,99,231,57,49,76,245,59,241]},"announce":[],"urlList":[]}}