{"title":"Charlie Chaplin - The Great Dictator's Final Speech - A Message","uid":10042353,"size":170223875,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3b6af47b41a43a4f69a6e8af7a7e2175edae0ef2&amp;dn=Charlie+Chaplin+-+The+Great+Dictator%27s+Final+Speech+-+A+Message+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jaljentaa","files":10,"time":1398477296,"description":"Charlie Chaplin - The Great Dictator's Final Speech\n===================================================\n\n2014-04-26\n\nThis package contains several media files, all variations of Chaplin's speech, given at the ending of his 1940 film, &quot;The Great Dictator&quot;. All files contain the exact same speech, but vary in the images shown (or lack of) and in background music (or lack of). One of the files is just the video from the film without music, which allows you to see the speech as seen originally in the film.\n\nThis resource is extremely important to keep freely available! With centralized corporate-controlled sites applying censorship on the content, such as Y0utube and Faceb00k, there is no guarantee the speech remains available as long as people rely on such sites. It must be shared openly and distributed, and have many copies. That's why I made a torrent of it.\n\nThe video file format is WebM - an open royalty-free format. No patents. I use it for all my videos, and I encourage you to use it too (including for &gt;700MB movies).\n\nThe audio file format is Ogg - an open royalty-free format. No patents. I use it for all my audio, and I encourage you to use it too, including for your whole music library, instead of MP3 (unless you prefer FLAC, which is open too).\n\n\n\nThe speech is relevant now more than ever! There's a bonus track which will hopefully open your mind and eyes to things going on today in 2014. If you like what you find in this torrent, please help spread it and make it available by seeding it and giving copies (or the .torrent file) to friends. Thank you :-)","torrent":{"xt":"urn:btih:3b6af47b41a43a4f69a6e8af7a7e2175edae0ef2","amp;dn":"Charlie+Chaplin+-+The+Great+Dictator%27s+Final+Speech+-+A+Message+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b6af47b41a43a4f69a6e8af7a7e2175edae0ef2","infoHashBuffer":{"type":"Buffer","data":[59,106,244,123,65,164,58,79,105,166,232,175,122,126,33,117,237,174,14,242]},"announce":[],"urlList":[]}}