{"title":"Confronting the Evidence- A Call to Reopen the 911 Investigation","uid":4162009,"size":714211328,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3c07403a2652c193fa0637df5658e9a180d29e9d&amp;dn=Confronting+the+Evidence-+A+Call+to+Reopen+the+911+Investigation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"asc11","files":1,"time":1209419807,"description":"Welcome to 1984 [1]\n\n&quot;A really efficient totalitarian state would be one in which the all-powerful executive of political bosses and their army of managers control a population of slaves who do not have to be coerced, because they love their servitude. To make them love it is the task assigned, in present-day totalitarian states, to ministries of propaganda, newspaper editors and schoolteachers.&quot;\n-- Aldous Huxley (1894-1963) Author Source: Forward to &amp;#039;Brave New World&amp;#039;, 1932\n\n-----\n\nWhen Bush and the Republican Senate blocked the fully funded Iraq troop bill containing a withdrawal timetable, THEY were the ones not supporting our troops. The submission of the Democrats on this and the failure of the media to point it out, the Democrat&amp;#039;s failure to impeach Bush over the falsified evidence leading to the war and other high crimes and misdemeanors far worse that Clinton&amp;#039;s sex scandal, their failure to impeach [2] Gonzales, their failure to investigate and prosecute the vote fraud in the last two presidential elections, the quick concession of the last two presidential elections by Gore and then Kerry (a Skull and Bones member) when the exit polls all showed that they won, and the Democrat&amp;#039;s acceptance of the obviously flawed congressional 9/11 investigation clearly shows that the Democratic &quot;opposition&quot; is fake, designed to fail, that they and the media are controlled by our real rulers who are never seen.\n\nNo objective person can look at the absence of wreckage at the Pentagon and the WTC building 7 collapse and not know something is terribly wrong with the official story. Without doubt, the leadership and many members of the main stream media [3], Democrats, Republicans, FBI, CIA, MI6, Mossad, the Israeli, British, Russian, European, and Asian governments know the truth or are involved in the September 11, 2001 attack. Not even Hugo Chavez of Venezuela, Iran, or leftist media will devote time and resources to expose the lies.\n\n&quot;9/11&quot; is neither the first nor an isolated incident, just &quot;their&quot; latest contemptuous slapping of our faces to keep us shocked and in line. Consider that Tom Hanks will star in a TV series this year &quot;proving&quot; that JFK was killed by Oswald alone. No serious researcher nor a US Court [4] believes that. &quot;They&quot; control the media which controls the minds of the majority.\n\nWhat then do we do? Fight on, sacrificing all? How? The protests are under-reported and ignored. The elections are rigged. Violence will only give them the excuse they want for martial law.  \n\nHelp those that are near you bear the pain and prepare for the disasters that are coming for &quot;they&quot; will not give up or stop here. There will be more &quot;terrorist&quot; attacks, some blamed on Iran, to justify attacking Iran, staying in Iraq, and war without end.\n\nThis site [reopen911.org] remains up for those who want to know. I have given up. I no longer answer email, give away DVD&amp;#039;s, or support the $1,000,000 challenge (which no NIST, FEMA, or other credible engineer or scientist has dared to accept). Good luck to all. It will not be a good night.\n\nRegrettably,\n\nJimmy Walter\n\n------------------------------------------------------------------------\n\n[1] &quot;1984&quot; Novel where terrorist attacks and wars are orchestrated by world governments to terrorize the people into supporting the industrial-military-government complex.\n\n[2] &quot;The President, Vice President and all civil Officers of the United States, shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misdemeanors.&quot; - Article 2, Section 4, US Constitution\n\n[3] Wikipedia libeled me, refused to let me change it, and fully supports the official lies on 9/11. No mainstream media or the leftist press will mention my $1,000,000 challenge. 911Truth.org libeled me and sabotaged my efforts.\n\n[4] Marita Lorenz testified that an assassination caravan drove from Miami to Dallas arriving on November 21st 1963 and placed E. Howard Hunt (CIA) at the motel where the conspirators were staying, giving them a sum of money.\n\n&quot;The best way to control the opposition is to lead it ourselves.&quot; - Lenin\n","torrent":{"xt":"urn:btih:3c07403a2652c193fa0637df5658e9a180d29e9d","amp;dn":"Confronting+the+Evidence-+A+Call+to+Reopen+the+911+Investigation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c07403a2652c193fa0637df5658e9a180d29e9d","infoHashBuffer":{"type":"Buffer","data":[60,7,64,58,38,82,193,147,250,6,55,223,86,88,233,161,128,210,158,157]},"announce":[],"urlList":[]}}