{"title":"Chemical Process Design and Integration - Robin Smith","uid":12091379,"size":12873935,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c5e93d3c459941070e864b885dd661ab0ef7e55&amp;dn=Chemical+Process+Design+and+Integration+-+Robin+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1436057925,"description":"Chemical Process Design and Integration - Robin Smith (Wiley, 2005).pdf\n\nISBN 0471486809\n\nThis book deals with the design and integration of chemical processes, emphasizing the conceptual issues that are fundamental to the creation of the process. Chemical process design requires the selection of a series of processing steps and their integration to form a complete manufacturing system. The text emphasizes both the design and selection of the steps as individual operations and their integration. Also, the process will normally operate as part of an integrated manufacturing site consisting of a number of processes serviced by a common utility system. The design of utility systems has been dealt with in the text so that the interactions between processes and the utility system and interactions between different processes through the utility system can be exploited to maximize the performance of the site as a whole. Chemical processing should form part of a sustainable industrial activity. For chemical processing, this means that processes should use raw materials as efficiently as is economic and practicable, both to prevent the production of waste that can be environmentally harmful and to preserve the reserves of raw materials as much as possible. Processes should use as little energy as economic and practicable, both to prevent the build-up of carbon dioxide in the atmosphere from burning fossil fuels and to preserve reserves of fossil fuels. Water must also be consumed in sustainable quantities that do not cause deterioration in the quality of the water source and the long-term quantity of the reserves. Aqueous and atmospheric emissions must not be environmentally harmful, and solid waste to landfill must be avoided. Finally, all aspects of chemical processing must feature good health and safety practice. It is important for the designer to understand the limitations of the methods used in chemical process design. The best way to understand the limitations is to understand the derivations of the equations used and the assumptions on which the equations are based. Where practical, the derivation of the design equations has been included in the text. The book is intended to provide a practical guide to chemical process design and integration for undergraduate and postgraduate students of chemical engineering, practicing process designers and chemical engineers and applied chemists working in process development. Examples have been included throughout the text. Most of these examples do not require specialist software and can be performed on spreadsheet software. Finally, a number of exercises have been added at the end of each chapter to allow the reader to practice the calculation procedures","torrent":{"xt":"urn:btih:3c5e93d3c459941070e864b885dd661ab0ef7e55","amp;dn":"Chemical+Process+Design+and+Integration+-+Robin+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c5e93d3c459941070e864b885dd661ab0ef7e55","infoHashBuffer":{"type":"Buffer","data":[60,94,147,211,196,89,148,16,112,232,100,184,133,221,102,26,176,239,126,85]},"announce":[],"urlList":[]}}