{"title":"UBCD4WIN  .ISO - 2010kaiser","uid":7455221,"size":683218744,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3cb4ce775910455f4ea7e8e745af74c59cae59f1&amp;dn=UBCD4WIN++.ISO+-+2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2010kaiser","files":-1,"time":1342647222,"description":"UBCD4Win is a bootable recovery CD that contains software used for repairing, restoring, or diagnosing almost any computer problem. Our goal is to be the most complete and easy to use free computer diagnostic tool. Almost all software included in UBCD4Win are freeware \n\nutilities for WindowsÂ®. Some of the tools inlcuded are &quot;free for personal use&quot; copies so users need to respect these licenses. A few of the tools included in UBCD4Win are paid for and licensed software owned by UBCD4win. On occasion we work with software companies/authors for permission to include their software in our download or have requested their software better support PE.\n\n Users can freely share copies of UBCD4Win with friends but selling UBCD4Win for a profit is not acceptable. We have worked hard for many years helping people for free with this project, others should not make money from our hard work. If you are a dialup user having a hard time downloading UBCD4Win, please visit our ordering page. UBCD4Win is based on Bart's PEÂ©. Bart's PEÂ© builds a WindowsÂ® &quot;pre-install&quot; environment CD, basically a simple WindowsÂ® XP booted from CD. UBCD4Win includes network support and allows you the ability to modify NTFS volumes, recover deleted files, create new NTFS volumes, scan hard drives for viruses, etc. \n\nOur download includes almost everything you need to repair your system problems. This project has been put together to be the ultimate recovery cd and not a replacement OS (Operating System). Please visit the &quot;List of Tools&quot; page for a complete list of what is included in the latest version of UBCD4Win.\n\n\n\nRemember that we are a freeware tool. We still have hosting and other costs to pay every month. If UBCD4Win has helped you and you are able to, please consider donating\n\n\nUBCD4WIN Home Page Below:\n &lt;a href=&quot;\nhttp://www.ubcd4win.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ubcd4win.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:3cb4ce775910455f4ea7e8e745af74c59cae59f1","amp;dn":"UBCD4WIN++.ISO+-+2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cb4ce775910455f4ea7e8e745af74c59cae59f1","infoHashBuffer":{"type":"Buffer","data":[60,180,206,119,89,16,69,95,78,167,232,231,69,175,116,197,156,174,89,241]},"announce":[],"urlList":[]}}