{"title":"Yello - The Eye (2003)[Flac]","uid":6951132,"size":396450286,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3cf8a45d00fefe84448f4e794599d1409c80e5d2&amp;dn=Yello+-+The+Eye+%282003%29%5BFlac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"burmester78","files":14,"time":1326407173,"description":"The band was originally formed by Boris Blank (keyboards, sampling, percussion, backing vocals) and Carlos PerÃƒÂ³n (tapes) in the late 1970s. Dieter Meier (vocals, lyrics), a millionaire industrialist and gambler, was brought in when the two founders realized that they needed a singer. The new band name, Yello, was chosen as a pun based on a statement made by Dieter Meier, \\\\\\&quot;a yelled Hello\\\\\\&quot;.[1] Yello\\\\\\'s first release was the 1979 single \\\\\\&quot;I.T. Splash\\\\\\&quot;. The LP Solid Pleasure, featuring the hit dance single \\\\\\&quot;Bostich\\\\\\&quot;, was released in November 1980.\n \nIn 1983, Yello received substantial media attention with the release of \\\\\\&quot;I Love You\\\\\\&quot; and \\\\\\&quot;Lost Again\\\\\\&quot;. PerÃƒÂ³n left the band in 1983 to start a solo career. With their 1983 album You Gotta Say Yes to Another Excess, the band began a working relationship with Ernst Gamper, whose \\\\\\&quot;corner cut\\\\\\&quot; logo would represent them for three albums, and who would design covers for the group beyond the demise of this logo.[citation needed]\n \nMeier is also a filmmaker, having written and directed the films Jetzt und Alles and Lightmaker as well as most of Yello\\\\\\'s music videos. Additionally, Meier produces his own wine on his ranch.[2]\n \nIn 2005, Yello re-released their early albums Solid Pleasure, Claro Que Si, You Gotta Say Yes to Another Excess, Stella, One Second, and Flag, all with rare bonus tracks, as part of the Yello Remaster Series.[3]\n \nA documentary on Yello, Electro Pop made in Switzerland, directed by Anka Schmid, was premiered at the Riff Raff cinema in ZÃƒÂ¼rich in September 2005.[4]\n \nYello was commissioned to produce music for the launch of the Audi A5 at the Geneva Motor Show in March 2007 and for the Audi A5 commercial in May 2007.\n\n\n\nEnjoy :)","torrent":{"xt":"urn:btih:3cf8a45d00fefe84448f4e794599d1409c80e5d2","amp;dn":"Yello+-+The+Eye+%282003%29%5BFlac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cf8a45d00fefe84448f4e794599d1409c80e5d2","infoHashBuffer":{"type":"Buffer","data":[60,248,164,93,0,254,254,132,68,143,78,121,69,153,209,64,156,128,229,210]},"announce":[],"urlList":[]}}