{"title":"(1969) John Lennon &amp; Yoko Ono - Wedding Album [FLAC] {100.XY","uid":9751020,"size":248055053,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d1914f84fee85fc13fbd18e543b81549b73f17c&amp;dn=%281969%29+John+Lennon+%26amp%3B+Yoko+Ono+-+Wedding+Album+%5BFLAC%5D+%7B100.XY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"100.XY","files":-1,"time":1394665171,"description":"John Lennon &amp; Yoko Ono - Wedding Album\n\n\n\nReview:\nThe third long player of experimental recordings by John Lennon and Yoko Ono, Wedding Album was released by Apple in 1969.\n\nIt was like our sharing our wedding with whoever wanted to share it with us. We didn't expect a hit record out of it. It was more of a... that's why we called it Wedding Album. You know, people make a wedding album, show it to the relatives when they come round. Well, our relatives are the... what you call fans, or people that follow us outside. So that was our way of letting them join in on the wedding.\nJohn Lennon, 1980\nBBC\nThe couple's first collaboration, Two Virgins, marked the beginning of their relationship and artistic partnership. The follow-up, Life With The Lions, mostly documented their 1968 stay in London's Queen Charlotte Hospital, where Ono suffered a miscarriage.\n\nWedding Album commemorated their wedding in Gibraltar on 20 March 1969. Although it was the final instalment in their trilogy of avant garde and experimental recordings, the couple continued to document their lives on tape until Lennon's death in 1980.\n\nWedding Album was credited simply to &quot;John &amp; Yoko&quot;; their surnames did not appear anywhere on the sleeve or record labels.\n\nThe two sides of the vinyl disc each contained a single track. John And Yoko was a 22-minute recording of Lennon and Ono crying, whispering, speaking and screaming each others' names, at varying volumes and tempos, over the sound of their heartbeats.\n\nThey had previously released the sound of their unborn child's heartbeat on the Life With The Lions track Baby's Heartbeat, but this was the first time they had used their own non-vocal bodily sounds in their recordings.\n\nThe couple first recorded John And Yoko at EMI Studios, Abbey Road, on 22 April 1969, in a session beginning at 11pm and finishing at 4.30am the following morning. Five days later they returned to remake the track, with recording and mixing completed between 3pm and 8pm.\n\nThe released version was a combination of the 22 and 27 April recordings. Lennon edited the two together on 1 May 1969.\n\nThe album's second side was titled Amsterdam, and featured recordings made during their first bed-in for peace. The 25-minute track began with Ono singing John John (Let's Hope For Peace), which was later performed at the Toronto Rock and Roll Revival festival and released on Live Peace In Toronto 1969.\n\nMuch of Amsterdam consisted of interviews given by Lennon and Ono, explaining their campaigns for peace, and discussions with each other. The speech was also interspersed with the sounds of seagulls, industrial noises, traffic, children playing and sitars.\n\nPeace is only got by peaceful methods. The establishment knows how to play the game of violence. They can't handle peaceful humour.\nJohn Lennon\nAmsterdam\nAs the bed-in was discussed in the past tense during the recording, it is likely that parts of the recording were made in London or elsewhere after the event.\n\nFour other musical interludes were also included: Lennon performing a brief blues-style composition on an acoustic guitar, featuring the words &quot;Goodbye Amsterdam Goodbye&quot;; Ono singing Grow Your Hair, a song about peace and staying in bed, with Lennon on guitar; an a capella rendition of The Beatles' song Good Night; and Bed Peace, a brief recitation of the words &quot;Bed peace&quot; and &quot;Hair peace&quot;.\n\nCOVER ARTWORK\n\nUnusually for the time, Apple released Wedding Album as a lavish box set. It included a reproduction of the marriage certificate, a 16-page booklet of press cuttings labelled 'The Press', a picture of a slice of wedding cake, a poster of black-and-white photos taken on their wedding day, a 'Hair Peace/Bed Peace' postcard, a PVC bag labelled 'Bagism', and a strip of four passport photographs of the happy couple.\n\nThe vinyl disc was housed in a plain white inner sleeve, inside a laminated gatefold picture sleeve. The package was designed by John Kosh, with photography by Mlle Daniau, Richard DiLello, John Kelly, Nico Koster, David Nutter and John and Yoko.\n\nWedding Album was available on vinyl, cassette tape and 8-track tape. The elaborate packaging led to a delay in the album being issued. It eventually appeared in the United States on 20 October 1969, and in the United Kingdom on 14 November.\n\nThe album was digitally remastered and reissued on compact disc by the Rykodisc label in 1997. It included three bonus tracks: Who Has Seen The Wind? was written by Yoko Ono and originally appeared as the b-side to Instant Karma; Listen, The Snow Is Falling was the b-side to Happy Xmas (War Is Over); and Don't Worry Kyoko (Mummy's Only Looking For Her Hand In The Snow) was a previously unreleased acoustic recording made at Queen Charlotte Hospital, London.\n\nTHE RECEPTION\n\nThe album did not chart in the UK, but peaked at number 178 in the United States. Because of it poor sales and the various elements to the release, mint condition copies are highly sought after by collectors.\n\nThe UK weekly music newspaper Melody Maker ran a notorious review written by Richard Williams, who had been given a promotional copy containing two discs, each of which contained a test signal on one side. Williams duly reviewed what he thought was a double album, noting that &quot;constant listening reveals a curious point: the pitch of the tones alters frequency, but only by microtones or, at most, a semitone. This oscillation produces an almost subliminal, uneven 'beat' which maintains interest. On a more basic level, you could have a ball by improvising your very own raga, plainsong, or even Gaelic mouth music against the drone.&quot;\n\nLennon and Ono were greatly amused by Williams' review, and sent a telegram of thanks.\n\nDEAR RICHARD THANK YOU FOR YOUR FANTASTIC REVIEW ON OUR WEDDING ALBUM INCLUDING C-AND-D SIDES STOP WE ARE CONSIDERING IT FOR OUR NEXT RELEASE STOP MAYBE YOU ARE RIGHT IN SAYING THAT THEY ARE THE BEST SIDES STOP WE BOTH FEEL THAT THIS IS THE FIRST TIME A CRITIC TOPPED THE ARTIST STOP WE ARE NOT JOKING STOP LOVE AND PEACE STOP JOHN AND YOKO LENNON\n\n\nimage\n\n\n\nTrack List:\n01. John &amp; Yoko [0:22:43.29]\n02. Amsterdam [0:24:59.40]\n03. Who Has Seen The Wind? [0:02:05.20]\n04. Listen, The Snow Is Falling [0:03:24.80]\n05. Don't Worry Kyoko Mummy's Only Looking For Her Hand In The Snow [0:02:14.60]\n\n\nSummary:\nCountry: UK\nGenre: Avant-garde\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 16-bit PCM\nBit rate mode : Variable\nBit rate : ~810-1000 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits","torrent":{"xt":"urn:btih:3d1914f84fee85fc13fbd18e543b81549b73f17c","amp;dn":"%281969%29+John+Lennon+%26amp%3B+Yoko+Ono+-+Wedding+Album+%5BFLAC%5D+%7B100.XY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d1914f84fee85fc13fbd18e543b81549b73f17c","infoHashBuffer":{"type":"Buffer","data":[61,25,20,248,79,238,133,252,19,251,209,142,84,59,129,84,155,115,241,124]},"announce":[],"urlList":[]}}