{"title":"Nikos The Impaler (Violent Shit 4) - 2003 DVDRip","uid":5631198,"size":732813312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e0fa04a0cc94889f28e340eeea5e92fa607e824&amp;dn=Nikos+The+Impaler+%28Violent+Shit+4%29+-+2003+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Horrorspoke","files":1,"time":1276688797,"description":"Due to a botched robbery attempt, a ruthless Romanian barbarian is somehow resurrected in modern day New York and begins wreaking havoc on a small Manhattan art-house. Chaos ensues as the patrons of the establishment band together to fight for their lives.\n\nReview from IMDB:\n\nPrepare to laugh like you've never laughed before, people. Andreas Schnaas is the new Ed Wood! He can barely line up a shot, and whoever edits for him acts like he just bought his first iMac and is trying to puzzle his way through iMovie without reading the manual or even the onscreen tutorial. This is absolutely glorious cheese, a one-movie festival of filmmaking ineptitude, with performances that wouldn't pass muster in a high school play. The gore scenes will have you rolling on the floor in such convulsions of hilarity that EMS might have to be called in to feed you oxygen. When Nikos is brought back to life and promptly hacks off the head of the grandmotherly museum curator (with a totally &quot;plywood spray-painted silver&quot; sword), I thought I'd wake up the whole block with my laughter. This movie is fecal beyond the dreams of proctologists, but I swear, if you want to have an MST3K movie party at your place one night, your guests won't need to get wasted or toke up to appreciate this comedy of errors!\n\nActual worth as a film: 0/10 &quot;Cracking up all your friends at a party&quot; value:\n","torrent":{"xt":"urn:btih:3e0fa04a0cc94889f28e340eeea5e92fa607e824","amp;dn":"Nikos+The+Impaler+%28Violent+Shit+4%29+-+2003+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e0fa04a0cc94889f28e340eeea5e92fa607e824","infoHashBuffer":{"type":"Buffer","data":[62,15,160,74,12,201,72,137,242,142,52,14,238,165,233,47,166,7,232,36]},"announce":[],"urlList":[]}}