{"title":"A Grand Origin for Grand Canyon - Michael Oard","uid":11773175,"size":3729729,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e1b3a6f5f1e7abff961e24c63784ff4cc800e1e&amp;dn=A+Grand+Origin+for+Grand+Canyon+-+Michael+Oard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427157421,"description":"The author provides a thorough evaluation of the origin of one of the Earth?s most famous icons, Grand Canyon. Citing plentiful geomorphological evidence, he attributes the canyon?s formation to events that occurred near the end of the Noachian Flood. He shows that before the canyon itself could have been eroded, thousands of feet of strata were removed by massive sheet erosion. Then he develops the hypothesis that the canyon was rapidly carved by late-Flood channelized erosion. Oard also cites evidence which demonstrates that the evolutionists? uniformitarian ideas are very far from providing satisfactory explanations. He also examines the various creationist hypotheses, including the dam-breach hypothesis, and finds them all to be wanting.\n\nThis book, available only as an e-book, is written to the level of well-educated laypersons, and is heavily referenced to provide substance for those who are more technically oriented. There are some 134 figures spread throughout its estimated 328 pages.\n\n\nAbout the author:\nMichael J. Oard is a creation scientist with a specialization in Atmospheric Science. He is a prolific author who has published numerous books and papers in widely recognized creationist and secular journals. He worked for close to 30 years as a meteorologist/weather forecaster with the (US) National Weather Service, and now dedicates much of his time to creation science research. Mike's research interests have focused primarily on topics such as geological evidence for Noah's flood, the Ice Age, and the mass extinction of the Woolly Mammoths. He speaks regularly at creation conferences and other venues and has served on the board of directors of the Creation Research Society since 2001.\n\nMike received his Masters of Science degree in Atmospheric Science from the University of Washington in 1973. He then worked as a meteorologist for the U.S. National Weather Service until 2001, and as the lead forecaster in Montana from 1981 to 2001","torrent":{"xt":"urn:btih:3e1b3a6f5f1e7abff961e24c63784ff4cc800e1e","amp;dn":"A+Grand+Origin+for+Grand+Canyon+-+Michael+Oard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e1b3a6f5f1e7abff961e24c63784ff4cc800e1e","infoHashBuffer":{"type":"Buffer","data":[62,27,58,111,95,30,122,191,249,97,226,76,99,120,79,244,204,128,14,30]},"announce":[],"urlList":[]}}