{"title":"Walking in the Air [the original + 50 covers]","uid":5228538,"size":341058059,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3e26370196a520e1ffd2f6716ed26399162f5764&amp;dn=Walking+in+the+Air+%5Bthe+original+%2B+50+covers%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ADHDerby","files":-1,"time":1261231081,"description":"&quot;Walking in the Air&quot; is a song written by Howard Blake for the 1982 animated film of Raymond Briggs' 1976 children's book The Snowman. The story relates the fleeting adventures of a young boy, and a snowman who has come to life. In the second part of the story, the boy and the snowman fly to the North Pole. &quot;Walking in the Air&quot; is the theme for the journey. In the film the song was performed by St. Paul's Cathedral choirboy Peter Auty. For the subsequent single release, which reached number five in the UK pop charts in 1985, the vocals were sung by Welsh chorister Aled Jones, who became a popular celebrity on the strength of his performance. Jones' version was not an official The Snowman tie-in though it was authorised by Howard Blake. &quot;Walking in the Air&quot; has subsequently been covered by many artists, in a very wide range of styles, varying from choir vocals to trance and hard rock.\n\nThis collection contains the original song, performed by Peter Auty, and 50 covers performed by Aled Jones, Ambra, Andrew Johnston, Angelis, Avalanche, Boys Air Choir, Celtic Woman, Chloe Agnew, Cliff Richard, cLuMsY, Connie Talbot, Corwana, Dark By Design &amp; SMG, Declan Galbraith, Digital Dream Baby, DJ Kaos, Domingo &amp; Cocciante, Elaine Paige, Emi Fujita, George Winston, Gregorian, Hayley Westenra, Izgoy12, Joseph McManners, Kenny Loggins, Liam O'Kane, Lim Hyung Joo, Mari Fujiwara, Mike Cupcake, Nightwish, Oceansize, Osymyso, Phil Coulter, Rainbow, Re-form, Robin Allender, Ryan and Rachel O'Donnell, Sephfire, Stephen Van Dyck, Tangerine Dream, Tarja Turunen, The Choirboys, The King's Singers, The Omen, The Shadows, The Swingle Singers, Tracy Huang, Vienna Boy's Choir, X Project, and Yao Si Ting.\n\nI've grabbed the tracks from all over the world wide web, so the quality differs a bit, but overall it's good. - Make sure to check out the covers by cLuMsY (Reggae) and The King's Singers (A cappella),.. brilliant!! :D\n\nExtras: Lyrics, Piano Sheet Music and a Poster (3472 x 3999)\n\n\nMerry Christmas!! - ADHDerby","torrent":{"xt":"urn:btih:3e26370196a520e1ffd2f6716ed26399162f5764","amp;dn":"Walking+in+the+Air+%5Bthe+original+%2B+50+covers%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e26370196a520e1ffd2f6716ed26399162f5764","infoHashBuffer":{"type":"Buffer","data":[62,38,55,1,150,165,32,225,255,210,246,113,110,210,99,153,22,47,87,100]},"announce":[],"urlList":[]}}