{"title":"Stevie Nicks - Timespace (Greatest Hits) 1991 [FLAC] - Kitlope","uid":4810461,"size":469085944,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3e4a09f6b529eb447d90cab11a6d59f7ba55b65b&amp;dn=Stevie+Nicks+-+Timespace+%28Greatest+Hits%29+1991+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":18,"time":1238357081,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 3E4A09F6B529EB447D90CAB11A6D59F7BA55B65B\nFile Size: 447.35 Mb\nYear: 1991\nLabel: Modern Records /Atlantic/ EMI\nCatalog #: A2 91711\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\n\nStephanie Lynn &quot;Stevie&quot; Nicks (born on May 26, 1948 in Phoenix, Arizona) is an American singer-songwriter, best known for her work with Fleetwood Mac and an extensive solo career, which collectively have produced over forty Top 50 hits and has sold nearly 120 million albums. She has been noted for her ethereal visual style and symbolic lyrics. In the early 1980s, and after a hugely successful first solo album, Rolling Stone deemed her &quot;The Reigning Queen of Rock and Roll&quot;.[3]\n\nNicks was invited to join Fleetwood Mac in 1975 after Mick Fleetwood heard &quot;Frozen Love&quot;, a song she wrote and recorded with then-boyfriend Lindsey Buckingham. Initially, Fleetwood only intended to hire Lindsey Buckingham, but Buckingham told him: &quot;We're a package deal.&quot; Their first album after the addition of Nicks and Buckingham produced four Top 40 singles and hit #1 on the album charts. With the commercial and critical success of Fleetwood Mac's Rumours album in 1977 (which sold over 33 million copies worldwide), Fleetwood Mac gained international fame.\n\nNicks began her solo career in 1981 with Bella Donna, and she has produced five more solo studio albums to date. Overcoming cocaine addiction, dependency on tranquilizers, and chronic fatigue syndrome, Nicks remains a successful solo performer. Nicks has been nominated for seven Grammy Awards, and, with Fleetwood Mac, won the 1977/1978 Grammy for Album of the Year for Rumours. As a member of Fleetwood Mac, she was inducted into the Rock and Roll Hall of Fame in 1998. Nicks has a contralto vocal range.[1][4] [5] As a young child, Nicks had difficulty pronouncing her given name Stephanie, instead pronouncing it &quot;tee-dee&quot;, which became the nickname &quot;Stevie&quot;.[6].\n\nWith the Goya guitar that she received for her sixteenth birthday, Nicks wrote her first song called &quot;I've Loved and I've Lost, and I'm Sad But Not Blue&quot;. She joined her first band &quot;The Changing Times&quot; while attending Arcadia High School in Arcadia, CA, a suburb of Los Angeles.[7]\n\nNicks first met her future musical and romantic partner Lindsey Buckingham during her senior year at Menlo Atherton High School.[8] She and Buckingham attended a religious meeting called Young Life, where they performed a duet of &quot;California Dreamin'&quot;. Buckingham contacted Nicks a few years later and asked her to join him and his bandmates Javier Pacheco and Calvin Roper in a band called Fritz. Fritz became popular as a live act from 1968 until 1972. Fritz opened for popular musicians Jimi Hendrix and Janis Joplin, among others, in the San Francisco Bay Area.[9] Both Nicks and Buckingham attended San Jose State University in Northern California, where Nicks majored in Speech Communication.\n\n\n\n\nTimespace ~ The Best of Stevie Nicks \n\n\nTimespace - The Best of Stevie Nicks is a 1991 compilation album featuring songs from the solo career of American singer/songwriter and Fleetwood Mac vocalist Stevie Nicks. The album features many of her hit singles, along with three new songs: &quot;Sometimes it's a Bitch&quot;, &quot;Love's a Hard Game to Play&quot;, and &quot;Desert Angel&quot;. The album has sold over 1 million copies in the U.S., achieving platinum status there in 1997, and gold status in the UK for sales of over 100,000 copies.\n\n\n\nTracks: \n\n1.\t&quot;Sometimes it's a Bitch&quot; (Jon Bon Jovi, Billy Falcon) \n2.\t&quot;Stop Draggin' My Heart Around&quot; (Tom Petty, Mike Campbell) \no\tperformed by Stevie Nicks with Tom Petty and the Heartbreakers \n3.\t&quot;Whole Lotta Trouble&quot; (Stevie Nicks, Campbell) \n4.\t&quot;Talk to Me&quot; (Chas Sanford) \n5.\t&quot;Stand Back&quot; (Nicks) \n6.\t&quot;Beauty and the Beast&quot; (Nicks) \n7.\t&quot;If Anyone Falls&quot; (Stevie Nicks, Sandy Stewart) \n8.\t&quot;Rooms on Fire&quot; (Nicks, Rick Nowels) \n9.\t&quot;Love's a Hard Game to Play&quot; (Bret Michaels, Pat Schunk) \n10.\t&quot;Edge of Seventeen&quot; (Nicks) \n11.\t&quot;Leather and Lace&quot; (Nicks) \no\tperformed by Stevie Nicks &amp; Don Henley \n12.\t&quot;I Can't Wait&quot; (Nicks, Nowels, E. Pressly) \n13.\t&quot;Has Anyone Ever Written Anything for You?&quot; (Stevie Nicks) \n14.\t&quot;Desert Angel&quot; (Nicks, Campbell) \n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:3e4a09f6b529eb447d90cab11a6d59f7ba55b65b","amp;dn":"Stevie+Nicks+-+Timespace+%28Greatest+Hits%29+1991+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e4a09f6b529eb447d90cab11a6d59f7ba55b65b","infoHashBuffer":{"type":"Buffer","data":[62,74,9,246,181,41,235,68,125,144,202,177,26,109,89,247,186,85,182,91]},"announce":[],"urlList":[]}}