{"title":"David Icke - The Robots Rebellion The Story of the Spiritual Ren","uid":14780405,"size":1242076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f130532f6c591e678acbf477e50de8e84f604ea&amp;dn=David+Icke+-+The+Robots+Rebellion+The+Story+of+the+Spiritual+Ren&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1464986535,"description":"http://extraimago.com/images/2016/06/03/8616img.jpg\r\n\r\nDavid Icke - The Robots Rebellion The Story of the Spiritual Renaissance 1994\r\n\r\nWe live in a world which is increasingly dominated by revolutionary new technology but, according to author and lecturer, David Icke, it is WE who are the robots. In his strongest book to date, Icke reveals the alarming extent to which people of all nations have allowed themselves to be programmed by the ideas fed to them by those in power. Fearlessly, he tears down the veils of hypocrisy, built up for generations by the corrupt forces of Church, State, science and commerce - and reveals the true pathos of the human condition beneath. He points, too, to the frightening influence wielded throughout the planet by a merciless and manipulative network of secret societies. The existence of long-established links between Earth-bound humanity and beings from other dimensions and planets in the Universe has been suppressed for years, says Icke, by the world's power-broking hierarchy. When ordinary people learn the real role they have to play within a rich and varied cosmic society, rebellion against those who have kept this extraordinary truth from them will, he predicts, be inevitable. Hidebound politicians, bankers, economists, educationalists, scientists and the leaders of the world's established religions are not going to welcome Icke's challenging book. But it is not intended for those who wield and abuse power. This book is for the world's unwilling robots who, says Icke, in an upbeat conclusion, have it within themselves to rise up - and take control of their own exciting destiny. Other books by David Icke Heal the World Truth Vibrations","torrent":{"xt":"urn:btih:3f130532f6c591e678acbf477e50de8e84f604ea","amp;dn":"David+Icke+-+The+Robots+Rebellion+The+Story+of+the+Spiritual+Ren","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f130532f6c591e678acbf477e50de8e84f604ea","infoHashBuffer":{"type":"Buffer","data":[63,19,5,50,246,197,145,230,120,172,191,71,126,80,222,142,132,246,4,234]},"announce":[],"urlList":[]}}