{"title":"Miles Davis - In a Silent Way (1969) [Jazz][flac][schon55]","uid":6114013,"size":167247235,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:401d4817a1c7136d276d5e4d46e464b49297eefd&amp;dn=Miles+Davis+-+In+a+Silent+Way+%281969%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":7,"time":1295473240,"description":"Miles Davis - In a Silent Way \nYear: 1969\nAudio CD: August 20, 2002 \nLabel: Sony  \nFormat: Original recording reissued, Original recording remastered \nQuality: flac\n\nRecorded february 18, 1969 at NYC\n\nEditorial Reviews - Amazon.com\nMiles Davis's famous mid-1960s quintet, featuring saxophonist Wayne Shorter and pianist Herbie Hancock, was intact until just  a few weeks before his new, electric ensemble recorded In a Silent Way. Legendary as a kind of line in the sand challenging jazz  fans during the ascendance of electric, psychedelic rock, In a Silent Way hinted at the repetitive polyrhythms Davis would  employ throughout the early 1970s. It also partook generously of electric piano and bass and rekindled the tonal palette that  Davis had explored famously with Kind of Blue. But In a Silent Way remains a clearly electric jazz record, part ambient color  exploration, part rock-inflected energy and vibe, and part outright maverick creativity. Davis takes many long, breathy solos,  and they glisten in a burnished blue against his new group's strange admixture of musical moods.  ~ Andrew Bartlett \n\n&quot;In a Silent Way&quot; single-handedly ushered in a new era of improvised music blending the sophisticated modes of jazz, the  up-tempo pulse of rock and the cool other-worldliness of ambient - a term coined 12 years later by Brian Eno. According to John  McLaughlin, Miles was an inspirational band leader who was able to inspire unique performances by bringing together the best  young musicians and flexibly original material. \n\nThe 18 minute opening track &quot;Shh Peaceful&quot; finds the musicians moving in and out of the simple musical forms together  building to a shared climax from what has come before. Resolve to the after-glow of &quot;In a Silent Way&quot; - Joe Zawinul's  composition recalling the mountains of his boyhood home in Austria. Miles instructed McLaughlin to &quot;play the melody but not  the chords&quot;. McLaughlin came up with something that uniquely held the mood while allowing Miles and saxophonist Wayne  Shorter to play the theme and evoke a haunting yet hopeful mood inherent in the composition. \n\n&quot;It's about that Time&quot; emerges full-grown from that dream-trance. Clocking a 4-4 rock beat (Tony Williams) along with a  spacious, stuttering bass beat (Dave Holland), Miles states an open ended theme underpinned by electric guitar (McLaughlin)  and multiple keyboards (Corea, Hancock, Zawinul). Solos happen but the evolving blend dances around the solid pulse bringing  to a boil the passions that have been simmering and building from the beginning. More than anything the music evokes the  sensuous feel of late night sex. ~ Ron Hollings\n\nPersonnel:\nMiles Davis (Trumpet);\nHerbie Hancock (Electric Piano);\nChick Corea (Electric Piano);\nWayne Shorter (Tenor Sax);\nDave Holland (Bass);\nJoe Zawinull (Electric Piano and Organ);\nJohn McLaughlin (Guitar);\nTony Williams (Drums)\n\nMiles Davis - In a Silent Way Tracks:\n01  Shhh / Peacefull 17:58\n02  In a Silent Way /  It's About That time 19:57","torrent":{"xt":"urn:btih:401d4817a1c7136d276d5e4d46e464b49297eefd","amp;dn":"Miles+Davis+-+In+a+Silent+Way+%281969%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"401d4817a1c7136d276d5e4d46e464b49297eefd","infoHashBuffer":{"type":"Buffer","data":[64,29,72,23,161,199,19,109,39,109,94,77,70,228,100,180,146,151,238,253]},"announce":[],"urlList":[]}}