{"title":"Winzip 12","uid":4729841,"size":7210490,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4052b71620ee26f1454d3bee5cbab313a7408075&amp;dn=Winzip+12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"app0dayz","files":-1,"time":1234963375,"description":"choose keygen or serial...\n\nMost home users use WinZip to open Zip files, usually downloaded from the Internet or received as an email attachment, and to create zip files to send emails faster and conserve disk space. These are important benefits, but WinZip has so much more to offer.\n\nProtect Your Data!\n\nThese days, most people have software to protect their computer from viruses and spyware. But what about a hard drive crash? Or fire, water damage or theft? Have you ever deleted an important file by accident?\n\nThe reality is, these threats are just as real, as serious and as devastating (if not more so) as most viruses, yet studies show that very few home users back up their files on a regular basis. WinZip can help by making it easy to back up your important data on CD/DVD, jump drive or FTP location.\n\nNot only does WinZip make it easy for you to archive your files, it can even encrypt them with the same AES encryption method approved for use by the US government. That means that you can back up important data on your hard drive to CD/DVD or jump drive with the peace of mind that only you can unlock those files.\n\nWhat's more, WinZip Pro offers features that make data back up easier than ever:\n\nAutomate Repetitive Tasks\nIf you select WinZip Pro you'll love our Job Wizard that handles predefined data backup jobs and allows you to create custom zip jobs that run automatically and even email or FTP the resulting Zip file to a specified recipient. It's a HUGE time saver and lets you back up your data regularly without having to think about it.\n\nZip Directly to CDs and DVDs\nAlso available with WinZip Pro is the ability to zip directly to CDs and DVDs. That means that you can skip a step because there's no need to zip to your hard drive first. Large Zip files will even span multiple disks automatically.\n\nAnd whether you chose Standard or Pro, you'll have the ability to view all files at-a-glance and drill down quickly thanks to our Explorer-style view. Any Windows Explorer user will feel right at home using this new feature to navigate and organize complex, multi-folder Zip files.\n\n","torrent":{"xt":"urn:btih:4052b71620ee26f1454d3bee5cbab313a7408075","amp;dn":"Winzip+12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4052b71620ee26f1454d3bee5cbab313a7408075","infoHashBuffer":{"type":"Buffer","data":[64,82,183,22,32,238,38,241,69,77,59,238,92,186,179,19,167,64,128,117]},"announce":[],"urlList":[]}}