{"title":"Osho_The Last Testament_vol-3 #22-printing negativity.mp4","uid":15566817,"size":795705871,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:406cfa0ff39f105fb78a1755194eb503da90085d&amp;dn=Osho_The+Last+Testament_vol-3+%2322-printing+negativity.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1471212244,"description":"Format:                                    AVC\r\nFile size                                : 759 MiB\r\nDuration                                 : 1h 53mn\r\nOverall bit rate                         : 932 Kbps\r\nWidth                                    : 704 pixels\r\nHeight                                   : 576 pixels\r\nOriginal frame rate                      : 25.000 fps\r\nAudio:\r\nFormat                                   : AAC\r\nBit rate                                 : 158 Kbps\r\nChannel(s)                               : 2 channels\r\nSampling rate                            : 44.1 KHz\r\n\r\nOsho_The Last Testament vol 3 # 22\r\n12 October 1985 pm in Sanai Grove\r\n\r\nINTERVIEWS WITH MARY CATHERINE, SAMYA AND SUBHUTI FOR THE RAJNEESH TIMES.\r\nSAMYA: BHAGWAN, WHAT IS THE DIFFERENCE BETWEEN PRINTING NEGATIVITY AND PRINTING FREEDOM OF EXPRESSION?\r\n\r\nA:* There is no difference. It is man's birthright to express whatever he thinks, whatever he feels, in whatever language he wants to express it. To interfere in it on any grounds, is to destroy democracy.\r\nThe grounds may look valid. For example, the literature may be condemned as obscene. But who is going to determine what is obscene? If the act of making love is not obscene, then writing about it cannot be obscene. Then printing a picture or painting about it, cannot be obscene.\r\nFreedom of expression knows no limits. Any limit is an infringement on human individuality, on the grounds of morality, religion, ethics, manners, etiquette.\r\nThese are all excuses, and these are the ways that humanity has been repressed.\r\nAnything can be called immoral, it all depends how you define it. There is no fixed definition of morality.\r\nIf somebody is bringing unreal, unnatural things to people's mind, then he is a pervert. He should be prevented, because the freedom of expression does not mean that you can poison other people's minds.\r\nThe priests should be prevented from preaching celibacy, because that is the root cause of all the perversions. But no court rules against celibacy.\r\nAnd anything that can be expressed in words can also be printed, painted, sculpted -- there should be no limitation on it. The only thing that should be prevented is anybody creating in people sick ideas.\r\nYou are free to express, but you are not free to vomit over people's mind. You are free to express, but you are not to create people nauseous, sick. That will be a crime.&quot;(Osho)\r\n\r\nFree audio and books download from oshoworld(dot)com","torrent":{"xt":"urn:btih:406cfa0ff39f105fb78a1755194eb503da90085d","amp;dn":"Osho_The+Last+Testament_vol-3+%2322-printing+negativity.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"406cfa0ff39f105fb78a1755194eb503da90085d","infoHashBuffer":{"type":"Buffer","data":[64,108,250,15,243,159,16,95,183,138,23,85,25,78,181,3,218,144,8,93]},"announce":[],"urlList":[]}}