{"title":"Crisis and Opportunity: Sustainability in American Agriculture","uid":6572761,"size":749114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4093457634459dd74e3028400f9531ab8506774f&amp;dn=Crisis+and+Opportunity%3A+Sustainability+in+American+Agriculture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1312043152,"description":"John E. Ikerd, &quot;Crisis and Opportunity: Sustainability in American Agriculture&quot; \nBis on B ooks | 2008 | ISBN: 0803211422 | PDF | 342 pages | 1 MB\n\nWith the decline of family farms and rural communities and the rise of corporate farming and the resulting environmental degradation, American agriculture is in crisis. But this crisis offers the opportunity to rethink agriculture in sustainable terms. Here one of the most eloquent and influential proponents of sustainable agriculture explains what this means. These engaging essays describe what sustainable agriculture is, why it began, and how it can succeed. Together they constitute a clear and compelling vision for rebalancing the ecological, economic, and social dimensions of agriculture to meet the needs of the present without compromising the future.\nIn Crisis and Opportunity, John E. Ikerd outlines the consequences of agricultural industrialization, then details the methods that can restore economic viability, ecological soundness, and social responsibility to our agricultural system and thus ensure sustainable agriculture as the foundation of a sustainable food system and a sustainable society","torrent":{"xt":"urn:btih:4093457634459dd74e3028400f9531ab8506774f","amp;dn":"Crisis+and+Opportunity%3A+Sustainability+in+American+Agriculture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4093457634459dd74e3028400f9531ab8506774f","infoHashBuffer":{"type":"Buffer","data":[64,147,69,118,52,69,157,215,78,48,40,64,15,149,49,171,133,6,119,79]},"announce":[],"urlList":[]}}