{"title":"A Kim Jong-Il Production - Paul Fischer - Audiobook MP3","uid":11692530,"size":360646671,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:41668d61d12735ae6b93cdbb6b07847b43c9b7de&amp;dn=A+Kim+Jong-Il+Production+-+Paul+Fischer+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":11,"time":1423594242,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nA Kim Jong-Il Production: The Extraordinary True Story of a Kidnapped Filmmaker, His Star Actress, and a Young Dictator's Rise to Power\n\nWritten by: Paul Fischer\nNarrated by: Stephen Park\nLength: 12 hrs and 26 mins\nUnabridged Audiobook\nRelease Date:02-03-15\n\nBefore becoming the world's most notorious dictator, Kim Jong-Il ran North Korea's Ministry for Propaganda and its film studios. Conceiving every movie made, he acted as producer and screenwriter. Despite this control, he was underwhelmed by the available talent and took drastic steps, ordering the kidnapping of Choi Eun-Hee (Madam Choi) - South Korea's most famous actress - and her ex-husband Shin Sang-Ok, the country's most famous filmmaker.\nMadam Choi vanished first. When Shin went to Hong Kong to investigate, he was attacked and woke up wrapped in plastic sheeting aboard a ship bound for North Korea. Madam Choi lived in isolated luxury, allowed only to attend the Dear Leader's dinner parties. Shin, meanwhile, tried to escape, was sent to prison camp, and &quot;re-educated&quot;. After four years he cracked, pledging loyalty. Reunited with Choi at the first party he attends, it is announced that the couple will remarry and act as the Dear Leader's film advisors. Together they made seven films, in the process gaining Kim Jong-Il's trust. While pretending to research a film in Vienna, they flee to the U.S. embassy and are swept to safety.\nA nonfiction thriller packed with tension, passion, and politics, A Kim Jong-Il Production offers a rare glimpse into a secretive world, illuminating a fascinating chapter of North Korea's history that helps explain how it became the hermetically sealed, intensely stage-managed country it remains today","torrent":{"xt":"urn:btih:41668d61d12735ae6b93cdbb6b07847b43c9b7de","amp;dn":"A+Kim+Jong-Il+Production+-+Paul+Fischer+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41668d61d12735ae6b93cdbb6b07847b43c9b7de","infoHashBuffer":{"type":"Buffer","data":[65,102,141,97,209,39,53,174,107,147,205,187,107,7,132,123,67,201,183,222]},"announce":[],"urlList":[]}}