{"title":"Luther Allison - Hand Me Down My Moonshine-Mp3[CR-Bt]","uid":4660464,"size":164969546,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:41a0b63d45cacd920c8ca79e7d70727e6da3f4f5&amp;dn=Luther+Allison+-+Hand+Me+Down+My+Moonshine-Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CR-Bt","files":12,"time":1232370897,"description":"Luther Allison  ÃƒÂ¨ stato un chitarrista statunitense blues.\n\nDalla originaria Widener nell'Arkansas la famiglia si trasferÃƒÂ¬ a Chicago, Illinois, nel 1951. Prima di questo trasferimento aveva imparato a suonare la chitarra da autodidatta, ed aveva iniziato ad ascoltare gli autori blues. Nel 1954 iniziÃƒÂ² a farsi vedere nei blues club di Chicago con la speranza di essere invitato da qualcuno a suonare sul palco. RiuscÃƒÂ¬ a suonare con la band di Howlin' Wolf e con James Cotton.\n\nLa grande occasione gli si presentÃƒÂ² nel 1957, quando Muddy Waters lo invitÃƒÂ² a salire sul palco insieme a lui. Grazie a quell'incontro Allison inziÃƒÂ² a suonare nel circuito dei club blues tra la fine degli anni '50 e i primi anni '60, e registrÃƒÂ² il suo primo singolo nel 1965. FirmÃƒÂ² quindi un contratto con la Delmark Records nell'autunno del 1967, e nel 1969 realizzÃƒÂ² il suo album di debutto, Love me Mama. La sua esibizione all'Ann Arbor Blues Festival del 1969 riscosse un buon successo, e per questo venne invitato alle tre seguenti edizioni del festival. AndÃƒÂ² in tournÃƒÂ©e lungo tutti gli Stati Uniti e nel 1972 venne ingaggiato dalla Motown Records, uno dei pochi artisti blues ad esservi riuscito.\n\nDalla metÃƒÂ  degli anni '70 iniziÃƒÂ² ad andare in tour anche in Europa, e grazie al riscontro positivo del pubblico si trasferÃƒÂ¬ in Francia nel 1977, dove si stabilÃƒÂ¬ per i seguenti quindici anni. Allison era conosciuto soprattutto per le sue esibizioni dal vivo, nelle quali eseguiva assoli di chitarra lunghi dieci minuti, ed anche per il rapporto che aveva con il pubblico durante le esibizioni. Durante i suoi concerti usava lanciare una lunga corda al pubblico, corda che terminava attaccata alla sua Gibson Les Paul.","torrent":{"xt":"urn:btih:41a0b63d45cacd920c8ca79e7d70727e6da3f4f5","amp;dn":"Luther+Allison+-+Hand+Me+Down+My+Moonshine-Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41a0b63d45cacd920c8ca79e7d70727e6da3f4f5","infoHashBuffer":{"type":"Buffer","data":[65,160,182,61,69,202,205,146,12,140,167,158,125,112,114,126,109,163,244,245]},"announce":[],"urlList":[]}}