{"title":"How To Make Money Repairing Cellphones-d33p57a7u5","uid":12765173,"size":2941525175,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:422c6ec77e0dcf3ae46b02660528e134d4dba1a7&amp;dn=How+To+Make+Money+Repairing+Cellphones-d33p57a7u5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deepstatus","files":46,"time":1447592299,"description":"How to Make $5K/Month Repairing Cellphones with  Sung Jae Lee\r\n         ---------------------------------------------------------\r\n                             \r\n                URL..: https://www.udemy.com\r\n\r\n\r\n\r\n  Course Description:\r\n  Learn the skills that you will need to diagnose and repair broken\r\n  cell phones and ultimately learn how to make money from repairing phones.\r\n\r\n  Gain technical knowledge in repairing cell phones as well\r\n  as business knowledge in making money.\r\n\r\n  Learn to correctly disassemble cell phones\r\n  Diagnosing a problem\r\n  Screen repair\r\n  Microsoldering\r\n  Circuits theory\r\n  Business concepts in making money\r\n\r\n Make money immediately!\r\n The cell phone repair business is a $1.8 billion dollar industry in the U.S.\r\n alone, which is growing fast with a lot of demand globally. Since there is\r\n very little start up cost and you can jump right in this business, today.\r\n You will learn step-by-step, from technical know-how to the business\r\n knowledge of how to make money from this course.\r\n\r\n Unlike other courses, you do not have to apply for a job after you take\r\n a course. You can work from home, with a partner, with stores, and even\r\n from a van if you'd like, and make potentially $8000 to $10,000 a month,\r\n depending on the number of customers. The number of people owning cell\r\n phones will keep increasing, not decrease. There will always be damage\r\n to phones, which is why this business has been around since the first\r\n iPhone in 2007.\r\n\r\n Content and Overview\r\n\r\n One of the great aspects of this business is that this course is for\r\n anyone, from college or high school students, to people with full time\r\n jobs who want to make some extra money on the side, to someone who\r\n doesn't have a job and needs a full-time or part-time career.\r\n By actively finding customers through the venues explained in this course,\r\n you can have a full-time career in the cell phone repair business.\r\n\r\n Starting with the disassembly of the cell phones, this course will take\r\n you through various popular cell phones in the market these days.\r\n By repeating the videos and through practice, you will gain the\r\n technical expertise in disassembling and reassembling cell phones.\r\n\r\n With these basics mastered, the course will teach you how to diagnose\r\n a phone through the process of elimination, to efficiently and effectively\r\n repair the cell phone in the least amount of time and effort.\r\n\r\n Screen repairs make up the majority of the repairs, so we have especially\r\n focused on those repairs along with micro-soldering.\r\n\r\n Complete with theoretical concept of how cell phones work and how circuits\r\n work plus the business know-how in making money, you will receive\r\n a verifiable certificate of completion upon finishing the course.\r\n\r\n  A broken cell phone to practice with, preferably an iPhone or\r\n Samsung Galaxy phone due to demand of repairs on those phones.\r\n You can purchase offline or online from Ebay or Craigslist,\r\n or from a family or friend.\r\n  Basic repair tools, such as wire cutters, small Phillips screw drivers,\r\n flat head screw drivers, heat gun, adhesive, Isopropyl alcohol,\r\n soldering station\r\n\r\n\r\n  Diagnose Issues with defective cell phones\r\n   Identify the Solution for issues found during diagnosis\r\n   Disassemble and Reassemble most cell phones\r\n   Replace micro components\r\n   Fix broken screens on cell phones\r\n   Understand some of the circuits theory related to cell phones\r\n   Understand the business aspect of the cell phone repair industry\r\n\r\n\r\n   Anyone seeking another source of income\r\n   Anyone seeking a full-time career\r\n   People who already operate cell phone stores\r\n   People who are interested in learning the business of cell phone repair\r\n   People who would like to learn how to repair phones\r\n\r\n\r\n\r\n\r\n\r\n   • Thats it! Done.\r\n\r\n        • Supp0rt th3 D3v3lop3r if you liK3 it.\r\n\r\n                                 • 3Nj0Y!!!","torrent":{"xt":"urn:btih:422c6ec77e0dcf3ae46b02660528e134d4dba1a7","amp;dn":"How+To+Make+Money+Repairing+Cellphones-d33p57a7u5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"422c6ec77e0dcf3ae46b02660528e134d4dba1a7","infoHashBuffer":{"type":"Buffer","data":[66,44,110,199,126,13,207,58,228,107,2,102,5,40,225,52,212,219,161,167]},"announce":[],"urlList":[]}}