{"title":"Analysis and Control of Oilwell Drilling Vibrations","uid":12719591,"size":8718061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4242df70456090ce232f3440b1234b77b3eef00f&amp;dn=Analysis+and+Control+of+Oilwell+Drilling+Vibrations&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1446982539,"description":"Analysis and Control of Oilwell Drilling Vibrations - A Time-Delay Systems Approach (Springer, 2015).pdf\r\n\r\nISBN 978-3-319-15746-7\r\n\r\nThis book reports the results of exhaustive research work on modeling and control of vertical oilwell drilling systems. It is focused on the analysis of the system-dynamic response and the elimination of the most damaging drillstring vibration modes affecting overall perforation performance: stick-slip (torsional vibration) and bit-bounce (axial vibration). The text is organized in three parts.\r\n\r\nThe first part, Modeling, presents lumped- and distributed-parameter models that allow the dynamic behavior of the drillstring to be characterized; a comprehensive mathematical model taking into account mechanical and electric components of the overall drilling system is also provided. The distributed nature of the system is accommodated by considering a system of wave equations subject to nonlinear boundary conditions; this model is transformed into a pair of neutral-type time-delay equations which can overcome the complexity involved in the analysis and simulation of the partial differential equation model.\r\n\r\nThe second part, Analysis, is devoted to the study of the response of the system described by the time-delay model; important properties useful for analyzing system stability are investigated and frequency- and time-domain techniques are reviewed.\r\n\r\nPart III, Control, concerns the design of stabilizing control laws aimed at eliminating undesirable drilling vibrations; diverse control techniques based on infinite--dimensional system representations are designed and evaluated. The control proposals are shown to be effective in suppressing stick-slip and bit-bounce so that a considerable improvement of the overall drilling performance can be achieved.\r\n\r\nThis self-contained book provides operational guidelines to avoid drilling vibrations. Furthermore, since the modeling and control techniques presented here can be generalized to treat diverse engineering problems, it constitutes a useful resource to researchers working on control and its engineering application in oilwell drilling","torrent":{"xt":"urn:btih:4242df70456090ce232f3440b1234b77b3eef00f","amp;dn":"Analysis+and+Control+of+Oilwell+Drilling+Vibrations","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4242df70456090ce232f3440b1234b77b3eef00f","infoHashBuffer":{"type":"Buffer","data":[66,66,223,112,69,96,144,206,35,47,52,64,177,35,75,119,179,238,240,15]},"announce":[],"urlList":[]}}