{"title":"Bliss N Eso - Running On Air - C3R3AL_DWNLDR","uid":5725911,"size":109290071,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:42548ba7ae65cd17cbcdc809d883337d79c0bf0c&amp;dn=Bliss+N+Eso+-+Running+On+Air+-+C3R3AL_DWNLDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"C3R3AL_DWNLDR","files":20,"time":1280459420,"description":"Quality: High quality VBR\n\nNew Australian hip hop from Bliss, Eso and Izm. This album will forever ring in the halls of awesomeness...\n\nRundown:\nBliss N Eso's 2008 ARIA Award-winning, Gold certified album lived up to its name and passed with Flying Colours, spending over 100 weeks on the ARIA Charts. Now the hip hop trio return with their eminent follow-up, Running On Air. In 2009, the record-breaking band taught the 82,000-strong MCG crowd how to bounce at the biggest paid concert in Australian history, Sound Relief. After the craziness of playing multiple sold out shows at large scale venues across the nation off the back of Flying Colours, Bliss, Eso and DJ Izm withdrew from the distractions of city life in order to create more material for their fans to connect with. They secluded themselves in rural Victoria for close to six months and sought sanctuary where, in Eso's own words, there were &quot;no traffic jams of life comin' atcha&quot;. The band embraced nature and focused solely on their chosen artform. Down By The River, the lead single from Bliss N Eso's upcoming fourth studio release, has already hit radio. It is a tantalising peek into the surroundings that infiltrated the trio's songwriting this time around - acoustic guitar strums and tambourine dance effortlessly alongside the punchy beats and sung chorus. While our local heroes were laying down the tracks that would become their latest LP, the live arena beckoned once more and their services were called upon abroad. A sold-out, 20-plus date US tour confirmed that Bliss N Eso's skills are attracting a worldwide fanbase plus the respect of their Stateside peers. The proof is in the internationally acclaimed artists eager to leave their imprints on Bliss N Eso's latest cuts. Legends such as Xzibit and The Wu-Tang Clan's RZA make guest appearances on their forthcoming longplayer. Bliss N Eso have nothing to prove but still continue to challenge their genre and present to you this collection of songs for all moods, fittingly titled Running On Air.\n\nTrack Listing\nDisc 1:\n1.Never Land\n2.Flying Through The City\n3.Addicted\n4.Down By the River\n5.The Moses Twist\n6.Art House Audio\n7.Family Affair\n8.Reflections\n9.Coastal Kids\n10.People Up On it (feat. Xzibit)\n11.Caught At The Pub\n12.Where The Wild Things Are (feat. 13. Mind Over Matter)\n13.The Children of The Night\n14.Smoke Like A Fire (feat. RZA)\n15.Re-debating reality\n16.Late On Night\n17.I Can (feat. Jehst)\n18.Weightless Wings\n19.Golden Years","torrent":{"xt":"urn:btih:42548ba7ae65cd17cbcdc809d883337d79c0bf0c","amp;dn":"Bliss+N+Eso+-+Running+On+Air+-+C3R3AL_DWNLDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42548ba7ae65cd17cbcdc809d883337d79c0bf0c","infoHashBuffer":{"type":"Buffer","data":[66,84,139,167,174,101,205,23,203,205,200,9,216,131,51,125,121,192,191,12]},"announce":[],"urlList":[]}}