{"title":"(PSX-PSP) Suikoden 1 &amp; 2 converted properly (Kingdom-games by Kl","uid":4873186,"size":760159437,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:42a0ba8924b87063d0325ff603107fe3cb4195fb&amp;dn=%28PSX-PSP%29+Suikoden+1+%26+2+converted+properly+%28Kingdom-games+by+Kl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"toxicjuggalo","files":3,"time":1240952793,"description":"SUIKODEN:\n\nIn the first in this series of RPGs by Konami, you are the son of the General Teo, one of the emperor's most powerful generals. Immediately, your father leaves to fight a battle up north leaving a few of his trusted friends to watch over of you. Soon after, you come to realize that you and your father have been serving on the wrong side. The Emperor and his generals' minds have been brainwashed. The result is unhappy subjects and an enslaved country. Knowing this, you join the Liberation Army and when their heroic leader is assassinated by the baddies, you are chosen as leader. Your job now is to recruit thousands of men to join the Liberation Army and restore peace to the country. Along the way you will have to fight in three different styles of battle: normal, one-on-one, and war. See if you can bring justice to the world in Suikoden.\n\n\nSUIKODEN 2:\n\nSequel to the early PlayStation RPG. As a member of the Alliance, a military force only really hinted at in the original, you play the unwitting hero of the game: an orphan who has been raised by a quiet, unassuming battle hero in a seemingly ancient war. Alongside you in the ranks is your best friend Joei, a boy born of nobility but who has never been able to receive approval in his stubborn father's eyes. As the game begins, you are immediately tossed into a tale of political strife, betrayal and war on a grand scale beyond your scope in the early stages. As the game wears on, the plot will twist, turn and develop in numerous ways that expose the personalities of each of the characters involved. The battle system is turn-based, with the option to equip Runes for special abilities, combine party member attacks to create chain combos or devastating spells, and the option to run the battle in Auto mode.\n\n\nBoth games tested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:42a0ba8924b87063d0325ff603107fe3cb4195fb","amp;dn":"%28PSX-PSP%29+Suikoden+1+%26+2+converted+properly+%28Kingdom-games+by+Kl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a0ba8924b87063d0325ff603107fe3cb4195fb","infoHashBuffer":{"type":"Buffer","data":[66,160,186,137,36,184,112,99,208,50,95,246,3,16,127,227,203,65,149,251]},"announce":[],"urlList":[]}}