{"title":"Witchcraft and the Illuminati (1999)","uid":5046250,"size":3160479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42a65ac7b32c5b4d098786b6ebb6c45c5b33d96c&amp;dn=Witchcraft+and+the+Illuminati+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"red_gonzo","files":1,"time":1249650023,"description":"This is the amazing book Witchcraft and the Illuminati (1999) which exposes the relationships between Witchcraft and the Illuminati, through the inter-related connections and symbologies. The Illuminati is one of the most secret organizations ever existed. These &quot;Illiminated Ones&quot; or &quot;All-Knowing Ones&quot; are said to have derived their name from &quot;Lucifer&quot; the &quot;Light Bearer&quot; whom they worship and receive their power. The Occulit &quot;Illuminati&quot; in its philosophy fears no one except the indivuals or groups who are self-sufficent with food, fuel, weapons, ammunition, medical supplies, clothing, ect., who living in the country, have a common unity or faith, and are not dependent upon this World System for their survival. In 1865 Abraham Lincoln wanted to rebuild the South. Lincoln refused to pay off the war debts by borrowing from the International Bankers, and was assassinated by Illuminist John Wilkes Booth. Later on President Kenndey was likewise killed, because he reportedly came against the Illuminati's orders. The Secret Service aided in both murders. Though the Illuminati indeed controls the Financial, Political, Civil, Religious, and Social areas of the world, the Illuminati is much more than these groups. The majority of books on this subject have erroneously conceded the beginning of the Illuminati as 1776 and this book explains their true origin. Using symbols it demonstrates the occult connection between witchcraft and the masonic illuminati orders. 80 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:42a65ac7b32c5b4d098786b6ebb6c45c5b33d96c","amp;dn":"Witchcraft+and+the+Illuminati+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a65ac7b32c5b4d098786b6ebb6c45c5b33d96c","infoHashBuffer":{"type":"Buffer","data":[66,166,90,199,179,44,91,77,9,135,134,182,235,182,196,92,91,51,217,108]},"announce":[],"urlList":[]}}