{"title":"Spells of Blood and Kin A Dark Fantasy - {CHB Books}","uid":14936556,"size":3518117,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:433b1e1306b7f3a09b29108fef3d3b741cd8cf16&amp;dn=Spells+of+Blood+and+Kin+A+Dark+Fantasy+-+%7BCHB+Books%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":4,"time":1466001495,"description":"Author: Claire Humphrey\r\nSeries: A Dark Fantasy\r\nHardcover: 320 pages\r\nPublisher: Thomas Dunne Books (June 14, 2016)\r\nLanguage: English\r\nISBN-10: 125007634X\r\nISBN-13: 978-1250076342\r\n\r\n\r\n\r\nSome families hand down wealth through generations; some hand down wisdom. Some families, whether they want to or not, hand down the secret burdens they carry and the dangerous debts they owe.\r\nLissa Nevsky's grandmother leaves her a big, empty house, and a legacy of magic: folk magic, old magic, brought with Baba when she fled the Gulag. In the wake of her passing, the Russian community of Toronto will depend on Lissa now, to give them their remedies and be their koldun'ia. But Lissa hasn't had time to learn everything Baba wanted to teach her―let alone the things Baba kept hidden.\r\nMaksim Volkov's birth family is long dead, anything they bestowed on him long turned to dust. What Maksim carries now is a legacy of violence, and he does not have to die to pass it on. When Maksim feels his protective spell fail, he returns to the witch he rescued from the Gulag, only to find his spell has died along with the one who cast it. Without the spell, it is only a matter of time before Maksim's violent nature slips its leash and he infects someone else―if he hasn't done so already.\r\nNick Kaisaris is just a normal dude who likes to party. He doesn't worry about family drama. He doesn't have any secrets. All he wants is for things to stay like they are right now, tonight: Nick and his best buddy Jonathan, out on the town. Only Nick is on a collision course with Maksim Volkov, and what he takes away from this night is going to crack open Nick's nature until all of his worst self comes to light.\r\nLissa's legacy of magic might hold the key to Maksim's salvation, if she can unravel it in time. But it's a legacy that comes at a price. And Maksim might not want to be saved…","torrent":{"xt":"urn:btih:433b1e1306b7f3a09b29108fef3d3b741cd8cf16","amp;dn":"Spells+of+Blood+and+Kin+A+Dark+Fantasy+-+%7BCHB+Books%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"433b1e1306b7f3a09b29108fef3d3b741cd8cf16","infoHashBuffer":{"type":"Buffer","data":[67,59,30,19,6,183,243,160,155,41,16,143,239,61,59,116,28,216,207,22]},"announce":[],"urlList":[]}}