{"title":"The.Block.AU.Glasshouse.S09E01.WS.PDTV.x264.BF1.mkv","uid":10641651,"size":558207054,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:437a52fe2a3c03d1b23aba02b08d02356edd454c&amp;dn=The.Block.AU.Glasshouse.S09E01.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bigfish5","files":1,"time":1406469089,"description":"The Block Australia - Glasshouse Series 9 Episode 1\n\nEach series on The Block the somewhat cocky new contestants come in thinking they know exactly how it's all going to work.\n\nBut The Glasshouse newbies learnt almost straight away that nothing is ever the same on The Block.\n\nAfter meeting Scotty at what they thought was the run-down Channel Nine offices in High Street, the nervous newbies were relieved to hear there would no eliminations this time around.\n\n&quot;You're all moving in for 10 weeks, give yourselves a pat on the back,&quot; Scotty declared.\n\nIn Jenna's words, &quot;it was a high-five moment&quot;.\n\nScotty then revealed the even bigger news that the shabby offices they were sitting in was in fact The Block. The office Block.\n\n&quot;This is not my office, it's your office!&quot; Scotty said.\n\nNot one to mess around, Scotty asked the quiet couples to each pick a number between 1 and 5 and swiftly assigned them all plans for their new apartments.\n\nNo time to weigh up which space had the best views or the biggest rooms this time around.\n\nChris and Jenna got first dibs and chose apartment two, Shannon and Simon chose apartment four, Darren and Dee picked apartment five, Max and Karstan went for apartment three, which left Michael and Carlene with apartment one.\n\nBut Scotty had some wise words to perk up the timid new Blockheads.\n\n&quot;This is where you will be living. I don't want you to panic though, The Block is going to be much more exciting than this.&quot;\n\nThe five teams enter the biggest and most challenging Block ever! Once they get their bearings in this huge building, the teams just need to find which apartment they will live in and renovate over the next 11 weeks. \n\n","torrent":{"xt":"urn:btih:437a52fe2a3c03d1b23aba02b08d02356edd454c","amp;dn":"The.Block.AU.Glasshouse.S09E01.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"437a52fe2a3c03d1b23aba02b08d02356edd454c","infoHashBuffer":{"type":"Buffer","data":[67,122,82,254,42,60,3,209,178,58,186,2,176,141,2,53,110,221,69,76]},"announce":[],"urlList":[]}}