{"title":"Excel 2013 eLearning Kit For Dummies","uid":10558942,"size":34196308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43893a9d7f813f7b71948a585fd572b50c45d996&amp;dn=Excel+2013+eLearning+Kit+For+Dummies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"digital.devil","files":4,"time":1405432292,"description":"Faithe Wempen, &quot;Excel 2013 eLearning Kit For Dummies&quot;\nEnglish | ISBN: 1118493044 | 2013 | PDF | pag pages | 33 MB\n\nA complete package for learning Excel 2013!\n\nExcel is essential to business today, but it can be tricky to navigate. If you're eager to excel at Excel, then this dynamic multimedia learning solution is for you. This complete Excel 2013 package includes a full-color printed book and a For Dummies interactive eLearning course on CD. You'll discover the basics of the Excel interface, how to navigate it, and how to make the most of key features including charts, formulas, functions, macros, and more.\n\nFollow the material sequentially or jump in and out as you wish - it's set up so you can learn at your own pace. Throughout, you will benefit from illustrations, animations, voiceover explanations, and the option of closed captioning if you find you learn better when you can read the instructions.\n\nHelps self-motivated learners master Excel 2013, the leading spreadsheet application used today\nWalks you through creating worksheets, working with formulas and functions, formatting data, using financial functions, displaying data in PivotTables, and much more\nIncludes an easy-to-follow, full-color book and an interactive Dummies eLearning Course that corresponds with the book on CD\nAllows you to follow material sequentially or choose separate sections at your own time and pace\nExcel 2013 eLearning Kit For Dummies shows you the ins and outs of all things Excel so you can enhance your productivity and become a spreadsheet star!\n\nNOTE: CD-ROM/DVD and other supplementary materials are not included as part of the e-book file, but are available for download after purchase.\n &lt;a href=&quot;\nhttp://ultraimg.com/images/WDGOd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ultraimg.com/images/WDGOd.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:43893a9d7f813f7b71948a585fd572b50c45d996","amp;dn":"Excel+2013+eLearning+Kit+For+Dummies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43893a9d7f813f7b71948a585fd572b50c45d996","infoHashBuffer":{"type":"Buffer","data":[67,137,58,157,127,129,63,123,113,148,138,88,95,213,114,181,12,69,217,150]},"announce":[],"urlList":[]}}