{"title":"AVI.ReComp.1.4.4-iNC","uid":4441316,"size":10257030,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:43d530dfdac3e57b663367370bc6ec8082d75644&amp;dn=AVI.ReComp.1.4.4-iNC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"-iNC-","files":2,"time":1223829945,"description":"The program allows you to recompress your AVI files. The application supports not only files containing audio streams but AVIs without any audio as well. For the time being the program uses only XviD codec for the recompression process (versions: 1.0.3 or newer). The installation pack contains all required components (the newest versions of: VirtualDubMod, AviSynth and XviD). AVI ReComp can be very useful for users who want to clear their AVIs out of GMC or Qpel functions to prepare their clips for standalone DVD players. The program contains the feature of embedding subtitles into video. So if you want burnt in subtitles, you can use this software. Additionally the newest versions allow you to add black borders to your movie and place your subtitles on them. You can also adjust all settings for ssa and ass subtitles (style, colour, position). AVI ReComp enables batch encoding, getting detailed information about AVI files and adding own logo to the movie. You can also change a resolution and aspect ratio of your video clip. The Cropping tool can be used to crop existing black borders or just change video aspect ratio. It is also possible to convert all audio streams of your movie choosing one of available encoding modes (VBR, ABR, CBR) and bitrates. AVI ReComp supports AVIs with the following audio formats: mp3, wav, ac3, dts, ogg. Supported subtitle formats: TMPlayer (.txt), MicroDVD (.txt / .sub), SubViewer2 (.sub), SubRip (.srt), Advanced SubStation Alpha (.ass), SubStation Alpha (.ssa). The program includes multilingual interface (for the time being: British, Bulgarian, Czech, French, German, Hebrew, Hungarian, Italian, Polish, Portuguese, Russian, Serbian, Slovenian, Spanish, Thai and Turkish). Starting with version 1.4.1 ARC is Windows Vista compatible. In the future I&amp;#039;m going to create many new and very useful features.\n\n\n\nUppladdad av: iNC\n\nwww . Piratpalatset . com","torrent":{"xt":"urn:btih:43d530dfdac3e57b663367370bc6ec8082d75644","amp;dn":"AVI.ReComp.1.4.4-iNC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43d530dfdac3e57b663367370bc6ec8082d75644","infoHashBuffer":{"type":"Buffer","data":[67,213,48,223,218,195,229,123,102,51,103,55,11,198,236,128,130,215,86,68]},"announce":[],"urlList":[]}}