{"title":"Brian - Moongate - Suppressed Findings of the U.S. Space Program","uid":4339946,"size":2871339,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:449b8d892ed859b5b9ce463e61f791d963406796&amp;dn=Brian+-+Moongate+-+Suppressed+Findings+of+the+U.S.+Space+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1218539475,"description":"This is William L. Brian II&amp;#039;s explosive book Moongate - Suppressed Findings of the U.S. Space Program - The NASA-Military Cover-Up (1982) which is probably the best book on the topic of suppressed findings of Apollo project and the secret technology that was used to put a man on the Moon. The author compiled evidence from unclassified sources including official government publications, NASA photographs and movies, news articles, and books by authorities in various fields. Written for the layman and scientist alike, with mathematical calculations included in the appendices, it gives documented evidence for: NASA&amp;#039;s true link to secret military space operations; secret weapons developed under the cover of the civilian space program; suppressed gravity research discoveries; the real U.S.-Russian space race; secret discoveries that put Apollo astronauts on the Moon; the Moon&amp;#039;s true nature and history and the great energy cover-up. In contrast to other similar books Brian doesn&amp;#039;t state that noone ever visited the Moon but that significantly different technology was used to achieve this momentous feat and how it has being held from us for decades. Furthermore Moongate exposes many cover-ups that occured during the missions that fail to match reality when put under closer investigation. You&amp;#039;ve seen Watergate now it&amp;#039;s time to face Moongate. 230 pages, some pictures. A must read from everyone.\n","torrent":{"xt":"urn:btih:449b8d892ed859b5b9ce463e61f791d963406796","amp;dn":"Brian+-+Moongate+-+Suppressed+Findings+of+the+U.S.+Space+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"449b8d892ed859b5b9ce463e61f791d963406796","infoHashBuffer":{"type":"Buffer","data":[68,155,141,137,46,216,89,181,185,206,70,62,97,247,145,217,99,64,103,150]},"announce":[],"urlList":[]}}