{"title":"Nanofibers of Conjugated Polymers - A. Sezai Sarac","uid":15450588,"size":16261884,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44a933053cd006e6c8ec9e995d12a71d3ff34c4a&amp;dn=Nanofibers+of+Conjugated+Polymers+-+A.+Sezai+Sarac&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1469937923,"description":"Nanofibers of Conjugated Polymers - A. Sezai Sarac (Pan Stanford, 2016).pdf\r\n\r\nConjugated polymer composites with high dielectric constants are being developed by the electronics industry in response to the need for power-grounded decoupling to secure the integrity of high-speed signals and to reduce electromagnetic interference. Electrically conducting polymers are materials that simultaneously possess the physical and chemical properties of organic polymers and the electronic characteristics of metals. Multifunctional micro- and nanostructures of conjugated polymers, such as of pyrrole, have received great attention in recent years because they can polymerize easily and have high conductivity and good thermal stability. They, however, have some disadvantages such as brittleness and hard processability, which can be overcome by developing their nanocomposites. Nanofiber materials with different dielectric properties can be made from conjugated polymer composites and used in the electronics industry, in sensors and batteries, for electrical stimulation to enhance nerve-regeneration process, and for constructing scaffolds for nerve tissue engineering.\r\n\r\nElectrospinning is a versatile technique that is used to produce ultrathin continuous fibers with high surface-to-volume and aspect ratios from a variety of materials, including polymers, composites, and ceramics. Conductive materials in fibrillar shape may be advantageous compared with films because of their inherent properties such as anisotropy, high surface area, and mechanical strength. They are of particular interest in electroactive composites as they can be efficiently distributed in an insulating polymer matrix to improve both electrical and mechanical properties. Combination of electrical properties with good mechanical performance is of particular interest in electroactive polymer technology.\r\n\r\nThis book covers the general aspects of electrospinning and discusses the fundamental concepts that can be used to produce nanofibers with the help of mathematical models and equations. It also details the methods through which different polymeric structures can be included in conjugated polymers during electrospinning to form composites or blends of conjugated polymer nanofibers","torrent":{"xt":"urn:btih:44a933053cd006e6c8ec9e995d12a71d3ff34c4a","amp;dn":"Nanofibers+of+Conjugated+Polymers+-+A.+Sezai+Sarac","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a933053cd006e6c8ec9e995d12a71d3ff34c4a","infoHashBuffer":{"type":"Buffer","data":[68,169,51,5,60,208,6,230,200,236,158,153,93,18,167,29,63,243,76,74]},"announce":[],"urlList":[]}}