{"title":"Panic of 1819, The - Murray N. Rothbard.epub","uid":9159668,"size":654676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4508803fa7305ccaf2b64a62431342db7c450194&amp;dn=Panic+of+1819%2C+The+-+Murray+N.+Rothbard.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1383850324,"description":"The Panic of 1819 was America's first great economic crisis. And this is Rothbard's masterful account, the first full scholarly book on the topic and still the most definitive. It was his dissertation, published in 1962 but nearly impossible to get until this new edition, the first with the high production values associated with Mises Institute publications.\nThe American Economic Review was wild for this book when it appeared: &quot;Rothbard's work represents the only published, book-length, academic treatise on the remedies that were proposed, debated, and enacted in attempts to copy with the crisis of 1819,&quot; the reviewer wrote. &quot;As such, the book should certainly find a place on the shelf of the study of U.S. business cycles and of the economic historian who is interested in the early economic development of the United States.&quot;\nAnd specialists have treasured the book for years. It is incredible to realized that some American historians think of MN Rothbard as the author of this book and nothing else!\nRothbard tells the story about a disaster that could not be attributed to some specific government blunder or disaster. It seemed to originate from within the economic system itself. Its cause was not obvious to observers at the time. Confronted with something new, the Panic engendered much discussion and debate about possible causes and remedies. As Rothbard observes, the panic provides &quot;an instructive picture of a people coming to grips with the problems of a business depression, problems which, in modified forms, were to plague Americans until the present day.&quot;\nThere were many cranky and contradictory remedies proposed, and Rothbard reviews each one. But in the end, there was no widespread confusion on what caused the downturn. Instead, it was widely known that a false prosperity is a very dangerous thing. It always turns to bust. Bad legislation failed to pass, the government embarked on no New Deal planning, and there was no great reflat\nGenre: Non-Fiction&gt; Market History","torrent":{"xt":"urn:btih:4508803fa7305ccaf2b64a62431342db7c450194","amp;dn":"Panic+of+1819%2C+The+-+Murray+N.+Rothbard.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4508803fa7305ccaf2b64a62431342db7c450194","infoHashBuffer":{"type":"Buffer","data":[69,8,128,63,167,48,92,202,242,182,74,98,67,19,66,219,124,69,1,148]},"announce":[],"urlList":[]}}