{"title":"Matt Schofield-Anything But Time-2011-404","uid":6500076,"size":95791460,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:450c1808367cbfcfd912047ebb66d6b6510a5a3d&amp;dn=Matt+Schofield-Anything+But+Time-2011-404&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"soupucia","files":-1,"time":1309216259,"description":"Artist: Matt Schofield\nAlbum: Anything But Time\nBitrate: 253kbps avg\nQuality: EAC Secure Mode / LAME 3.98.4 / -V0 / 44.100Khz\nLabel: Nugene Records\nGenre: Rock\nSize: 95.49 megs\nPlayTime: 0h 49min 52sec total\nRip Date: 2011-06-26\nStore Date: 2011-06-14\n\nTrack List:\n--------\n01. Anything But Time                3:38\n02. See Me Through                   6:51\n03. At Times We Do Forget            5:41\n04. Shipwrecked                      5:02\n05. Dreaming Of You                  4:52\n06. Wrapped Up In Love               3:43\n07. Where Do I Have To Stand         7:00\n08. One Look (And I'm Hooked)        4:17\n09. Don't Know What I'd Do           4:11\n10. Share Our Smile Again            4:37\n\nRelease Notes:\n--------\n&quot;If it ain't broke, don't fix it&quot; might sound like faint praise for a musician,\nbut in U.K. guitarist Matt Schofield's case, it's a compliment. Also, some\nthings have changed since his last studio release two years ago. He recorded\nthis one in New Orleans with veteran producer John Porter and brought in\nex-Robert Cray drummer Kevin Hayes. Still, his alternately breezy/stinging blues\nflecked with a swinging jazz groove stays the same. Big Easy mainstay Jon Cleary\n-- who also made the trek from the U.K. to New Orleans, where he now resides --\ncontributes to a few tracks, but otherwise it's business as usual with Schofield\ntearing into fluid, biting guitar lines and wrapping far-better-than-average\noriginals around his emotional yet boyish voice. He brings the ballad side of\nJimi Hendrix -- think &quot;Little Wing,&quot; &quot;Angel,&quot; and &quot;May This be Love&quot; -- to his\nown &quot;Dreaming of You,&quot; and writes a terrific slow burner in the seven-minute\n&quot;Where Do I Have to Stand.&quot; He's a compelling guitarist, as is shown in the\ngradual intensity he brings to the two leads in that song which build to a fiery\nclimax, but it's his imaginatively arranged, sharply written songs and\ndistinctive vocals that put him so far ahead of the pack of fellow contemporary\nsinging guitar slingers. Albert King's &quot;Wrapped Up in Love&quot; gets a wonderfully\nfunky workout, helped immensely by Hayes' backbeat, and Steve Winwood's &quot;At\nTimes We Do Forget,&quot; an obscure track salvaged from Winwood's under-the-radar\n2008 release Nine Lives, is Schofield's first stab at covering a relatively\ncurrent tune. Deep-fried New Orleans funk seeps into &quot;One Look (And I'm\nHooked),&quot; which finds the singer/guitarist digging into a rare baritone vocal to\npush the song into dark, swampy territory. It's given extra heft by longtime\ncohort Johnny Henderson's organ, and keyboard-bass work that is so much a part\nof Schofield's sound. Porter adds spacious and crisp audio that jumps out of the\nspeakers, making even musty shuffles such as &quot;Don't Know What I'd Do&quot; connect\nwith a freshness and snappy energy rarely captured in the studio. Only the\nstereotypical slow blues of &quot;See Me Through,&quot; a perfectly fine &quot;Stormy\nMonday&quot;-influenced grinder, seems to be added just to establish Schofield as an\nold-school-influenced bluesman, something he can pull off perfectly well, but\nwhich doesn't utilize the songwriting strengths that make the rest of this\nsuperb album so rewarding.\n","torrent":{"xt":"urn:btih:450c1808367cbfcfd912047ebb66d6b6510a5a3d","amp;dn":"Matt+Schofield-Anything+But+Time-2011-404","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"450c1808367cbfcfd912047ebb66d6b6510a5a3d","infoHashBuffer":{"type":"Buffer","data":[69,12,24,8,54,124,191,207,217,18,4,126,187,102,214,182,81,10,90,61]},"announce":[],"urlList":[]}}