{"title":"Yusef Lateef &amp; Adam Rudolph - Live In Seattle (1999) Yal","uid":11971566,"size":340649093,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:454b802c6270415da8a1a4155fd85cb1aad75ccd&amp;dn=Yusef+Lateef+%26amp%3B+Adam+Rudolph+-+Live+In+Seattle+%281999%29+Yal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"svidrigailovjones","files":16,"time":1432842051,"description":"YUSEF LATEEF &amp; ADAM RUDOLPH - LIVE IN SEATTLE\n\n01. Mount Shasta    [9:37]\n02. Puget Sound    [9:23]\n03. Hold Your Light    [7:05]\n04. Ear Shot    [5:21]\n05. Live In Seattle    [4:53]\n06. I See The Rainbow    [7:03]\n07. North West Passage    [7:22]\n08. Rainbow In Oregon    [4:38]\n09. Kampong    [5:35]\n10. Mountain Path    [7:38]\n\nYusef Lateef - flutes, tenor saxophone, shenai, bamboo flutes, piano, midi electronics\n\nAdam Rudolph - habd drums, djembe, bendir, talking drum, thumb pianos, udu drum, didjiridoo, percussion\n\n1999 Yal Records\n\nWhen serious artist/composers of Autophysiopsychic music, like Adam Rudolph and Yusef Lateef, come together to innovate and synthesize elements of sound in creative practice, the result is sure to be: 1. musically authentic, 2. aesthetically innovative, and 3. spiritually satisfying to any audience.\n\nYusef Lateef &amp; Adam Rudolph began working together in 1988 and have presented their duo collaboration to enthusiastic audiences in Europe and the USA for the past 3 years. \n\nTheir most recent concerts at the Northsea festival, Canada, and Germany have included powerful Tenor sax and Conga dialogues, Yusef's beautiful vocal rendering in ballad form of the classic &quot;When the Saints Go Marching In', delicate Udu drum and Alto flute modal expressions and explorations into new sound and form combinations of percussion, and woodwinds and midi electronics. \n\nEach concert is a jouney into new areas for performers and audience alike. \t \n  \nTHE ARTISTS\nAt 78 years of age, DR. YUSEF LATEEF is a master improviser and composer with over 70 recordings under his own name. His explorations into sound have led him from study of Eastern music since the 1950's to a recent four year Senior Research Fellowship at Ahmadu Bello University, in Zaria, Nigeria. He contributed to the legendary groups of Dizzy Gillespe, Charles Mingus and Cannonball Adderly and led his own ensembles in tours worldwide. He has composed for and performed with the Detroit, New World, and Augusta Symphony Orchestras. His recent work &quot;The African American Epic Suite&quot; was recorded and performed by the Cologne Radio Orchestra and featured himself and Adam Rudolph as soloists. Dr. Lateef also has many publications to his credit in both music and literature. He is currently a Visiting Professor of Music at the University of Massachusetts. \nComposer and hand percussionist ADAM RUDOLPH has been hailed as &quot;a pioneer in world music&quot; by the New York Times and &quot;a master percussionist&quot; by Musician magazine. He has recorded extensively and performed at festivals and concerts throughout the North &amp; South America, Europe and Japan, with Don Cherry, Shankar, Foday Musa Suso, Kevin Eubanks, Pharoah Sanders, and Hassan Hakmoun. He has received grants from the Cary Trust &amp; NEA and has released several recordings and toured internationally his own ensemble, Adam Rudolph's Moving Pictures. His first opera, The Dreamer recently premiered to coincide with it's CD release.\t \n  \nREVIEWS\n&quot;Lateef's robust sound and dynamic phrasing brought the sheer essence of African-American music history to every note he played. Rudolph's drumming was equally fascinating, spinning with lightning speed and propulsive acceleration.&quot;\nLos Angeles Times \n\n&quot;A peaceful feeling and a sense of sparkling, iridescent beauty.&quot;\nOption \n\n&quot;This music is challenging, soothing and rewarding.&quot;\nCadence","torrent":{"xt":"urn:btih:454b802c6270415da8a1a4155fd85cb1aad75ccd","amp;dn":"Yusef+Lateef+%26amp%3B+Adam+Rudolph+-+Live+In+Seattle+%281999%29+Yal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"454b802c6270415da8a1a4155fd85cb1aad75ccd","infoHashBuffer":{"type":"Buffer","data":[69,75,128,44,98,112,65,93,168,161,164,21,95,216,92,177,170,215,92,205]},"announce":[],"urlList":[]}}