{"title":"[SURF] Here &amp; Now.mp4","uid":7875034,"size":2335683097,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:460e7e6395d995e3db98a506278a403c8cc323f2&amp;dn=%5BSURF%5D+Here+%26amp%3B+Now.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jorgesvelazquez","files":1,"time":1354313390,"description":"This film was shot in one day. More than 25 filmmakers and surfers worked in unison to document the world of surfing in a single 24-hour period: May 2, 2012. From world champs like Kelly Slater and Stephanie Gilmore to free spirits like Dave Rastovich, Ozzy Wright and Alex Knost, this project brings together shapers, photographers, legends, beginners, third world, first world and surf world. Some scored big. Others couldn't find a ripple. It's all part of the surfing experience. From contests to camping, hanging at home or hitting the road, veteran surf filmmaker Taylor Steele pulls together an epic, international cast to prove the best place to be is here and now.\n\nSTARRING: Kelly Slater, Dave Rastovich, Ozzy Wright, Alex Knost, Rob Machado, Stephanie Gilmore, Conner Coffin, Matt Meola, Jay Davies, Albee Layer, Ford Archbold, Gabriel Villaran, Dede Suryana, Leif Engstrom, Peter Devries, Reubyn Ash, Grant Baker, Garut Widiarta, Mikala Jones, Steve Sherman, Ellis Ericson, Brad Gerlach, Noah Cohen, Alex Gray, Ezekial Lau, Andrew Serrano, Junior Faria, Gilbert Brown, Lauren Lindsey Hill, Jack Robinson\n\nCINEMATOGRAPHY: Taylor Steele, Nathan Myers, Chris Searl, Elliott Leboe, Wyatt Davies, Tim Boydell, Peter King, Bali Strickland, Jeremy Koreski, Etan Blatt, Ryan Perry, Ryan Heywood, Andy Elliot, Rodrigo Metrinho, Saul Garcia, Jimmy Kinniard, Taylor Bonin, Loic Wirth, Jason Shibata, Saul Garcia, Isaac Zoller, Ben Gulliver, Darren McCagh, Mike Nulty, Kishore Kumar\n\n\nGood Waves Guys!!","torrent":{"xt":"urn:btih:460e7e6395d995e3db98a506278a403c8cc323f2","amp;dn":"%5BSURF%5D+Here+%26amp%3B+Now.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"460e7e6395d995e3db98a506278a403c8cc323f2","infoHashBuffer":{"type":"Buffer","data":[70,14,126,99,149,217,149,227,219,152,165,6,39,138,64,60,140,195,35,242]},"announce":[],"urlList":[]}}