{"title":"Massive Attack - 1998 - Mezzanine [TQMP]","uid":6487278,"size":378150751,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:462bf6524fbabb89bda2280a96590297a59a3729&amp;dn=Massive+Attack+-+1998+-+Mezzanine+%5BTQMP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"quose","files":-1,"time":1308703583,"description":" ____________________________________________________________________________\n|                                                                            |\n|                      Massive Attack - 1998 - Mezzanine                     |::\n|                                                                            |::\n|        Ripped w/EAC v1.0b2 (Secure) :: Encoded w/FLAC v1.2.1 -V -8         |::\n|____________________________________________________________________________|::\n  ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n       +--------------+\n+------+ Pack / Files +--------------------------------------------------------+\n|      +--------------+                                                        |\n|   No. of Files / Size _____ 23 files / 360.63MB (378,150,751 bytes)          |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +--------------+\n+------+ Audio Source +--------------------------------------------------------+\n|      +--------------+                                                        |\n|   Type / Quantity _________ CD (Compact Disc) (* 1)                          |\n|   Date Released ___________ 27th of April, 1998                              |\n|   User Rating _____________ 4.3/5 (940 user ratings)                         |\n|   Genre(s) ________________ Trip-Hop                                         |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +--------+\n+------+ Review +--------------------------------------------------------------+\n|      +--------+                                                              |\n|   Many of us go through certain musical phases. A couple years ago, while    |\n|   electronica was still in my roots, nu metal was my world. At that point    |\n|   I, and so many others, felt that an album like Slipknot or L.D.50 were     |\n|   the greatest album of all time. It sounds ridiculous, but it's strange     |\n|   to think that I was so sure of it back then. It therefore makes it         |\n|   difficult for me to decide whether or not my high opinion of Mezzanine     |\n|   is the same as my old love for Follow The Leader and such albums. I        |\n|   honestly believe that I will regard Mezzanine as one the greatest albums   |\n|   of all time for the rest of my life, without a doubt. The rest of my       |\n|   life seems like a far cry from the seemingly short five years that I've    |\n|   been listening to Mezzanine, so there's really no way of knowing if it     |\n|   will retain its staying power.                                             |\n|                                                                              |\n|   I cannot fully explain the phenomenon that is Mezzanine, nor its nearly    |\n|   unequaled critical acclaim. What I can explore is how much of an advance   |\n|   for Massive Attack is was, and how it affects me.                          |\n|                                                                              |\n|   After a brief hiatus, Massive Attack re-emerged in 1998 minus one          |\n|   member. Tricky had left for a solo career, unsurprisingly making music     |\n|   similar to early Massive Attack. How much of an impact his departure had   |\n|   on the band I'm not sure, but some factors must have caused them to        |\n|   change so dramatically. Massive Attack rose above their contemporaries     |\n|   such as Portishead, with a new style. They had almost said goodbye to      |\n|   the indie, soul, and hip-hop influences that drove their previous          |\n|   albums. While Protection showed a little electronic flair, Mezzanine was   |\n|   when instumentals fully surfaced as a key element of the band. From        |\n|   dark, brooding keyboards in the club-scene commentary Risingson, to        |\n|   smooth, lush instrumentals in the 50's slow-jam Exchange, Massive Attack   |\n|   helped reinvent an entire genre, although an obscure one.                  |\n|                                                                              |\n|   What is also superior to the previous albums is the vocals. There is a     |\n|   smaller input from from the rather annoying reggae singer Horance Andy,    |\n|   whose vibrato style almost ruined Blue Lines' One Love. He does appear     |\n|   on the opener, Angel, but he sings in a more soft, subtle way. The other   |\n|   song of his, Man Next Door, happens to be the only song on Mezzanine I     |\n|   find mediocre. It only seems mediocre compared to the greats like          |\n|   Teardrop and Group Four.                                                   |\n|                                                                              |\n|   This brings me to absolute best thing about Mezzanine: Elizabeth Fraser.   |\n|   While Shari Nelson and Tracy Thorn are both perfectly decent singers       |\n|   (understatement of the year), they always seemed to draw attention away    |\n|   from the music for me, except in the case of the 1991 classic Unfinished   |\n|   Sympathy. On the other hand, Elizabeth Fraser's voice is just plain        |\n|   perfect. It's more than perfect; it's divine. If I believed in God, I      |\n|   would imagine it to have a voice like hers. Her singing brings emotion     |\n|   to Massive Attack's songs that may have seemed inconceivable before.       |\n|   Fraser's ending to Teardrop makes it one of the most moving moments of     |\n|   the album. She just adds to much beauty to Mezzanine, and I do not think   |\n|   it would it would have made it so far without her.                         |\n|                                                                              |\n|   Now, Robert Del Naja (also known as 3D) can't exactly shatter glass with   |\n|   his voice, but he makes an outstanding contribution as a vocalist          |\n|   nonetheless. With the newly-introduced dark atmospheres behind him, his    |\n|   amelodic murmurs are often chilling. On the title track, Del Naja          |\n|   creates an unnerving depth with the repeated lyrics &quot;All these have        |\n|   flaws.&quot; On the earlier albums, his talk-rapping was as annoying as         |\n|   Andy's singing, but with the right background he makes quite a presence,   |\n|   especially on Massive's most recent release 100th Window.                  |\n|                                                                              |\n|   With the addition of instumentals and more refined vocals, Mezzanine       |\n|   manages to create a broad spectrum of emotions. I equate the contrast of   |\n|   tones to the contrast between the two main singers. Fraser is meant to     |\n|   represent the gentle, motherly yin, whereas Del Naja plays the male role   |\n|   of the strong, unyielding yang. After an album of ups and downs, the two   |\n|   sides to the dichotomy meet face to face in the final act, Group Four.     |\n|   It begins with a creepy, crawling sound, and then an ever-so-dark          |\n|   bassline kicks off the song. The use of instrumentals is excellent here,   |\n|   casting a sad yet hopeful tone. Del Naja and Fraser take turns singing     |\n|   to each other, in some kind of dance of death. Del Naja's lyrics           |\n|   represent introversion and isolation, &quot;A flask I drink of sober tea,       |\n|   while relay cameras monitor me, and the buzz surrounds it does, buzz       |\n|   surrounds.&quot; The buzz of the cameras represents a stark artificiality,      |\n|   while Fraser expresses the complete opposite. Her lyrics, &quot;Daydreaming,    |\n|   admiring, being, quietly, open the world I hear the time of the starry     |\n|   sky turning over at midnight,&quot; obviously suggest a more warm, open         |\n|   embracing of nature and beauty. After five minutes of competition, Del     |\n|   Naja says &quot;Flickering I roam,&quot; creating the illusion that the song is      |\n|   drawing to a close. The very quiet music is pushed forward by a            |\n|   crescendoing drum beat, joined soon after by a guitar. As it continually   |\n|   strums, you just know that something wonderful is about to happen, until   |\n|   everything finally comes to light with Fraser leading the majestic final   |\n|   movement. The music keeps speeding up gradually, until you feel like you   |\n|   can't take it anymore. It then reaches its inevitable decline into one     |\n|   of the most fulfilling releases I've ever heard. It leaves me with an      |\n|   impression that the two sides have found some kind of solace, maybe even   |\n|   in death.                                                                  |\n|                                                                              |\n|   Not quite to spoil everything, but to certainly put a damper to an         |\n|   otherwise perfect ending, the very last track is an alternative version    |\n|   of Exchange, with Horace Andy singing along. I recommend that you leave    |\n|   this song off, because Group Four is the true ending to the album. As I    |\n|   said, Mezzanine presents a broad range of emotions, most of which were     |\n|   brought about by Massive Attack's developments in production. Mezzanine    |\n|   is both a classic and a 5/5 album; a classic because of its redefinition   |\n|   of trip hop, and a 5/5 for being an almost perfect album in my eyes.       |\n|   Mezzanine is hardly perfect, but I would never say that there is even      |\n|   one bad song. I refuse to even consider the possibility that Mezzanine     |\n|   is a &quot;phase album,&quot; like some of my old nu-metal flames. I've never been   |\n|   surer about an album that I'll listen to it and love it for the rest of    |\n|   my life. It sounds naive, but I guess I just have that much faith in       |\n|   Mezzanine. [ocelot-05, sputnikmusic]                                       |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +------------+\n+------+ Track List +----------------------------------------------------------+\n|      +------------+                                                          |\n|   No. | Title                                                  | Duration    |\n|   ----+--------------------------------------------------------+----------   |\n|   001 | Angel ................................................ | 00h06m21s   |\n|   002 | Risingson ............................................ | 00h04m59s   |\n|   003 | Teardrop ............................................. | 00h05m31s   |\n|   004 | Inertia Creeps ....................................... | 00h05m57s   |\n|   005 | Exchange ............................................. | 00h04m11s   |\n|   006 | Dissolved Girl ....................................... | 00h06m07s   |\n|   007 | Man Next Door ........................................ | 00h05m56s   |\n|   008 | Black Milk ........................................... | 00h06m22s   |\n|   009 | Mezzanine ............................................ | 00h05m57s   |\n|   010 | Group Four ........................................... | 00h08m12s   |\n|   011 | (Exchange) ........................................... | 00h04m10s   |\n|   ----+--------------------------------------------------------+----------   |\n|                                                                              |\n|   Total Length ____________ 01h03m43s                                        |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +-----------+\n+------+ Audio Rip +-----------------------------------------------------------+\n|      +-----------+                                                           |\n|   Ripped with _____________ EAC v1.0b2 [http://www.exactaudiocopy.de]        |\n|   Encoded with ____________ FLAC v1.2.1 [http://flac.sourceforge.net]        |\n|   Encoding Stats __________ 1411kbps / 44.1kHz / CBR / 16-bit / Stereo       |\n|   Tag(s) __________________ Vorbis                                           |\n|   Includes Artwork? _______ Yes                                              |\n|   Includes Rip .LOG? ______ Yes                                              |\n|   Includes Rip .CUE? ______ Yes                                              |\n|   Includes Playlist? ______ Yes                                              |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\nrainfo v0.2 [2011/06/22 @ 18:29:18]","torrent":{"xt":"urn:btih:462bf6524fbabb89bda2280a96590297a59a3729","amp;dn":"Massive+Attack+-+1998+-+Mezzanine+%5BTQMP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"462bf6524fbabb89bda2280a96590297a59a3729","infoHashBuffer":{"type":"Buffer","data":[70,43,246,82,79,186,187,137,189,162,40,10,150,89,2,151,165,154,55,41]},"announce":[],"urlList":[]}}