{"title":"Within Temptation - Paradise (What About Us)  MP3  320k ak6103","uid":10746600,"size":180028267,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46373b2008ab9aa6078e71f50bb124995768e584&amp;dn=Within+Temptation+-+Paradise+%28What+About+Us%29++MP3++320k+ak6103&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"analogkid6103","files":17,"time":1407824269,"description":"Within Temptation - Paradise (What About Us)  MP3  320k ak6103 What we got...&quot;Paradise (What About Us?)&quot; is a studio EP by Dutch symphonic metal/rock band Within Temptation from their sixth studio album &quot;Hydra&quot;. It was released on 27 September with three songs from the upcoming album in their demo versions and also accompanying a music video. Besides the official music charts, the EP reached 4th position on iTunes European music charts right on the day of its release and 17th position worldwide. Beside its digital release, the EP has also been released as a physical CD (only in Japan).Background\n\nAt the end of May 2013, the band started the process of finalization of the song vocal lines. Next month, the band went on to record the first music video for the new album.\n\nOn 12 July 2013, the band released a teaser trailer of the upcoming music video, but without any names revealed.\n\nNext month, the band announced the title of the lead single, in which was called &quot;Paradise (What About Us?)&quot;, also uploading a teaser trailer revealing some of the song lyrics and a guitar solo in anticipation for the release.\n\nDuring the recording process of the song, the band came to a point of confusion in which they couldn't decide how to mix it, so the song was sent to several different mixers for the band's to choose the better one. They wanted a mix that was &quot;pumping, heavy, big and melancholic&quot; at the same time, and to make sure that nothing was left missing on the song. According to lead vocalist Sharon den Adel, the early idea was to put &quot;a swingy dance beat with rap in all verses&quot; but the band disliked the end result because it led to a place &quot;a bit too much out of our comfort zone&quot;, and then they led it to a well-known territory, transforming the song into a &quot;big symphonic, and heavy guitar cranking song.&quot;\n\nIn early August, the band started to post one picture per day of the video, or its behind the scenes, via their official Facebook account, until the official release of the video. Ideas for the music video came up in May, and den Adel was responsible for the video style and clothing.\n\nOn 13 September, the band officially announced that Tarja Turunen would also appear on the song as guest vocalist. About the invitation, Turunen stated that it was &quot;wonderful that they thought of [her]&quot; and that she &quot;truly appreciates the invitation and the opportunity to work with them&quot;. On working with Tarja, den Adel stated that they &quot;immediately clicked, not only creatively but personally. [...] it felt completely natural that [they] would do this together!&quot;.\n\nAccording to den Adel, the song is based on the speech given by retired four-star general Peter van Uhm on 4 May 2013, which addressed the importance of not thinking only of 'yourself' or 'them', but 'us'.\nTracklist\nNo. \tTitle \tLength \t\n1. \t&quot;Paradise (What About Us?)&quot; (featuring Tarja Turunen) \t5:21\n2. \t&quot;Let Us Burn&quot; (Demo Version) \t5:38\n3. \t&quot;Silver Moonlight&quot; (Demo Version) \t5:14\n4. \t&quot;Dog Days&quot; (Demo Version) \t4:56\nPersonnel\n\nBand members\n\n    Sharon den Adel - Vocals\n    Martijn Spierenburg - Keyboards\n    Robert Westerholt - Rhythm guitar, grunts\n    Stefan Helleblad - Rhythm guitar\n    Ruud Jolie - Lead guitar\n    Jeroen van Veen - Bass guitar\n    Mike Coolen - Drums\n\nGuest musicians\n\n    Tarja Turunen - Vocals on track 1\n............................................................................................................Tarja got voice she could probanly blow out your eardrums with it.So   seed it.......seed......................seed.................seed.....................seed.....Seed?..............................seed.....","torrent":{"xt":"urn:btih:46373b2008ab9aa6078e71f50bb124995768e584","amp;dn":"Within+Temptation+-+Paradise+%28What+About+Us%29++MP3++320k+ak6103","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46373b2008ab9aa6078e71f50bb124995768e584","infoHashBuffer":{"type":"Buffer","data":[70,55,59,32,8,171,154,166,7,142,113,245,11,177,36,153,87,104,229,132]},"announce":[],"urlList":[]}}