{"title":"Poke That Tranny In The Fanny Vol. 5 XXX 2015 WEB-DL","uid":12237816,"size":5848096607,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:46f8ddac419dcc90559a2001640f8744669463e8&amp;dn=Poke+That+Tranny+In+The+Fanny+Vol.+5+XXX+2015+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Ctrlme","files":4,"time":1439698012,"description":"Poke That Tranny In The Fanny Vol. 5 XXX 2015 WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/N21&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N21&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2O&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2O&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2T&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2T&lt;/a&gt;\n\nDescription:  The movie begins with a skimpily dressed babysitter Jane Marie watching TV. Smith and Chad Diamond walk in and after Chad gives a brief introduction, he ducks out to pick up a prescription. Smith already knows Jane though and he wonders why she left her life of stripping, tricking, and porn to babysit. She wants a normal life but Smith threatens to tell Chad and the family about her background if she doesn't hook up with him. He pulls out his cock and she reluctantly goes down on him after a thorough blowjob, she hops on him reverse cowgirl while stroking herself. Then she gets fucked on her back. Smith blows her a bit. Chad of course walks in freaking the fuck out and quickly kicks Smith out. Chad apologizes to Jane for his trashy friend but wants to see what Jane is hiding between her legs, she reveals her cock and Chad is all about it. Jane starts blowing him and then hops on him reverse cowgirl. Then they fuck doggy style and Chad finishes with a facial. Wolf Hudson and Penny Tyler open the next scene training for cheerleading. Wolf is frustrated though because she's just not getting it. Penny offers to release some of his tension and goes down on him. Wolf trades blowjobs with her and then she hops on him reverse cowgirl. Wolf fucks her from behind side by side, on her back, doggy and then on her back again where she strokes herself. Wolf then pulls out and comes in her mouth. Spencer Fox is playing pinball in the next scene and cheerleader Carmen Moore walks in all flirty and starts trying to seduce Spencer. After calling him a pussy who's too scared to fuck trans girls, he pulls out his cock and she starts blowing him. Spencer goes down on her as well and fucks her while she's laying on the top of the couch. He blows her a bit more and then she hops on his dick reverse cowgirl. He fucks her from behind while laying side by side, blows her some more and then fucks her from behind while standing. he finishes coming in her mouth. Christian is on the phone chatting with his wife explaining that he's working late but really he's with Bambi Prescott. Christian blows her on the couch and then she goes down on him. After the warm up, he fucks her doggy style and then she hops on him cowgirl she turns around for reverse cowgirl. Then he fucks her from behind side by side, on her back and reverse cowgirl again while she strokes herself. Then she hops off and Christian comes in her mouth. Next we see cheerleader Khloe Hart on the phone saying she's in pain and calling for help. Earl Slate arrives and examines her and finds one of her pom poms in her ass. It's stuck pretty firmly but his attempt at removing it looks more like an attempt at foreplay. He takes it out though and starts fingering her. After a bit, Khloe starts blowing him and then takes him in doggys style. She hops on him reverse cowgirl and then they fuck laying side by side and while she's on her back stroking herself. She comes on herself and then Earl gives her a facial. Following that we see Earl Slate walking down a tunnel towards Ryder Monroe. The scene switches back to his place where she's blowing him. Then they lay on the couch together and he fucks her from behind. She rides him reverse cowgirl and then takes him in doggy and then on her back. Eventually he pulls out and gives her a small facial. Natalie Foxx and Earl Slate are outside doing cheerleader practice in the next scene. They bring it inside and Earl gives her more coaching. One move being the deepthroat technique. Natalie is shocked, but goes along with it. After a long blowjob they fuck doggy style, reverse cowgirl, side by side, and on her back while she strokes herself until she comes on her cute belly. Then Earl pulls out and comes in her mouth. The last scene opens with Carrie Ann cleaning tables when Jessica Fox walks in. Carrie gives her a drink and they chat some. Then shortly after they start making out and Carrie starts blowing Jessica. Jessica goes down on Carrie and then fucks her while she's on her back and doggy style. Carrie Ann blows her some and then hops on Jessica reverse cowgirl, then cowgirl. Carrie hops off and then Jessica strokes herself until she squirts on Carries face while she licks it up. They make out a bit to finish and compliment each other.\n\nLength: 3:43:14\n\nScene 1: Jane Marie\nScene 2: Penny Tyler\nScene 3: Carmen Moore\nScene 4: Bambi Prescott\nScene 5: Khloe Hart\nScene 6: Ryder Monroe\t\nScene 7: Natalie Foxx\nScene 8: Carrie Ann &amp; Jessica Fox\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:46f8ddac419dcc90559a2001640f8744669463e8","amp;dn":"Poke+That+Tranny+In+The+Fanny+Vol.+5+XXX+2015+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46f8ddac419dcc90559a2001640f8744669463e8","infoHashBuffer":{"type":"Buffer","data":[70,248,221,172,65,157,204,144,85,154,32,1,100,15,135,68,102,148,99,232]},"announce":[],"urlList":[]}}