{"title":"Science Magazine [PDF]","uid":5028079,"size":113982414363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:480974fe9f5bddec7c5a4f1eb9d5d7635aa507b3&amp;dn=Science+Magazine+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"oo7ACE","files":245,"time":1248791253,"description":"Science is the academic journal of the American Association for the Advancement of Science and is considered one of the world's most prestigious scientific journals. The journal is peer-reviewed, is published weekly, and has a print subscriber base of around 130,000. Because institutional subscriptions and online access serve a larger audience, its estimated readership is one million people.[1]\nThe major focus of the journal is publishing important original scientific research and research reviews, but Science also publishes science-related news, opinions on science policy and other matters of interest to scientists and others who are concerned with the wide implications of science and technology. Although most scientific journals focus on a specific field, Science and its rival Nature cover the full range of scientific disciplines. Science places special emphasis on biology and the life sciences because of the expansion of biotechnology and genetics over the past few decades. Science's impact factor for 2005 was 30.927 (as measured by Thomson ISI).\nAlthough it is the journal of the American Association for the Advancement of Sciences, membership in the AAAS is not required to publish in Science. Papers are accepted from authors around the world. Competition to publish in Science is very intense, as an article published in such a highly-cited journal can lead to attention and career advancement for the authors. Fewer than 10% of articles submitted to the editors are accepted for publication and all research articles are subject to peer review before they appear in the magazine.\nScience is based in Washington, D.C., USA, with a second office in Cambridge, England.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Science_(journal)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Science_(journal)&lt;/a&gt;\n\nScience Magazine 1880-2002, 07.2004 (5684)- 11.2008 (5904) - 5820\n\n","torrent":{"xt":"urn:btih:480974fe9f5bddec7c5a4f1eb9d5d7635aa507b3","amp;dn":"Science+Magazine+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"480974fe9f5bddec7c5a4f1eb9d5d7635aa507b3","infoHashBuffer":{"type":"Buffer","data":[72,9,116,254,159,91,221,236,124,90,79,30,185,213,215,99,90,165,7,179]},"announce":[],"urlList":[]}}