{"title":"Ring Runner Flight Of The Sages [Version 2.0.5.7][GOG]","uid":8944094,"size":262872398,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:48c7526b1427b97a4bf46565f3f804b4b90dcff3&amp;dn=Ring+Runner+Flight+Of+The+Sages+%5BVersion+2.0.5.7%5D%5BGOG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1379731409,"description":"Discover your destiny as a reality-bending Sage through a hilarious trek across the universe.\nUnprecedented replayability offered by online multiplayer scenarios with procedurally generated backgrounds, level layouts, and AI enemies. From epic base battles to zombie horde invasions, Ring Runner has it all!\nDozens of ships act as unique templates for hundreds of skills inspired by games of all kinds. The possibilities are endless.\n\nOverview:\nYou awake from forced brain surgery to find key memory centers of your brain missing. They've been replaced by Nero, your peanut-butter-craving neuro-Hud, that will act as your guide to the universal super highways known as the Rings. If you can survive fiery trench runs, flail-swinging gladiators in intergalactic arenas, and feuding trash moguls, you'll discover that you're a Sage, capable of rewriting the physical laws with your thoughts.\n\nExploring the quantum space beneath atoms has made most Sages rather... eccentric, but relatively harmless. And yet The Consortium of the Inner Rings has deemed that any man or woman capable of destroying a world with a thought will never be bound by its laws. In the interest of peace and order, they have slated the Sages for extermination. So began The Extinguishing, a universal war whose casualties can be measured in galaxies. You will play a pivotal role in this terrible battle... if you can find out who you are. The Universe is only as vast as our minds can imagine. -- an unnamed Sage.\n\nInstall the Game. Install each update separately.Play.\n\nOther:\nGenre:........................................shooter / rpg / sci-fi\nDownload size:...........................196 MB\nRelease date:.............................July 9, 2013\nCompatible with:........................Windows (XP, Vista, 7, 8)\nLanguages:................................English\nDeveloper / Publisher:................Triple-B-Titles\nGame modes:.............................single-player, multi-player, co-op\n\nBonus content included:\nsample soundtrack (7 tracks)\n6 artworks\nwallpaper\n\nSystem Requirements:\nMinimum system requirements:Windows XP / Vista / 7 / 8, AMD/Intel dual-core 2.4 GHz processor or higher, 2 GB RAM or more, Nvidia GeForce 8800/ATI Radeon HD 4800 3D graphics card with 256 MB VRAM compatible with DirectX 9.0c (Shader Model 3.0 support required), 4 GB HDD, DirectX 9.0c-compatible sound card, Mouse, Keyboard. Patched to version 1.0.0.4","torrent":{"xt":"urn:btih:48c7526b1427b97a4bf46565f3f804b4b90dcff3","amp;dn":"Ring+Runner+Flight+Of+The+Sages+%5BVersion+2.0.5.7%5D%5BGOG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48c7526b1427b97a4bf46565f3f804b4b90dcff3","infoHashBuffer":{"type":"Buffer","data":[72,199,82,107,20,39,185,122,75,244,101,101,243,248,4,180,185,13,207,243]},"announce":[],"urlList":[]}}