{"title":"Spectacular Spider Man Magazine 1968 COMPLETE","uid":9712869,"size":183069168,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:48d93803f7833797cfa2f04541f4d4ddbc02ae83&amp;dn=Spectacular+Spider+Man+Magazine+1968+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mothra67","files":-1,"time":1394128409,"description":"The Spectacular Spider-Man was initially a two-issue magazine published by Marvel in 1968,[1] as an experiment in entering the black-and-white comic-magazine market[2] successfully pioneered by Warren Publishing and others. It sold for 35 cents when standard comic books cost 12 cents and annuals and giants 25 cents. It represented the first Spider-Man spin-off publication aside from the original series' summer annuals, begun in 1964.\nThe first issue (cover-dated July 1968) featured a painted, color cover by men's adventure-magazine artist Harry Rosenbaum, in acrylic paint on illustration board, over layouts by The Amazing Spider-Man artist John Romita Sr..[3] The 52-page black-and-white Spider-Man story, &quot;Lo, This Monster!&quot;, was by writer Stan Lee, penciler Romita Sr. and inker Jim Mooney. A 10-page origin story, &quot;In The Beginning!&quot;, was by Lee, penciler Larry Lieber and inker Bill Everett.\nThe feature story was reprinted in color, with some small alterations and bridging material by Gerry Conway, in The Amazing Spider-Man #116-118 (Jan.-March 1973) as &quot;Suddenly...the Smasher!&quot;, &quot;The Deadly Designs of the Disruptor!&quot;, and &quot;Countdown to Chaos!&quot; (with additional inking by Tony Mortellaro on the latter two). These versions were themselves reprinted in Marvel Tales #95-97 (Sept.-Oct. 1978).\n\n\nThe Spectacular Spider-Man magazine #2 (November 1968) Cover art by John Romita, Sr.\nThe second and final issue (Nov. 1968) sported a painted cover and the interior was in color as well. Lee, Romita and Mooney again collaborated on its single story, &quot;The Goblin Lives!&quot;, featuring the Green Goblin. A next-issue box at the end promoted the planned contents of the unrealized issue #3, &quot;The Mystery of the TV Terror&quot;. A version of the Goblin story, trimmed by 18 pages, was reprinted in The Amazing Spider-Man Annual #9 (1973), and portions of the &quot;TV Terror&quot; costume were reused for the costume of the Prowler.[2]\nBoth issues of the magazine were reprinted in their entirety (albeit reduced to comic size) in the collection Marvel Masterworks: The Amazing Spider-Man #7 (ISBN 0-7851-1636-2). The first issue was reprinted again in 2002 as The Spectacular Spider Man Facsimile, exactly as it was originally presented.[4]","torrent":{"xt":"urn:btih:48d93803f7833797cfa2f04541f4d4ddbc02ae83","amp;dn":"Spectacular+Spider+Man+Magazine+1968+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d93803f7833797cfa2f04541f4d4ddbc02ae83","infoHashBuffer":{"type":"Buffer","data":[72,217,56,3,247,131,55,151,207,162,240,69,65,244,212,221,188,2,174,131]},"announce":[],"urlList":[]}}