{"title":"Nuclear.Coffee.My.Music.Collection.v1.0.1.26.Multilingual-BEAN","uid":10316768,"size":13844951,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:49157068290146f409b1d8d62687b39963774336&amp;dn=Nuclear.Coffee.My.Music.Collection.v1.0.1.26.Multilingual-BEAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Tom_Da_Man","files":3,"time":1402254411,"description":"My Music Collection is the most comprehensive music catalog software designed for organizing and managing music collections of any kind, including CD discs, MP3 files or vinyl records. This music organizer allows you to create an ordered CD database and view its contents, even if the disk is lying on a shelf or is being borrowed by a friend of yours. Now you can forget about creating music database on a paper, in Excel or text files. \n\nSimply insert a disc, scan barcode or type the title and My Music Collection will fetch all album information from the Internet, including artist, title, release year, country, track titles and cover image, etc. \n\nFurthermore, this music organizer does not only allow you to create comprehensive music collection with a great amount of options, but it is also a great loan manager allowing you to keep track of albums borrowed to your friends.\n\nFamiliar and intuitive interface allows you to easily and quickly search and browse your music collection. You can sort albums by artist, release year or even by media type. Checking statistics is also easy - My Music Collection allows you to view statistics in a table view or use a variety of diagrams. With music database software you can export your list into almost all popular file formats, including HTML, Excel, PDF, Text file or XML.\n\nInstall using setup. Copy files from crack to install dir.","torrent":{"xt":"urn:btih:49157068290146f409b1d8d62687b39963774336","amp;dn":"Nuclear.Coffee.My.Music.Collection.v1.0.1.26.Multilingual-BEAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49157068290146f409b1d8d62687b39963774336","infoHashBuffer":{"type":"Buffer","data":[73,21,112,104,41,1,70,244,9,177,216,214,38,135,179,153,99,119,67,54]},"announce":[],"urlList":[]}}