{"title":"Install.Block.2.07","uid":5295847,"size":4577079,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4930db4c615bb6bce9879d10ac1d278ba975457f&amp;dn=Install.Block.2.07&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"arnellord","files":5,"time":1264055131,"description":"Install-Block 2.07 (Good for internet cafe's)\n\nPlace crack file to install directory (overwrite)\n\nNote: cracked version is v2.06\n\nAbout Install-Block\n Install-Block allows you to require a password to be entered in order for new software to be installed on your computer. An ideal solution for parents, employers, and teachers who seek to secure their PCs, Install-Block can protect you from software potentially harboring adware or spyware. The program can also return to you the productivity lost through the use of games (be it Solitaire or games on the web), instant messaging programs, MySpace, and other distractions. In addition, you can prevent harm to your computer by denying access to system tools and other Windows features. Virtually any program, individual window inside an application, or website can be restricted from use. When someone tries to access a feature that the program administrator has chosen to block, a password prompt is displayed, and without the password the user cannot continue.\n\n\nFeatures: \nPrevent users from installing, or un-installing, any program \nPrevent users from accessing the Start Menu, Task Manager, Control Panel applets, Internet Options, and other Windows features. Install-Block can also disable logging off or shutting down of the system. \nPrevent children from using instant messaging programs, file-sharing programs, MySpace, or other content you find unsuitable \nPrevent employees from playing games such as Solitaire \nDisable the entire web browser, or choose to only stop internet downloads \nPassword-protect nearly any program or window that you choose \nAdministrators can remotely grant or deny access to a blocked program on a networked user's machine \nAdminister all of your systems with ease, changing settings on all networked computers \nEncrypt files using Blowfish technology \nAbility to specify a list of programs/windows to allow, with access to all others being denied \nAbility to have the program launch at system start only if the user logging into Windows matches a list of users that you create \nCompatible with Windows Vista \nMuch more powerful and easier to manage than Windows' Group Policy Editor \n\n\nUses: \nInstall-Block is trusted by organizations around the world. Among our customers are many schools and colleges, internet cafes, banks, manufacturing plants, design firms, call centers, and small businesses. Of course parents also find the software very useful as well. \nInstall-Block password-protects all software installs, prompting the user for a password before allowing the installation to continue.\n\nInstall-Block can prevent people from using specific programs, websites, or Windows features.\n\nInstall-Block can be used to secure your systems, put a stop to time-wasting activities, limit an employee or child's access to programs, and much more.\n\nInstall-Block has been found useful for combatting gambling addiction -- stopping a spouse or loved one from downloading casino software or visiting online gambling websites.\n\n","torrent":{"xt":"urn:btih:4930db4c615bb6bce9879d10ac1d278ba975457f","amp;dn":"Install.Block.2.07","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4930db4c615bb6bce9879d10ac1d278ba975457f","infoHashBuffer":{"type":"Buffer","data":[73,48,219,76,97,91,182,188,233,135,157,16,172,29,39,139,169,117,69,127]},"announce":[],"urlList":[]}}