{"title":"Poweramp Full Version Unlocker v1.1-build-12 -ZombieWarez-","uid":7158247,"size":22932,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:49cb502d1eded3f8075067f287f7c92dd75b8e6d&amp;dn=Poweramp+Full+Version+Unlocker+v1.1-build-12+-ZombieWarez-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZombieWarez","files":-1,"time":1333521159,"description":"Please Comment! SEED! and Enjoy!\n\nTested with Poweramp Music Player (trial) v2.0.5-build-488\n\n\n\nDescription\nPowerful Music Player for Android\n\nThis application unlocks Poweramp (Trial), powerful music player for Android. Please install Poweramp Music Player (Trial) application first. Unlocker removes the trial period limitation. Any version of Poweramp can be unlocked (v1.x and v2.x).\n\nPlease update BOTH Unlocker and Poweramp Trial (it's the main app) if you're experiencing any issues with the license.\n\nCommon Questions/Answers for Poweramp v2.x:\n\nQ. My songs are missing from folders/library.\nA. Please ensure you have all your folders with music actually checked in Poweramp Settings =&gt; Music Folders.\nYour original Android Library is not changed, nor any files deleted.\nPoweramp 2.0.1+ has Auto-find option in Settings. This will import your Android library folders into Poweramp.\n\nPoweramp library is a separate, completely independent library. When you installed Poweramp 2.0, it just got filled with the files scanned from your sd card/other flash memory, as specified in Music Folders. By default these are /music, /mp3 and Google music cache directory, or the Poweramp 1.4 previous music folders settings.\n\n\nQ. Where is Auto-advance Setting now in Poweramp 2.0\nA. It's merged with Repeat modes. Just keep pressing Repeat mode until Advance List.\n\n\nQ. Volume too low. Volume changes weirdly. Other volume issues.\nA. Try to disable Direct Volume Control in Poweramp Settings =&gt; Audio Engine =&gt; Advanced Tweaks.\n\nPoweramp 2.x uses Direct Volume Control by default on 2.3+ mid-to-high end devices. On stock ROMs this produces much better audio output. But many custom/buggy ROMs, while supporting DVC, can fail with it.\n\n\nQ. Poweramp 2.0 widget becomes white/doesn't work on phone reboot\nA. This can happen if something blocks Poweramp from starting on reboot and updating the widget - task managers, auto-start tweaking. If you use such apps/tweaks, you may need to add Poweramp (or/and WidgetPack) to exceptions list.\n\n\nQ. Can I get Poweramp v1.4 look?\nA. You can download &quot;Poweramp Classic Skin&quot; on Market.","torrent":{"xt":"urn:btih:49cb502d1eded3f8075067f287f7c92dd75b8e6d","amp;dn":"Poweramp+Full+Version+Unlocker+v1.1-build-12+-ZombieWarez-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49cb502d1eded3f8075067f287f7c92dd75b8e6d","infoHashBuffer":{"type":"Buffer","data":[73,203,80,45,30,222,211,248,7,80,103,242,135,247,201,45,215,91,142,109]},"announce":[],"urlList":[]}}