{"title":"VA - Dubstep and Drum N Bass EPs Vol. 13 by Geloso (2013)","uid":8528368,"size":836971063,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:49ebb31be7d20a4acec7dfc0b9e38f7d56b695f3&amp;dn=VA+-+Dubstep+and+Drum+N+Bass+EPs+Vol.+13+by+Geloso+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"geloso","files":77,"time":1370085829,"description":"Compilation of singles and eps in one torrent grouped for easy download. Most released in May of 2013. As always perfectly labeled. In Mp3 320 Kbps.\n\n #. Artist          -EP Title-      Track Title             -Genre-     Label\n\n01. Daenine, Melissa Pixel -Where You Belong- Where You Belong -Drum &amp; Bass- Multikill Recordings (MKR006)\n02. Daenine, Melissa Pixel -Where You Belong- Fresher Memory -Dubstep- Multikill Recordings (MKR006)\n03. Dodge &amp; Fuski -Remixed- Turn It Up (Xilent Remix) -Drum &amp; Bass- Disciple Recordings (DISC001)\n04. Dodge &amp; Fuski -Remixed- Got 2 Come Together (501 Remix) -Glitch Hop- Disciple Recordings (DISC001)\n05. Dodge &amp; Fuski -Remixed- Bad feat. Messinian (Flinch Remix) -Dubstep- Disciple Recordings (DISC001)\n06. Dodge &amp; Fuski -Remixed- Call My Name feat. 720 (Astronaut Remix) -Electro House- Disciple Recordings (DISC001)\n07. Excision &amp; Ajapai -Blast Off-(DESTROID002)- Blast Off -Dubstep- Destroid Music\n08. Getter -Gnar Ep- Gnar -Dubstep-\n09. Getter -Gnar Ep- Run Up -Dubstep-\n10. Greenpiece -Instincts- Instincts -Bass- The Pooty Club Records (POOTY041D)\n11. Greenpiece -Instincts- Kill The DJ -Bass- The Pooty Club Records (POOTY041D)\n12. Greenpiece -Instincts- Karmacode Scream -Bass- The Pooty Club Records (POOTY041D)\n13. Greenpiece -Instincts- Go Go Go -Bass- The Pooty Club Records (POOTY041D)\n14. Hirshee -Spark The Flare EP- Spark The Flare -Drumstep- Play Me Records (PLAY087)\n15. Hirshee -Spark The Flare EP- Fire On Ice -Dubstep- Play Me Records (PLAY087)\n16. Ming &amp; 2beeps -King Kong EP WEB- King Kong (Original Mix) -House- Dim Mak Records (886788891111)\n17. Ming &amp; 2beeps -King Kong EP WEB- Like A Ninja (Original Mix) -House- Dim Mak Records (886788891111)\n18. Ming &amp; 2beeps -King Kong EP WEB- Make You Stay (Original Mix) -House- Dim Mak Records (886788891111)\n19. Ming &amp; 2beeps -King Kong EP WEB- Afterglow (Original Mix) -House  -  Dim Mak Records (886788891111)\n20. Ming, 2Beeps -King Kong (Remixes)- King Kong (Casino Gold Remix) -Techno- Dim Mak Records (887396370913)\n21. Ming, 2Beeps -King Kong (Remixes)- King Kong (Sluggo Remix) -Electro House- Dim Mak Records (887396370913)\n22. Ming, 2Beeps -King Kong (Remixes)- King Kong (Stafford Brothers Remix) -Electro House- Dim Mak Records (887396370913)\n23. Ming, 2Beeps -King Kong (Remixes)- Like a Ninja (Jumpshot Remix) -Drum &amp; Bass- Dim Mak Records (887396370913)\n24. Ming, 2Beeps -King Kong (Remixes)- Make You Stay (Manics Remix) -Indie Dance- Dim Mak Records (887396370913)\n25. Ming, 2Beeps -King Kong (Remixes)- Make You Stay (Will Bailey Remix) -Drum &amp; Bass- Dim Mak Records (887396370913)\n26. Mt Eden, Diva Ice -Air Walker- Air Walker (Original Mix) -Dubstep- Ultra (UL3896)\n27. Must Die! &amp; CRNKN -Tokyo Police- Tokyo Police - Original -Dubstep- SMOG Records (SMOG028)\n28. Must Die! &amp; CRNKN -Tokyo Police- The Palmtop Tiger - Original -Dubstep- SMOG Records (SMOG028)\n29. Neosignal -Planet Online- Planet Online (Original Mix) -Electronic- Division Recordings (DVSN011)\n30. Neosignal -Planet Online- Angst (Original Mix) -Drum &amp; Bass- Division Recordings (DVSN011)\n31. Neosignal -Planet Online- Planet Online (Culprate Remix) -Drum &amp; Bass- Division Recordings (DVSN011)\n32. Neosignal -Planet Online- Planet Online (Rockwell Remix) -Drum &amp; Bass- Division Recordings (DVSN011)\n33. Neosignal -Planet Online- Angst (Rawtekk Remix) -Electronic- Division Recordings (DVSN011)\n34. Optiv &amp; CZA -Journey Inwards EP- Journey Inwards -Drum &amp; Bass- C4C Recordings (C4CDIGUK019)\n35. Optiv &amp; CZA -Journey Inwards EP- I Feel -Drum &amp; Bass- C4C Recordings (C4CDIGUK019)\n36. Optiv &amp; CZA -Journey Inwards EP- I Can Hear Myself -Drum &amp; Bass- C4C Recordings (C4CDIGUK019)\n37. Optiv &amp; CZA -Journey Inwards EP- Cant You See -Drum &amp; Bass- C4C Recordings (C4CDIGUK019)\n38. Pixel -Momentary Lapse EP- Momentary Lapse -Drum &amp; Bass- Textures Music Group (TMGRLS40)\n39. Pixel -Momentary Lapse EP- Feelin' It -Drum &amp; Bass- Textures Music Group (TMGRLS40)\n40. Point.blank, KLRGRM -The Colab EP- Danger -Dubstep- Prime Audio (PRIMEDIGI017)\n41. Torrid, Point.blank -The Colab EP- Abducted -Dubstep- Prime Audio (PRIMEDIGI017)\n42. We Bang, Point.blank -The Colab EP- Back Again -Dubstep- Prime Audio (PRIMEDIGI017)\n43. Point.blank, KLRGRM -The Colab EP- Like That -Dubstep- Prime Audio (PRIMEDIGI017)\n44. Syndaesia, Point.blank -The Colab EP- Brain Wreck -Dubstep- Prime Audio (PRIMEDIGI017)\n45. Real Trauma -This Is How EP- Guide (feat. Arly J) -Dubstep- Spawn Records (SPAWN00004)\n46. Real Trauma -This Is How EP- Fly By (feat. Arly J) -Dubstep- Spawn Records (SPAWN00004)\n47. Real Trauma -This Is How EP- This Is How (feat. Rebecca K) -Drum &amp; Bass- Spawn Records (SPAWN00004)\n48. Real Trauma -This Is How EP- Yeah Man -Dubstep- Spawn Records (SPAWN00004)\n49. Rednek -Free DL- Train Sex (Original Mix) -Brostep- Rednek (Free Download)\n50. Seapoint -Lunar Eve- Lunar Eve -Breaks- Infinite Machine (IMSL8)\n51. Seapoint -Lunar Eve- Triangle Optics -Breaks- Infinite Machine (IMSL8)\n52. Seapoint -Lunar Eve- Lunar Eve (Kon Remix) -Breaks- Infinite Machine (IMSL8)\n53. Sponge Bandits -To the shadows- To the shadows (Original Mix) -Dubstep- Xenomorph Recordings (10057941)\n54. Sponge Bandits -To the shadows- Lurking (Original Mix) -Dubstep- Xenomorph Recordings (10057941)\n55. Sponge Bandits -To the shadows- Rupture (Original Mix) -Dubstep- Xenomorph Recordings (10057941)\n56. Sponge Bandits -To the shadows- I can see you (Original Mix) -Dubstep- Xenomorph Recordings (10057941)\n57. Sponge Bandits -To the shadows- Its a jungle out there (Original Mix) -Dubstep- Xenomorph Recordings (10057941)\n58. Sponge Bandits -To the shadows- I can see you (Jphelpz Remix) -Dubstep- Xenomorph Recordings (10057941)\n59. StereoLiez &amp; Telmini ft. Shaz Sparks -Anybody- Anybody (Original Mix) -Glitch Hop- Burn The Fire (BTF122)\n60. StereoLiez &amp; Telmini ft. Shaz Sparks -Anybody- Anybody (Dubsidia Remix) -Dubstep- Burn The Fire (BTF122)\n61. StereoLiez &amp; Telmini ft. Shaz Sparks -Anybody- Anybody (Club Mix) -Dubstep- Burn The Fire (BTF122)\n62. The Jackass -EP1- Sex, Drugs &amp; Chicken Roll (Original Mix) -Drum &amp; Bass- Dirt, Lies &amp; Audio Black (DLAB454EP)\n63. The Jackass -EP1- For The Craziest Bitch (Original Mix) -Drum &amp; Bass- Dirt, Lies &amp; Audio Black (DLAB454EP)\n64. TTEK -Recharge- Recharge -Dubstep- Future Bass Records (FB007)\n65. TTEK -Recharge- Redstrike -Dubstep- Future Bass Records (FB007)\n66. TTEK -Recharge- The Flow -Dubstep- Future Bass Records (FB007)\n67. TTEK -Recharge- Whatever -Dubstep- Future Bass Records (FB007)\n68. TTEK -Recharge- Wrapped -Dubstep- Future Bass Records (FB007)\n69. Etch -Keysound Allstars 2- Scattah -Dubstep- Keysound Recordings (5055300359322)\n70. Walton -Keysound Allstars 2- Homage -Dubstep- Keysound Recordings (5055300359322)","torrent":{"xt":"urn:btih:49ebb31be7d20a4acec7dfc0b9e38f7d56b695f3","amp;dn":"VA+-+Dubstep+and+Drum+N+Bass+EPs+Vol.+13+by+Geloso+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49ebb31be7d20a4acec7dfc0b9e38f7d56b695f3","infoHashBuffer":{"type":"Buffer","data":[73,235,179,27,231,210,10,74,206,199,223,192,185,227,143,125,86,182,149,243]},"announce":[],"urlList":[]}}