{"title":"Back to the Future - Episodes 1 to 5 - Pc Game Rip and Crack mad","uid":8755181,"size":2158657192,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4aa1a643f9fea1d97d5e0411e7a396185f43df5b&amp;dn=Back+to+the+Future+-+Episodes+1+to+5+-+Pc+Game+Rip+and+Crack+mad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"drean5","files":-1,"time":1375138998,"description":"Back to the Future: The Game is an episodic point-and-click adventure role-playing video game based on the Back to the Future film franchise. The game was developed by Telltale Games as part of a licensing deal with Universal Pictures. Bob Gale, co-creator, co-writer and co-producer of the film trilogy, assisted Telltale in writing the game's story. Original actors Michael J. Fox and Christopher Lloyd allowed the developers to use their likenesses in the game for the lead characters Marty McFly and Doc Brown, respectively. Lloyd also provides the voice for Doc, while A.J. Locascio plays the role of Marty; Fox later appeared to voice two cameo roles in the final episode, reprising his role as future versions of Marty McFly in addition of playing his forefather William.[5] The game is split up into five episodes available on multiple gaming platforms, the first episode released for Microsoft Windows and Mac OS X on December 22, 2010. PlayStation 3 and iOS versions followed February 15, 2011. Episodes 2 through 5 were released throughout February to June 2011, with the final episode released on June 23, 2011. Telltale published the series as retail products for the PlayStation 3 and Nintendo Wii consoles for North America.[6] Deep Silver published the retail Nintendo Wii and PlayStation 3 versions for Europe on May 4, 2012.","torrent":{"xt":"urn:btih:4aa1a643f9fea1d97d5e0411e7a396185f43df5b","amp;dn":"Back+to+the+Future+-+Episodes+1+to+5+-+Pc+Game+Rip+and+Crack+mad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa1a643f9fea1d97d5e0411e7a396185f43df5b","infoHashBuffer":{"type":"Buffer","data":[74,161,166,67,249,254,161,217,125,94,4,17,231,163,150,24,95,67,223,91]},"announce":[],"urlList":[]}}