{"title":"[Classic] Rosalie - Die nacht der Heisse Korper [1983]","uid":14633200,"size":1886414336,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4af8ad76bc76071b424759f2b1da5a04d98d6be2&amp;dn=%5BClassic%5D+Rosalie+-+Die+nacht+der+Heisse+Korper+%5B1983%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hunter534","files":1,"time":1463387594,"description":"Rosalie goes to the big city to work as an assistant to Dr. Palmer. As they arrive he is having sex on his desk with his brunette nurse Corinne. On her first day in the job a female patient masturbates and has sex with a male patient (the John Leslie lookalike from French Satisfaction and Diamond Baby) in the waiting room watched by the other waiting patients after reading one of the sexy magazines Dr. Palmer has supplied for patients. Advised by Corinne, Rosalie changes her image from a sweet, nice girl into a sexy woman, and immediately gets an invitation to spend the weekend with the doctor. When her fiancй (Andrй Kay) comes to visit her, but does not find her home, he and the doctor's wife, Brigitte (Dominique Saint Claire) have sex together, then make a plan to get their partners back on the yearly masked ball by wearing identical costumes to the doctor and Rosalie. Corinne, the patients who had sex in the waiting room, the blonde boutique owner, Esther Allen and some extra males and females attend this party cum orgy. The boutique owner has g/g sex with a brunette who may not have been Corinne. The fiancй reveals himself to Rosalie while they are making love and they run off back home, leaving the orgy in full swing behind them. There she invites him to spend the night with her in her room, to be discovered by her prim and proper mother in the morning.\r\n\r\nGenre: Hardcore\r\nCast: Agnes Ardant, Dominique Saint Claire, Michelle Villers, Olinka Hardiman, Sophie Pressle, Gabriel Pontello, Andre Kay, Silvio Rey, Paul Thomas, Robert Bullock\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-573969773f0c7.html \r\n \nhttp://photo-up.info/img-5739698252609.html","torrent":{"xt":"urn:btih:4af8ad76bc76071b424759f2b1da5a04d98d6be2","amp;dn":"%5BClassic%5D+Rosalie+-+Die+nacht+der+Heisse+Korper+%5B1983%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4af8ad76bc76071b424759f2b1da5a04d98d6be2","infoHashBuffer":{"type":"Buffer","data":[74,248,173,118,188,118,7,27,66,71,89,242,177,218,90,4,217,141,107,226]},"announce":[],"urlList":[]}}