{"title":"I Shouldn't Be Alive - Season 5 - SD 480p","uid":11252975,"size":4821686668,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4bfb75b650da7d37177cbcdf8570e6e7e01e2c78&amp;dn=I+Shouldn%27t+Be+Alive+-+Season+5+-+SD+480p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"voltxrid","files":-1,"time":1413859746,"description":" &lt;a href=&quot;http://bayimg.com/DaclIAAGC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/DaclIAAGC&lt;/a&gt;\n\n\n=========================================\n\nI Shouldn't Be Alive - Season 5 - SD 480p\n\n=========================================\n\n\nEpisode 1 - &quot;Avalanche!&quot; - July 6, 2011\n\nIn Montana, five skiers are ravaged by a massive avalanche on New Year's Day, 2005. Sam suffers a gruesome compound fracture to his leg and Blake (who triggered the avalanche) is killed by blunt-force trauma. The three remaining friends fight to keep Sam alive through a growing storm, but his leg is starting to decompose and the rescue helicopter can't land in the weather.\n\n\nEpisode 2 - &quot;Blood on the Mountain&quot; - July 13, 2011\n\nOn March 20, 2009 in New Zealand, 33-year old Matthew Briggs, traveling with his dog Little Dog, loses balance, slides down a hill and falls 15 feet onto rocks, breaking his ankle and wrist, and sustaining deep cuts to his thigh. He camps for a week and then using his tent poles as a walking stick, he is forced to hobble for two days to a nearby hut and is found by two hunters.\n\n\nEpisode 3 - &quot;Christmas Horror&quot; - July 27, 2011\n\nTwo hikers in New Zealand take a risky detour around an ice wall, eventually becoming stuck on a potentially unstable rock ledge for 10 days, including Christmas Day. They are unable to escape the ledge because of several days of rainfall and a whole night of snow.\n\n\nEpisode 4 - &quot;First Date Nightmare&quot; - July 22, 2011\n\nTwo climbers on a first date in the Swiss Alps nearly summit a mountain, but are stopped by ice. A massive storm has formed in the valley below, and the climbers are forced to descend through the treacherous conditions. They end up trapped on a ledge.\n\n\nEpisode 5 - &quot;Climb out of Hell&quot; - September 30, 2011\n\nNovember 2009. A man, climbing a cliff, falls 20 feet and shatters his pelvis. He is forced to crawl more than a mile and climb a steep cliff to survive.\n\n\nEpisode 6 - &quot;'Til Death Do Us Part&quot; - September 30, 2011\n\nJuly 2009. An off-road adventure goes terribly wrong when the Bosworths' jeep rolls, leaving them stranded in the rugged canyons of New Mexico. They face a grueling four-day hike out of the area, and when Lynda becomes too weak to continue Tom is forced to continue on to save his dying wife.\n\n\nIf problems or inconsistencies with any of the content files are noticed, please let me know via the comments and I will attempt to upload some corrected replacements.  Thanks much and enjoy!  :-)","torrent":{"xt":"urn:btih:4bfb75b650da7d37177cbcdf8570e6e7e01e2c78","amp;dn":"I+Shouldn%27t+Be+Alive+-+Season+5+-+SD+480p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bfb75b650da7d37177cbcdf8570e6e7e01e2c78","infoHashBuffer":{"type":"Buffer","data":[75,251,117,182,80,218,125,55,23,124,188,223,133,112,230,231,224,30,44,120]},"announce":[],"urlList":[]}}