{"title":"Timothy Besley - Principled Agents. The Political Economy of Goo","uid":10428659,"size":2478883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cfeb32a45f61dfba164a5d54f5f124bfc3349b5&amp;dn=Timothy+Besley+-+Principled+Agents.+The+Political+Economy+of+Goo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1403780021,"description":"Description\nProduct Details\nBook Title: Principled Agents?: The Political Economy of Good Government (Lindahl Lectures)\t\nBook Author: Timothy Besley (Author)\nSeries: Lindahl Lectures\nHardcover: 280 pages\nPublisher: Oxford University Press (August 10, 2006)\nLanguage: English\nISBN-10: 019927150X\nISBN-13: 978-0199271504\n\n===================================================================================\nBook Description\nPublication Date: August 10, 2006\nMainstream policy economics now pays more attention to the delivery of policy outcomes and how incentives and institutional change shape the effectiveness of government. But should these issues be studied against a background of purely self-interested public servants? There is plenty of evidence that many citizens are publicly spirited. Can their motivation be harnessed in the public interest? These lectures review how economic thought on these issues has evolved.\n\n===================================================================================\nReviews\n&quot;How can democratic competition make a government of politicians act as a government for the people? Tim Besley has given us a broad and deep analysis of this fundamental agency problem which is essential to the theory of democracy. This is an important book for anyone who wants to study political science with the best analytical tools of modern economics.&quot;--Roger Myerson, William C. Norby Professor of Economics, University of Chicago\n\n&quot;How does the structure of democratic political institutions and organization shape policy choice? This path-breaking book boldly claims that well-designed institutions can help voters select politicians who are 'better:' more capable and more faithful to the fiduciary duties of public life. Novel in its emphasis on information, this unprecedentedly careful, thorough analysis of the 'agency' problem links voters' ability to screen out bad politicians and discipline rent-seeking with the competence, motivation, and alignment of politicians' preferences to explain a wide variety of political economy and public finance outcomes including debt accumulation, the size and scope of government activities, corruption, and political turnover.&quot;--James E. Alt, Frank G. Thomson Professor of Government, Harvard University\n\n&quot;A wonderful and important book, that combines state of the art analysis and deep knowledge of real world institutions to obtain novel insights about a fundamental issue. It should be read by all those who want to understand what it is that brings about good government.&quot;--Guido Tabellini, Professor of Economics, Bocconi University\n\n&quot;Tim Besley demonstrates how to analyze political agency in the intellectual middle ground left open in between the optimism of the traditional welfare-economics approach, and the pessimism of the traditional public-choice approach. The key to good government is institution design- in the best Federalist tradition- to improve incentives in policymaking and selection to public office. Quite simply, a great book by a great economist.&quot;--Torsten Persson, Director of the Institute for International Economic Studies\n\n===================================================================================\nAbout the Author\nTimothy Besley is Professor of Economics at the LSE and Director of the Suntory Toyota International Centres for Economics and Related Disciplines (STICERD) at the LSE. He is also a Research Fellow at the Institute for Fiscal Studies and the Centre for Economic Policy Research (CEPR). He has acted as Co-Editor of the American Economic Review and Managing Editor of the Economic Journal. He is an elected member of the Council of the Royal Economic Society, the Econometric Society, and the European Economics Association.\n===================================================================================","torrent":{"xt":"urn:btih:4cfeb32a45f61dfba164a5d54f5f124bfc3349b5","amp;dn":"Timothy+Besley+-+Principled+Agents.+The+Political+Economy+of+Goo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cfeb32a45f61dfba164a5d54f5f124bfc3349b5","infoHashBuffer":{"type":"Buffer","data":[76,254,179,42,69,246,29,251,161,100,165,213,79,95,18,75,252,51,73,181]},"announce":[],"urlList":[]}}