{"title":"Kiss Of The Spider Woman (restored) [1985] Hector Babenco","uid":6579419,"size":730810452,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4d2ef5bc36f8a70ef8fb8161f69a08f4fdb2f495&amp;dn=Kiss+Of+The+Spider+Woman+%28restored%29+%5B1985%5D+Hector+Babenco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1312350900,"description":" &lt;a href=&quot;http://bayimg.com/kajhHAADg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/kajhHAADg&lt;/a&gt;\n\nKiss of the Spider Woman (1985) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0089424/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0089424/&lt;/a&gt;\n\nRestored by the Independent Cineman Restoration Archive\n\n  William Hurt  ...  Luis Molina  \n  Raul Julia  ...  Valentin Arregui  \n  Sonia Braga  ...  Leni Lamaison / Marta / Spider Woman  \n  JosÃƒÂ© Lewgoy  ...  Warden  \n  Milton GonÃƒÂ§alves  ...  Secret Policeman  \n  MÃƒÂ­riam Pires  ...  Mother (as Miriam Pires)  \n  Nuno Leal Maia  ...  Gabriel  \n  Fernando Torres  ...  Americo  \n  Patricio Bisso  ...  Greta  \n  Herson Capri  ...  Werner  \n  Denise Dumont  ...  Michele (as Denise Dummont)  \n  Nildo Parente  ...  Leader of Resistance  \n  AntÃƒÂ´nio Petrin  ...  Clubfoot (as Antonio Petrin)  \n  Wilson Grey  ...  Flunky  \n  Miguel Falabella  ...  Lieutenant  \n\nThe Kiss of the Spider Woman movie project began in the early 1980s as a notion in the heads of an up-and-coming Latin American director with a recent international success and an independent producer whose output to that point would not have predicted mainstream popularity; both were enamored of a work by a gay novelist little known in the United States. Against everyone's best advice, the picture was made with no money under highly stressful circumstances; at any point during principal photography and post-production, the whole project easily could have gone down the drain. Even when it was finally completed, some years after its inception, it was impossible to get anyone even to consider taking on its distribution. Yet the people involved doggedly believed in what they were doing and would let nothing stand in the way of getting their dream into theaters. And what came out of that was an international phenomenon, a solid commercial hit and critical darling that transcended even the most optimistic expectations of an art house run.\n\nKiss of the Spider Woman was a rather unlikely film to have been rewarded with such high honors and mainstream success. An independent, foreign-based production (albeit starring American actors) with no major studio connections, it told a compassionate story about the relationship between a gay man in prison for corrupting a minor and his radical political prisoner cellmate. It was a long shot for Academy Award nominations yet it received four and won the Best Actor award for William Hurt's performance as Luis Molina, the first time anyone had won an OscarÃ‚Â® for playing an openly gay character.\n\nMuch was made of Hurt's courage in taking on such a part, and it certainly opened a lot of doors to have an important leading man enjoy such success in a role that could have been a career-buster. Yet there are those for whom Raul Julia's performance is the stronger one and less dependent on studied effects and the kind of technical brilliance that is a draw at awards season but sometimes falls short of deep insight. It's never really clear how the fantasy sequences draw the two men together or lead to mutual understanding. Further, some have noted how the film softened and changed some of the more challenging aspects of Manuel Puig's source novel to meet the expectations of a largely heterosexual audience, even to the point of confirming certain stereotypes of sexuality and gender identity. Nevertheless, no matter how one feels about Kiss of the Spider Woman as a film experience, this is still essential. But less for what actually appears on screen and more for how it was made, released, distributed and what influence it had on the way films were produced and sold in the following years.\n\nThe production's attorney, Peter Dekom, echoing the claims of most of those involved in the making of the film, recently said, Everybody thinks the world of independent movies started with Pulp Fiction [1994]. No folks, it didn't. It started with Kiss of the Spider Woman. This certainly was not the first independent film or the first one to achieve notable success, but it was a major milestone for indies, the first ever not only to be nominated for a Best Picture Academy Award but for four of the top categories. Its widespread exhibition and generous reception in mainstream movie houses across the country, not just on the coasts or in major cities, is remarkable for a motion picture produced with no backing from any studio or major production company and distributed by a cobbled-together consortium of small companies, one of which was a venture capital firm put together primarily for the purpose of this movie. Such arrangements are common today, but as Dekom noted, It broke the mold and inspired a lot of people to go out and take chances. \n\nPractically every motion picture has its cherished production stories, its tales of hardship and horrors, of clashing egos and close calls to disaster. The stories surrounding the making of Kiss of the Spider Woman approach epic proportions of blood, sweat, and tears; indeed, much of the film's reputation rests on those stories. What will probably keep it alive in cinema history, however, is the very unlikelihood of the movie's ultimate triumph and the way it was virtually dragged to that end by a group of dedicated, intensely driven, even combative craftsmen who often clashed with each other in their determination to get this story onto the screen","torrent":{"xt":"urn:btih:4d2ef5bc36f8a70ef8fb8161f69a08f4fdb2f495","amp;dn":"Kiss+Of+The+Spider+Woman+%28restored%29+%5B1985%5D+Hector+Babenco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d2ef5bc36f8a70ef8fb8161f69a08f4fdb2f495","infoHashBuffer":{"type":"Buffer","data":[77,46,245,188,54,248,167,14,248,251,129,97,246,154,8,244,253,178,244,149]},"announce":[],"urlList":[]}}