{"title":"Spoon - Ga Ga Ga Ga Ga [24 bit FLAC] vinyl","uid":8264169,"size":808783168,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4eba9b610abe6b752759eb7ce149c0aabbd74f5e&amp;dn=Spoon+-+Ga+Ga+Ga+Ga+Ga+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"24.96","files":-1,"time":1363454315,"description":"  Spoon - Ga Ga Ga Ga Ga (2007) [24 bit FLAC] vinyl\n\n  Released: 2007\n  Source: MRG295 / US\n  Genre: Pop/Rock\n  Style: Indie Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Don't Make Me A Target 3:55 \n  A2. The Ghost Of You Lingers 3:34 \n  A3. You Got Yr. Cherry Bomb 3:08 \n  A4. Don't You Evah 3:36 \n  A5. Rhthm &amp; Soul 3:30 \n  B1. Eddies's Ragga 3:39 \n  B2. The Underdog 3:42 \n  B3. My Little Japanese Cigarette Case 3:03 \n  B4. Finer Feelings 4:54 \n  B5. Black Like Me 3:25\n\n  &quot;Attention to detail&quot; doesn't necessarily sound like the secret ingredient to brilliant rock &amp; roll, but in Spoon's case, it comes second only to inspiration. Britt Daniel, Jim Eno, and company keep finding ways to challenge themselves and their listeners by working within the same basic, streamlined sonic framework they crafted on Girls Can Tell, adding a few new twists here and there with each album. Ga Ga Ga Ga Ga just might be the most winning update on this approach since Girls Can Tell itself: each song is as carefully and creatively pruned as a bonsai tree, with nothing fussy or superfluous to mar the clean lines of the songwriting or arrangements. This is especially impressive considering that on this album, Spoon works with their widest array of sounds yet. Everything from kotos to chamberlains to horns straight out of Motown are fair game on Ga Ga Ga Ga Ga, but they're used so deftly and judiciously that they never feel like window dressing. As on Gimme Fiction, the band maps out Ga Ga Ga Ga Ga's territory within the first three tracks. &quot;Don't Make Me a Target&quot; is a sleek yet gritty prologue designed to draw listeners in like Fiction's &quot;The Beast and Dragon, Adored,&quot; and its seductive pull only heightens the impact of &quot;The Ghost of You Lingers.&quot; All pounding pianos and fleeting, fragmented verses, the song initially feels like it's all buildup and no release, but this insistent yet incomplete feeling is what makes it haunting and brilliant: its circling thoughts and echoes upon echoes feel like you're chasing the song -- or its subject -- to no avail. Even if &quot;The Ghost of You Lingers&quot; almost perversely avoids hooks, &quot;You Got Yr. Cherry Bomb&quot;'s homage to blue-eyed soul delivers them in abundance. Ga Ga Ga Ga Ga's songs are svelte, especially compared to Gimme Fiction, yet they're far from starved. Interesting details decorate the margins of these songs, whether it's the studio chatter that revs up &quot;Don't You Evah&quot; or the fascinatingly fragmented lyrics of &quot;Eddie's Ragga&quot; (&quot;there ain't no getting over Joanie Hale-Maier&quot;). Jon Brion pops up bass, chamberlain, and production duties on &quot;The Underdog,&quot; one of Spoon's bounciest, brassiest nods to classic pop in a long time, and a perfect contrast to the exotic, spooky minimalism of &quot;My Little Japanese Cigarette Case&quot;'s shivery kotos and Spanish guitars. Concise and lively (&quot;Black Like Me&quot; is as close as the album gets to a ballad), Ga Ga Ga Ga Ga is a remarkable blend of focus and creativity; even if Spoon's modus operandi seems overly regimented on paper, the results are just as elegant as they are fun.","torrent":{"xt":"urn:btih:4eba9b610abe6b752759eb7ce149c0aabbd74f5e","amp;dn":"Spoon+-+Ga+Ga+Ga+Ga+Ga+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eba9b610abe6b752759eb7ce149c0aabbd74f5e","infoHashBuffer":{"type":"Buffer","data":[78,186,155,97,10,190,107,117,39,89,235,124,225,73,192,170,187,215,79,94]},"announce":[],"urlList":[]}}