{"title":"Richard Hittleman's 28 Day Yoga Exercise Plan","uid":9496041,"size":39428231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ec773de643dfa73161e5b5d756092e5bcdbe3b5&amp;dn=Richard+Hittleman%27s+28+Day+Yoga+Exercise+Plan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1390112914,"description":"Back in the 80's I bought this as a paperback book and in 1 month I was convinced this was the best exercise routine I ever did, over powerlifting and track running.  This book has a 28-day program that introduces you to a group of yoga moves, and at the end of the month, you have a 3-day routine that you do over and over for the rest of your life, and it will keep you flexible enough, even if it's just to tie your own shoes!\n\nWhen my paperback broke down, someone gave me a hardcover book version.  I put that away and searched for another paperback edition, which I found on eBay.  I ripped it apart and scanned it in .TIF format and posted it on Demonoid a few years ago.  I was popular, and someone was kind enough to convert my high-resolution scans into a more useable .PDF edition.  This .PDF version is what I am posting now.\n\nSince Demonoid is dead, long live Demonoid, I would like this out of print yoga book to live on through Pirate Bay.\n\nIf yoga is a part of your life, you need to peruse this book.  If you never did yoga, this is the book for you.  You can walk into a book store today (if one it still operating in your area) or hit onand you won't find a better starter's yoga book than this.  Add to the fact that once you finish this book in 28 days, you have a 3-day routine that you can jot down on a business card, keep in your wallet, and use every day for the rest of your life.  No other yoga books needed.\n\nThis is the yoga book of all yoga books.  No, you won't be putting your legs behind your ears or any other kinky things, but you will be standing on your head.\n\nRecommended book for anyone interested in yoga, even the slightest bit.\n\nNothing like it on the market today.\n\nEnjoy!","torrent":{"xt":"urn:btih:4ec773de643dfa73161e5b5d756092e5bcdbe3b5","amp;dn":"Richard+Hittleman%27s+28+Day+Yoga+Exercise+Plan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ec773de643dfa73161e5b5d756092e5bcdbe3b5","infoHashBuffer":{"type":"Buffer","data":[78,199,115,222,100,61,250,115,22,30,91,93,117,96,146,229,188,219,227,181]},"announce":[],"urlList":[]}}