{"title":"The First World War: A Concise Global History","uid":7065592,"size":1198344,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f2f662c515274d1571614cf177f7b2ef2e0f390&amp;dn=The+First+World+War%3A+A+Concise+Global+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1330502488,"description":"By request: owatell\n-------------------\nowatell at 2012-02-29 06:01 CET:\nI know this is unrelated but I was wondering if you can upload the following books \n\n1.the elite - the story of the rhodesian sas\n\n2.the complete idiot's guide to irish history and culture \n\n3.the first world war - a concise global history\n================================================\nKeep up the good work !\n------------------------------------------------------------------\n\nPublication Date: October 15, 2009 | ISBN-10: 0742541452 | ISBN-13: 978-0742541450\nIn a compact but comprehensive and clear narrative, this book explores the First World War from a genuinely global perspective. Putting a human face on the war, William Kelleher Storey takes into account individual decisions and experiences as well as environmental and technological factors such as food, geography, manpower, and weapons. \n\nHe argues that the war profoundly changed the ways in which people imagined the landscape around them and thought about technology and the environment. Before the war, Europe and its colonies generally regarded industrial technology as an instrument of modernity; the landscape existed to be conquered, divided, and ruled. During and after the war, the costs of conquest became much higher, raising significant doubts about the value of progress. Soldiers experienced profound personal degradation, physical injuries, and mental collapse in the midst of nightmarish, technologically induced environmental conditions, which they vividly remembered when they formed new identities in the postwar world. Although people did not abandon thoughts of technological advance, after the war they had a keener sense of modernity's costs. Without neglecting traditional themes, Storey's deft interweaving of the role of environment and technology enriches our understanding of the social, political, and military history of the war, not only in Europe, but throughout the world.","torrent":{"xt":"urn:btih:4f2f662c515274d1571614cf177f7b2ef2e0f390","amp;dn":"The+First+World+War%3A+A+Concise+Global+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f2f662c515274d1571614cf177f7b2ef2e0f390","infoHashBuffer":{"type":"Buffer","data":[79,47,102,44,81,82,116,209,87,22,20,207,23,127,123,46,242,224,243,144]},"announce":[],"urlList":[]}}