{"title":"Spit Lip Rayfield - Never Make it Home","uid":6300646,"size":41861167,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f2f4dce6d52c8b4d6aa57912e3018adad6e3d85&amp;dn=Spit+Lip+Rayfield+-+Never+Make+it+Home&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"count_drunkula","files":14,"time":1302141104,"description":"Amazon.com\nA string band with a mean streak and a standup bass fashioned from a gas tank, Wichita\\'s picking punks earned their reputation by beating tradition into submission. But with Never Make It Home, their third effort, Split Lip discover that playing it (comparatively) straight can yield satisfying results. This most welcome surprise is spurred by the emergence of Wayne Gottstine, the quartet\\'s flashy but always solid mandolinist, as a stellar singer and songwriter to rival bandleader Kirk Rundstrom. Fans of the Gourds\\' Jimmy Smith will find a lot to like in Gottstine\\'s handful of tunes, from the jaunty \\&quot;Movin\\' to Virginia\\&quot; to the mopey \\&quot;Used to Call Me Baby.\\&quot; Elsewhere, Split Lip prove they can still play like they\\'re blowing a tollbooth, especially on another Gottstine original, \\&quot;River,\\&quot; and the disc\\'s pair of covers, \\&quot;Love Please Come Home\\&quot; and \\&quot;Day the Train Jumped the Tracks.\\&quot; --Anders Smith-Lindall\n\nProduct Description\nAfter a bit of tinkering these bluegrass outlaws have emerged from the garage soot-smeared, short of temper and ready for beer with their third CD. Steel yourself for the trademark souped up hillbilly barrage. \\&quot;Never Make it Home\\&quot; features SLR\\'s bluegrass underground sound, tick-tight playing and even a few sing-along anthems.","torrent":{"xt":"urn:btih:4f2f4dce6d52c8b4d6aa57912e3018adad6e3d85","amp;dn":"Spit+Lip+Rayfield+-+Never+Make+it+Home","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f2f4dce6d52c8b4d6aa57912e3018adad6e3d85","infoHashBuffer":{"type":"Buffer","data":[79,47,77,206,109,82,200,180,214,170,87,145,46,48,24,173,173,110,61,133]},"announce":[],"urlList":[]}}