{"title":"Learning akka by Jason Goodwin","uid":14129120,"size":2301719,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f429fb8083363b37491025080ed4dabf8aee9ce&amp;dn=Learning+akka+by+Jason+Goodwin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1459533137,"description":"\nPaperback: 274 pages\r\nPublisher: Packt Publishing - ebooks Account (December 30, 2015)\r\nLanguage: English\r\nISBN-10: 1784393002\r\nISBN-13: 978-1784393007\r\n\r\nBook Description\r\nSoftware today has to work with more data, more users, more cores, and more servers than ever. Akka is a distributed computing toolkit that enables developers to build correct concurrent and distributed applications using Java and Scala with ease, applications that scale across servers and respond to failure by self-healing. As well as simplifying development, Akka enables multiple concurrency development patterns with particular support and architecture derived from Erlang's concept of actors (lightweight concurrent entities). Akka is written in Scala, which has become the programming language of choice for development on the Akka platform.\r\n\r\nLearning Akka aims to be a comprehensive walkthrough of Akka. This book will take you on a journey through all the concepts of Akka that you need in order to get started with concurrent and distributed applications and even build your own.\r\n\r\nBeginning with the concept of Actors, the book will take you through concurrency in Akka. Moving on to networked applications, this book will explain the common pitfalls in these difficult problem areas while teaching you how to use Akka to overcome these problems with ease.\r\n\r\nThe book is an easy to follow example-based guide that will strengthen your basic knowledge of Akka and aid you in applying the same to real-world scenarios.\r\n\r\nWhat you will learn\r\nUse Akka to overcome the challenges of concurrent programming\r\nResolve the issues faced in distributed computing with the help of Akka\r\nScale applications to serve a high number of concurrent users\r\nMake your system fault-tolerant with self-healing applications\r\nProvide a timely response to users with easy concurrency\r\nReduce hardware costs by building more efficient multi-user applications\r\nMaximise network efficiency by scaling it","torrent":{"xt":"urn:btih:4f429fb8083363b37491025080ed4dabf8aee9ce","amp;dn":"Learning+akka+by+Jason+Goodwin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f429fb8083363b37491025080ed4dabf8aee9ce","infoHashBuffer":{"type":"Buffer","data":[79,66,159,184,8,51,99,179,116,145,2,80,128,237,77,171,248,174,233,206]},"announce":[],"urlList":[]}}