{"title":"EnigmaT Set Rips { Cuts } - June 9th, 2014","uid":10319580,"size":1202872954,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f61994ab666b6af2c2881736761b9444ed40e0b&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+9th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"EnigmaT","files":124,"time":1402289742,"description":"A Great Big World feat. Christina Aguilera - Say Something (ID remix) (Cut From Tiesto Set)-enTc\nA-Sean - Dreaming (Stephane Badey Remix) (-SHORT- Cut From Anderson Set)-enTc\nA.L.A.M.I &amp; Mehdi Hamam - Hopeful (Diego Morrill Remix) (Cut From El Jay Set)-enTc\nAaron Camz vs Solis &amp; Sean Truby - Consequence (Dan Dobson Remix) (Cut From Sherry Set)-enTc\nAaron Camz Vs. Solis &amp; Sean Truby - Consequence (Dan Dobson Remix) (Cut From Romel Set)-enTc\nAdam Deane - Crucial State (Cut From Skyver Set)-enTc\nAdam Kancerski feat. Aneym - Into The Light (Cut From Bobina Set)-enTc\nAlekzander &amp; Julia Lav - Like A First Time (Adam Navel's Extended Out Mix) (Cut From D&amp;E Set)-enTc\nAmine Maxwell - Olusia (Lence &amp; Pluton Remix) (Cut From Feel Set)-enTc\nAmitacek - Burn (Mark Dean Remix) (Cut From Touchstone Set)-enTc\nAndrew Cash - Voices of Passion (Farzam Remix) (Cut From Shah Set)-enTc\nAndy Blueman - Fallen Souls (Original Edit) (Cut From Romel Set)-enTc\nAndy Wide &amp; Signal Space - Let It Go (Cut From Knowles Set)-enTc\nArtego - Make Me Believe (Original Mix) (Cut From Anderson Set)-enTc\nAsten - Source (Original Mix) (Cut From D&amp;E Set)-enTc\nBeat Anatomy - Theory of the Universe (Original Mix) (Cut From Rutkovski Set)-enTc\nBeatsole - Desire To Live (South Pole Remix) (Cut From Anderson Set)-enTc\nBreame &amp; Jack Vath - Arancini (ABGT 082 Rip)-enTc\nChris Cockerill &amp; Phil Lee - Watershed (Renato Dinis Remix) (Cut From Allen&amp;Envy Set)-enTc\nCJ Peeton feat. Di - Loves Tapestry (Kim Harris Remix) (Cut From Shah Set)-enTc\nColdplay - Sky Full of Stars (Beat Service Proglifting Bootleg) (GDJB Rip)-enTc\nComing Soon - Stand Up (ASOT 666 Rip)-enTc\nCream Sound - Intromodul (Dynamic Illusion Remix) (Cut From D&amp;E Set)-enTc\nD-Wayne &amp; Leon Bolier - Detonate (Cut From Hardwell Set)-enTc\nDallasK - SUPERFUTURE (Cut From Hardwell Set)-enTc\nDallonte - Essence (Original Mix) (Cut From Anderson Set)-enTc\nDallonte - Essence (Witness45 Club Mix) (Cut From Calabro Set)-enTc\nDallonte - Essence EP (Essence Original Mix) (Cut From Feel Set)-enTc\nDamien S vs Under - The Cars Below (Tom Noize Extended Remix) (Cut From Anderson Set)-enTc\nDaniel Skyver - ID (Cut From Skyver Set)-enTc\nDave Emanuel - Azuria (Cut From Hardwell Set)-enTc\nDavid Mayne &amp; Squarz Kamel - Neon Suns (Blugazer Remix) (Cut From Knowles Set)-enTc\nDisorder - Tryptamine (Original Mix) (Cut From UKTuni Set)-enTc\nDJ Chris - Dreamers (Original Mix) (Cut From Sty Set)-enTc\nDJ Chris - Dreamers (Xenoflash Remix) (Cut From El Jay Set)-enTc\nDJ Chris - Dreamers (Xenoflash Remix) (Cut From Saux Set)-enTc\nDyro &amp; Dannic - Radical (Cut From Hardwell Set)-enTc\nEllez Ria - Overdrive (ASOT 666 Rip)-enTc\nEximinds feat. Chloe - Rescue Me (Original Mix) (Cut From MORPH Set)-enTc\nFaraday &amp; SNR - Space Jam (Original Mix) (Cut From Anderson Set)-enTc\nFlight Facilities feat. Giselle - Crave You (TEEMID &amp; Daniela Andrade Cover) (Cut From Tiesto Set)-enTc\nFon Leman &amp; Shingo Nakamura - Radiance (Evave Remix) (Cut From Anderson Set)-enTc\nFrank Waanders - Ashes (Cut From Palagano Set)-enTc\nFrank Waanders - Java (Cut From Palagano Set)-enTc\nGenix - Run (ABGT 082 Rip)-enTc\nHawie - Nai Wok (Cut From Knowles Set)-enTc\nHenry Fong - Takin' It Back (Cut From Hardwell Set)-enTc\nHibernate - Please Stop Runnin (Original Mix) (Cut From Shah Set)-enTc\nJamie Knowles - Global Emotive (Orbion Remix) (Cut From Knowles Set)-enTc\nJaxx Inc &amp; Fred Baker - Godzilla (Fred Baker Trance Remix) (Cut From Sherry Set)-enTc\nJohlin - Monolith (David Szurok Remix) (Cut From 9Axis Set)-enTc\nJordan Suckley - Contaminated (ASOT 666 Rip)-enTc\nKamil Esten - Aquatica (GDJB Rip)-enTc\nKenneth Thomas &amp; Har Megiddo feat. Michael Ketterer - Be With You (Thomas Penton Remix) (Set Rip)-enTc\nKhaskada - Nibiru (John Wilson Remix) (Cut From El Jay Set)-enTc\nKraak &amp; Smaak feat. Stee Downes - How We Gonna Stop The Time (NEW ID Remix) (Cut From Hardwell Set)-enTc\nLisa Lashes - Dia Del Presidente (Original Mix) (Cut From Correa Set)-enTc\nLoCo - Seaside (Cut From Tiesto Set)-enTc\nLost Witness - Happiness Happening (Lee Osborne Remix) (Cut From Sherry Set)-enTc\nM.Pravda - Meridian Reflex (Set Rip)-enTc\nMaestrix - Space Intruders (Original Mix) (Cut From 9Axis Set)-enTc\nMarkus Cole &amp; Angel De Mota - Running (Cut From Karanda Set)-enTc\nMassai One - Supersphere (Chasing the Sun Mix) (Cut From Moore Set)-enTc\nMauro Picotto &amp; Frankyeffe - Like This (Riot Mix) (Cut From Sherry Set)-enTc\nMauro Picotto - Iguana 2014 (Megamind Mix) (Cut From Sherry Set)-enTc\nMichael Badal - Carnivale (Original Mix) (Cut From Lange Set)-enTc\nMichael-Li feat. Roxy Charming - Tell Me Why (Original Mix) (Cut From Feel Set)-enTc\nMiles - Anger Management (ASOT 666 Rip)-enTc\nMinamoca &amp; Yu-I - Eternal (Cut From Palagano Set)-enTc\nMino Safy &amp; KeyPlayer - Karama (NoMosk Remix) (Cut From Feel Set)-enTc\nMistolTeam - Aladelta (Original Mix) (Cut From Anderson Set)-enTc\nMorgan Page feat. Michael S - Against The World (Kill The Buzz Remix) (Cut From Hardwell Set)-enTc\nMorttagua &amp; Danilo Garcia feat Molly Williams - With You (Cut From Knowles Set)-enTc\nNeil Moore - Stolen Memories (Original Mix) (Cut From Moore Set)-enTc\nNiklas Grosswald - Stockholm (Horizons Offshore Remix) (Set Rip)-enTc\nOh Honey - Be Okay (Dzeko &amp; Torres Remix) (Cut From Hardwell Set)-enTc\nOlegparadox - Thank You For Everything (Mike Adams Remix) (Cut From Tero A Set)-enTc\nOu Est Le Swimming Pool - I Just Dance The Way I Feel (Gossling Cover &amp; Fdvm Edit) (Cut From Tiesto Set)-enTc\nPablo Artigas - Reliever (Mostfa and Mostfa aka Craft Integrated Remix) (GDJB Rip)-enTc\nPaul Surety feat. Rita Raga - Beneath The Mask (Tolga Uzulmez Remix) (Cut From Feel Set)-enTc\nPhil Dinner - You Need Me (Original Mix) (Cut From Saux Set)-enTc\nPhilippe El Sisi &amp; Sarah Lynn - Look Above (Walsh &amp; McAuley Remix) (Cut From Bobina Set)-enTc\nPiramex - Lunar Eclipse (Cut From Knowles Set)-enTc\nRaddle B &amp; Nellu L - Empires (Original Mix) (Cut From Chou Set)-enTc\nRaddle B - Behind the Silence (Original Mix) (Cut From 9Axis Set)-enTc\nRain City Riot - Burning (Cut From Tiesto Set)-enTc\nRapha - Goodbye (Mike Shiver Remix) (GDJB Rip)-enTc\nRene Dale pres. STR84WARD - Sometimes (Tom8 Remix) (Cut From Allen&amp;Envy Set)-enTc\nReOrder - Beyond Horizons (Paul Di White Remix) (Cut From El Jay Set)-enTc\nRhodes - Worry (Hello Spada Bootleg) (ABGT 082 Rip)-enTc\nRobbie Seed feat. Ai Takekawa - Illusion (Original Mix) (Cut From Chou Set)-enTc\nRoman Messer feat. Ange - Imagination (Purple Stories Remix) (Cut From Allen&amp;Envy Set)-enTc\nRospy - Boundless Love (Project 8 Remix) (ASOT 666 Rip)-enTc\nRY X - Berlin (LCAW &amp; Felix Jaehn Edit) (Cut From Tiesto Set)-enTc\nSaer - Event Horizon (ABGT 082 Rip)-enTc\nScenica - Aurora (Original Mix) (Cut From Feel Set)-enTc\nSG - Firebird (Original Mix) (Cut From Anderson Set)-enTc\nShowave - Eternal (Cut From Knowles Set)-enTc\nSimon Patterson feat. Sarah Howells - Dissolve (Freedom Fighters Remix) (ASOT 666 Rip)-enTc\nSou Kanai - Driving In The Sunlight (Original Mix) (Cut From Tero A Set)-enTc\nSou Kanai - Komorebi (Cut From Team140 Set)-enTc\nSou Kanai - Rebirth (Cut From Palagano Set)-enTc\nSou Kanai - Search For The Truth (Original Mix) (Cut From Romel Set)-enTc\nStartail - Daylight (Cut From Palagano Set)-enTc\nStephane Badey - Mars (Original Mix) (Cut From Anderson Set)-enTc\nSunflare - 140 (Original Mix) (Cut From El Jay Set)-enTc\nSunny Lax - Khaleesi (ABGT 082 Rip)-enTc\nSunset feat Diana Leah - Carry Me Away (Tangle Remix) (Cut From Palagano Set)-enTc\nSuonare - In The Summer (Original Mix) (Cut From Anderson Set)-enTc\nSuonare - Keep With Us (Original Mix) (Cut From Anderson Set)-enTc\nSuper8 &amp; Tab vs. Jaytech - Code Red (Kago Pengchi Remix) (ABGT 082 Rip)-enTc\nSynthea - Long Day (Sunny Lax Remix) (ABGT 082 Rip)-enTc\nThe XX - Intro (LoCo Edit) (Cut From Tiesto Set)-enTc\nTim Verkruissen &amp; AM 2.0 - Meet Me In Bloemendaal (Beatsole Remix) (Cut From Skyver Set)-enTc\nTim Verkruissen &amp; AM 2.0 - Meet Me In Bloemendaal (Matt Chowski Remix) (Cut From Romel Set)-enTc\nTonerush - Space Technology (Digital X Remix) (GDJB Rip)-enTc\nTwoB Project - Sandy Wind (Cut From MPravda Set)-enTc\nTygris - Babylon (GDJB Rip)-enTc\nUDM - Entrance To Eternity (Kinetica Remix) (Cut From Skyver Set)-enTc\nUP3 - Balrog (Original Mix) (ASOT 666 Rip)-enTc\nVertical Mode - Alien Rock (Original Mix) (ASOT 666 Rip)-enTc\nVIF - Point Of View (Original Mix) (Cut From Anderson Set)-enTc\nWellenrausch with Project ReBeat aka Andre Berger - Virtual Sel (GDJB Rip)-enTc\nZuubi - Lost (Cut From Knowles Set)-enTc\n","torrent":{"xt":"urn:btih:4f61994ab666b6af2c2881736761b9444ed40e0b","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+9th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f61994ab666b6af2c2881736761b9444ed40e0b","infoHashBuffer":{"type":"Buffer","data":[79,97,153,74,182,102,182,175,44,40,129,115,103,97,185,68,78,212,14,11]},"announce":[],"urlList":[]}}