{"title":"The Flash - Terminal Velocity","uid":6902260,"size":44270544,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4f67787ad56fedcde43104030fa19c7c6b5154df&amp;dn=The+Flash+-+Terminal+Velocity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jshnaidz","files":1,"time":1324443099,"description":"Written by Mark Waid; Art by Mike Wieringo, Salvador Larroca, Oscar Jiminez, Carlos Pacheco Jose Marzan Jr., and Sergio Borjas; Cover by Wieringo and Marzan, Jr.\n\nThe runaway best-selling storyline that propelled DC\\'s Scarlet Speedster to new heights of excitement is now available in one sensational volume. THE FLASH: TERMINAL VELOCITY trade paperback reprints Wally West\\'s most astounding adventure from issues #0 and #95-100, redefining the true nature of the Flash and super-speedsters throughout the DC Universe.\n\nAs a result of the events in ZERO HOUR, Flash achieved the speed of light, and in so doing was flung headlong on an odyssey of self-rediscovery. He encountered, for the first time, the mysterious force on the Other Side of Light, a strange energy that in time would cause him to transcend all previous limits, transforming Wally West into the quintessential fusion of humanity and velocity.\n\nWritten by fan-favorite writer Mark Waid (IMPULSE, LEGION OF SUPER-HEROES, UNDERWORLD UNLEASHED), with the sensational art of Mike Wieringo, Salvador Larroca, Oscar Jiminez, Carlos Pacheco Jose Marzan Jr., and Sergio Borjas, TERMINAL VELOCITY is a fast-paced story driven as much by its well-developed characters and shocking revelations as it is by the explosive action in every chapter. Co-starring Impulse, Max Mercury, Johnny and Jesse Quick, and the Golden Age Flash, TERMINAL VELOCITY has everything you\\'re looking for: a great story with great art, uniting DC\\'s rich history with its current continuity. The collection also includes an introduction by Waid and editor Brian Augustyn, and a new cover by Wieringo and Marzan, Jr.\n\n-------------------------------------------------------------------------------------\n\nThis Issue is no longer being printed. Support DC and the comic book industry by going out and buying comics! \t\t","torrent":{"xt":"urn:btih:4f67787ad56fedcde43104030fa19c7c6b5154df","amp;dn":"The+Flash+-+Terminal+Velocity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f67787ad56fedcde43104030fa19c7c6b5154df","infoHashBuffer":{"type":"Buffer","data":[79,103,120,122,213,111,237,205,228,49,4,3,15,161,156,124,107,81,84,223]},"announce":[],"urlList":[]}}