{"title":"Billy Cobham - 2013 - Compass Point FLAC","uid":9075416,"size":570331379,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4f9a2218f069cd043d8d34fb092840abcebfa5be&amp;dn=Billy+Cobham+-+2013+-+Compass+Point+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1382278439,"description":"Billy Cobham - 2013 - Compass Point\n\nFew if any jazz-fusion drummers have been more influential than Billy Cobham, along with his modern jazz drumming for legends such as Freddie Hubbard, McCoy Tyner and other notables. Yet touring has its trials and tribulations, noted in the album liners on this previously unissued 2-CD set, presenting live material from the drummer's 1997 show at the Compass Point Hotel in the Bahamas. With impending storms on the horizon and the only piano tuner in the vicinity not showing up because he had just won the lottery, the quartet had a few pins and needles to dodge, but pulled it off rather triumphantly. Indeed, this archival release materializes as one of Cobham's finest albums of the jazz-fusion genre in several years.\nThe band concludes the live set with consecutive performances of time-honored Cobham originals, the title track of Crosswinds (Atlantic, 1974) and classic &quot;Stratus,&quot; from the seminal fusion album Spectrum (Atlantic, 1973). With &quot;Crosswinds,&quot; Cobham puts the gears in motion with a sturdy backbeat, as guitarist Carl Orr and keyboardist Gary Husband execute the lithe melody in unison, subsequently paced by Cobham's melodic polyrhythms, which accent and drive the overall dynamic. They segue into &quot;Stratus&quot; with a glassy sheen anchored by bassist Stefan Rademacher's pumping lines. Here, Orr's slight use of distortion adds a grittier edge via his animated build-up and scorching free-flight, raising the pitch and intensity a few notches, and leading to the audience pleasing finale.\nCompass Point is an exceptional album on all counts. Brimming with memorable compositions and ample soloing room from the frontline, the quartet toggles between loose-groove metrics and shrewdly designed arrangements, spanning an extensive assortment of rhythmic configurations. (allaboutjazz)\n\nTrack list:\nCD 1\n01 - The Snaffler\n02 - Fragolino\n03 - Mushu Creole Blues\n04 - Egg Shells Still On My Head\n05 - Les Cocos\nCD 2\n01 - Mirage\n02 - Panama\n03 - Obliquely Speaking\n04 - Crosswinds-Stratus\n\nPersonnel:\nBilly Cobham: drums;\nGary Husband: keyboards;\nCarl Orr: guitar;\nStefan Rademacher: bass\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:4f9a2218f069cd043d8d34fb092840abcebfa5be","amp;dn":"Billy+Cobham+-+2013+-+Compass+Point+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f9a2218f069cd043d8d34fb092840abcebfa5be","infoHashBuffer":{"type":"Buffer","data":[79,154,34,24,240,105,205,4,61,141,52,251,9,40,64,171,206,191,165,190]},"announce":[],"urlList":[]}}