{"title":"TSF Shell Pro v2.0.4 (Android Launcher)","uid":9417175,"size":11677724,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:4ff87af6f1ff6c27f05f900fd37a9ed777188d2b&amp;dn=TSF+Shell+Pro+v2.0.4+%28Android+Launcher%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"allrockedout","files":-1,"time":1388481479,"description":" &lt;a href=&quot;https://play.google.com/store/apps/details?id=com.tsf.shell&amp;hl=en&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;https://play.google.com/store/apps/details?id=com.tsf.shell&amp;hl=en&lt;/a&gt;\n\nDescription\nTSF Shell is a brand-new 3D launcher that will subvert your concept of the mobile device home screen operations. It offers smooth, unique and customized man-machine interactive operation experience. You are allowed to define all the elements of the home screen freely and efficiently. TSF Shell keeps creating new features and exclusive 3D widgets that will bring you amazing operation experience and unprecedented visual.\nMain features:\n========================\n1.Fantastic animation transition effects. All operations, including deletion, addition, menu showing-up or vanishing, are provided with natural, glaring and butter-smooth animation transition effects.\n2.Miraculous and effective 3D home screen switching mode and freewheeling home screen element layout mode. More than 10 independent layout home screens supported.\n3.Unlimited dock bar. Ability to change its position, length and angle as well as to modify the size and the status (hidden or showed) of icons and folders in the dock bar. You can open the apps and the folders in the dock bar with wave-sliding mode.\n4.Batch icon selecting for home screens, folders and dock bar.\n5.More than 10 TSF Shell exclusive widgets, such as Message, Clock, Weather, Memo, Music, Gallery etc. All 3D widgets provide unique visual and operative experience.\n6.More than 9 gestures supported for Android shortcuts, e.g. app launching, phone call, sms, as well as TSF Shell shortcuts, e.g. home screen switching, status bar hiding, TSF Shell side bar hiding.\n7.TSF Shell Arch Shortcut Menu with special animation effects and operative experience. Ability to complete quick custom shortcut operations on any home screen.\n8.Pioneering icon editing tool. Ability to customize icon back image, upon image, text label style, etc.\n9.Many nice free third-party themes are available.\n10.Funny and intuitive TSF Shell settings menu. You can preview the corresponding settings directly.\n========================\nWe are working constantly to improve TSF Shell. We update our product and widgets regularly. Please check for updates often to insure you receive the best experience.","torrent":{"xt":"urn:btih:4ff87af6f1ff6c27f05f900fd37a9ed777188d2b","amp;dn":"TSF+Shell+Pro+v2.0.4+%28Android+Launcher%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff87af6f1ff6c27f05f900fd37a9ed777188d2b","infoHashBuffer":{"type":"Buffer","data":[79,248,122,246,241,255,108,39,240,95,144,15,211,122,158,215,119,24,141,43]},"announce":[],"urlList":[]}}