{"title":"Poco - Legend [MCA MasterDisc Gold]","uid":5865959,"size":289743679,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5088805f49b25e6e7b1b840cddac6176bdf6f064&amp;dn=Poco+-+Legend+%5BMCA+MasterDisc+Gold%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ddawg","files":-1,"time":1286169732,"description":"\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51ykNv8ZzOL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51ykNv8ZzOL.jpg&lt;/a&gt;\n\n\nTitle: Legend [MCA MasterDisc Gold]\nArtist: Poco\nAudio CD (March 14, 1995)\nOriginal Release Date: November 1978\nNumber of Discs: 1\nGenre: Rock\nQuality: Lossless\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Boomerang\n02. Spellbound\n03. Barbados\n04. Little Darlin`\n05. Love Comes Love Goes\n06. Heart of the Night\n07. Crazy Love\n08. The Last Goodbye\n09. Legend\n\n\nAllmusic Review:\nPoco's biggest-selling album of all time also presented the biggest personnel change at one time for the then-decade-old group, whose lineup had hardly been a model of stability up to that time. Co-founding drummer/singer George Grantham and longtime bassist/singer Timothy B. Schmit were both gone, the latter off to the Eagles. Listening to parts of this album, one gets the sense that, with the arrival of Charlie Harrison (bass, harmony vocals) and Steve Chapman (drums) in the group, Poco was deliberately adopting a change in sound similar to what the Eagles went through when Joe Walsh joined, into much harder rocking territory, at least part of the time. Longtime fans were probably disheartened to hear Rusty Young and Paul Cotton give up any semblance of their country roots on the opening track, &quot;Boomerang,&quot; a bracing, heavy rock number (for this band) that didn't sound a great deal like the Poco of previous years. Most of the rest of the album, however, was closer to what one wanted and expected from this band -- &quot;Spellbound&quot; a beautifully lyrical ballad that benefited from Young's instrumental range and his and Cotton's harmonizing, and Cotton's &quot;Barbados&quot; offering similarly alluring musical textures with more of a beat. Cotton's &quot;Heart of the Night,&quot; however, dominated everything around it, as one of the most finely crafted songs in the group's history, highlighted by a beautiful sax solo from Phil Kenzie. And then there's &quot;Crazy Love&quot; (composed by Rusty Young), with its soft, ethereal textures, which was a little lightweight for this band but unassuming enough to dominate the adult contemporary charts at the time. Young's &quot;The Last Goodbye&quot; and &quot;Legend&quot; closed out the album on a more thickly textured, higher-wattage note, representing the group's newer sound, the latter with a memorably driving beat that, with &quot;Boomerang,&quot; bookended the album.","torrent":{"xt":"urn:btih:5088805f49b25e6e7b1b840cddac6176bdf6f064","amp;dn":"Poco+-+Legend+%5BMCA+MasterDisc+Gold%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5088805f49b25e6e7b1b840cddac6176bdf6f064","infoHashBuffer":{"type":"Buffer","data":[80,136,128,95,73,178,94,110,123,27,132,12,221,172,97,118,189,246,240,100]},"announce":[],"urlList":[]}}