{"title":"fdhypno_Hypnodomme_Minipack","uid":4573676,"size":2834829810,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:50a48b65e1adf9737251f9de5cda369c69897d4e&amp;dn=fdhypno_Hypnodomme_Minipack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sspiff9913","files":95,"time":1229150347,"description":"Hypnodomme hypnofetish erotic hypnosis hypnotic FDHYPNO femdom\n\nThis torrent, the &quot;Hypnodomme Minipack&quot; is a TPB re-uploading of a\ntorrent I have been seeding (as sspiff9912) on another site for a\nwhile now.   Judging from the response to the previous hypnodomme\ncollection I brought over to TPB\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4520487/fdhypno_Hypnodomme_Gigapack&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4520487/fdhypno_Hypnodomme_Gigapack&lt;/a&gt;\n\nthere is a fair bit of interest here in this material, so I'll seed\nthis one here as well.  It would take a lot of work to catalogue all\nthe hypnodomme files already seeded here, and I would have to redo all\nthe README files, so I have not attempted to avoid duplicating files\nalready available here.\n\nHowever, remember that on The Pirate Bay, you can always see what\nfiles are in a torrent by clicking on the number after the &quot;Files:&quot;\nline in the header.\n\nBelow are the posting notes I used on the original upload:\n\n------------------------------END TPB INTRO---------------------------------\n\nhypnodomme hypnofetish erotic hypnosis hypnotic FDHYPNO femdom\n\nThis is a collection of erotic hypnosis audio files gathered\nfrom a large number of different places.\n\nThis is a follow-up to my Empornium &quot;Hypnodomme Superpack&quot; torrent:\n\n\nIf you liked that torrent, you should like this torrent\nas well. I have tried to make sure that there is no\noverlap between that torrent and this one, though it's\npossible I have missed a file somewhere. The\n&quot;Superpack&quot; was fairly large with over 200 files. This\none has about 70 files, so I am calling it my\n&quot;Hypnodomme Minipack&quot;\n\nThe list of hypnodommes with files in this torrent is:\n\nEvilena\nGoddess Marquesa\nGoddess Spiral\nIsabella Valentine\nLady Izzabelle\nLady Julia\nMistress Cat\nMz Dominica\nNikki Fatale\nPrincess Porsche\nQueen Passionate\nSeductra\nStudio Jezebel\nVictoria Wizell (not a domme)\n\nThe bulk of these files are femdom hypnosis, but there\nare also a few vanilla hypnosex files which induce sexy\nfantasies or firm up your erection. I have tried to\ndescribe each file to some extent in a &quot;00_README.TXT&quot;\nfile. Often I have just cut-and-pasted the description\nfrom the domme's web site. Just because there is a\ndescription, does not mean I have listened to the file.\nMost of these files are for guys, but there are a few\nlesbian domination files by Evilena for the ladies, and\nVictoria Wizell's &quot;Hypnotic O&quot; session is gender\nneutral.\n\nAre these files safe? Well, as always when dealing with\nthe human mind, there is no guarantee. Certainly if you\nhave a history of mental illness, you should probably\napproach anything that might alter your mental state\nwith great caution. Remember however that no hypnotist\ncan make you do anything you do not want to do. You are\nalways free to reject any suggestion a hypnotist may\nmake. I will say that there are some things that you\nmay want to do at some level which normally you do NOT\ndo because they are not in your best interest. I think\nit is possible a hypnotist could tip your judgement in\nthe case of an ill-advised thing you may have some\nhidden desire to try. In any case, since having to\nreject a suggestion kind of spoils a trance, I suggest\nyou audit any files you are suspicious of by skipping\nthe induction (the introductory part which takes you\ninto trance) and playing parts of the middle and the\nend (where any post-hypnotic suggestions will be) to\nmake sure there is nothing you will have to reject. (I\nwould be especially suspicous of any files from Mz\nDominica!)\n\nAlso, recall that hypnosis is not magic. A stage\nhypnotist gets &quot;instant&quot; results since he is trained to\npick the half-dozen most gung-ho subjects from an\naudience of hundreds. In most cases, since you are\nprobably not one of those half-dozen, you will have to\nplay a session many times to get the full effect.\n\nMy personal suggestion is that you start with sessions\nby Nikki Fatale, who seems a sanely grounded domme with\na lovely voice, a sense of humor, and a great delivery.\n","torrent":{"xt":"urn:btih:50a48b65e1adf9737251f9de5cda369c69897d4e","amp;dn":"fdhypno_Hypnodomme_Minipack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50a48b65e1adf9737251f9de5cda369c69897d4e","infoHashBuffer":{"type":"Buffer","data":[80,164,139,101,225,173,249,115,114,81,249,222,92,218,54,156,105,137,125,78]},"announce":[],"urlList":[]}}