{"title":"Bad Things - Bad Things (Deluxe) (2014) [FLAC]","uid":9522410,"size":326990140,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:50e380f5308004a7d7e0b756029ef2e4f6af6f41&amp;dn=Bad+Things+-+Bad+Things+%28Deluxe%29+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1390666522,"description":"\n  Bad Things - Bad Things (Deluxe) (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Anybody\n  02 Fool\n  03 Haunting \n  04 Caught Inside \n  05 Saturday Night \n  06 Lost Feeling \n  07 Vices \n  08 Lonely Eyes \n  09 Bury \n  10 Say It Again \n  11 End of the Road \n  12 Cold Case \n  13 John Wayne \n\n  For better or worse, prior to the release of their 2014 self-titled debut album, Los Angeles' Bad Things were primarily known as the band Olympic gold medal-winning snowboarder Shaun White played guitar for. A fortuitous last-minute replacement headlining slot at the Chicago stop of the 2013 Lollapalooza tour went a long way to lend the band some much needed buzz. And, while Bad Things may never fully transcend their lead guitar player's extreme sports profile, their album at least proves that White's band is actually pretty decent and that he's a fairly capable guitarist. In some ways, although White's celebrity is the initial reason for checking Bad Things out, the album doesn't hinge solely upon this curiosity. Generally speaking, it's former Billy Boy on Poison singer David LeDuke, with his tortured, sonorous croon, who takes the spotlight on Bad Things. Equal parts the Killers' Brandon Flowers and the Strokes' Julian Casablancas with faint hints of J. Geils Band's Peter Wolf, LeDuke is a sturdy presence on the mike and lends the band's straightforward, often melodic songs some indie grit. Perhaps the biggest surprise, though, isn't so much White and the band's skill level, but rather their knack for crafting catchy, hook-laden songs that are often infectious. Cuts like &quot;Anybody,&quot; &quot;Saturday Night,&quot; and &quot;Lonely Eyes,&quot; while certainly bringing to mind similarly inclined cuts by Kings of Leon, the Killers, and Coldplay, are perfectly acceptable radio-ready recordings that are more than likely to catch your ear whether you're a fan of winter sports or not.","torrent":{"xt":"urn:btih:50e380f5308004a7d7e0b756029ef2e4f6af6f41","amp;dn":"Bad+Things+-+Bad+Things+%28Deluxe%29+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50e380f5308004a7d7e0b756029ef2e4f6af6f41","infoHashBuffer":{"type":"Buffer","data":[80,227,128,245,48,128,4,167,215,224,183,86,2,158,242,228,246,175,111,65]},"announce":[],"urlList":[]}}