{"title":"Paul Rodgers - Muddy Water Blues (1993) [Blues][mp3 320][h33t][s","uid":4934104,"size":158734161,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:513c16f4d7ed9d36ae1c836c1ea5e3ea4b7cdb7a&amp;dn=Paul+Rodgers+-+Muddy+Water+Blues+%281993%29+%5BBlues%5D%5Bmp3+320%5D%5Bh33t%5D%5Bs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":20,"time":1244168989,"description":"Paul Rodgers - Muddy Water Blues \nAudio CD: October 8, 2002 \nLabel: Red Int / Red Ink\nBitrate: 320 kbps \n\nWhen it comes to rock vocalists, there aren't many that can top Paul Rodgers. His voice is one of the most recognizable around, and despite the number of years he's been in the business, he still sounds great. Back in 1993, he released a collection of blues covers, entitled Muddy Water Blues, featuring an all-star cast of rock and blues guitarists. David Gilmour, Buddy Guy and several others all appeared on various cuts. The title track went on to earn Rodgers a Grammy nomination. \nUnfortunately, the CD's original label, Victory Records, went belly-up shortly after its release and the CD was sadly out of print for years. Finally, after all these years, this stellar disc is available once again. These songs are some of the best known blues classic around. &quot;Hoochie Coochie Man&quot; (featuring Steve Miller), &quot;Born Under a Bad Sign&quot; (featuring Neal Schon), and &quot;I Just Want to Make Love to You&quot; (featuring Jeff Beck) are just a few of the tracks you'll find here. Whether you're a Rodgers fan, or you just like good rock and blues, this CD is a must-have addition to your collection. There's not a bad track in the bunch. ~ The Night Owl\n\nThis 1993 tribute to Muddy Waters concocted by Paul Rodgers does more than just honor the legacy of one of our founding fathers of American music - it also manages to kick up a whole boatload of fun. Teaming up the voice of Bad Company with an impressive lineup of axe wielders sure was a good idea! This record rocks and swaggers through most of it's 65:52 running time. However, blues purists beware: This is NOT a collection of note-for-note covers of some of Muddy's greatest tunes.  And therein lies the beauty.  Instead of a sterile reading of old blues classics, the boys on this disk inject their own styles and personalities into each song, sometimes with stunning results.  Jeff Beck takes top honors here with his three incredible cuts, bending, twisting and stretching these classics as only he can. David Gilmour takes a very close second with a searing version of the slow blues, Standing Around Crying. Here's how things measure up:\nMuddy Water Blues acoustic (Buddy Guy) - Buddy Guy fans might be a bit disappointed due to Buddy's low key approach.  Known for his manic and dynamic playing, this mostly acoustic tune is just lightly adorned with Guy's very bare-boned electric tone. There's no mistaking that scattered phrasing of his, but as you're waiting for things to take off, the song ends.\n\nIf you're considering this CD, it's important to understand what kind of tribute album this is.  I think Paul's intent was to show Muddy's influence by featuring his music in more contemporary settings.  Rockers and guitar geeks (such as myself) will love this, while blues purists will cut their own throats with the disk. This is a fun album and should be taken in that spirit. ~ Jeff Beck and David Glmour - 'nuff said??\n\nPaul Rodgers - Muddy Water Blues Tracks:\n01  Muddy Water Blues (Acoustic Version)  \n02  Louisiana Blues  \n03  Can't Be Satisfied  \n04  Rollin' Stone  \n05  Good Morning Little School Girl (Part 1)  \n06  I'm Your Hoochie Coochie Man  \n07  She's Alright  \n08  Standing Around Crying  \n09  The Hunter  \n10  She Moves Me  \n11  I'm Ready  \n12  I Just Want To Make Love To You  \n13  Born Under A Bad Sign  \n14  Good Morning Little School Girl (Part 2)  \n15  Muddy Water Blues (Electric Version)  \n\n02\nLouisiana Blues (Trevor Rabin) - This is full on rock with Rabin's heavily processed sound and finger taps making it quite clear that this is NOT going to be a blues album.\n\n03\nI Can't Be Satisfied (Brian Setzer) - Great rockabilly style intro (and outro) as only Brian can deliver. The solo is full of his trademark Gretsch bar dips and slippery single note lines. Good stuff.\n\n04\nRollin' Stone (Jeff Beck) - Rodger's impassioned voice mixing with Jeff's unbelievable guitar playing is just a jaw dropping delight. It leaves you wondering &quot;how the heck did he do that??&quot;. Because this is Jeff Beck, stupid.\n\n05\nGood Morning Little School Girl Part I (Jeff Beck) - After these sessions Beck remarked how much it reminded him of his Truth days with Rod Stewart. I can definitely see why Jeff wanted to do the whole album! His enthusiasm jumps from your speakers.\n\n06\nI'm Your Hoochie Coochie Man (Steve Miller) - My apologies to Steve Miller fans out there, but this cut is rather luke warm. Jimmie Woods' harmonica seems more featured than Steve's playing.\n\n07\nShe's Alright (Trevor Rabin) - Another rocker very much in the same vein as Rabin's last cut. Certainly energetic and enthusiastic (Is there a pedal this guy DOESN'T own??). \n\n08\nStanding Around Crying (David Gilmour) - Scorching slow blues by the man in Pink. A stratocaster with a nice touch of gain and some delay makes for a raw and nasty tone...at least in Gilmour's hands. Squealing bends, singing vibrato, subtle feedback....noone makes a guitar cry like David Gilmour.\n\n09\nThe Hunter (Slash) - This is a great rocking vehicle for Slash's down-n-dirty guitar style. He and Rodgers were clearly having a blast.\n\n10\nShe Moves Me (Gary Moore) - There isn't a Les Paul tone on earth like Gary Moore's. I swear that guitar was made just for him. This cut is just a tiny taste of what can be found on Moore's Still Got The Blues, After Hours, or the ultimate tribute album Blues For Greeny.\n\n11\nI'm Ready (Brian May) - A bouncy tune that features some of Brian's wall-of-guitars sound as well as Jimmie Woods' harmonica. Unfortunately just a mediocre cut. \n\n12\nI Just Want To Make Love To You (Jeff Beck) - Holy Bajeezus this guy has tone. This is the heaviest version of this tune I've ever heard. No other even comes close. \n\n13\nBorn Under A Bad Sign (Neal Schon) - Another heavily processed guitar sound that fits this updated version well. Schon chops his way through the solo nicely.\n\n14\nGood Morning Little School Girl Part II (Richie Sambora) - He may not be Jeff Beck but he can rock. Great tone and a great energetic reading of this tune.\n\n15\nMuddy Water Blues electric (Neal Schon) - Basically the opening song extended with Schon soloing this time.","torrent":{"xt":"urn:btih:513c16f4d7ed9d36ae1c836c1ea5e3ea4b7cdb7a","amp;dn":"Paul+Rodgers+-+Muddy+Water+Blues+%281993%29+%5BBlues%5D%5Bmp3+320%5D%5Bh33t%5D%5Bs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"513c16f4d7ed9d36ae1c836c1ea5e3ea4b7cdb7a","infoHashBuffer":{"type":"Buffer","data":[81,60,22,244,215,237,157,54,174,28,131,108,30,165,227,234,75,124,219,122]},"announce":[],"urlList":[]}}