{"title":"Carlos Libedinsky - Narcotango [FLAC]  + covers","uid":4532957,"size":284327552,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:514fb69ee557d14bea16ac521d6110ff261917f5&amp;dn=Carlos+Libedinsky+-+Narcotango+%5BFLAC%5D++%2B+covers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Willy_B","files":-1,"time":1227629734,"description":"NARCOTANGO is a deep embrace between tango and the electronic music atmosphere of our time.\n\n&quot;At the hour when there are only a few couples left on the dance floor,\nmagic sneaks (or 'creeps') into the milonga, and I watch peopledancing \nand experimenting with a new kind of tango dance,\nwhen my body is exhausted from dancing for hours and I don't want the night to end,\nat that hour NARCOTANGO was born. It was then that I could imagine\nthe music that I wanted to dance to, and to see others dance to.\nAt that moment the narcotic power of tango takes over and confirms, once again,\nthat I have entered a universe inside of me that is hard to leave, because like a drug,\ntango generates an incredible, sensual and powerful addiction.&quot;\n\n\n                                               Carlos Libedinsky\n\n\nThis is first disk of project &quot;Narcotango&quot;. Actually I can't describe this music. It's not tango in classic view. It's more rhythmic: more drums &amp; electronic. \nI'm waiting for third album of this band.\n\nMore information, pictures, videos at http://www.carloslibedinsky.com/\n\nAll pictures in booklet is 300 pixels/inch. Disk wasn't legal, so covers are not high quality ;) Sorry for that, but it's very hard to find this kind of music on legal CD's in our city...\nAll tracks are separate &amp; with tags. Ripped by EAC.\nIf you want to burn this CD, you can download cole2K nero audio plugin (google helps you), or use alcohol, EAC  etc. \nI can't seed all the time, but I'll seed every night, till someone downloads. Just wait. I'll be hapy if you seed few days after download.\nIf you think you want somethig else, just tell me here.\n\nP.S. Sorry for my bad english. I'm russian.","torrent":{"xt":"urn:btih:514fb69ee557d14bea16ac521d6110ff261917f5","amp;dn":"Carlos+Libedinsky+-+Narcotango+%5BFLAC%5D++%2B+covers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"514fb69ee557d14bea16ac521d6110ff261917f5","infoHashBuffer":{"type":"Buffer","data":[81,79,182,158,229,87,209,75,234,22,172,82,29,97,16,255,38,25,23,245]},"announce":[],"urlList":[]}}