{"title":"Kate Bush- The Line, the Cross and the Curve","uid":5715447,"size":2634031970,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:51aa79937c19b9aafa762c197273b5af4357b17f&amp;dn=Kate+Bush-+The+Line%2C+the+Cross+and+the+Curve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":11,"time":1280074665,"description":"Direct rip from original retail VHS (rental).\nAlso includes an MP4 version for easy viewing on an MP4 player and Quicktime.\nMenu and subtitles (song titles only).\n\nFrom Wikipedia, the free encyclopedia:\nThe Line, The Cross and the Curve\n\nDirected by \tKate Bush\nProduced by \tMargarita Doyle\nWritten by \tKate Bush\nStarring \t\tKate Bush\n\t\tMiranda Richardson\n\t\tLindsay Kemp\nMusic by \tKate Bush\nCinematography \tRoger Pratt\nEditing by \tJulian Rodd\nRelease date(s) \tNovember 13, 1993\nRunning time \t43 min.\nLanguage \tEnglish\n\n\nThe Line, the Cross, and the Curve is a musical short film directed by and starring pop singer Kate Bush. Released in 1993, it co-starred Miranda Richardson and noted choreographer Lindsay Kemp.\n\nThis short film is essentially an extended music video featuring songs from Bush's 1993 album, The Red Shoes, which in turn was inspired by the classic movie musical-fantasy The Red Shoes.\n\nIn this version of the tale, Bush plays a frustrated singer-dancer who is enticed by a mysterious woman (Richardson) into putting on a pair of magical ballet slippers. Once on her feet, the shoes start dancing on their own and Bush's character (who is never referred to by name) finds herself in a magical and psychedelic wonderland. Her guide on this strange journey is played by Lindsay Kemp, who in real life was Bush's dancing mentor.\n\nThe film was released direct-to-video in most areas and was only a modest success. Soon after its release, Bush effectively dropped out of the public eye. Her eighth studio album, Aerial, was released in November of 2005.\n\n Song listing\n\n   1. Rubberband Girl\n   2. And So is Love\n   3. The Red Shoes\n   4. Lily\n   5. Moments of Pleasure\n   6. Eat the Music\n\nAll songs apart from &quot;Lily&quot; (the rest were singles) were also used on their own as music videos to promote The Red Shoes album. &quot;Eat the Music&quot; was released as a music video in the U.S., differing slightly from the version featured in the film. The &quot;Rubberband Girl&quot; and &quot;Moments of Pleasure&quot; clips were available on The Whole Story '94 video CD which also featured videos from the albums The Whole Story and The Sensual World.","torrent":{"xt":"urn:btih:51aa79937c19b9aafa762c197273b5af4357b17f","amp;dn":"Kate+Bush-+The+Line%2C+the+Cross+and+the+Curve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51aa79937c19b9aafa762c197273b5af4357b17f","infoHashBuffer":{"type":"Buffer","data":[81,170,121,147,124,25,185,170,250,118,44,25,114,115,181,175,67,87,177,127]},"announce":[],"urlList":[]}}