{"title":"Black Rainbow (Xvid) DVD-Rip","uid":4095468,"size":1481487606,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:520d0d3b1d0c77c2aba44eed11f8150c02aca947&amp;dn=Black+Rainbow+%28Xvid%29+DVD-Rip+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"circlensess","files":2,"time":1206294693,"description":"Plot Summary: Martha Travis is a medium who makes contact with spirits &quot;on the other side&quot; and connects them with their loved ones still alive... \n\nBlack Rainbow(Xvid)(Darkside_RG).avi (1.38 gigabyte)\n\nBlack Rainbow(Xvid)(DVD-Rip From NTSC)\n\nRelease Date: 3 October 1997 (USA)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0099143/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0099143/&lt;/a&gt;\n\n\n\nCast (Cast overview, first billed only)\t\n         Rosanna Arquette\t... \tMartha Travis\n\tJason Robards\t... \tWalter Travis\n\tTom Hulce\t... \tGary Wallace\n\tMark Joy\t... \tLloyd Harley\n\tRon Rosenthal\t... \tLieutenant Irving Weinberg\n\tJohn Bennes\t... \tTed Silas\n\tLinda Pierce\t... \tMary Kuron\n\tOlek Krupa\t... \tTom Kuron\n\tMarty Terry\t... \tMrs. Adams\n\tEd Grady\t... \tEditor, Geoff McBain (as Ed L. Grady)\n\tJon Thompson\t... \tJack Callow\n\tHelen Baldwin\t... \tEva Callow\n\tDarla N. Warner\t... \tShirley Harley\n\tChristopher L. Gray\t... \tChoirmaster\n\tLucy Williams\t... \tChoirlady\n\n\n\n\nA Confusing Film.\n\nA man named Gary Wallace (Tom Hulce) looked for a medium named Martha Travis (Rosanna Arquette) who disappeared after her father&amp;#039;s death. Gary found her living in the woods and he had been tracking this girl down for 10 years.This was confusing in the beginning because, you see her father alive! Weird. This movie began where it ended. Anyways, here&amp;#039;s the rest of the review:\n\nMartha worked at a church as a medium and she lived with her father named Walter Travis (Jason Robards) at a hotel. And that day, she saw a vision of a woman&amp;#039;s husband, her name was Mary Kuron (Linda Pierce). And her husband&amp;#039;s name was Tom (Olek Krupa) and Martha believed that he was dead! And when Mary returned home, he was okay until she went out of the lounge. Tom got shot while he was watching t.v. BIZARRE! \n\nAfter the incident, Martha and Walter went to go speak to a guy named Jack Callow (Jon Thompson) to discuss the incident. Fortunately, Jack&amp;#039;s wife Eva (Helen Boldwin) refused to say who Mary was with. That guy was the person who shot Mary&amp;#039;s Husband! He certainly was looking for TROUBLE!\n\nAgain, at the church. Martha said to a woman named Jacky Adams (Marty Terry) that her deceased friend had seen her husband, Bill. And then, she said to a woman that her brother named Louis is with his twin brother Jimmy, when in fact one of them was dead! And soon, Jacky believed that her husband Bill was dead.\n\nAnd not so soon, Martha was told to go because, everyone thought she was a witch. And when Wallis popped in to the church to see Martha, she had left. And he finally found her and he warned her about Tom Kuron&amp;#039;s murderer was going to kill her that evening. And that night, the murderer came after her while she was communicating to another person&amp;#039;s deceased love one. Martha shrieked, she told everyone in the church to run , gun shots went off, and everyone ran out like crazy people.\n\nAnd when Martha came home, her father took off with her the moment she came in! And the killer shot out of Martha&amp;#039;s room and he tried to shot Martha down the passage. But strangely, the bullets went through her and they killed her father! And followed by an investigator named Irving Weinberg (Ron Rosenthal) when he was coming out of the elevator. And when the killer came downstairs, he got shot and he went through a wood and glass door.\n\nAnd before Gary left the church, Martha told him that her father didn&amp;#039;t know that all this was not a dream. And she disappeared. And Wallace went back into the wood&amp;#039;s , to Martha&amp;#039;s house to find her. NOW! This was the strangest moment that I was talking about: A car that was seen stuck in a leaf pile was seen again and Martha&amp;#039;s house was totally shambled. And as you all knew....it was in the woods. Weird END!\n\n\n\n\n","torrent":{"xt":"urn:btih:520d0d3b1d0c77c2aba44eed11f8150c02aca947","amp;dn":"Black+Rainbow+%28Xvid%29+DVD-Rip+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"520d0d3b1d0c77c2aba44eed11f8150c02aca947","infoHashBuffer":{"type":"Buffer","data":[82,13,13,59,29,12,119,194,171,164,78,237,17,248,21,12,2,172,169,71]},"announce":[],"urlList":[]}}