{"title":"Noah Hawley - Before the Fall","uid":14886614,"size":375761126,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5218e865499c02b173bcdf86b749ee04ea90b0bf&amp;dn=Noah+Hawley+-+Before+the+Fall&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":38,"time":1465738652,"description":"From the Emmy, PEN, Peabody, Critics' Choice, and Golden Globe Award-winning creator of the TV show Fargo comes the thriller of the year. \r\n\r\n\r\n\r\nOn a foggy summer night, 11 people - 10 privileged, one down-on-his-luck painter - depart Martha's Vineyard on a private jet headed for New York. Sixteen minutes later the unthinkable happens: The plane plunges into the ocean. The only survivors are Scott Burroughs - the painter - and a four-year-old boy who is now the last remaining member of an immensely wealthy and powerful media mogul's family.\r\n\r\nWith chapters weaving between the aftermath of the crash and the backstories of the passengers and crew members - including a Wall Street titan and his wife, a Texan-born party boy just in from London, a young woman questioning her path in life, and a career pilot - the mystery surrounding the tragedy heightens. As the passengers' intrigues unravel, odd coincidences point to a conspiracy. Was it merely by dumb chance that so many influential people perished? Or was something far more sinister at work? Events soon threaten to spiral out of control in an escalating storm of media outrage and accusations. And while Scott struggles to cope with fame that borders on notoriety, the authorities scramble to salvage the truth from the wreckage.\r\n\r\nAmid pulse-quickening suspense, the fragile relationship between Scott and the young boy glows at the heart of this stunning novel, raising questions of fate, human nature, and the inextricable ties that bind us together.\r\n\r\n\r\n\r\n\r\n\r\nRead by Robert Petkoff\r\nFormat: MP3\r\nUnabridged","torrent":{"xt":"urn:btih:5218e865499c02b173bcdf86b749ee04ea90b0bf","amp;dn":"Noah+Hawley+-+Before+the+Fall","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5218e865499c02b173bcdf86b749ee04ea90b0bf","infoHashBuffer":{"type":"Buffer","data":[82,24,232,101,73,156,2,177,115,188,223,134,183,73,238,4,234,144,176,191]},"announce":[],"urlList":[]}}