{"title":"Louise Hay - Living Wisdom, Loving Life","uid":4362973,"size":42484194,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:52d8a245b3c3cee8b3c8aeb6002da5efd9582744&amp;dn=Louise+Hay+-+Living+Wisdom%2C+Loving+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"praeator","files":5,"time":1219764783,"description":"Living Wisdom, Loving Life!\nThis is a Day of Great Healing!\n\nIn this inspirational new mix of studio and live recordings, Louise offers a culmination of the life philosophy that she has developed and shared throughout her many years of writing and lecturing. Living Widosm, Loving Life will guide you into a celebration of living, showing you how to rejoice in the wisdom of your body and mind.\n\nLife is filled with learning experiences and periods of evolution. In this prgoram, Louise deals with the milestones and turning points in every person&amp;#039;s life - growing up, relationships, career, spirituality, the elder years, and death - and explores the fears and challenges associated with them.\nYou&amp;#039;ll learn how to:\n* Develop a strong spiritual connection with life.\n* Love your body both inside and out.\n* Raise self-esteem with positive self-talk and affirmations.\n* Build relationships by becoming warm and receptive to others.\n* Let go of fear and accept death as a natural part of life.\n* Celebrate and learn from the elders in your family and community.\n* Improve your work by loving what you do.\n* And much more.\n\nIn Living Wisdom, Loving Life, Louise Hay shatters the negative myths of our society: about our priorities, about our most lasting relationships and our most important work, about health and happiness, about changing the world, about aging and death.\n\nReleased from these misconceptions, we are empowered to pass through every stage in our development with love, joy, dignity, peace, and infinite wisdom - to fully appreciate and experience this thing called LIFE!.\n\nAbout the Author\nLouise L. Hay is a lecturer and teacher, founder of Hay House Publishing and the bestselling author of 27 books. Her books have been translated into 25 different languages and are available in 33 countries worldwide. Since beginning her career as a Science of Mind minister in 1981, she has assisted thousands of people in discovering and using the full potential of their own creative powers for personal growth and self-healing.","torrent":{"xt":"urn:btih:52d8a245b3c3cee8b3c8aeb6002da5efd9582744","amp;dn":"Louise+Hay+-+Living+Wisdom%2C+Loving+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52d8a245b3c3cee8b3c8aeb6002da5efd9582744","infoHashBuffer":{"type":"Buffer","data":[82,216,162,69,179,195,206,232,179,200,174,182,0,45,165,239,217,88,39,68]},"announce":[],"urlList":[]}}