{"title":"SCORE Xtra #13 (The Score Group) [DVDRip]","uid":8908515,"size":1247483802,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:53048f1da53e39865be62a511b4530df5b9a570a&amp;dn=SCORE+Xtra+%2313+%28The+Score+Group%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chkm8te","files":1,"time":1378963496,"description":"SCORE Xtra #13 (The Score Group) [DVDRip]\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=jeoip9qv6o8ndqqtnna1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=jeoip9qv6o8ndqqtnna1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=is41ql86o6m89u6b971l.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=is41ql86o6m89u6b971l.jpg&lt;/a&gt;\n\nPersia Monir, Rita Daniels, Demi La Rue, Joanna Storm, Shana DuPlae, Sunny Ray\n10 NATURAL STACKED GIRLS. OVER THREE HOURS OF XXX!\n\nSultry brunette Shione Cooper, wearing a blue bra, gives us a tit show with close-ups and oiling, then shows us how she likes to suck cock and get her meaty, big-lipped pussy fucked.\n\nChristy Marks, wearing a purple top with a push-up bra, is having a competition to see who can fuck her best. Big-dicked J-Mac stuffs her mouth, then fucks her every which way. In-between positions, Christy can't keep her mouth off his cock.\n\nSelena Castro's mechanic is trying to rip her off, so rather than letting him fuck her over, she fucks him over with her big tits and Latina pussy. She gives his cock a sloppy sucking, then bends over the hood of her car for a deep fucking while talking dirty all the way.\n\nBlack 'n' stacked Aileen Ghettman models her heavy FF-cup naturals in a sheer white top. Her videographer gets so turned on by her tit-bouncing and kneading and filthy talk that he whips out his cock and fucks her mouth, tits and hairy pussy.\n\nGerman blonde Lucy tells us about herself in her native language, then shows us how big-titted German girls like to fuck and suck. She ends up with a load of cum on her tits, then uses her face to wipe his cock dry.\n\nAlia Janine is a pole dancer in a skimpy bikini and no panties. She invites a customer to suck her tits, then she sucks his cock and balls on stage. He tears open her fishnets and fucks her up the pole before dropping his load on her tits.\n\nVoluptuous redhead Contessa Rose wants to be a model, so she makes sure she gets the job by modeling her big ass and shaved pussy, then sucking and fucking her prospective employer's cock right in his office.\n\nNewcomer Kitana Flores shows off her firm, perfectly shaped tits and big, round, firm ass before sucking cock and riding dick. We're treated to in-your-face views of her Latina booty while she's getting her pink cunt stuffed.\n\nBlonde Kali West tells us what we're going to see before getting her big, pliable tits played with and sucked. This lusty girl-next-door goes down for a heaping mouthful of dick, then gets her shaved pussy fucked hard.\n\nChica's big, brown tits and sexy ass look great in a skimpy yellow dress. This slim 'n' stacked teen newcomer from the Dominican Republic dances for us, then moves inside for some sucking, tit-fucking and pussy slamming.\n\nWe've got standards! What the other guys call busty, we call flat-chested! The smallest chick in this bunch is a DD-cup, they soar to an H-cup, so when they're sucking cock, their natural boobs are bouncing wildly, and when they're getting fucked, their tits are out of control, and our cameras are catching every jiggle. H-cup SCORE exclusive Christy Marks joins DDD-cup newcomer Chica, Euro slut Shione Cooper and seven more of your favorite naturals-including several first-timers-for wall-to-wall XXX action. What a big-tit cumfest!","torrent":{"xt":"urn:btih:53048f1da53e39865be62a511b4530df5b9a570a","amp;dn":"SCORE+Xtra+%2313+%28The+Score+Group%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53048f1da53e39865be62a511b4530df5b9a570a","infoHashBuffer":{"type":"Buffer","data":[83,4,143,29,165,62,57,134,91,230,42,81,27,69,48,223,91,154,87,10]},"announce":[],"urlList":[]}}