{"title":"Forgotten History: Captivating History Events that Have Been For","uid":14707959,"size":123515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5366fc77252cc9e307d93f2960832048f8c76a28&amp;dn=Forgotten+History%3A+Captivating+History+Events+that+Have+Been+For&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1464383572,"description":"Forgotten History: Captivating History Events that Have Been Forgotten (American History, Ancient Greece, Egypt)\r\n\r\n\r\n\r\nHistory Holds the Key to Understanding the Present\r\n\r\nDo you want to know when the first peace treaty came into play? \r\n\r\nWhat about the strange disappearances in the 1500s? \r\n\r\nDo we really know everything about WWI and WWII? \r\n\r\nWith history channels focusing predominantly on WWI and WWII, we are losing out on the rich history of the previous eras, not to mention some unknown events within the World Wars. This book holds the key to unlocking a world of forgotten events and moments. \r\n\r\nIn this book, you'll discover a variety of historical events covering the span from the turn of the common era through to WWII. Within this book is a record of events once forgotten or previously unknown that have helped shape history and the world we live in today. History holds the key to understanding the present. Our past explains where we have come from and where we are heading. Although humanity can determine the steps it will take in the future, history often shows us the cycles that humanity repeats. A wise student will see these cycles and learn from them in order to better shape the future. \r\n\r\nHow can we know our history and what shapes us if we have forgotten great historical events and occurrences? \r\n\r\nTo fully understand where we come from and what we have achieved, both great and devastating, we need a more holistic history book. This book attempts to fill in some of those blanks. The historical events listed in this book are not all that have been forgotten, but it is one step closer to fitting the missing puzzle pieces into our already grand puzzle. \r\n\r\nWithin this book's pages, you'll find the answers to these questions and more. Just some of the questions and topics covered include \r\n\r\nLate BC to Early AD Years\r\nThe Mysterious, the Unknown, and the Trivial\r\nThe busy time of the 1700s to the late 1800s\r\nThe busy time of the 1700s to the late 1800s\r\nRebellions and Revolutions (the 1700s to the late 1800s)\r\nThe Crimean War and WWI Happenings\r\nThe Forgotten History of WWII\r\nAnd much more!","torrent":{"xt":"urn:btih:5366fc77252cc9e307d93f2960832048f8c76a28","amp;dn":"Forgotten+History%3A+Captivating+History+Events+that+Have+Been+For","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5366fc77252cc9e307d93f2960832048f8c76a28","infoHashBuffer":{"type":"Buffer","data":[83,102,252,119,37,44,201,227,7,217,63,41,96,131,32,72,248,199,106,40]},"announce":[],"urlList":[]}}