{"title":"The God Delusion (&amp; The Virus of Faith) by Richard Dawkins","uid":4442612,"size":648060928,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:53e779c9e4ab63e8ee2961f181abfd3fad141c4d&amp;dn=The+God+Delusion+%28%26+The+Virus+of+Faith%29+by+Richard+Dawkins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FreedomLover","files":2,"time":1223895277,"description":"In this two-part TV series famous British scientist Richard Dawkins takes a closer look at Christianity and Islam and the belief systems behind them. How is it possible that in this scientific age people still believe in the rantings of ignorant desert nomads who lived 2000 years ago? What underpins such ignorance? How can anyone believe in the Bible as the word of God, although it has long been shown that it contains countless mistranslations and omissions. And how can anyone believe in a God despite the overwhelming evidence against such an entity both from an empirical point of view (studies have shown that prayer, for example, has NO effect whatsoever) and from a logical point of view (an all-powerful and all-compassionate god cannot exist for the existence of suffering is proof to the contrary). Explore the depths of ignorance in this riveting series with Richard Dawkins. Also read his books: The God Delusion, Unweaving the Rainbow, The Blind Watchmaker. Further reading: Why I am not a Christian (Bertrand Russell), God is not Great (Christopher Hitchens), Letter to a Christian Nation (Sam Harris).\n\nFor more imformation go to: http://richarddawkins.net/\n\n\nAlso watch famous British magician Derren Brown make a mockery of Christian and spiritualist beliefs in his shows 'Seance' and 'Messiah'.","torrent":{"xt":"urn:btih:53e779c9e4ab63e8ee2961f181abfd3fad141c4d","amp;dn":"The+God+Delusion+%28%26+The+Virus+of+Faith%29+by+Richard+Dawkins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53e779c9e4ab63e8ee2961f181abfd3fad141c4d","infoHashBuffer":{"type":"Buffer","data":[83,231,121,201,228,171,99,232,238,41,97,241,129,171,253,63,173,20,28,77]},"announce":[],"urlList":[]}}