{"title":"Jonah Hex + Appearances [ADULT]","uid":5236727,"size":4618281649,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:54049b3edf2c72f5937a8fdd599506dd57ddd84d&amp;dn=Jonah+Hex+%2B+Appearances+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1261569212,"description":"Jonah Woodson Hex is a Western comic book antihero created by writer John Albano and artist Tony DeZuniga and published by DC Comics. The right side of his face is horribly scarred. He was an officer for the Confederacy during the American Civil War, fought at Gettysburg and is normally shown wearing a tattered Confederate States Army jacket. Hex is surly and cynical, but bound by a personal code of honor to protect and avenge the innocent and is in many ways similar to Clint Eastwood's Man with No Name or The Outlaw Josey Wales. \n\nThe character first appeared in volume two of All-Star Western #10 (1972), which was renamed Weird Western Tales with its twelfth issue. Jonah Hex all but dominated the new title right up until issue #38, at which point Scalphunter took over the spotlight while Jonah moved into his own self-titled series, Jonah Hex, in 1977. The series lasted for 92 issues with Michael Fleisher as the main writer.\n\nJonah Hex was canceled during Crisis on Infinite Earths, but in the same year Jonah moved to a new eighteen-issue series titled Hex, also penned by Michael Fleisher. In a bizarre turn of events, he found that he had been transported to the 21st century and became somewhat of a post-apocalyptic warrior, reminiscent of Mad Max. The series had mediocre success in the United States but was critically acclaimed and well received in Great Britain, Italy, Spain, and Japan.\n\nThree Jonah Hex miniseries have been published under DC's Vertigo imprint. These series, written by Joe R. Lansdale and drawn by Tim Truman, fit more into the western-horror genre, as Hex interacts with zombies (&quot;Two-Gun Mojo&quot; #1-5, 1993), a Cthulhoid monster (&quot;Riders of the Worm and Such&quot; #1-5, 1995), and spirit people (&quot;Shadows West&quot; #1-3, 1999).\n\nIn November 2005, DC began a new monthly Jonah Hex series written by Justin Gray and Jimmy Palmiotti with interior art by Luke Ross. In assorted postings on their message board, Grey and Palmiotti have stated their intent to depict various adventures from across the full length of Hex's life and career. The main artistic difference is that the series is published without the external restraints of the Comics Code Authority which allows for harder edged stories without having to keep with the Vertigo imprint's dark fantasy themes. Famous Hex artist Tony DeZuniga has pencilled two issues of the book (#5 and #9) and may do more in the future. J. H. Williams III drew Jonah Hex #35 and has stated an interest in doing more, saying &quot;I certainly want to do more issues myself or even a graphic novel if the opportunity and schedule presented itself.&quot;  This pack contains the first 50 issues.\n\nIn 1998, a female character named Hex was introduced in the pages of Superboy. She first appears as a temperamental supermodel until an agent of the Agenda slices the right side of her face, at which point she started claiming to be Jonah Hex. She adopts his voice and manner of speaking, and displays his sharpshooting skills with a pistol. She has the ability to shoot &quot;psionic bullets&quot; from any kind of gun when in her &quot;Jonah Hex&quot; mode; otherwise she was powerless. It was hinted that the Agenda had either performed experiments on her or that she had been created by them; but nothing has been confirmed. She was last seen flying out of Cadmus riding atop Grokk, the Living Gargoyle.  Her appearances are also included in this pack.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:54049b3edf2c72f5937a8fdd599506dd57ddd84d","amp;dn":"Jonah+Hex+%2B+Appearances+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54049b3edf2c72f5937a8fdd599506dd57ddd84d","infoHashBuffer":{"type":"Buffer","data":[84,4,155,62,223,44,114,245,147,122,143,221,89,149,6,221,87,221,216,77]},"announce":[],"urlList":[]}}