{"title":"Sexually Broken--AJ Applegate shackled and blindfolded, facefuck","uid":9868022,"size":826156105,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5423d07a473a4e00c4d2e0f3546f536bac816a9a&amp;dn=Sexually+Broken--AJ+Applegate+shackled+and+blindfolded%2C+facefuck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1396384116,"description":"\nAJ Applegate shackled and blindfolded, facefucked with brutal challenging deepthroat, used hard! | AJ Applegate | Matt Williams\n\nMarch 31, 2014\n\n\nMP4 only.\n\n\nAJ Applegate is the perfect package. Blonde, toned and very very good at sucking dick. Just how we like them around here. Today we are going to going to put her throat training to the test. She has been out there sucking every dick in town, does she have what it takes to hang with Sexuallybroken? This is the major leagues.\n\nUsing a custom made wooden bondage device that binds her arms into a modified strappado and shackles her wrists down, AJ is starting to realize just how helpless she truly is. A leather blindfold reinforces the feeling. She can not see, she can not anticipate, all she can do is feel. In this case, feel the hard dick that walks up and owns her throat hole. The drool and deep back of the throat spit starts to flow out almost immediately, coating her perfect perky tits. Her rock hard nipples show just how much she likes being used like a piece of meat.\n\nRipping off the blindfold so that we can have those big blue eyes look up at us while we plow her mouth, we continue the pace. We seek total destruction. AJ will be unraveled by dick. Her bondage keeps her firmly in place, on her knees where she belongs. That dazed look in those eyes shows it is working. Bondage and dick are the magic combination to take sluts to their happy place of sexual subspace.\n\nPicking up the speed, we fully unleash. it is a tooth rattling facepounding, and her eyes rattle like a pinball machine on full tilt. Her makeup and hair are destroyed, her face coated with her own juices. It is throat training as only Sexuallybroken can deliver. AJ is blasted into orbit via dick. Throwing a vibrator on her just seals the deal. She cums, over and over, her sensitive pussy unable to escape. By the time we are done, she no longer remembers her own name... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_31aapplegate/SexuallyBroken-AJ-Applegate-Matt-Williams-AJ-Applegate-shackled-and-blindfolded-facefucked-with-brutal-challenging-deepthroat-used-hard.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_31aapplegate/SexuallyBroken-AJ-Applegate-Matt-Williams-AJ-Applegate-shackled-and-blindfolded-facefucked-with-brutal-challenging-deepthroat-used-hard.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:5423d07a473a4e00c4d2e0f3546f536bac816a9a","amp;dn":"Sexually+Broken--AJ+Applegate+shackled+and+blindfolded%2C+facefuck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5423d07a473a4e00c4d2e0f3546f536bac816a9a","infoHashBuffer":{"type":"Buffer","data":[84,35,208,122,71,58,78,0,196,210,224,243,84,111,83,107,172,129,106,154]},"announce":[],"urlList":[]}}