{"title":"The Audiophile's Project Sourcebook(ePUB,Retail){32Skulls}","uid":10931177,"size":15948114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:542da49aa8bd071f8425ed7b9ed5074c16a65c14&amp;dn=The+Audiophile%27s+Project+Sourcebook%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"32Skulls","files":-1,"time":1409405146,"description":"                    â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nBuild audio projects that produce great sound for far less than they cost in the store, with audio hobbyists' favorite writer Randy Slone. In &quot;The Audiophile's Project Sourcebook&quot;, Slone gives you - clear, illustrated schematics and instructions for high-quality, high-power electronic audio components that you can build at home; carefully constructed designs for virtually all standard high-end audio projects, backed by an author who answers his email; 8 power-amp designs that suit virtually any need; instructions for making your own inexpensive testing equipment; comprehensible explanations of the electronics at work in the projects you want to construct, spiced with humor and insight into the electronics hobbyist's process; and, complete parts lists.&quot;The Audiophile's Project Sourcebook&quot; is devoid of the hype, superstition, myths, and expensive fanaticism often associated with 'high-end' audio systems. It provides straightforward help in building and understanding top quality audio electronic projects that are based on solid science and produce fantastic sound! It includes: balanced input driver/receiver circuits; signal conditioning techniques; voltage amplifiers; preamps for home and stage; tone controls; passive and active filters; parametric filters; graphic equalizers; bi-amping and tri-amping filters; headphone amplifiers; power amplifiers; speaker protection systems; clip detection circuits; power supplies; delay circuits; level indicators; and, homem\n\n\nBy G. Randy Slone\nPublished by McGraw-Hill in 2001\nEPUB, Retail, 361 pages, English ","torrent":{"xt":"urn:btih:542da49aa8bd071f8425ed7b9ed5074c16a65c14","amp;dn":"The+Audiophile%27s+Project+Sourcebook%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"542da49aa8bd071f8425ed7b9ed5074c16a65c14","infoHashBuffer":{"type":"Buffer","data":[84,45,164,154,168,189,7,31,132,37,237,123,158,213,7,76,22,166,92,20]},"announce":[],"urlList":[]}}