{"title":"A Nation of Religions by Stephen Prothero (2006) [PDF]","uid":10593786,"size":3489992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54cfc6eb430214686a2b74847ab717abb88317d4&amp;dn=A+Nation+of+Religions+by+Stephen+Prothero+%282006%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405836475,"description":"Title: A Nation of Religions - The Politics of Pluralism in Multireligious America \nAuthor: Stephen Prothero\nCategory: Academic/Religion\nPublisher: The University of North Carolina Press; 1 edition (September 25, 2006)\nLanguage: English\nISBN-10: 0807830526\nISBN-13: 978-0807830529\n\nPromotional info/Publisher's summary - &quot;The United States has long been described as a nation of immigrants, but it is also a nation of religions in which Muslims and Methodists, Buddhists and Baptists live and work side by side. This book explores that nation of religions, focusing on how four recently arrived religious communities--Muslims, Buddhists, Hindus, and Sikhs--are shaping and, in turn, shaped by American values.\n\nFor a generation, scholars have been documenting how the landmark legislation that loosened immigration restrictions in 1965 catalyzed the development of the United States as &quot;a nation of Buddhists, Confucianists, and Taoists, as well as Christians,&quot; as Supreme Court Justice Tom Clark put it. The contributors to this volume take U.S. religious diversity not as a proposition to be proved but as the truism it has become. Essays address not whether the United States is a Christian or a multireligious nation--clearly, it is both--but how religious diversity is changing the public values, rites, and institutions of the nation and how those values, rites, and institutions are affecting religions centuries old yet relatively new in America. This conversation makes an important contribution to the intensifying public debate about the appropriate role of religion in American politics and society.\n\n\nContributors:\nIhsan Bagby, University of Kentucky \nCourtney Bender, Columbia University\nStephen Dawson, Forest, Virginia\nDavid Franz, University of Virginia\nHien Duc Do, San Jose State University\nJames Davison Hunter, University of Virginia\nPrema A. Kurien, Syracuse University\nGurinder Singh Mann, University of California, Santa Barbara\nVasudha Narayanan, University of Florida\nStephen Prothero, Boston University\nOmid Safi, Colgate University\nJennifer Snow, Pasadena, California\nRobert A. F. Thurman, Columbia University\nR. Stephen Warner, University of Illinois at Chicago\nDuncan Ryuken Williams, University of California, Berkeley&quot;\n\nReview:\n&quot;Enlarges the scholarly conversation about American religious pluralism and points to the importance of conducting that conversation across disciplines. . . . Extremely valuable and suggestive of additional future projects that place such comparisons at their center.&quot; -American Journal of Sociology\n\nThis is a scanned copy of the book in PDF format. The front cover image is also included. Please seed, and enjoy.","torrent":{"xt":"urn:btih:54cfc6eb430214686a2b74847ab717abb88317d4","amp;dn":"A+Nation+of+Religions+by+Stephen+Prothero+%282006%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54cfc6eb430214686a2b74847ab717abb88317d4","infoHashBuffer":{"type":"Buffer","data":[84,207,198,235,67,2,20,104,106,43,116,132,122,183,23,171,184,131,23,212]},"announce":[],"urlList":[]}}