{"title":"Boundinpublic------BiP-33186 Brian Bonds and Hayden Richards","uid":8951279,"size":758441836,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:55d8ed6193b48ddba6ae629e745b527283d001bd&amp;dn=Boundinpublic%5C------BiP-33186+Brian+Bonds+and+Hayden+Richards&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1379890053,"description":"REQUEST\n\n\nBoundinpublic  BiP-33186 Brian Bonds and Hayden Richards\n\n\nCock hungry whore cattle prodded and fucked at Dore Alley Street Fair\n\n\nWMV only.\n\nThe BIP crew have been entertaining the crowd at Dore Alley Street Fair and Brian Bonds is the center of attention. He's bound to the cross with his balls tied up as the doms carry him through the crowd. After an intense flogging scene to get the crowd going, Brian is suspended on a fence with a zipper going down his thighs. The crowd cheers him on as Brian takes a shock from the cattle prod before the zipper is ripped off his legs. The BIP crew takes the naked stud back to a sex shop to have their way with him. Brian's hands are bound with clamps on his nipples as the guys play with his cock, edging him as he begins to pre-cum. When Brian begs the guys to let him cum, he gets a heavy beating instead as Hayden Richards flogs him from front to back. Brian screams for mercy so the guys drag him to the back arcade, shoving their feet and cocks through the glory holes for Brian to swallow. Hayden gets so horny he stands the boy up and bends him over, ramming his big cock up Brian's tight hole as everyone watches. The guys have Brian crawl back to the front of the store where they gangbang him one more time before showering his face with cum. Brian finally blows his load onto Hayden's boot and licks up every last drop before the guys take him back out onto the streets. \n\nScreens                        \n &lt;a href=&quot;\nhttp://www.boundinpublic.com/site/shoot.jsp?shootId=33186&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.boundinpublic.com/site/shoot.jsp?shootId=33186&lt;/a&gt;\n\n11 000 uploads,12k here we come, and if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)    \n\n\nCheers  :-) ","torrent":{"xt":"urn:btih:55d8ed6193b48ddba6ae629e745b527283d001bd","amp;dn":"Boundinpublic%5C------BiP-33186+Brian+Bonds+and+Hayden+Richards","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d8ed6193b48ddba6ae629e745b527283d001bd","infoHashBuffer":{"type":"Buffer","data":[85,216,237,97,147,180,141,219,166,174,98,158,116,91,82,114,131,208,1,189]},"announce":[],"urlList":[]}}