{"title":"Head First Web Design","uid":4707798,"size":42337924,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:560e202dd65d415aa7acdfed4578d8bbde48a828&amp;dn=Head+First+Web+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1233919379,"description":"Want to know how to make your pages look beautiful, communicate your message effectively, guide visitors through your website with ease, and get everything approved by the accessibility and usability police at the same time? Head First Web Design is your ticket to mastering all of these complex topics, and understanding what's really going on in the world of web design.\n\nWhether you're building a personal blog or a corporate website, there's a lot more to web design than div's and CSS selectors, but what do you really need to know? With this book, you'll learn the secrets of designing effective, user-friendly sites, from customer requirements to hand-drawn storyboards all the way to finished HTML and CSS creations that offer an unforgettable online presence.\n\nYour time is way too valuable to waste struggling with new concepts. Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First Web Design uses a visually rich format specifically designed to take advantage of the way your brain really works.","torrent":{"xt":"urn:btih:560e202dd65d415aa7acdfed4578d8bbde48a828","amp;dn":"Head+First+Web+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"560e202dd65d415aa7acdfed4578d8bbde48a828","infoHashBuffer":{"type":"Buffer","data":[86,14,32,45,214,93,65,90,167,172,223,237,69,120,216,187,222,72,168,40]},"announce":[],"urlList":[]}}