{"title":"Red.Sweater.MarsEdit.v3.3.5.MacOSX.Incl.Keymaker-CORE.rar","uid":6775787,"size":6822802,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:56508d06e89369d6c42e852ea3bed4f502aa5324&amp;dn=Red.Sweater.MarsEdit.v3.3.5.MacOSX.Incl.Keymaker-CORE.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NanoG5","files":1,"time":1319723825,"description":"### Think Outside The Browser\n\nBrowser-based interfaces are slow, clumsy, and require you to be connected to the internet just to use them. Browsers are perfect for reading web content, but not so great for creating it.\n\nIf you're serious about your blog, you need a desktop blog editor. If you're lucky enough to have a Mac, nothing is more powerful or more elegant than MarsEdit.\n\n### Rich And HTML Text Editing\n\nWhether you love HTML or can't bear the sight of it, MarsEdit's editor will thrill you. If you prefer the best of both worlds, you can switch easily between the two.\n\n### Wildly Compatible\n\nWorks with WordPress, Blogger, Tumblr, Squarespace, TypePad, Movable Type and dozens more through standard MetaWeblog and AtomPub interfaces.\n\n### Perfect Previews\n\nBuild a template to match your blog, then let MarsEdit's live preview show you how your posts will look before you publish them. Use Markdown? MarsEdit will preview that, too.\n\n### Your Editor Or Ours\n\nCombine the power of MarsEdit with your favorite editor. Integrates cleanly with BBEdit, SubEthaEdit, TextMate, TextWrangler, and any editor that supports that ODBEditor suite.\n\n### Media At Your Fingertips\n\nQuickly scan your iPhoto, Aperture, Lightroom, or Flickr libraries, and insert images into your blog post with the click of a button.\n\n### Easy File Uploads\n\nUpload images and files directly to your blog, or attach them to a post for automatic upload-on-publish. MarsEdit will even resize them to suit your needs.\n\n### Re-Blog It!\n\nAdd our &quot;Blog This&quot; bookmarklet to your browser's button bar. Now when you discover something cool, you can start a new MarsEdit post with the click of a button.\n\n### Offline Freedom\n\nWrite when you want to, without an internet connection. Fine-tune your masterpiece on the boat, plane, or train, and publish when you get back online.","torrent":{"xt":"urn:btih:56508d06e89369d6c42e852ea3bed4f502aa5324","amp;dn":"Red.Sweater.MarsEdit.v3.3.5.MacOSX.Incl.Keymaker-CORE.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56508d06e89369d6c42e852ea3bed4f502aa5324","infoHashBuffer":{"type":"Buffer","data":[86,80,141,6,232,147,105,214,196,46,133,46,163,190,212,245,2,170,83,36]},"announce":[],"urlList":[]}}