{"title":"Leatherheads(multi Subs)(2Lions-Team)","uid":5321201,"size":4684400898,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:569e5cbc94dd16ea13aa4fbc7f71726ba490f8a6&amp;dn=Leatherheads%28multi+Subs%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1264868344,"description":"Leatherheads  2008\n\nVerenigde Staten\nKomedie / Drama\n114 minuten\n\ngeregisseerd door George Clooney\nmet George Clooney, John Krasinski en RenÃƒÂ©e Zellweger\n\nDodge Connolly is in 1925 al een wat oudere footballheld van weleer, die vastbesloten is zijn team van hun wekelijkse bargevechten naar volle stadions te loodsen. Maar dan verliezen ze hun sponsor en de hele footballsport staat er niet best meer voor in de V.S. Dodge probeert als laatste redmiddel een jonge collegefootballer te verleiden zijn team te komen versterken en de sport weer aanzien te geven. Deze knappe jongeling, Carter Rutherford, is bovendien een oorlogsheld uit W.O.I, maar journaliste Lexie Littleton proeft gaten in zijn succesverhaal.\n\nEngels\n\nA romantic comedy set against the backdrop of America's nascent pro-football league in 1925. Dodge Connolly, a charming, brash football hero, is determined to guide his team from bar brawls to packed stadiums. But after the players lose their sponsor and the entire league faces certain collapse, Dodge convinces a college football star to join his ragtag ranks. The captain hopes his latest move will help the struggling sport finally capture the country's attention. Welcome to the team Carter Rutherford, America's favorite son. A golden-boy war hero who single-handedly forced multiple German soldiers to surrender in WWI, Carter has dashing good looks and unparalleled speed on the field. This new champ is almost too good to be true, and Lexie Littleton aims to prove that's the case. A cub journalist playing in the big leagues, Lexie is a spitfire newswoman who suspects there are holes in Carter's war story. But while she digs, the two teammates start to become serious off-field rivals for her fickle affections. As the new game of pro-football becomes less like the freewheeling sport he knew and loved, Dodge must both fight to keep his guys together and to get the girl of his dreams. Finding that love and football have a surprisingly similar playbook, however, he has one maneuver he will save just for the fourth quarter...\n\nWeblink http://amazon.imdb.com/title/tt0379865/\nWeblink http://www.moviemeter.nl/film/43628\n\nVideo          : DVD RIP\nAudio          : Engels German Polski Hungarian\nSubs           : Engels german Dansk Dutch Polski Arabic Finnish Hongarian Islandic Norwegian Zwedish Turkisk\nID             : 0xE0\nFormat         : MPEG Video\nFormat version :  Version 2\nBit rate mode  :  Variable\nWidth          :  720 pixels\nHeight         :  576 pixels\nDisplay aspect ratio  : 16:9\nFrame rate     :  25.000 fps\nStandard       : PAL\nCover          : Yes\nMenu           :  Yes\nExtra          :  Yes\n\n***************************************** \n\nBrought to you by Juultje\n\n\n2Lions Team \n\n          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n \n \n \n","torrent":{"xt":"urn:btih:569e5cbc94dd16ea13aa4fbc7f71726ba490f8a6","amp;dn":"Leatherheads%28multi+Subs%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"569e5cbc94dd16ea13aa4fbc7f71726ba490f8a6","infoHashBuffer":{"type":"Buffer","data":[86,158,92,188,148,221,22,234,19,170,79,188,127,113,114,107,164,144,248,166]},"announce":[],"urlList":[]}}