{"title":"Mp3 Tag Editor","uid":7055347,"size":2452400,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:56b997b4e0884a3a21bc2008b8059fe02d726024&amp;dn=Mp3+Tag+Editor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"talktothehand","files":1,"time":1330088894,"description":"Mp3tag is a powerful and yet easy-to-use tool to edit metadata of common audio formats where it supports ID3v1, ID3v2.3, ID3v2.4, iTunes MP4, WMA, Vorbis Comments and APE Tags.\n\nIt can rename files based on the tag information, replace characters or words in tags and filenames, import/export tag information, create playlists and more.\n\nMp3tag supports online database lookups from, e.g., Amazon, discogs, or freedb, allowing you to automatically gather proper tags and cover art for your music library.\n\nMp3tag supports the following audio formats:\nAdvanced Audio Coding (aac)\nFree Lossless Audio Codec (flac)\nMonkey\\'s Audio (ape)\nMpeg Layer 3 (mp3)\nMPEG-4 (mp4 / m4a / m4b / iTunes compatible)\nMusepack (mpc)\nOgg Vorbis (ogg)\nOptimFROG (ofr)\nOptimFROG DualStream (ofs)\nSpeex (spx)\nTom\\'s Audio Kompressor (tak)\nTrue Audio (tta)\nWindows Media Audio (wma)\nWavPack (wv)\n\nMain features:\n\nBatch Tag Editing: Write ID3v1.1, ID3v2.3, ID3v2.4, MP4, WMA, APEv2 Tags and Vorbis Comments to multiple files at once.\n\nSupport for Cover Art: Download and add album covers to your files and make your library even more shiny.\n\nImport from Amazon, discogs, freedb, MusicBrainz: Save typing and import tags from online databases like Amazon, discogs, freedb, MusicBrainz, and more.\n\nReplace characters or words: Replace strings in tags and filenames (with support for Regular Expressions).\n\nCreate Playlists automatically: Create and manage playlists automatically while editing.\n\nRename files from tags: Rename files based on the tag information and import tags from filenames.\n\nExport to HTML, RTF, CSV: Generate nice reports and lists of your collection based on user-defined templates.\n\nFull Unicode Support: User-interface and tagging are fully Unicode compliant.\n\nBesides these main features Mp3tag offers a variety of other functions and features ranging ranging from batch export of embedded album covers, over support for iTunes-specific tags like media type or TV Show settings, to combining multiple actions into groups that can be applied with a single mouse click.","torrent":{"xt":"urn:btih:56b997b4e0884a3a21bc2008b8059fe02d726024","amp;dn":"Mp3+Tag+Editor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56b997b4e0884a3a21bc2008b8059fe02d726024","infoHashBuffer":{"type":"Buffer","data":[86,185,151,180,224,136,74,58,33,188,32,8,184,5,159,224,45,114,96,36]},"announce":[],"urlList":[]}}