{"title":"Doctor Who - Season 11 - (1973-74) - 26 Episodes","uid":9100252,"size":4886094994,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:56cd3d600f5c7332309c901f387d155b582d1385&amp;dn=Doctor+Who+-+Season+11+-+%281973-74%29+-+26+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bnaron","files":26,"time":1382758013,"description":"The eleventh season of British science fiction television series Doctor Who began on 15 December 1973 with the serial The Time Warrior, and ended with Jon Pertwee's final serial Planet of the Spiders. Jon Pertwee makes his final appearance as the Third Doctor in Planet of the Spiders (although he would reprise the role in 1983 in The Five Doctors, a special episode made to commemorate the 20th anniversary of the program). Elisabeth Sladen makes her first appearance as Sarah Jane Smith in The Time Warrior. Nicholas Courtney and John Levene continue their roles of Brigadier Lethbridge-Stewart and Sergeant Benton, while Richard Franklin makes his final regular appearance as Captain Yates in Planet of the Spiders. Alan Bennion makes his third of three appearances in the series. In this, his final appearance (to date), he portrays Lord Azaxyr in The Monster of Peladon.\n\nThis season oversaw the new logo that would be used nearly throughout the fourth Doctor's era, as well as the new companion Sarah Jane Smith and the alien race, the Sontarans.\n\n1.  The Time Warrior - Four Episodes\n\n    Synopsis: In the Middle Ages, a rabble of criminals find the crashed\n    spaceship of a Sontaran warrior. Meanwhile the Doctor is investigating\n    the disappearance of several scientists from a top secret research complex. \n\n2.  Invasion of the Dinosaurs - Six Episodes\n\n    Synopsis: The Doctor and Sarah arrive in 1970s London to find that it has\n    been evacuated due to the mysterious appearance of dinosaurs.  \n\n3.  Death to the Daleks - Four Episodes\n\n    Synopsis: Travelling through space, the TARDIS suffers an energy drain and\n    crash-lands on the planet Exxilon.  \n\n4.  The Monster of Peladon - Six Episodes\n\n    Synopsis: The Third Doctor returns to Peladon, where once again the sacred\n    beast Aggedor casts its shadow. \n\n5.  Planet of the Spiders - Six Episodes\n\n    Synopsis: Mysterious goings-on at a meditation retreat run by Tibetan monks\n    are linked to the blue planet Metebelis III, and a colony of monstrous,\n    evolved spiders.\n \n","torrent":{"xt":"urn:btih:56cd3d600f5c7332309c901f387d155b582d1385","amp;dn":"Doctor+Who+-+Season+11+-+%281973-74%29+-+26+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56cd3d600f5c7332309c901f387d155b582d1385","infoHashBuffer":{"type":"Buffer","data":[86,205,61,96,15,92,115,50,48,156,144,31,56,125,21,91,88,45,19,133]},"announce":[],"urlList":[]}}