{"title":"Mesopotamia - The Mighty Kings (History Art Ebook).pdf","uid":10496249,"size":49193796,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:571f9ddb6b65552c8d968141901d06f869ae3072&amp;dn=Mesopotamia+-+The+Mighty+Kings+%28History+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1404642777,"description":"Pdf / English / 1995 Time-Life / 168 pag / 47 MB\n\nThis handsomely illustrated book spans the history and culture of ancient Mesopotamia during the last two millennia B.C.-from the rise of Hammurabi to the conquest of Babylon in 539 B.C.-with emphasis on the archaeological evidence. The stories of the Babylonian and Assyrian empires, along with the history of their excavation, are told in well-written style threaded through with quotations from ancient texts and data from excavators themselves. More recently acquired information from sites dug over the last 30 years right up to 1990 adds to the value of this work. While the lavish format will capture any reader's interest, the target audience, 12 years to adult, will in most cases need more background reading before they can assimilate the contents. Thus, it is unfortunate that there are no cross references to an earlier volume in this series, Sumer: Cities of Eden (Time-Life, dist. by Silver Burdett, 1993). This problem is especially evident with regard to the history of cuneiform writing, which is underrepresented here. Readers are advised to read the earlier book in the series first. For history collections.\nJoan Gartland, Detroit P.L. ","torrent":{"xt":"urn:btih:571f9ddb6b65552c8d968141901d06f869ae3072","amp;dn":"Mesopotamia+-+The+Mighty+Kings+%28History+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"571f9ddb6b65552c8d968141901d06f869ae3072","infoHashBuffer":{"type":"Buffer","data":[87,31,157,219,107,101,85,44,141,150,129,65,144,29,6,248,105,174,48,114]},"announce":[],"urlList":[]}}