{"title":"The Emperor's New Religion - An Analysis of the Church of Sat","uid":4949481,"size":1780030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:575971107202a79632655cdaff1c00a8ab5ab378&amp;dn=The+Emperor%5C%27s+New+Religion+-+An+Analysis+of+the+Church+of+Sat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1244823404,"description":"The Church of Satan has caused outrage and extensive media attention since its inception as the boldest champion of Satan in the &quot;occult explosion&quot; peaking in the 1960es, and for better or for worse has become synonymous with modern Satanism. It asserts that Satanism is a unique philosophy distinctly tailored to man's life on Earth which, if followed, has the potential to increase the follower's earthly success.\n\nThis paper investigates the Church of Satan, its ideology, and its practices, and observes that the Church of Satan includes the same dynamics as can be observed in many other religions. In addition, the Church of Satan appears to deliberate mislead its members via conflicting policy statements and communication.\n\nThe paper concludes that the Church of Satan is a personality cult that seems to have less interest in maintaining an ideology than in gaining members, and that the Church of Satan may be no more than the invention of a skilled con artist who saw an unused opportunity.","torrent":{"xt":"urn:btih:575971107202a79632655cdaff1c00a8ab5ab378","amp;dn":"The+Emperor%5C%27s+New+Religion+-+An+Analysis+of+the+Church+of+Sat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"575971107202a79632655cdaff1c00a8ab5ab378","infoHashBuffer":{"type":"Buffer","data":[87,89,113,16,114,2,167,150,50,101,92,218,255,28,0,168,171,90,179,120]},"announce":[],"urlList":[]}}