{"title":"Vampire Weekend (2008) [24 bit FLAC] vinyl","uid":8873710,"size":682993996,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5777451369f883a88771212b2d04d4e1f30a87d8&amp;dn=Vampire+Weekend+%282008%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1378137918,"description":"\n  Vampire Weekend (2008) [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Indie Rock, Alternative\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  Side A\n\n  01 Mansard Roof \n  02 Oxford Comma \n  03 A-Punk \n  04 Cape Cod Kwassa Kwassa \n  05 M79 \n\n  Side B\n\n  01 Campus \n  02 Bryn \n  03 One (Blake's Got a New Face) \n  04 I Stand Corrected \n  05 Walcott \n  06 The Kids Don't Stand a Chance \n\n  With the Internet able to build up or tear down artists almost as soon as they start practicing, the advance word and intense scrutiny doesn't always do a band any favors. By the time they've got a full-length album ready to go, the trend-spotters are already several Hot New Bands past them. Vampire Weekend started generating buzz in 2006 -- not long after they formed -- but their self-titled debut album didn't arrive until early 2008. Vampire Weekend also has just a handful of songs that haven't been floating around the 'Net, which may disappoint the kind of people who like to post &quot;First!&quot; on message boards. This doesn't make those songs any less charming, however -- in fact, the band has spent the last year and a half making them even more charming, perfecting the culture collision of indie-, chamber-, and Afro-pop they call &quot;Upper West Side Soweto&quot; by making that unique hybrid of sounds feel completely effortless. So, Vampire Weekend ends up being a more or less official validation of the long-building buzz around the band, served up in packaging that uses the Futura typeface almost as stylishly as Wes Anderson. \n\n  At times, the album sounds like someone trying to turn a Wes Anderson movie back into music (it's no surprise that the band's keyboardist also writes film scores); there's a similarly precious yet adventurous feel here, as well as a kindred eye and ear for detail. Everything is concise, concentrated, distilled, vivid; Vampire Weekend's world is extremely specific and meticulously crafted, and Vampire Weekend often feels like a concept album about preppy guys who grew up with classical music and recently got really into world music. Amazingly, instead of being alienating, the band's quirks are utterly winning. Scholarly grammar (&quot;Oxford Comma&quot;) and architecture (&quot;Mansard Roof&quot;) are springboards for songs with impulsive melodies, tricky rhythms, and syncopated basslines. Strings and harpsichords brush up against African-inspired chants on &quot;M79,&quot; and lilting Afro-pop guitars and a skanking beat give way to Mellotrons on &quot;A-Punk.&quot; It's a given that a band that's this high concept has hyper-literate lyrics: the singer's name is the very writerly Ezra Koenig, and you almost expect to see footnotes in the album's liner notes. \n\n  Once again, though, Vampire Weekend's words are evocative instead of gimmicky. The irresistible &quot;Cape Cod Kwassa Kwassa&quot; rhymes &quot;Louis Vuitton&quot; with &quot;reggaeton&quot; and &quot;Benneton&quot; and name-drops Peter Gabriel (though it's clear the band spent more time with Paul Simon's Graceland) without feeling contrived. &quot;Campus&quot; is another standout, with lines like &quot;I see you walking across the campus...how am I supposed to pretend I never want to see you again?&quot; throwing listeners into college life no matter what their age. Koenig has a boyish, hopeful quality to his voice that completes Vampire Weekend, especially on bittersweet but irrepressible songs like &quot;I Stand Corrected&quot; and album closer &quot;The Kids Don't Stand a Chance.&quot; Fully realized debut albums like Vampire Weekend come along once in a great while, and these songs show that this band is smart, but not too smart for their own good.","torrent":{"xt":"urn:btih:5777451369f883a88771212b2d04d4e1f30a87d8","amp;dn":"Vampire+Weekend+%282008%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5777451369f883a88771212b2d04d4e1f30a87d8","infoHashBuffer":{"type":"Buffer","data":[87,119,69,19,105,248,131,168,135,113,33,43,45,4,212,225,243,10,135,216]},"announce":[],"urlList":[]}}