{"title":"The Red Green Show - Season 10","uid":5198580,"size":3867109924,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:57915bc0b45eb1b0406993852cbdced9158fe921&amp;dn=The+Red+Green+Show+-+Season+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"theanonymousentity","files":19,"time":1260042980,"description":"Season 10 of The Red Green Show, ripped from the 2000 season DVD set. This is the fourth of five seasons to be released on DVD.\n\nThis includes the following episodes:\n\n\nA Very Merry Red Green Christmas - 60 Minute Special\n\nSausage Envy - The boys do their wurst for the Possum Lake Sausage Carnival. \n\nFoster Child - Red learns that the Lodge has a foster child who's coming to spend the weekend with him.\n\nWhat A Dump - The Lodge proposes itself to the city of Toronto as an ideal place to dump garbage.\n\nWinston's Wedding - Winston needs Red's help in planning his wedding - he has everything except the bride.\n\nMan Of The Year - The guys at the Lodge nominate a man who doesn't exist, as Possum Lake's Man Of The Year, hoping to win a new fishing boat. \n\nSurvivor - A toxic cloud in the area forces Red to stay locked in the Lodge for a few days.\n\nHistoric Site - Red and Mike try to save the Lodge by having it declared a historical site. \n\nTwinning - Possum Lodge twins with the state of Iowa and Red stays back to host the 500 visiting Americans.\n\nLunar Eclipse - The men try to recapture their youth by watching a lunar eclipse together, just like they did thirty-five years ago.\n\nBarter Starter - Red, Dalton and Winston trade somewhat valuable items to each other for the weekend but it doesn't work out so well for Dalton. \n\nOut Of The Woods - Red and Ed trap a large animal roaming the woods at night.\n\nCheap Jeep - Red sends away for an army surplus jeep that shows up in kit form.\n\nDNA All The Way - A rich eccentric passes away and everyone tries to prove they're related to him.\n\nWho Wants To Be A Smart Guy - Dalton represents the Lodge as a contestant on a tv trivia game show.\n\nThe Beaver Dam - Possum Lake is rising because the beavers have built a dam across the river running out of it. \n\nThe Dandruff Foundation - The men find a charity for the Lodge to affiliate with as way of avoiding taxes and receiving government grants.\n\nDamn You Emu - Dalton starts an emu ranch and gets Red to help him out. \n\nNo Duct Tape - Everyone panics when the Lodge runs out of duct tape and the local hardware store is back-ordered. \n\n\nEnjoy and keep seeding!\t\t\n\n","torrent":{"xt":"urn:btih:57915bc0b45eb1b0406993852cbdced9158fe921","amp;dn":"The+Red+Green+Show+-+Season+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57915bc0b45eb1b0406993852cbdced9158fe921","infoHashBuffer":{"type":"Buffer","data":[87,145,91,192,180,94,177,176,64,105,147,133,44,189,206,217,21,143,233,33]},"announce":[],"urlList":[]}}