{"title":"Euro Sex Parties - Ohh Lucy - Lucy Heart [432] [mp4]","uid":7872226,"size":514735877,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:57b2655b84892e9ae4cb400e5fd54d3e5ac16360&amp;dn=Euro+Sex+Parties+-+Ohh+Lucy+-+Lucy+Heart+%5B432%5D+%5Bmp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"R0thschild","files":2,"time":1354239713,"description":"Gallery: \n &lt;a href=&quot;\nhttp://imagedomino.com/?g=745214&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagedomino.com/?g=745214&lt;/a&gt;\n\nLucy desperately needs to go sunbathing before a night of partying. Shs on holiday and doesnt know of any tanning salons in the area. Luckily for James and Chocky she walks into their friends salon. They are cleaning and actually shut down for the day, but once she gives a little peek at what she has under her clothes, they make an exception. After tanning Lucy is getting dressed when the man she met earlier at the counter checks in on her. Once he sees this beautiful blond in the buff, with her nice big, luscius tits and round, plump ass, he feels compelled to invite her out with him and his friends to party. Being new to the city and sweetened by how they generously stayed open, Lucy accepts the invite. Once back at the apartment the small talk doesnt last long. Choky playfully argues about how sexy Lucy really is. He says that maybe if she had less clothes on he could tell. Next thing you know Lucy is half naked, sucking James cock, and having her ass eaten my Chocky. From here it goes back and forth as James and Choky try Lucy on like multiple pairs of finger cuffs. Lucy really likes to party though and she doesnt stop here, nor does she seem a stranger to DP. She rides through like a champ until Choky blows his load in her ass. This is followed by James covering her face with his creamy sauce. It looks like Lucy found a proper place to party indeed.","torrent":{"xt":"urn:btih:57b2655b84892e9ae4cb400e5fd54d3e5ac16360","amp;dn":"Euro+Sex+Parties+-+Ohh+Lucy+-+Lucy+Heart+%5B432%5D+%5Bmp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57b2655b84892e9ae4cb400e5fd54d3e5ac16360","infoHashBuffer":{"type":"Buffer","data":[87,178,101,91,132,137,46,154,228,203,64,14,95,213,77,62,90,193,99,96]},"announce":[],"urlList":[]}}