{"title":"To Orbit and Back Again - How the Space Shuttle Flew in Space.pd","uid":10937815,"size":15164682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57b82b52139c3add960b0bb0aa02068ff26167cc&amp;dn=To+Orbit+and+Back+Again+-+How+the+Space+Shuttle+Flew+in+Space.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tmcnl","files":-1,"time":1409452802,"description":"To Orbit and Back Again: How the Space Shuttle Flew in Space \n\nby Davide Sivolella\n\n\nThe Space Shuttle has been the dominant machine in the U.S. space program for thirty years and has generated a great deal of interest among space enthusiasts and engineers. This book enables readers to understand its technical systems in greater depth than they have been able to do so before. \n\nThe author describes the structures and systems of the Space Shuttle, and then follows a typical mission, explaining how the structures and systems were used in the launch, orbital operations and the return to Earth. Details of how anomalous events were dealt with on individual missions are also provided, as are the recollections of those who built and flew the Shuttle. Many photographs and technical drawings illustrate how the Space Shuttle functions, avoiding the use of complicated technical jargon. \n\nThe book is divided into two sections: Part 1 describes each subsystem in a technical style, supported by diagrams, technical drawings, and photographs to enable a better understanding of the concepts. Part 2 examines different flight phases, from liftoff to landing. Technical material has been obtained from NASA as well as from other forums and specialists. \n\nAuthor Davide Sivolella is an aerospace engineer with a life-long interest in space and is ideally qualified to interpret technical manuals for a wider audience. This book provides comprehensive coverage of the topic including the evolution of given subsystems, reviewing the different configurations, and focusing on the solutions implemented.\n\nISBN-10: 1461409829\nISBN-13: 978-1461409823\n\n2014\nPDF","torrent":{"xt":"urn:btih:57b82b52139c3add960b0bb0aa02068ff26167cc","amp;dn":"To+Orbit+and+Back+Again+-+How+the+Space+Shuttle+Flew+in+Space.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57b82b52139c3add960b0bb0aa02068ff26167cc","infoHashBuffer":{"type":"Buffer","data":[87,184,43,82,19,156,58,221,150,11,11,176,170,2,6,143,242,97,103,204]},"announce":[],"urlList":[]}}