{"title":"Holy Ghost! - Dynamics (2013) [24 bit FLAC] vinyl","uid":9137390,"size":1061334611,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5823afcd44f744fd464d20045d57f14a97af100e&amp;dn=Holy+Ghost%21+-+Dynamics+%282013%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1383436537,"description":"\n  Holy Ghost! - Dynamics (2013) [24 bit FLAC] vinyl\n  \n  Genre: Electronic, Pop/Rock\n  Styles: Synthpop, New Wave\n  Source: vinyl \n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  01 Okay\n  02 Dumb Disco Ideas\n  03 Changing of the Guard\n  04 Dance a Little Closer\n  05 It Must Be the Weather\n  06 For Edgar\n  07 I Wanna Be Your Hand\n  08 Bridge and Tunnel\n  09 Don't Look Down\n  10 In the Red\n  11 Cheap Shots\n\n  Rip Info: (Not my rip)\n\n  &quot;This is a rip of the 2LP release of the second Holy Ghost! album, &quot;Dynamics&quot; (DFA2391), on pink vinyl. \n\n  Equipment used: Rega Planar 2 with the GrooveTracer subplatter and a modified RB300 tonearm that incorporates better cables (and a ground wire). I used a Denon DL-110 cartridge. The sound is routed through a Musical Fidelity X-LPS phono stage to an E-Mu 0202 USB ADC, and then to my laptop via USB.\n\n  24/96 was captured in Audacity and output as a single 24-bit WAV file. \n\n  Manual de-clicking was handled in Izotope RX Advanced. \n\n  I imported the 24-bit WAV file from RX Advanced back into Audacity, where I normalized the file (Remove any DC offset checked and normalize maximum amplitude to -0.1 dB), split the tracks and output the resulting files as 24/96 FLAC. I then cleaned up the tags in foobar2000.&quot;\n\n  Album Review\n\n  Dynamics could be considered the first proper album from Alex Frankel and Nick Millhiser, whose self-titled debut as Holy Ghost! -- part singles compilation, part standard album -- was made incrementally over several years. It's undoubtedly steadier and unified, built for beginning-to-end listening. Nothing is quite as momentous as earlier A-sides like &quot;Hold On&quot; or &quot;I Will Come Back,&quot; but the songs are more finely detailed and developed. It also sounds more like the work of a band than a production duo, due in part to more involvement from collaborators, such as Nancy Whang, who played the role of Shay Jones on the duo's 2011 cover of Ministry's &quot;I Wanted to Tell Her&quot;; she adds background vocals to half of the songs. Just as notably, Millhiser's choppy post-punk guitar is more prominent. \n\n  Two of the album's best songs are also the slowest, placed in the middle of the sequence. &quot;It Must Be the Weather&quot; confronts stunted adulthood pensively yet optimistically; even as an instrumental, it's among the most well-crafted modern synth pop, constantly shifting in shape throughout six frosty and entrancing minutes. &quot;I Wanna Be Your Hand,&quot; another highlight, is dreamier and more spaced-out than anything on the debut, and it has a drifting soft rock quality -- like America gone moody new wave -- that recalls Usher's &quot;Looking 4 Myself.&quot; (An Empire of the Sun coincidence/connection between the songs is too complex to explain here.) The duo's more energetic side shines, too. On &quot;Bridge and Tunnel,&quot; they're joined by a string section that features viola from Kelly Polar, and it's the closest the album gets to an &quot;I Will Come Back,&quot; with percolating electronics and wistful lyrics about New York City clubbing. &quot;Cheap Shots&quot; closes the album on a sonically rippling, lyrically zinging note, like they're ready to leave early adulthood -- but not their New Order records -- to the past.","torrent":{"xt":"urn:btih:5823afcd44f744fd464d20045d57f14a97af100e","amp;dn":"Holy+Ghost%21+-+Dynamics+%282013%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5823afcd44f744fd464d20045d57f14a97af100e","infoHashBuffer":{"type":"Buffer","data":[88,35,175,205,68,247,68,253,70,77,32,4,93,87,241,74,151,175,16,14]},"announce":[],"urlList":[]}}