{"title":"Generation Earth 1080p x264 [AClass]","uid":11866605,"size":2584452412,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:584adc5afcb3a7d763c20844aa9e723db880ae8a&amp;dn=Generation+Earth+1080p+x264+%5BAClass%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"akula941","files":3,"time":1430376944,"description":"Generation Earth is the story of our manmade world\n\n\n\nIn the last generation, we have changed the face of the Earth on a scale unimaginable to our ancestors. Generation Earth discovers how \n\nvillages in China have been transformed into cities of millions, the tallest building in the world dwarfs the skyscrapers of America, and we \n\nhave built a dam so big that it has changed the rotation of the planet.\n\n\nPart One: A Place to Live\n\nThe story of our manmade world In the last generation, we have changed the face of the Earth on a scale unimaginable to our ancestors. \n\nVillages in China have been transformed into cities of millions, the tallest building in the world dwarfs the skyscrapers of America, and we \n\nhave built a dam so big that it has changed the rotation of the planet.\n\nPart Two: The Way We Move\n\nLook at how, in the last generation, we have changed the face of the Earth on a scale unimaginable to our ancestors. Villages in China have \n\nbeen transformed into cities of millions, the tallest building in the world dwarfs the skyscrapers of America, and we have built a dam so big \n\nthat it has changed the rotation of the planet.\n\nPart Three: Food, Fire and Water\n\nAs the world population continues to grow, vital necessities such as food, water, and energy are becoming increasingly difficult to supply. \n\nModern-day engineering feats like to Hoover Dam and large greenhouses attempt to satisfy the demands on these important resources","torrent":{"xt":"urn:btih:584adc5afcb3a7d763c20844aa9e723db880ae8a","amp;dn":"Generation+Earth+1080p+x264+%5BAClass%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"584adc5afcb3a7d763c20844aa9e723db880ae8a","infoHashBuffer":{"type":"Buffer","data":[88,74,220,90,252,179,167,215,99,194,8,68,170,158,114,61,184,128,174,138]},"announce":[],"urlList":[]}}