{"title":"I Drink For a Reason by David Cross - insane86","uid":6141171,"size":3015143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:598d2f55c3eb1642812e3b4b25f79df2ad0b3cdf&amp;dn=I+Drink+For+a+Reason+by+David+Cross+-+insane86&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"insane86","files":6,"time":1296503882,"description":"I Drink for a Reason\n\nAuthor(s): David Cross\n\nPublisher: Grand Central Publishing\n\nDate : 2010\n\nPages : 319 In PDF Format\n\nFormat : PDF, RTF, Epub, LIT, LRF, Mobi\n\nLanguage : English\n\nISBN-10 : 0446697710\n\nISBN-13 : 978-0446697712\n\nDescription:\n\nAfter a decade spent in isolation in the Ugandan jungles thinking about stuff, David Cross has written his first book. Known for roles on the small screen such as never-nude Tobias Funke on Arrested Development and the role of David in Mr. Show With Bob And David, as well as a hugely successful stand-up routine full of sharp-tongued rants and rages, Cross has carved out his place in American comedy. Whether deflating the pomposity of religious figures, calling out the pathetic symbiosis of pseudo-celebrity and its leaching fandom, or merely pushing the buttons of the way-too-easily offended P.C. left or the caustic, double-standard of the callous (but funnier) right, Cross has something to say about everyone, including his own ridiculous self.\n\nNow, for the first time, Cross is weaving his media mockery, celebrity denunciation, religious commentary and sheer madness into book form, revealing the true story behind his almost existential distaste of Jim Belushi (The Belush), disclosing the up-to-now unpublished minutes to a meeting of Fox television network executives, and offering up a brutally grotesque run-in with Bill OReilly. And as if this wasnt enough for your laughing pleasure in these troubled times, some of the pieces splinter off with additional material being created online in exclusive video and animated web content created solely for the book-a historical first (presumably)!\n\nWith a mix of personal essays, satirical fiction posing as truth, advice for rich people, information from Americas least favorite Rabbi and a top-ten list of top-ten lists, I DRINK FOR A REASON is as unique as the comedian himself, and cannot be missed.\n\nMy other torrents:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/insane86&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/insane86&lt;/a&gt;","torrent":{"xt":"urn:btih:598d2f55c3eb1642812e3b4b25f79df2ad0b3cdf","amp;dn":"I+Drink+For+a+Reason+by+David+Cross+-+insane86","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"598d2f55c3eb1642812e3b4b25f79df2ad0b3cdf","infoHashBuffer":{"type":"Buffer","data":[89,141,47,85,195,235,22,66,129,46,59,75,37,247,157,242,173,11,60,223]},"announce":[],"urlList":[]}}