{"title":"Micro- and Nanotechnology for Neurotology - Fan-Gang Zeng","uid":15512548,"size":4080027,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a198770e158aca29bbef64bcea70ed528dfba06&amp;dn=Micro-+and+Nanotechnology+for+Neurotology+-+Fan-Gang+Zeng&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470670837,"description":"Micro- and Nanotechnology for Neurotology - Fan-Gang Zeng (Karger, 2006).pdf\r\n\r\nIntegrated circuits have revolutionized the way we live and work in the last five decades. Micro- and nanotechnologies may have the same impact in the future. The probably most amazing microelectromechanical system the nature built is the ear which, just to mention one of its many capacities, can sense vibrations as small as 0.5 n. Engineers do not only learn the operation principles from the ear, but also use them to improve their own technological development. Many functions can already be substituted by technical means. Microphones, electrodes, and gyroscopes for the next generation of hearing aids, cochlear and vestibular implants, as well as designed new protocols to deliver drugs and control nerve growth in the inner ear have already been developed. This special issue publishes studies that may have a considerable impact on the developments of audiology and neurotology in the near future. To audiologists, otologists, biomedical engineers, and neuroscientists who want to keep up to date with recent technological advances it is a must","torrent":{"xt":"urn:btih:5a198770e158aca29bbef64bcea70ed528dfba06","amp;dn":"Micro-+and+Nanotechnology+for+Neurotology+-+Fan-Gang+Zeng","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a198770e158aca29bbef64bcea70ed528dfba06","infoHashBuffer":{"type":"Buffer","data":[90,25,135,112,225,88,172,162,155,190,246,75,206,167,14,213,40,223,186,6]},"announce":[],"urlList":[]}}