{"title":"OReilly.Head.First.C.Sharp.Nov.2007.pdf","uid":4803053,"size":149094081,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5abcd1cfe903d8d71a282969b287401d2d85644a&amp;dn=OReilly.Head.First.C.Sharp.Nov.2007.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"massdale","files":-1,"time":1238103612,"description":"Do you want to learn C#? Programmers around the world have learned that C# lets them design great-looking programs and build them fast. With C#, you ve got a powerful programming language and a valuable tool at your fingertips. And with the Visual Studio IDE, you ll never have to spend hours writing obscure code just to get a button working. C#, Visual Studio and .NET take care of the grunt-work, and let you focus on the interesting parts of getting your programs written. Sound appealing?\n\nUnlike other C# books, which just show you examples and expect you to just memorize them and move on, Head First C# gets you writing code from the beginning. You're given the tools you need, and then you're guided through fun and engaging programming projects. You'll build programs to play a card game, explore a house, and help lazy programmers manage their sick day excuses. But it's not all fun and games: you'll build business applications too, like a contact database and a program to help a party planner estimate her dinner parties. You'll build a dungeon role-playing game and a fully animated, colorful simulation of a beehive. And by the end of the book, you'll build a fast-paced, full-featured retro Invaders arcade game.\n\nMake no mistake: by the time you're done with Head First C#, you'll be able to build full-scale, complex, and highly visual programs. And you'll have all of the C# tools you need to tackle almost any programming problem that comes your way.\n\nHead First C# is built for your brain, using the revolutionary approach that was pioneered by the highly acclaimed and popular Head First series. You'll never get that bored, &quot;eyes glazed over&quot; feeling from Head First C#, because it guides you through one challenging project after another until, by the end of the book, you're a C# rock star!\n\nHere's what you'll learn:\n\n    * Core C# programming concepts\n    * How to use the Visual Studio 2008 IDE to build, debug and run your programs\n    * Important .NET 3.5 features, including generic collections, Windows forms, GDI+ graphics, streams, serialization and more\n    * Using object oriented programming concepts to help you build well-designed programs\n    * How to build robust applications with good error handling\n    * The latest C# 3.0 features, including LINQ, object and collection initializers, automatic properties, extension methods and more\n\n\n\nThroughout the book, you'll confront and conquer advanced C# concepts. Some of the most mysterious ideas are demystified and explained with clear examples: how Unicode works, events and delegates, references versus value types, the stack versus the heap, what's really going on with garbage collection, and more.\n\nThousands of readers have learned C# using this innovative book, including:\n\n    * Beginning programmers who want to learn programming from the ground up\n    * More advanced programmers who are proficient in another language (like Visual Basic, Java, SQL, FoxPro) and want to add C# to their toolbox\n    * Programmers who understand basic C# syntax, but are still looking to get a handle on how objects work\n    * Anyone who's tried to learn C#, but had to deal with books full of dull examples and nothing but boring console applications\n    * Lots of people who just want to learn how to build cool games!\n\n\n\nHead First C# is built to work with any version of Visual Studio 2008, including the free express edition. (It can also can be used with any version of Visual Studio 2005.)\n\n**************************************************************\n\nThis file is in .pdf format.\n\nAny comments on why the upload doesn't start here?\nthe UDP tracker thingy gave me an tracker announce error, anybody? I'm not so experienced in uploading torrents...","torrent":{"xt":"urn:btih:5abcd1cfe903d8d71a282969b287401d2d85644a","amp;dn":"OReilly.Head.First.C.Sharp.Nov.2007.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5abcd1cfe903d8d71a282969b287401d2d85644a","infoHashBuffer":{"type":"Buffer","data":[90,188,209,207,233,3,216,215,26,40,41,105,178,135,64,29,45,133,100,74]},"announce":[],"urlList":[]}}