{"title":"Comp It Up - A Studio Skills Foundation (gnv64)","uid":8714971,"size":47317275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5af7690f78f7a737905c9a932883f66c92633de3&amp;dn=Comp+It+Up+-+A+Studio+Skills+Foundation+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gnv65","files":-1,"time":1374313440,"description":"Comp It Up: A Studio Skills Foundation \nby Rose Gonnella and Christopher J. Navetta\nCengage Learning | June 2010 | ISBN-10: 1428322353 | True PDF | 352 pages | 45.1 mb &lt;a href=&quot;\nhttp://www.amazon.com/Comp-It-Up-Studio-Foundation/dp/1428322353&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Comp-It-Up-Studio-Foundation/dp/1428322353&lt;/a&gt;\n\nComp It Up: A Studio Skills Foundation is a one of kind practical and functional guide for students learning to produce professional-level comprehensive mockups and portfolio presentations in graphic design. This text not only covers a wide range of materials and techniques needed to produce these mockups, but it also promotes creative inspiration with hundreds of images and examples. Readers will also find dozens of step by step visuals to help them in learning how to work out more difficult techniques. Exploring both traditional print and new media applications, Comp It Up is adaptable to a variety of graphic design and advertising design applications. Using this text, students will not only learn the skills they need to build comprehensive mockups, but they will also gain the knowledge and confidence needed to present them professionally.\n\n Features:\n-    Heavily illustrated, Comp It Up clearly shows students how to create a comp with hundreds of creative examples and concise step-by-step instructions.\n-    Each chapter contains an &quot;Exercise Knowledge Gained&quot; section that allows students to work in class or on their own to interpret and put to use what they learn in each chapter.\n-    Included throughout the text are lists of basic industry standards for paper, printing, standard formats for folding, envelopes and folders, binding and packaging.\n-    Features helpful design tips and warnings to readers in a variety of boxed elements throughout the book.\n-    Explores portfolio presentation techniques necessary for launching a career or reentering the job market and that are essential for gaining a competitive edge.\n\nAbout the Authors\nRose Gonnella is currently a twenty-five year experienced professor in the Visual Communications Program of the Department of Design at Kean University in New Jersey. She teaches courses in design theory, studio skills and computer technology and has also developed the school's web design curriculum. She currently serves on the executive board of the Art Directors Club of New Jersey (ADCNJ) and as the Director of the Kean University/ADCNJ &quot;Thinking Creatively&quot; design conference. Ms. Gonnella is also the author and co-author of several books and has written many magazine articles on creativity, art and architecture for several national publications. In addition, Ms. Gonella has written over two hundred and fifty articles on art, design and architecture for two newspapers in Nantucket, Massachusetts.\nChristopher J. Navetta is currently professor of design at Kean University in New Jersey and has taught courses in Digital Prepress, Promotional Design and Studio Skills. He is currently the Vice President of the Art Directors Club of New Jersey (ADCNJ). Mr. Navetta has been a professional freelance graphic designer for over fifteen years and boasts an eclectic group of clients and employers, from large nationally known corporations to small businesses and individual customers. He is involved with the Kean University/ADCNJ &quot;Thinking Creatively&quot; annual design conference. Mr. Navetta earned his Bachelor of Fine Arts Degree in Visual Communications/Graphic Design from Kean University and, while in school, was awarded two ADCNJ scholarships for design and a Phi Kappa Phi Honor Society writing scholarship.","torrent":{"xt":"urn:btih:5af7690f78f7a737905c9a932883f66c92633de3","amp;dn":"Comp+It+Up+-+A+Studio+Skills+Foundation+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5af7690f78f7a737905c9a932883f66c92633de3","infoHashBuffer":{"type":"Buffer","data":[90,247,105,15,120,247,167,55,144,92,154,147,40,131,246,108,146,99,61,227]},"announce":[],"urlList":[]}}