{"title":"John Mayer - Half Of My Heart (Xvid-2nafish) 1080p","uid":5723624,"size":111710324,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5d13f99e32beba26810a27503980679e2941318c&amp;dn=John+Mayer+-+Half+Of+My+Heart+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1280381357,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:01\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 3384 Kbps\nQuality Factor : 0.07 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Half of My Heart&quot; is a song by American alternative rock singer John Mayer and American country pop singer Taylor Swift. It is the third single from Mayer's 2009 album, Battle Studies.\n\n&quot;Half of My Heart&quot; features more of a pop rock sound than Mayer's previous music. His previous albums explored blues and acoustic rock, especially in his 2006 album Continuum. It also has a carefree, sing-along sound to it.\n\nThe lyrics of the song are sung by both Mayer and Swift; Swift sings with Mayer in the chorus and in the song's bridge. The lyrics are about the duo, with half of their hearts saying they should continue to love each other, although the other half says they are not each other's true love, and cannot keep loving each other.\n\nMayer &quot;tweeted&quot; about wanting to record the song with Swift in March 2009: &quot;Waking up to this song idea that won't leave my head. 3 days straight now. That means it's good enough to finish,&quot; he wrote. &quot;It's called 'Half of My Heart' and I want to sing it with Taylor Swift. She would make a killer Stevie Nicks in contrast to my Tom Petty of a song.&quot;\n\nIn an interview shown on television called John Mayer: On the Record with Fuse (which only aired on the Fuse channel), Mayer's interviewer asked why the singer chose Swift to duet with, since she was only nineteen years old, and Mayer was 32. He responded by saying that he was not putting her on the album just to sell more copies for die-hard fans of Taylor Swift that might just get the album for that song.\n\n&quot;Half of My Heart&quot; debuted at twenty-nine on the Billboard Hot Adult Top 40 Tracks chart on the issue date of May 8, 2010. This makes John Mayer's fourteenth appearance on that chart.\n\nBattle Studies is the fourth studio album by American rock musician John Mayer, released November 17, 2009 on Columbia Records in the United States. Production for the album took place during February to August 2009 at Battle Studies recording studio in Calabasas, California, Capitol Studios in Hollywood, California, and The Village in West Los Angeles, California, and was handled by Mayer and Steve Jordan.\n\nThe album debuted at number one on the US Billboard 200 chart, selling 286,000 copies in its first week. It achieved successful sales in several other countries and produced two singles that attained chart success. Upon its release, Battle Studies received generally mixed to positive reviews from most music critics. The album has sold 880,000 copies in the United States.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5d13f99e32beba26810a27503980679e2941318c","amp;dn":"John+Mayer+-+Half+Of+My+Heart+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d13f99e32beba26810a27503980679e2941318c","infoHashBuffer":{"type":"Buffer","data":[93,19,249,158,50,190,186,38,129,10,39,80,57,128,103,158,41,65,49,140]},"announce":[],"urlList":[]}}