{"title":"580 - Metasploit Kung-Fu Pentesting (2011)","uid":10083287,"size":75534365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d7f6b26929ef29449fb3b998526932f63f97d2f&amp;dn=580+-+Metasploit+Kung-Fu+Pentesting+%282011%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1399049680,"description":"\n\n\n580 - Metasploit Kung-Fu Pentesting (2011)\n\n\nDescription:\n\n\nMany enterprises today face regulatory or compliance requirements that mandate regular penetration testing and vulnerability assessments. Commercial tools and services for performing such tests can be expensive. While really solid free tools such as Metasploit, are available, many testers do not understand the comprehensive feature sets of such tools and how to apply them in a professional-grade testing methodology. Metasploit was designed to help testers with confirming vulnerabilities using an Open Source and easy-to-use framework. This course will help students get the most out of this free tool.\n\nThis class will show students how to apply the incredible capabilities of the Metasploit Framework in a comprehensive penetration testing and vulnerability assessment regimen, according to a thorough methodology for performing effective tests. Students who complete the course will have a firm understanding of how Metasploit can fit into their penetration testing and day-to-day assessment activities. The course will provide an in-depth understanding of the Metasploit Framework far beyond simply showing attendees how to exploit a remote system. The class will cover exploitation, post-exploitation reconnaissance, token manipulation, spear-phishing attacks, and the rich feature set of the Meterpreter, a customized shell environment specially created for exploiting and analyzing security flaws.\n\nThe course will also cover many of the pitfalls that a tester may encounter when using the Metasploit Framework and how to avoid or work around them, making tests more efficient and safe.\n\n\n\nContents:\n\n\n1. Two PDFs (total of 422 pages.)\n\n\n","torrent":{"xt":"urn:btih:5d7f6b26929ef29449fb3b998526932f63f97d2f","amp;dn":"580+-+Metasploit+Kung-Fu+Pentesting+%282011%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d7f6b26929ef29449fb3b998526932f63f97d2f","infoHashBuffer":{"type":"Buffer","data":[93,127,107,38,146,158,242,148,73,251,59,153,133,38,147,47,99,249,125,47]},"announce":[],"urlList":[]}}