{"title":"Fantastic Four by Millar, Hickman, Fraction (2008-2014|Dgtl+)","uid":9603560,"size":3433537585,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5d8b898548ad67bb90cb3cd5aac95ca081c1c329&amp;dn=Fantastic+Four+by+Millar%2C+Hickman%2C+Fraction+%282008-2014%7CDgtl%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1392170597,"description":"This compilation is the total body of work on Fantastic Four and FF by three highly regarded writers - Mark Millar, Jonathan Hickman, and Matt Fraction - which comprises three consecutive runs and nearly six years' worth of material. These runs heavily build on each other and are all much-praised for several different reasons, thus I have decided to combine them into one large and (hopefully!) coherent torrent. The work of Mark Millar introduces Nu-World - a second Earth - and its eventual inhabitants, along with reinforcing Doctor Doom's unquenchable fury and will to live; this in turn is heavily expanded on in Hickman's machinations. Hickman's amazing work includes the fate of Nu-World and the creation of the Future Foundation - a society of young and gifted individuals under the care of the Fantastic Four - an idea that Fraction takes and runs with while keeping two books in circulation (one of which is entirely devoted to the FF's crazy adventures). All three sets of tales feature the &quot;usual&quot; Fantastic Four weirdness - time travel, alternate realities, future and past versions of the characters, focus on the family aspects of the team, etc. - but utilize them in unique, fun, and interesting ways. Together, these remarkable stories have served to return the Fantastic Four to its rightful position at the top of the Marvel hierarchy, both commercially and critically. Even if you've never read a single word of Fantastic Four comics, this is an ideal place to start and I promise you won't regret it.\n\nI have divided this torrent into four parts:\n\n01 Fantastic Four v3 554-569 [Mark Millar &amp; Bryan Hitch] (2008-2009): This folder contains the special edition TPB by MiracleScans Ltd. which encompasses the entire 16-issue run, NOT the Omnibus edition or individual issues. Though they are comprised of analog scans, the work here by MrclScns is awesome - with a wealth of bonus interviews and a clean, cover-less one volume - and it is very small for what you get (less than 250 MB). This is best version of these stories out there, in my opinion, which is why it was chosen for this torrent.\n\n02 Fantastic Four - Dark Reign 01-05, Fantastic Four v3 570-588 &amp; 600-611, FF v1 01-23 [Jonathan Hickman &amp; Various Artists] (2009-2012): This section requires a little more explanation; although DocBerry and MrclScns have both released excellent versions of Hickman's run on The Pirate Bay before, they are both somewhat &quot;incorrect&quot;, for lack of a better word. MrclScans' great two-volume edition has everything in the correct order but is missing the Dark Reign series that launches Hickman's run. DocBerry's torrent is well-organized and has the Dark Reign miniseries but the ordering of the final section is not in line with Hickman's own numbering. In addition, both of those versions feature analog scans, albeit good ones to be sure. This edition features ALL-DIGITAL copies of every issue of the main series and FF provided by Minutemen-InnerDemons, which have not been compiled before in torrent form except on the hitlists. For the Dark Reign section, I have used the HQ Minutemen scans which are the best resolution currently available. Everything is numbered and ordered over 4 folders in the accurate order that the author has intended, with each section clearly labeled. Thus as of now, this is the definitive version of Hickman's extraordinary work.\n\n03 Fantastic Four v4 01-16 &amp; FF v2 01-16 [Matt Fraction - with assists from Lee Allred &amp; Karl Kesel - and Mark Bagley, Michael Allred and others] (2012-2014): The last chapter of this saga collects Fraction's recent work over the two books in the proper reading order, more or less alternating the titles with few exceptions. Fraction plotted this run as one massive story revolving around Doom becoming nearly all-powerful and the team's attempts to stop them (even while they are slowly decaying themselves). While Fraction had to leave near the end of his run, Karl Kesel and Lee Allred took his completed treatments and finished the scripts with the art teams largely remained unchanged. The issues presented here are again ALL-DIGITAL (thanks to TheGroup, Zone-Empire, and Minutemen-Phd).\n\n04 Bonus Material - This section contains the story &quot;Doctor Doom:...And I'll Get The Land&quot; by Jonathan Hickman, which I have manually excerpted from the Minutemen-The Dangerous Side scan of Dark Reign - The Cabal 01 (2009, One-Shot). I have also added the two annuals that are part of this era, numbering 32 (2010) and 33 (2012). The first is a Minutemen-DTs scan and the second is digital release by TheGroup. None of these is all that essential to read but they are included for the sake of completeness and are fun nonetheless.\n\nSorry for that wall of text but I wanted to be clear as to the contents of this package, and I hope that you like it very much. Thanks to all the original scanners and uploaders and especially the three tremendous authors whose work I can't even begin to describe in terms of sheer detail, emotional power, and the joy of reading it. ALL of the incredible artists deserve plaudits for their work in bringing these visions to life as well. PLEASE SEED this one, as it is pretty big - but I will have it going indefinitely too! Enjoy! :-)","torrent":{"xt":"urn:btih:5d8b898548ad67bb90cb3cd5aac95ca081c1c329","amp;dn":"Fantastic+Four+by+Millar%2C+Hickman%2C+Fraction+%282008-2014%7CDgtl%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d8b898548ad67bb90cb3cd5aac95ca081c1c329","infoHashBuffer":{"type":"Buffer","data":[93,139,137,133,72,173,103,187,144,203,60,213,170,201,92,160,129,193,195,41]},"announce":[],"urlList":[]}}