{"title":"Irene Huss (NLsubs)(DVD 2 v 3  ) TBS B-SAM","uid":6951146,"size":4635378018,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5dafda3a91ed055ff29c0fa256283ea4483eac78&amp;dn=Irene+Huss+%28NLsubs%29%28DVD+2+v+3++%29+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Mad_Parrot","files":-1,"time":1326407638,"description":"\nIrene Huss dvd 2 (2 van 3)  \n\nIrene Huss - Eldsdansen  en  Irene Huss - Nattrond\n\n\n\n\n\nNederlands:\n\nNieuwe uiterst spannende Zweedse crimeserie, gebaseerd op de boeken van Helene Tursten. \nIrene Huss wordt de vrouwelijke tegenhanger van Kurt Wallander genoemd, de hoofdpersoon in de misdaadromans van Henning Mankell. \nHuss is een veertigjarige inspecteur, ze is gelukkig getrouwd, heeft een zwarte band in jiu-jitsu en werkt al heel wat jaren bij de politie. \nToch komt ze nog altijd collega\\'s tegen die niet zo blij zijn met vrouwen bij het corps. \n\n\nIrene Huss - Eldsdansen:\n\nIrene Huss en haar collega\\'s moeten een reeks mysterieuze brandstichtingen ophelderen, die allen een bijzonder kenmerk hebben: het gaat steeds om huisnummer 9.\nEn uiteindelijk valt er dan ook een dodelijk slachtoffer te betreuren.\nDit herinnert Irene aan haar eerste zaak, waarbij ze 15 jaar eerder een jong meisje als verdachte had, maar toen niets kon bewijzen.\nNog voordat ze dat oude dossier tevoorschijn kan halen, komt er nog een tweede moord bij.\nIngrid Eriksson, lid van een sektarische geloofsgemeenschap op een klein eiland.\nOp de begrafenis van het slachtoffer ontmoet ze Frej Eriksson, een begenadigd danser, en zijn danslerares Gisela, die Irene iets wil vertellen. \nMaar op de dag waarop ze afgesproken hebben, wordt Gisela vermoord.....\n\n\n\n\nIrene Huss - Nattrond:\n\nGÃƒÂ¶teborg, een koude nacht in februari. \nIn de LÃƒÂ¶wanderkliniek rinkelen de alarmbellen, een stroomuitval heeft het hele ziekenhuis platgelegd. \nEen patiÃƒÂ«nt overlijdt, maar het wordt nog erger: de verpleegster die bij hem moest waken wordt gewurgd bij het stroomaggregaat gevonden. \nDe volgende dag blijkt een andere verpleegster van de aardbodem verdwenen te zijn... \nEen nieuwe zaak voor rechercheur Irene Huss en haar team. \nHaast is geboden, want een moord in het ziekenhuismilieu is zeer nadelig voor het imago en de personeelsbezetting. \nBovendien heeft de zaak een link met een mysterieus ongeval van jaren geleden. \nEen dienstdoende zuster getuigt namelijk dat ze in de bewuste rampennacht zuster Tekla heeft gezien. \nMaar die pleegde ruim vijftig jaar geleden zelfmoord... \n\n\n\n\nEngels:\n\nIrene Huss - Eldsdansen:\n\nOne morning in May: In Goteborg is wrapped in plastic found a corpse washed up, a horribly maimed body.\nWho is the victim of a sick crime.\nThe only trace is a special and exotic tattoo on the shoulder.\nThis clue leads Inspector Irene Huss to Copenhagen two years ago under similar circumstances a prostitute was brought to life.\nIf there are more murders occur following one event to another and the young Huss stands for riddles. The bloody trail of the serial killer Huss brings a world of lies and false promises.\nStuck in the research she believes the killer, like a shadow, has lifted his heels and remain forever out of reach.\n\n\nIrene Huss - Nattrond:\n\nA blackout leaves the distinguished halls of the LÃƒÂ¶wanderska Hospital in complete darkness. \nDoctor Sverker LÃƒÂ¶wander hears the alarm when one of the ventilators go off, and rushes to the intensive care unit only to find the nurse in charge dead \nin the stairwell and the other disappeared without a trace. When DI Irene Huss arrives, the only witness claims to have seen Nurse Tekla doing her rounds. \nThere\\'s only one slight problem: Nurse Tekla committed suicide at the hospital sixty years ago\n\n\n   \n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nMenu          : Ja\nAudio         : Zweeds\nExtra\\'s       : Ja , trailers\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Beperkt\nGenre         : Action Crime\n\n &lt;a href=&quot;\nhttp://www.bol.com/nl/p/dvd/irene-huss/1002004006495489/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bol.com/nl/p/dvd/irene-huss/1002004006495489/index.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/53536&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/53536&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1043458/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1043458/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1043514/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1043514/&lt;/a&gt;\n\n\n\n\nVerrast???? \n\n\nKom eens kijken bij \n\n\n &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;","torrent":{"xt":"urn:btih:5dafda3a91ed055ff29c0fa256283ea4483eac78","amp;dn":"Irene+Huss+%28NLsubs%29%28DVD+2+v+3++%29+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dafda3a91ed055ff29c0fa256283ea4483eac78","infoHashBuffer":{"type":"Buffer","data":[93,175,218,58,145,237,5,95,242,156,15,162,86,40,62,164,72,62,172,120]},"announce":[],"urlList":[]}}