{"title":"Papa's Burgeria To Go! v1.1.0.ipa","uid":11645406,"size":29814768,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:5ddc94289d3c251c17ff9025ba63cc1ec247e4f1&amp;dn=Papa%27s+Burgeria+To+Go%21+v1.1.0.ipa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zxfghfg","files":-1,"time":1417817819,"description":"Papa's Burgeria is now available to play on the go, with gameplay and controls reimagined for iPhone and iPod Touch. Grill, stack, and serve burgers in a brand-new way! \n\nYou're left in charge of Papa Louie's famous Burgeria, where you'll learn to take orders, grill patties, add toppings, and serve burgers to all of your crazy customers. You need to multitask between each area of the restaurant, with new controls that feel just right in the palm of your hand: Head to the Order Station to keep an eye out for customers waiting in the lobby. Switch to the Grill Station to drag patties onto the grill and flip burgers to cook them evenly. Jump to the Build Station to carefully craft your sandwiches with toppings and sauces exactly how they ordered, and deliver the finished burger to earn points and tips!\n\nEach Station is a hands-on experience, where you'll need to drag, swipe, and tap your way through the burger-building process. With full multi-touch support, the process is more fun than ever before! Tap many burgers at once to flip them all on the grill, or keep one finger on the Build Station's bin slider for even better precision when building.\n\nKeep your customers happy to earn more points and level up. As your level rises, you'll unlock new toppings in the shop, and new customers will start visiting the Burgeria! Papa's Burgeria To Go also features unlockable toppings that aren't available in previous versions!\n\n**NEW FOR PAPA'S BURGERIA TO GO**\n\nPapa's Burgeria To Go is redesigned and reimagined for smaller screens, so your fingers won't get in the way of the action!\n\nCONTROL WITH YOUR THUMBS - You'll switch stations using buttons in the corners of the screen, perfect for your thumbs. Use buttons in the top corners to switch Order Tickets without having to drag them back and forth. You can also view all of your Order Tickets in a zoomed-in mode for easy reading.\n\nGRILL STATION - We've made keeping track of your burgers easier than ever, with Timers stuck in each burger patty that you can read at a glance, showing the cooking time and how each side is cooked. You can also buy Alarms in the Shop to add onto each Timer, so you'll get an alert when it's time to flip or remove a burger. With multi-touch support, you can quickly flip and remove burgers by using multiple fingers. Try a triple-tap to flip three patties in a row!\n\nBUILD STATION - With a traditional drag-and-drop system, your finger would block your view, so we've completely changed the Build Station to work on smaller screens. You'll swipe a carousel of Topping Bins across the top of the screen, and slide it carefully to line up toppings with the burger below. Simply tap on the bottom of the screen to drop a topping from the bin above! You can also tap a button to swap your Topping Bins with Burger Bins, which hold all of the patties you've cooked on the grill. And with full multi-touch support, you can keep one finger sliding the bins and another tapping on the bottom of the screen, so stacking burgers is a breeze!\n\n\n**GAME FEATURES**\n\n- Hands-on burger shop game in the Papa Louie universe\n- All new controls and gameplay designed for smaller screens\n- Multi-task between grilling, stacking, and serving\n- Shop to buy upgrades using your in-game tips\n- Over 60 customers to unlock with unique orders\n- Challenging Closers and Food Critic\n- Over 50 in-game achievements to earn\n\n**NOTE FOR iPAD USERS**\n\nPapa's Burgeria To Go is designed especially for smaller screens. If you're looking for large-screen gameplay, check out the original &quot;Papa's Burgeria&quot; for iPad!","torrent":{"xt":"urn:btih:5ddc94289d3c251c17ff9025ba63cc1ec247e4f1","amp;dn":"Papa%27s+Burgeria+To+Go%21+v1.1.0.ipa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ddc94289d3c251c17ff9025ba63cc1ec247e4f1","infoHashBuffer":{"type":"Buffer","data":[93,220,148,40,157,60,37,28,23,255,144,37,186,99,204,30,194,71,228,241]},"announce":[],"urlList":[]}}