{"title":"[MP3 ITA AUDIOLIBRO] DIVINA COMMEDIA - VITTORIO SERMONTI TPB","uid":4542707,"size":2352683660,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5ddfc16bb58c086d4bd6a1f39a674f8610666d06&amp;dn=%5BMP3+ITA+AUDIOLIBRO%5D+DIVINA+COMMEDIA+-+VITTORIO+SERMONTI+TPB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"golet","files":207,"time":1228003873,"description":"Vittorio Sermonti (Roma, 1939) e' uno studioso di letteratura, scrittore e attore italiano.\n\nLaureato a Roma in Lettere, ha fuso il suo interesse per le professioni di studioso, scrittore, traduttore, docente, con il rapporto fra la scrittura e la viva voce; numerosissime opere dalla poesia petrarchesca alla titanica Commedia di Dante  sono state da lui recitate davanti a un grande numero di interessati.\n\nEsemplare la sua opera iniziata nell'1985, anno dal quale si occupa in prevalenza di Dante e che lo ha spinto a curare, fra il 1987 e il 1992, con la consulenza scientifica di Gianfranco Contini e poi di Cesare Segre, un ciclo di trasmissioni radiofoniche serali, sulla terza rete, riguardanti la Divina Commedia: trasmissioni dalle quali ha poi sintetizzato i commenti, canto per canto, esposti in tre volumi pubblicati dalla Rizzoli.\n\nFra il 1995 e il 1998, ha raccontato e letto i cento canti della Commedia nella Basilica di S. Francesco a Ravenna, dove e' sepolto il poeta. Straordinario il concorso del pubblico. Nel 1998 la CittÃƒÆ’Ã‚Â  di Ravenna gli ha conferito la cittadinanza onoraria. Dal 1996 e' membro dell'Accademia Virgiliana di Mantova e dal 1998 e' componente del comitato d'onore della Societa'Ã‚Â  Dante Alighieri di Parigi.\n\nQuesta raccolta e' frutto di registrazioni fatte alla radio, spesso con mezzi di fortuna.\nIn particolare si segnalano difetti, e disturbi di ricezione, nei canti 8 e 33 del Paradiso.\nI primi canti dell'Inferno (dal 1 all'8) erano mancanti e sono stati integrati con quelli reperiti in rete. Di questi si segnala una leggera differenza (anche se non sostanziale) rispetto a quelli registrati via etere.\n\n- INFERNO\n\n- PURGATORIO\n\n- PARADISO","torrent":{"xt":"urn:btih:5ddfc16bb58c086d4bd6a1f39a674f8610666d06","amp;dn":"%5BMP3+ITA+AUDIOLIBRO%5D+DIVINA+COMMEDIA+-+VITTORIO+SERMONTI+TPB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ddfc16bb58c086d4bd6a1f39a674f8610666d06","infoHashBuffer":{"type":"Buffer","data":[93,223,193,107,181,140,8,109,75,214,161,243,154,103,79,134,16,102,109,6]},"announce":[],"urlList":[]}}