{"title":"Le Survenant (French with English srt subs) moviesbyrizzo","uid":6039772,"size":981474864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e500f5cf2f7760d06d6c311ade6cdbb1ed091d8&amp;dn=Le+Survenant+%28French+with+English+srt+subs%29+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1292341785,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0407230/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0407230/&lt;/a&gt;\n\n720 X 480 res 800k video, 128k audio French program, English SRT subtitles\n\nWe have literally dozens of movies waiting to launch of special interest such as \nthis one here. We have eight times as much upload speed as we did this time last\nyear, however please note that we are on minimal speed during late night hours \n(due to throttling of our server - this occurs mainly on weekdays and an hour\nor so on saturdays).\n\nLe Survenant is a great movie from Quebec - the French are perhaps the best\nat describing and explaining the human condition without reticence or a lack\nof veracity - boldness even - while still being in great taste to those keepers\nof the faith that want honesty in all human affairs.\n\nLe Survenant (The Outlander) is quite interesting in comparing opposing\nor complementary spirits that are present within each community even within\nthe same &quot;broader culture&quot; race or nation within Europe even certainly!\n\nWould an obviously Irish spirited Frenchman have to be considered an &quot;outlander&quot;\nin his own country? An outsider perhaps? Would there be some reason that so many\nin some locale or other would not cheer for him rather than his opponent in what\nis a fight that isnt based on merit alone? (Fist fight as it turns out to be the\ncase in this movie).\n\nShould this man actually follow his own spirit rather than &quot;demons&quot; to his\nown voice? (as he is told in those exact words in the movie towards the end.\n\nNo matter - its a great enough European appeal movie with &quot;What shall we do with \na drunken sailor spiritedly sung by the great French crowd assembled\nin the barroom scene of this movie that is memorable too!\n\nThis movie is funded in part by our telecom provider Bell Canada - as they have\nmuch to support in great culture here yet - while most players on the stage\nhave decided instead to focus mainly if not altogether on strange exotic customs\nand cultural expenditures favouring the third world. what strange country this has \nbecome! Whatever happened to fairness?\n\n\nMichael Rizzo Chessman\n\n\n\n\n\n","torrent":{"xt":"urn:btih:5e500f5cf2f7760d06d6c311ade6cdbb1ed091d8","amp;dn":"Le+Survenant+%28French+with+English+srt+subs%29+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e500f5cf2f7760d06d6c311ade6cdbb1ed091d8","infoHashBuffer":{"type":"Buffer","data":[94,80,15,92,242,247,118,13,6,214,195,17,173,230,205,187,30,208,145,216]},"announce":[],"urlList":[]}}