{"title":"Inter Arma - Sky Burial [2013][FLAC]","uid":8504299,"size":463117167,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5ed827c0bbe7ce301c4b060e1e2043ab4982906b&amp;dn=Inter+Arma+-+Sky+Burial+%5B2013%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":11,"time":1369390354,"description":"Artist:Inter Arma\nRelease: Sky Burial\nReleased: 2013\nLabel: Relapse Records\nCatalog#: RR7206\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Doom Metal, Black Metal, Psychedelic Rock\n\n1.The Survival Fires\t 10:33\t\n2.The Long Road Home (Iron Gate) 03:48\t\n3.The Long Road Home\t 10:27\t\n4.Destroyer\t 10:34\t\n5.'sblood\t 06:33\t\n6.Westward\t 10:07\t\n7.Love Absolute\t 04:10\t\n8.Sky Burial\t 13:26\t\n\nThe moniker Inter Arma roughly translates to &quot;war time&quot; and is a part of the larger phrase inter arma enim silent leges, or &quot;in times of war, the law falls silent.&quot; Inter Arma make a concerted effort to challenge the unpredictable, easily corruptible periods of unchecked power that can result from martial law on their second full-length release, Sky Burial (the album title itself referring to the funereal practice of ritually feeding a body to carrion birds, effectively burying them in the sky). While the genre they operate within is often simplified to &quot;blackened groove,&quot; Virginia-based Inter Arma incorporate elements of everything from psychedelia to doom, with vast, experimental song structures swirling and evolving, evoking Neurosis or Kylesa. There are stoner-y, psychedelic moments, but the tracks never get lost within themselves, instead retaining a clarity of direction and vision. There are vast, sludge-seeping doom passages as well, but they never become crushing or dirge-like due to the infectious energy, the unexpected hopefulness that infuses Sky Burial. Opening track &quot;The Survival Fires&quot; is tense and dextrous, a finely tuned, vast machine, like a walking city. &quot;The Long Road Home (Iron Gate)&quot; is an album highlight, the emotive keys and shiveringly alive steel guitar sapping none of its vital strength and martial stomp. Between their unflagging energy and brilliant execution, Inter Arma have produced a stellar album that will remain memorable.","torrent":{"xt":"urn:btih:5ed827c0bbe7ce301c4b060e1e2043ab4982906b","amp;dn":"Inter+Arma+-+Sky+Burial+%5B2013%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ed827c0bbe7ce301c4b060e1e2043ab4982906b","infoHashBuffer":{"type":"Buffer","data":[94,216,39,192,187,231,206,48,28,75,6,14,30,32,67,171,73,130,144,107]},"announce":[],"urlList":[]}}