{"title":"Charles Dickens - Oliver Twist (Unabridged)","uid":4599287,"size":656810539,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5f0b3152122d3cad4a23a6cc0ba3876a7e40f893&amp;dn=Charles+Dickens+-+Oliver+Twist+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eddie1969","files":19,"time":1230131002,"description":"Audio Books : Literary : MP3/128Kbps : English\n\nCharles Dickens - Oliver Twist\n\nRead by Martin Jarvis\n\nUnabridged - 14 CDs converted to 14 MP3 files and set at 96 kbit/s ABR (Average Bit Rate)\n\n\n\nAbout The Novel:\nDickens's second novel was a far cry from THE PICKWICK PAPERS, his first. The story of an orphan who flees the workhouse only to fall in with a gang of thieves and prostitutes in London's sleazy underworld, it was a trenchant criticism of England's poor laws.\n\nEnacted in the 1830s, these laws provided assistance for the poor only through workhouses, which were deliberately squalid and miserable to encourage the poor - who were considered lazy and immoral - to better themselves and get out. \n\nThe inequities between rich and poor were one of Dickens's constant themes, and with OLIVER TWIST he established himself as a staunch champion of the downtrodden, particularly children. The novel also, however, has its cheerful moments, and contains some of Dickens's most memorable characters, including Fagin, the Artful Dodger, the evil Bill Sykes, and the unfortunate Nancy.\n\nThe story of the orphan Oliver, who runs away from the workhouse only to be taken in by a den of thieves, shocked readers when it was first published. Dickens's tale of childhood innocence beset by evil depicts the dark criminal underworld of a London peopled by vivid and memorable characters - the arch-villain Fagin, the artful Dodger, the menacing Bill Sikes and the prostitute Nancy. Combining elements of Gothic Romance, the Newgate Novel and popular melodrama, Dickens created an entirely new kind of fiction, scathing in its indictment of a cruel society, and pervaded by an unforgettable sense of threat and mystery. \n\n\nAbout The Author:\nCharles John Huffam Dickens was born on February 7, 1812 in Portsmouth, Hampshire, England. In 1824, his father was imprisoned for debt, so Charles was sent to work in a shoe-dye factory. He later became a clerk in a law firm, a shorthand reporter in the courts, and a parliamentary and newspaper reporter. \n\nIn 1833, Dickens began to contribute short stories and essays to periodicals, heralding the start of a glittering and prolific literary career. He married Catherine Hogarth in 1836, with whom he had nine surviving children before they separated in 1858.\n\nDickens died suddenly at home on June 9, 1870, leaving behind an internationally acclaimed canon of work, including Oliver Twist (1837), Nicholas Nickleby (1838), David Copperfield (1849-50), Bleak House (1852-53), Little Dorrit (1855-57), A Tale of Two Cities (1859), Great Expectations (1860-61) and Our Mutual Friend (1864-65). He was buried in Westminster Abbey. \n\n\nAbout The Reader:\nA distinguished actor with a very long career, Martin Jarvis is probably best known for his radio work - his voice is a staple of BBC Radio 4. With his wife Rosalind Ayres, he runs Jarvis and Ayres Productions, which produces dramas, readings and audiobooks. For this, and his other work, Martin was honoured with an OBE for his services to drama in 2000. \n\nMartin often steps behind the mike himself, and has narrated dozens of audiobooks and readings, including versions of Richmal Crompton's William books, Kafka's Metamorphosis, P.G. Wodehouse's Carry On Jeeves, and 101 Dalmations. \n\nMartin's TV debut was in Doctor Who in 1965, playing a giant butterfly in The Web Planet. A couple of years later he played Jolyon Forsyte in The Forsyte Saga. Since then, his many TV parts have included Oliver, the main lead, in 1978 sitcom Rings On Their Fingers, Uriah Heep in David Copperfield, and Jeeves in the TV version of Alan Ayckbourn's musical By Jeeves!","torrent":{"xt":"urn:btih:5f0b3152122d3cad4a23a6cc0ba3876a7e40f893","amp;dn":"Charles+Dickens+-+Oliver+Twist+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f0b3152122d3cad4a23a6cc0ba3876a7e40f893","infoHashBuffer":{"type":"Buffer","data":[95,11,49,82,18,45,60,173,74,35,166,204,11,163,135,106,126,64,248,147]},"announce":[],"urlList":[]}}