{"title":"Catlow (Western) {Brynner, Nimoy} [1971]","uid":8236264,"size":853651275,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5f12abe74f368f6cf2a3d9943fe510e1c650391a&amp;dn=Catlow+%28Western%29+%7BBrynner%2C+Nimoy%7D+%5B1971%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alien99","files":-1,"time":1362847890,"description":"THIS IS SPANISH/ENGLISH  SO DEFAULT IS SPANISH ENGLISH INCLUDED JUST CHANGE IT IN YOUR PLAYER.\n\nThis is a real fun western to watch this has just about it all and very good placed  comedy in it really adds to the fun of this movie.\n\nUnfortunately we have the TCM stuck in the upper right side of it but overhaul good quality  \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0066900/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0066900/?ref_=fn_al_tt_1&lt;/a&gt;\n\nStoryline\n\nMarshall Cowan and the mercenary Miller are both separately hunting the outlaw Catlow. During the Civil War both Cowan and the always smiling Catlow were comrades. Catlow helps Cowan, when he is wounded in the right leg by an arrow from the Apaches, despite Cowan hunting him. Catlow escapes with help of his gang. Catlow then robes a Mexican gold shipment, worth $ 2,000,000. Catlow flies with the stolen gold through the dangerous territory of the Apaches who besides of Miller, Cowan and the Mexican cavalry, are hunting for him and his gang of outlaws.\n\nReview;\n\nIn this European made western, Yul Brynner plays it considerably lighter than he did in The Magnificent Seven. Adapted from the Louis L'Amour novel, Catlow is a pretty amusing romp through the old west by Yul Brynner as an outlaw and Richard Crenna as Ben Cowan, the marshal sworn to bring him in, but alive. The two of them were in the Civil War together and that kind of bond doesn't sever easily.\n\nBut Catlow's got all kinds of people who want him bad, the Mexican Army, the Indians, and a mean hired killer in the person of Leonard Nimoy. He's also got a girlfriend in Daliah Lavi who definitely has an agenda involving Brynner that's all her own. As for Nimoy before he became the wise and logical Vulcan Mr. Spock, he played all kinds of nasty types on television and in film.\n\nI'm surprised Richard Crenna didn't do more westerns in his career, probably had he come along earlier he might very well have. It's a career path he should have taken.\n\nBrynner and Crenna have a nice easy chemistry between them, it's the main reason for checking out Catlow.\n\n","torrent":{"xt":"urn:btih:5f12abe74f368f6cf2a3d9943fe510e1c650391a","amp;dn":"Catlow+%28Western%29+%7BBrynner%2C+Nimoy%7D+%5B1971%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f12abe74f368f6cf2a3d9943fe510e1c650391a","infoHashBuffer":{"type":"Buffer","data":[95,18,171,231,79,54,143,108,242,163,217,148,63,229,16,225,198,80,57,26]},"announce":[],"urlList":[]}}