{"title":"James Joyce The Trial of Ulysses (2000)","uid":6151150,"size":734419776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5f70db88170876fb4f25945c479f6f093d1e08c8&amp;dn=James+Joyce+The+Trial+of+Ulysses+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"StephenDedalus","files":2,"time":1296883368,"description":" &lt;a href=&quot;http://www.themodernword.com/joyce/film_ulysses_doc.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.themodernword.com/joyce/film_ulysses_doc.html&lt;/a&gt;\n\nJames Joyce: The Trials of Ulysses (2000)\n\n2000; Documentary.\nColor, 50 minutes.\nDirected by Ian Graham\n\nFrom The Irish Times, covering the Galway Film Fleadh 2000:\n\n    In a different genre, two documentary profiles of 20th century Irish artists -- one extremely well known, the other half-forgotten -- were in a familiar style, inter-cutting interviews, location footage and archive material.\n\n    Ian Graham's James Joyce: The Trials of Ulysses, examined the turbulent life of the writer during the writing of his most famous novel. While much of the material was familiar, there was an added emphasis on Joyce's atrocious behaviour towards Nora Barnacle while the couple was in Trieste, which made his portrayal in Pat Murphy's Nora seem almost saintly. As always, the problem with a film such as this is the absence of primary sources -- a 30-second archive clip with Sylvia Beach told us more about the subject than half and hour of academic talking heads.\n\nFrom the Web page of the 2001 Seattle Irish Reels film festival:\n\n    The Trials of Ulysses, shot in Trieste, Zurich, New York and Dublin, retells the history of this acclaimed masterpiece. The film recounts the books early battles against charges of obscenity and its official banning in the USA. It portrays Joyce's own trials as a writer and his long struggle to get Ulysses published. Always intelligent and learned, it also touches on the background life of Joyce and Nora Barnacle.\n\n    It wears its admiration for Joyce and his work on its sleeve and though it doesn't restore his reputation as a family man, it does suggest that a book as masterful as Ulysses does necessitate certain sacrifices. Beatifully framed and paced, The Trials of Ulysses is insightful and authoritative -- a very valuable addition to our knowledge of the man and his work.","torrent":{"xt":"urn:btih:5f70db88170876fb4f25945c479f6f093d1e08c8","amp;dn":"James+Joyce+The+Trial+of+Ulysses+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f70db88170876fb4f25945c479f6f093d1e08c8","infoHashBuffer":{"type":"Buffer","data":[95,112,219,136,23,8,118,251,79,37,148,92,71,159,111,9,61,30,8,200]},"announce":[],"urlList":[]}}