{"title":"Hitler's Blitzkrieg Campaigns","uid":4758266,"size":10758524,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fc885479ff3acb9808b1866caa42e45cfdefaea&amp;dn=Hitler%5C%27s+Blitzkrieg+Campaigns&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"philmccrevice","files":1,"time":1236569170,"description":"This book in my opinion is one of the best titles on the early war period. What makes it stand out is the way in which it gives a clear explanation of why the Germans were so strong during this period of the war: training and preparation. This was something all of their opponents lacked, as is shown to great effect in the book. \nThe book is an easy read; I couldn't put it down once I started. I feel it deals with all important aspects of the early war period in sufficient detail. It covers the respective armed forces, and deals with their strengths and weaknesses. It gives a good description of the French Army, the Maginot line and the role it played in French strategic thinking. It also deals with tank design and tactics, explaining why French tanks, though heavilly armored and well armed, need not necessarilly be the best design. I felt that this part of the book set the scene for the campaign very well. \nThe Polish campaing is dealt with in 40 pages. This is short, but all important aspects are mentioned. The Weserubung campaign is also briefly described (32 pages). The western front first gets a chapter on the Sitzkrieg, and then the actual campaign is dealt with in over 120 pages.","torrent":{"xt":"urn:btih:5fc885479ff3acb9808b1866caa42e45cfdefaea","amp;dn":"Hitler%5C%27s+Blitzkrieg+Campaigns","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc885479ff3acb9808b1866caa42e45cfdefaea","infoHashBuffer":{"type":"Buffer","data":[95,200,133,71,159,243,172,185,128,139,24,102,202,164,46,69,207,222,250,234]},"announce":[],"urlList":[]}}