{"title":"An Exaltation of Soups - Patricia Solley","uid":9441760,"size":4577189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fc9f6976c8a8821d1047df490cecf36a99d9d73&amp;dn=An+Exaltation+of+Soups+-+Patricia+Solley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"420weedman","files":-1,"time":1389023415,"description":"Solley's passionate compendium of history, folklore, literary references and recipes collects tidbits about and recipes for soup from all over the world. The author, who runs the SoupSong.com Web site, shares proverbs and quotes about soup's famed comforting qualities, and recipes for stocks, which are the foundation of all soups. \nShe looks at the role soups can play in life's key moments: e.g., French &quot;Boiled Water&quot; Garlic Soup is traditionally served to convalescing new mothers; Guatemalan Lamb Soup with Tamales, with its robust, meaty content, is reserved for weddings and other fancy occasions; and Irish Cottage Broth for the Wake is &quot;enough to bring the dead back to life.&quot; Next come &quot;soups of purpose,&quot; that is, ones that supposedly assist in weight loss (Cabbage Soup), appetite stimulation (Creamy Crab and Cognac Soup) and healing (Fava Bean Soup from Egypt). \nThere are also recipes to foster love (Lobster Sweetheart Soup) or cure a hangover (Beer Soup from Denmark). The clear and generally simple recipes are enhanced by informative and descriptive head notes; sidebars on such topics as the use of almonds as an aphrodisiac or the history of Japanese soy sauce; literary quotations and extracts; and personal stories.","torrent":{"xt":"urn:btih:5fc9f6976c8a8821d1047df490cecf36a99d9d73","amp;dn":"An+Exaltation+of+Soups+-+Patricia+Solley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc9f6976c8a8821d1047df490cecf36a99d9d73","infoHashBuffer":{"type":"Buffer","data":[95,201,246,151,108,138,136,33,209,4,125,244,144,206,207,54,169,157,157,115]},"announce":[],"urlList":[]}}