{"title":"A Brief History of Infinity  (BBC Radio)","uid":5102323,"size":43362798,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5fe39805f260688362cad7e78f63846c9a4452c0&amp;dn=A+Brief+History+of+Infinity++%28BBC+Radio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":7,"time":1254081680,"description":"A Brief History of Infinity - BBC Radio Science Documentary\n\n\nRipped from the audio torrent site - radioarchive.cc - Registration is FREE!!\n\n\nHuman beings have trouble with infinity - yet infinity is a surprisingly human subject. Philosophers and mathematicians have gone insane contemplating its nature and complexity - yet it is a concept routinely used by schoolchildren.\n\nPresented by the renowned astronomer Heather Couper, these programmes take the listener on a journey with an endless audio horizon and feature contributions from musicians who write endless music; science fiction authors, who create infinite worlds and timeless beings; theologians; Buddhist lamas; astro-physicists and mathematicians.\n\nIt is infinity... in a nutshell.\n\nTwo episodes of approximately 25 minutes each.\n\n\n\nPart One: Space and the Universe\n\nThis first programme takes us outside the known universe, and tries to measure whether it has a beginning and end.\n\nIf a star is a fixed number of light years away, how do we know if there is anything lurking beyond the stars which will not show itself to a human being on earth for several more light years? Are we more comfortable with the finite? Is this why we developed theories like Big Bang to explain things we don't know in sizes which we do know?\n\nA group of experts show how the human mind prefers to stop short of a total acceptance of the truly &quot;without end&quot;.\n\nSupersize, it seems, has to stop somewhere!\n\n\n\nPart Two: Mathematics\n\nImagine a hotel with an infinite number of rooms. Even if the hotel is completely full and there are no vacancies, another guest can be easily accommodated...\n\nThis is just one of the fascinating insights that Heather Couper will be exploring in the second part of her quest to think the unthinkable.\n\nShe is joined by mathematicians, psychologists, Sci Fi writers, theologians and a room full of monkeys to try and grasp a handle on how infinity can be seen in our world. The programme looks at how infinity has troubled some of the greatest minds and thinkers, with sometimes deadly consequences. We also learn how Infinity drove one such mathematician to the brink of sanity. Scary stuff indeed. But the entire concept of infinity in mathematics is maddening, and the deeper we go, the stranger the results become.\n\nInfinity has also played an important part in the arts. Heather explores the music of Steve Reich, Michael Nyman and Philip Glass to see how endless repetition has inspired these great composers.\n\nJoin Heather on this tour of an endless audio horizon, where 1=0 and 2 is just a number bigger than 1.\n\n\n\nType : mpeg 1 layer III\nBitrate : 128\t\nMode : joint stereo\nFrequency : 44100 Hz\nEncoder : Lame 3.95\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5fe39805f260688362cad7e78f63846c9a4452c0","amp;dn":"A+Brief+History+of+Infinity++%28BBC+Radio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fe39805f260688362cad7e78f63846c9a4452c0","infoHashBuffer":{"type":"Buffer","data":[95,227,152,5,242,96,104,131,98,202,215,231,143,99,132,108,154,68,82,192]},"announce":[],"urlList":[]}}