{"title":"The Exterminator 2 -Hyperdrive25","uid":6294243,"size":511646720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6035951ff24bc5b2e85a83e009fb88b74c77ed8c&amp;dn=The+Exterminator+2+-Hyperdrive25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Hyperdrive25","files":3,"time":1301938326,"description":"                           THE EXTERMINATOR 2\n                     +++++++++++++++++++++++++++++\n\nExterminator 2 is a 1984 action film written and directed by Mark Buntzman, starring Robert Ginty and Mario Van Peebles, with cameos by Arye Gross in his debut role, and John Turturro in his second role. It is the sequel to the 1980 film The Exterminator.\n\nPlot summary\n------------\nFollowing somewhat incongruously from the previous film, it shows Eastland walking freely on the streets of New York, without any hint that his dual identity was compromised. He meets up with another old army buddy, Be Gee (Faison), who owns a garbage truck. As seen at the beginning of the film, Eastland wears a welders' mask and wields a flame thrower, while listening to a police scanner for possible crimes to stop. Slaying the brother of a gang leader named X (Van Peebles), the Exterminator gains the gang's enmity. Coincidentally, his army buddy happens to see the gang during a robbery of an armoured car, and scares them away with his truck. However, they get the truck's plate numbers, and vow revenge. Following the truck one night when the buddy loans it to Eastland, they follow Eastland to his home, and, not having seen who the driver of the truck was the night it scared them away, they presume Eastland was the man behind the wheel that night. They attack Eastland's girlfriend in the park, crippling her. Later, they break into her apartment and kill her.\n\nThen Eastland and his buddy interrupt a drug deal between X's gang and the mob, stealing the narcotics in the process, though the army buddy dies. Having earlier captured one of the gang members, Eastland allows him to escape to draw X into a confrontation, with the drugs as bait, in a closed up industrial site. Curiously, X seems to be aware of the Exterminator's real name in this final battle. Eastland triumphs, but was shot when last seen, and is seen walking away. There were no further Exterminator movies.\n\n...................................................................................\n\nThis file can be played with any DIVX/MP4 compatible DVD/VCD Player. \nJust burn the MP4 file onto a CD using Nero or Ashampoo Buring Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n                       (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!**********************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\n\n","torrent":{"xt":"urn:btih:6035951ff24bc5b2e85a83e009fb88b74c77ed8c","amp;dn":"The+Exterminator+2+-Hyperdrive25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6035951ff24bc5b2e85a83e009fb88b74c77ed8c","infoHashBuffer":{"type":"Buffer","data":[96,53,149,31,242,75,197,178,232,90,131,224,9,251,136,183,76,119,237,140]},"announce":[],"urlList":[]}}