{"title":"Dave Brubeck  Jazz Goes To College {jazz}(flac)[rogercc]","uid":6169328,"size":234869895,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:604581544049b99fdcb12d9569a82b0650478abd&amp;dn=Dave+Brubeck++Jazz+Goes+To+College+%7Bjazz%7D%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":10,"time":1297508770,"description":"DAVE BRUBECK QUARTET JAZZ GOES TO COLLEGE\nLabel Legacy\nOriginal Year 1954\nRecorded in 1954\nFormat:Flac\nInc: Cover ,Cue, NFO.\n\n\n\nDave Brubeck (piano) began his Columbia Records association on a second album of material that his quartet had cut during its spring of 1954 tour of North American college campuses, Paul and Dave's Jazz Interwoven (1954) being the first. Joining Brubeck are Paul Desmond (alto sax), Bob Bates (bass), and Joe Dodge (drums), whose support of Brubeck is uniformly flawless, ultimately producing what many consider as the most memorable music in the artist's cannon. &quot;Balcony Rock&quot; commences the platter from sides documented at the University of Michigan in Ann Arbor. The heavily improvised tune is formed on an eight-bar blues as Desmond steers the combo via his inspired and lyrical leads. The bouncy &quot;Out of Nowhere,&quot; comes via a show at the University of Cincinnati and centers on Brubeck's uncanny timing as his passages quickly vacillate between edgy and atonal to decidedly more fluid and melodic. Again, Desmond is nothing short of exemplary as his sax weaves around the rhythm section. &quot;Le Souk&quot; hails from Oberlin College in Ohio and provides Desmond another strong vehicle. His lines tie Bates' prominent propulsions together with Dodge's solid backbeat and Brubeck's similarly aggressive bashing. This takes place behind Brubeck's emphatic and frenetic pounding and garners considerable appreciation by those in attendance. The sturdy bop supporting Duke Ellington's &quot;Take the 'A' Train&quot; is given further fuel thanks to the combination of Desmond's straightforward and unfettered blows and Dodge's punchy interjections. &quot;The Song Is You&quot; is a minor masterpiece as Desmond's efforts resonate his exceptional fluidity. In fact, practically the whole track is marked by his cool, limber phrasing, with Brubeck taking the helm only briefly at the end. The refined and stately reading of &quot;Don't Worry 'Bout Me&quot; reaches far beyond the blues intimated by the sense of forlorn in Brubeck's contributions, thanks to the simple if not austere arrangement. The converse can be said regarding the striking energy of &quot;I Want to Be Happy&quot; as the band leans in hard with a purpose and finesse that can be eloquently summed up in the final phrase as all four members seemingly draw the song to a dynamic and dramatic conclusion. Indeed the genre gets schooled on Jazz Goes to College, a (dare say) perfect representation of the Dave Brubeck Quartet's pre-Time Out (1959) antics in the preferable concert performance setting. \n\n\nTracks List\n1.Balcony Rock\n2.Out Of Nowhere\n3.Le Souk\n4.Take The ''a'' Train\n5.The Song Is You\n6.Don't Worry 'Bout Me\n7.I Want To Be Happy\n\nPersonel[/b][/color]\n[color=orangered]Dave Brubeck: piano;\nPaul Desmond: alto saxophone;\nBob Bates: bass;\nJoe Dodge: drums.","torrent":{"xt":"urn:btih:604581544049b99fdcb12d9569a82b0650478abd","amp;dn":"Dave+Brubeck++Jazz+Goes+To+College+%7Bjazz%7D%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604581544049b99fdcb12d9569a82b0650478abd","infoHashBuffer":{"type":"Buffer","data":[96,69,129,84,64,73,185,159,220,177,45,149,105,168,43,6,80,71,138,189]},"announce":[],"urlList":[]}}