{"title":"TMPGEnc DVD Author With DivX Authoring v3.1.2.176 EMBRACE ","uid":4240881,"size":50531987,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:60b0923d82f19728530abfb999215a49d8e10877&amp;dn=TMPGEnc+DVD+Author+With+DivX+Authoring+v3.1.2.176+EMBRACE+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"aoloffline","files":1,"time":1213539224,"description":"Main features\n1. DivXÂ® Ultra Authoring\n\nDivXÂ® UltraWith DivXÂ® Ultra authoring, your DivXÂ® projects can now have advanced features such as DVD-like menus and navigation! DivXÂ® projects created with TMPGEnc DVD Author 3 with DivXÂ® Authoring are the ultimate combination of DVD-like presentation with DivXÂ® technology. Play your DivXÂ® Ultra projects with DivXÂ® Player software on your PC or any DivXÂ® Ultra Certified DVD player in the comfort of your livingroom.\n? Officially licensed DivXÂ® video software product\n? Creates high-quality DivXÂ® video\n\n2. DV and HDV Capture\n\nNow you can capture video directly from your DV or HDV camcorder. Just plug your camcorder into your computer via an IEEE 1394 interface and TMPGEnc DVD Author 3 with DivXÂ® Authoring will be able to view the camcorder&amp;#039;s contents and add it as a source file.\n\nDV and HDV Capture image\n\n3. Improved Format Importing\n\nDVD Author 3 with DivXÂ® Authoring lets you add even more types of source files to your projects than TMPGEnc DVD Author 2.0. Add DVD-VIDEO, DVD-VR, MPEG1/2, AVI, Windows Media, DivXÂ®, and QuickTime (mov, qt, mp4, m4a, 3gp, 3g2) file formats.\n\nImport and Export Formats\n\n4. Multiple Subtitle Streams\n\nAdd up to two subtitle streams.New to DVD Author 3 with DivXÂ® Authoring is the ability to have up to two subtitle streams for your DivXÂ® or DVD projects! Create your own multiple language DivXÂ® or DVD projects with multiple subtitle streams.\n\n5. DivXÂ® HD Support\n\nGot high definition movie files? Make a DivXÂ® HD project with advanced features that keeps the high resolution of HD without the huge file size, then watch your creation on your computer or DivXÂ® Certified High Definition DVD player.\nDivX HD Support\n6. Menu Creation\n\nChoose between all-new pre-made menu templates or design your own. With its robust menu creation process, TMPGEnc DVD Author 3 with DivXÂ® Authoring allows you to customize your menus quickly and easily. Freely position and resize your titles, thumbnail images, and text, or create stunning motion menus that bring your creation to life. Change highlight colors, screen ratios, and more!\n\n7. Smart Rendering\n\nThe improved Smart Rendering technology of TMPGEnc DVD Author 3 with DivXÂ® Authoring makes encoding faster, allowing you to edit and output your DivXÂ® and DVD projects much quicker than other authoring software.\n\n8. Optimized Encoding\n\nTMPGEnc DVD Author 3 with DivXÂ® Authoring is optimized for IntelÂ® Core? 2 Duo Processors and IntelÂ® Duo/Extreme? Processors for a speed increase of 5%-18% over TMPGEnc DVD Author 2.0.\n\n9. Menu Note Page\n\nMenu Note Page screen captureNew to TMPGEnc DVD Author 3 with DivXÂ® Authoring is the ability to add note pages to your menus. Use the note page for anything you wish--add an introduction message, credits, images, actor bios, or anything else you can think of!\n\n10. Transcoding Engine\n\nThe Smart Rendering technology of TMPGEnc DVD Author 3 with DivXÂ® Authoring allows you to transcode (shrink) your projects to fit onto single or dual-layer DVD&amp;#039;s, or even CD-R and CD-RW&amp;#039;s (transcoding to CD for DivXÂ® projects only).\n\n11. Menu Simulation\n\nTest your custom menus before you burn your project to disc with the menu simulation stage. The simulator mimics the controls of an actual DVD-player, allowing you to see exactly how your menu will look and work.\n\nMenu Simulation screen capture\n12. Support for IntelÂ®&amp;#039;s Latest Processors!\n\nIntel Core 2 ExtremeAs of Version 3.1.1.174, TMPGEnc DVD Author 3 with DivXÂ® Authoring is optimized for SSE4 and IntelÂ®&amp;#039;s latest processors--The IntelÂ® Core?2 Extreme quad-core QX9650 processor and the IntelÂ® Xeon 5400 family of processors!\n\n\n","torrent":{"xt":"urn:btih:60b0923d82f19728530abfb999215a49d8e10877","amp;dn":"TMPGEnc+DVD+Author+With+DivX+Authoring+v3.1.2.176+EMBRACE+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b0923d82f19728530abfb999215a49d8e10877","infoHashBuffer":{"type":"Buffer","data":[96,176,146,61,130,241,151,40,83,10,191,185,153,33,90,73,216,225,8,119]},"announce":[],"urlList":[]}}