{"title":"BBC Why Poverty 6 of 8 Solar Mamas HC Eng Subs 2012 XviD","uid":7931096,"size":734762486,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:60dd5790c646f10506acf37d8fc1107529fbe2b6&amp;dn=BBC+Why+Poverty+6+of+8+Solar+Mamas+HC+Eng+Subs+2012+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1355720816,"description":" &lt;a href=&quot;http://www.bbc.co.uk/programmes/p010jyb8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.bbc.co.uk/programmes/p010jyb8&lt;/a&gt;\n\nSolar Mamas follows the remarkable story of Rafea, a mother-of-four from Jordan \nwho challenges the status quo of her traditional marriage by travelling to \nIndia to train as a solar engineer for six months. Along with 27 other mothers \nand grandmothers from poor communities around the world - many of whom are \nilliterate - she will learn the skills needed to bring electricity and light \nback to her village.\n\nFor Rafea, it is a life changing journey. As the second wife of a Bedouin \nliving in a remote part of the Jordanian desert, she has had limited \nopportunities in life. Now she has been selected to attend the Barefoot College \nin India run by the inimitable Roy Bunker. Alongside women from Kenya, Burkina \nFaso and Colombia and across cultural and language divides, Rafea needs to get \nto grips with electrical components, circuit boards and soldering. Her new \nknowledge will see her do things she never imagined, but it will also have an \nunanticipated effect on her relationship with her patriarchal husband.\n\nAddressing themes of education, gender equality, environmental sustainability \nand development, the documentary takes an inspiring and compelling look at \npoverty - and the ways women around the world are working to pull themselves \nout of the poverty trap.\n\nA BBC Storyville film, produced in partnership with the Open University, it \nscreens as part of Why Poverty? - when the BBC and the OU, in conjunction with \nmore than 70 broadcasters around the world, hosts a debate about contemporary \npoverty.\n\nIncludes hard coded English Subs.","torrent":{"xt":"urn:btih:60dd5790c646f10506acf37d8fc1107529fbe2b6","amp;dn":"BBC+Why+Poverty+6+of+8+Solar+Mamas+HC+Eng+Subs+2012+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60dd5790c646f10506acf37d8fc1107529fbe2b6","infoHashBuffer":{"type":"Buffer","data":[96,221,87,144,198,70,241,5,6,172,243,125,143,193,16,117,41,251,226,182]},"announce":[],"urlList":[]}}