{"title":"Iain Murray - The Really Inconvenient Truths","uid":6639082,"size":1210330724,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:60eaf2856fd75265752561a6d24c689d5147dfcc&amp;dn=Iain+Murray+-+The+Really+Inconvenient+Truths&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1314683129,"description":"Iain Murray - The Really Inconvenient Truths\n\n\nProduct Details\nAudio CD\nPublisher: Blackstone Audiobooks, Inc.; Unabridged edition (June 1, 2008)\nLanguage: English\nDuration: 10 hrs, 30 min\nISBN-10: 1433251035\nISBN-13: 978-1433251030\n &lt;a href=&quot;\nhttp://bayimg.com/aAJBpaADN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/aAJBpaADN&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Really-Inconvenient-Truths-Murray/dp/1433251035/ref=pd_rhf_p_t_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Really-Inconvenient-Truths-Murray/dp/1433251035/ref=pd_rhf_p_t_2&lt;/a&gt;\n\nProduct Description\n\nIain Murray's rollicking expose reveals how environmental blowhards waste more energy, endanger more species, and actually \n\nkill more people than the environmental villains they finger.\n\nFrom the Inside Flap\n\nAl Gore is bad for the planet...\n\nTalk about really inconvenient truths--that's one of the many you'll find in Iain Murray's rollicking exposÃƒÂ© of environmental blowhards who waste more energy, endanger more species, and actually kill more people (yes, that's right) than the environmental villains they finger. Did you know that estrogen from birth control and &quot;morning after&quot; pills is causing male fish across America to develop female sex organs? Funny how &quot;pro-choice&quot; and &quot;environmentalist&quot; liberals never talk about that. Or how about this: the Live Earth concert to &quot;save the planet&quot; released more CO2 into the atmosphere than a fleet of 2,000 Humvees emit in a year? We hear a lot about AIDS in Africa, but the number one killer of children in much of Africa is malaria--and guess who was responsible for banning the pesticide that used to have malaria under control? Iain Murray, a sprightly conservative environmental analyst with a long record of skewering liberal hypocrisy, has dug up seven of the all-time great environmental catastrophes caused by the Left and exposed them in The Really Inconvenient Truths. Murray lays bare:\n\n* How ethanol, the liberals' favorite fuel, is destroying the world's rainforests--and could cause global food shortages \n* How Al Gore's hero Rachel Carson cost the lives of millions of Africans through her efforts to ban DDT \n* How the environmentalists have covered up the polluting effects of contraceptive and chemical abortion drugs \n* How the Endangered Species Act actually endangers species \n* How Gore's vision of greater state control over the economy has already produced some of the greatest environmental disasters in history\n\nAll of us want a planet with clean air and clean water, vibrant forests, healthy animal populations, and glorious open space. But liberal environmentalists aren't the ones to deliver it. In fact, they've made the planet worse, while old-fashioned property rights, unpopular hunters, and the innovative engine of capitalism have made it better. The facts are all here, in a book that Al Gore would rather burn than read.\n\n\n***NOTE*** - This audiobook was originally part of a now defunct torrent by TPB uploader Spanikopita, who appears to have stopped uploading. I was asked in the comment section of one my own torrents if I had any of the books in THAT torrent. I have this one, and one other. All I have done with this book was to gussy up the tags and re-release it. Originally, it was to be found here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4960952/Hunting_Eichmann__Really_Inconvenient_Truths__Alamo__More&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4960952/Hunting_Eichmann__Really_Inconvenient_Truths__Alamo__More&lt;/a&gt;\n","torrent":{"xt":"urn:btih:60eaf2856fd75265752561a6d24c689d5147dfcc","amp;dn":"Iain+Murray+-+The+Really+Inconvenient+Truths","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60eaf2856fd75265752561a6d24c689d5147dfcc","infoHashBuffer":{"type":"Buffer","data":[96,234,242,133,111,215,82,101,117,37,97,166,210,76,104,157,81,71,223,204]},"announce":[],"urlList":[]}}