{"title":"Super Dinosaur (darkhomr) [TPB]","uid":7836127,"size":404417546,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:60ee14716c5ce2b306d5092e6b112aab99dc3935&amp;dn=Super+Dinosaur+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dadrkhomr","files":16,"time":1353192297,"description":"This is a user request.  All user requests will be honored and attempted as long as: \n 1)  I have room on my seedbox\n 2)  They are reasonable requests\n 3)  I get them in private messages onKAT, or Extratorrent.  I cannot guarentee I will see requests in the comments sections of my releases.\n\n\nIncluded in this torrent are the first 15 issues of Super Dinosaur, as well as the Special.  This brings you up to date on this series.\n\nPlot synopsis\n \nScientists Doctor Dynamo and Max Maximus together discovered a hole in the Earth that led to Inner Earth, a place where dinosaurs live. In addition to dinosaurs, Inner Earth is home to DynOre, a valuable deposit of solar power contained in a rock.[4] While conducting experiments there, Maximus genetically altered a Tyrannosaurus, with which he tried to take over the world. Doctor Dynamo and his son, Derek, stopped him and formed a team with the Super Dinosaur to protect Inner Earth from Maximus. As Kirkman explains:\n \n&quot;In the falling out between Max Maximus and the Dynamos, Doctor Dynamo was injured to the point where he can't really think as much as he could before. His brain isn't really working right but he doesn't know it, so Derek has to go behind him and finish his equations for him, correcting his work and doing whatever he can to make sure that his father doesn't realize that he has this ailment now. It's also so the government overseers don't see that their operation is being run by a 10-year-old kid, so it's to make his dad look good and make sure that he can keep working.&quot;[3]\n","torrent":{"xt":"urn:btih:60ee14716c5ce2b306d5092e6b112aab99dc3935","amp;dn":"Super+Dinosaur+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60ee14716c5ce2b306d5092e6b112aab99dc3935","infoHashBuffer":{"type":"Buffer","data":[96,238,20,113,108,92,226,179,6,213,9,46,107,17,42,171,153,220,57,53]},"announce":[],"urlList":[]}}