{"title":"Encyclopedia of the Blues (2006)","uid":5506026,"size":9592195,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6119a570cc0c7c311f8837e49fa3f928ac59f13c&amp;dn=Encyclopedia+of+the+Blues+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1271813109,"description":"Encyclopedia of the Blues\n\nEdward M. Komara\n\nRoutledge 2006) | ISBN-10: 0415927005 | 1100 Pages | PDF | 10,1 MB \n\n\n\n\n\n\n\n\n\n\n\nThis encyclopedia is devoted to covering the blues as a musical form while also exploring its historical and cultural foundations. The 2,100 entries, written by 140 scholars and musicians, are arranged alphabetically and range in length from brief definitions (a couple of sentences) to long, analytical articles (5,000 words). \n\n\nAccess is aided by both an alphabetical and a thematic list of entries as well as a comprehensive subject, people, and song-title index. There is also some cross-referencing between related entries. Although the text is occasionally supplemented with black-and-white photographs, the aesthetic appeal would have been greater with more pictures, particularly given the large number of biographical entries.\n\nThe majority of entries are indeed biographical, covering performers, historians, songwriters, and label owners. Coverage is also heavily weighted toward record labels ( Irma, Matchbox). Other, less-represented areas of coverage include musical styles, forms, techniques, and instruments ( Field hollers, Funk, Scales); specific regions ( Africa, Chicago); the historiography of the blues ( Libraries, Periodicals); cultural aspects of the blues ( Racial issues and the blues, Women and the blues); business aspects ( Chitlin Circuit, Marketing); and individual songs (&quot; Mustang Sally, &quot; &quot; Stormy Monday&quot;). Each entry ends with a bibliography of further reading, and each biographical entry also has a discography. \n\n\nIn the case of major musicians, a list of selected recordings and reissues is also included. References rely heavily on a short list of &quot;frequently cited sources&quot; that wisely includes the All Music Guide to the Blues (Backbeat, 2003) and Robert Santelli's The Big Book of Blues: A Biographical Encyclopedia (Penguin, 1993).\n\nLibraries with access to the above-referenced blues titles or the Grove Music Online database already offer basic coverage for mainstream questions about the blues, but this encyclopedia clearly fills a gap by offering multifaceted coverage in one place. \n\n\nThe blues, when treated as an encyclopedic subject, often gets lumped together with jazz, folk, or gospel; it is rare to see it stand on its own. This encyclopedia is more comprehensive than the last attempt at a solely blues encyclopedia, the same-titled Encyclopedia of the Blues (University of Arkansas, 1997). Recommended for all music libraries and all libraries supporting blues scholars. \n-- Susan Gardner, American Library Association.\n\nAn impressive list of contributors... Besides being rich with biographical entries, this Encyclopedia also includes entries for important record labels, instruments, styles, geographic regions, aspects of the business, and additional topics that have been lacking in other encyclopedic efforts... This is a valuable addition to the reference shelf of blues literature... Highly recommended. -- Choice\n\n\n\nThis two-volume A-to-Z set effectively categorizes the history of the blues. A great benefit is that the book features blues artists from all time periods, and the number of obscure blues artists listed in remarkable. Essential for any library collecting the history of the blues. \n-- Library Journal\n\n\n\nIn this two-volume encyclopedia, Komara provides about 2100 entries, both brief and extensive, on the blues, its history, culture, roots, contemporary styles, artists, historians, songwriters, record labels, forms, characteristics, instruments, songs, regions, historiography, music business, and related forms. Discographies and bibliographiesfor each entry are included, as well as a thematic list of entries and an index in each volume. \n--Reference &amp; Research Book News\n\n","torrent":{"xt":"urn:btih:6119a570cc0c7c311f8837e49fa3f928ac59f13c","amp;dn":"Encyclopedia+of+the+Blues+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6119a570cc0c7c311f8837e49fa3f928ac59f13c","infoHashBuffer":{"type":"Buffer","data":[97,25,165,112,204,12,124,49,31,136,55,228,159,163,249,40,172,89,241,60]},"announce":[],"urlList":[]}}