{"title":"Tortured for Christ - Richard Wurmbrand","uid":11773153,"size":460038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61381ecaa9eb0fccbae7b887404128892f64d80c&amp;dn=Tortured+for+Christ+-+Richard+Wurmbrand&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":2,"time":1427155880,"description":"One Man Who Dared to Stand Up\n\nMonths of solitary confinement, years of periodic physical torture, constant suffering from hunger and cold, the anguish of brainwashing and mental cruelty--these are the experiences of a Romanian pastor during his 14 years in Communist prisons.His crime, like that of thousands of others, was his fervant belief in Jesus Christ and his public witness concerning that faith.Meeting in homes, in basements, and in woods--sometimes daring to preach in public on street corners--these faithful souls persisted in their Christian witness knowing full well the ultimate cost of their actions.This is their story--a classic account of courage, tenacious faith, and unbelievable endurance. This history of the Underground Church reflects the continuing struggle in many parts of the world today.\n\nThis classic story of amazing faith in shocking circumstances has been updated for a new generation. Its message remains urgent and relevant: thousands of Christians are still persecuted and tortured around the world today, suffering solely for their belief in Jesus Christ. Richard Wurmbrand endured months of solitary confinement, years of periodic physical torture, constant suffering from hunger and cold, the anguish of brainwashing and mental cruelty. His captors lied to his wife, saying he was dead. Yet he went on to tell the West the truth about Christianity behind the Iron Curtain. Millions of people have been touched by this story, and thirty years after its first publication it is now updated with a new foreword by Rob Frost, a picture section and details of the final years of Wurmbrand's life.\n\nAbout the author:\nRichard Wurmbrand (March 24, 1909 ? February 17, 2001) was a Romanian Christian minister of Jewish descent. He was a youth during a time of anti-Semitic activity in Romania, but it was later, after becoming a believer in Jesus Christ as Messiah, and daring to publicly say that Communism and Christianity were not compatible, that he experienced imprisonment and torture for his beliefs. After serving five years of a second prison sentence, he was ransomed for $7,000. His colleagues in Romania urged him to leave the country and work for religious freedom from a location less personally dangerous. After spending time in Norway and England, he and his wife Sabina, who had also been imprisoned, emigrated to America and dedicated the rest of their lives to publicizing and helping Christians who are persecuted for their beliefs. He wrote more than 18 books, the most widely known being Tortured for Christ. Variations of his works have been translated into more than 60 languages. He founded the international organization Voice of the Martyrs, which continues to aid Christians around the world who are persecuted for their faith.\nHe died at the age of 91 on February 17, 2001 in a hospital in Torrance, California. His wife, Sabina, had died six months earlier on August 11, 2000. In 2006, he was voted fifth among the greatest Romanians according to the Mari Rom?ni poll","torrent":{"xt":"urn:btih:61381ecaa9eb0fccbae7b887404128892f64d80c","amp;dn":"Tortured+for+Christ+-+Richard+Wurmbrand","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61381ecaa9eb0fccbae7b887404128892f64d80c","infoHashBuffer":{"type":"Buffer","data":[97,56,30,202,169,235,15,204,186,231,184,135,64,65,40,137,47,100,216,12]},"announce":[],"urlList":[]}}