{"title":"Prowlers Series By Christopher Golden","uid":9471457,"size":2654044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6140c9cff2a95528112cb7a854023d0bb339ad21&amp;dn=Prowlers+Series+By+Christopher+Golden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"maxdesolate","files":16,"time":1389586263,"description":"4 books.\n\n1 - Prowlers\nWhen nineteen-year-old Jack Dwyer's best friend Artie is murdered, he is devastated. But his world is truly turned upside down when Artie emerges from the Ghostlands to bring him a warning. With his dead friend's guidance and the help of the one person who doesn't think he's insane, Jack learns of the existence of the Prowlers. Under bold new leader Owen Tanzer, the Prowlers, already eight packs strong, have united. They move from city to city, preying on humans until they are close to being exposed, then they move on. And unlike werewolves of legend, they aren't human beings whom the moon transforms into wolves...they are savage beasts masquerading as humans. Jack wants revenge. But even as he hunts the Prowlers, he marks himself -- and all of his loved ones -- as prey.\n\n2 - Laws of Nature\nJack Dwyer defeated the pack of Prowlers who had preyed upon the city of Boston with their leader, Owen Tanzer. Tanzer may be gone, but now that Jack is aware of their existence, he is on a constant lookout for evidence of Prowler presence elsewhere. So when his sister, Courtney, and her friend Bill uncover reports of vicious animal attacks in rural Buckton, Vermont, his suspicions are aroused. Messages from the Ghostlands confirm the worst, and Jack and Molly -- whose feelings for each other are growing harder to ignore -- head for the mountains. Buckton is a small, quaint town. Jack and Molly are expecting a warm welcome, but instead they are met with distrust. Soon they discover that Buckton is a town with deep secrets, and before they know it, the two become the lead suspects in a rash of brutal murders....\n\n3 - Predator and Prey\nJack Dwyer has a new enemy...a vicious, ravenous beast brings a new dimension of terror to the third in Christopher Golden's spectacular dark fantasy series. Ever since his best friend Artie was brutally murdered by the savage predators known as Prowlers, Jack Dywer has been able to see and communicate with ghosts. Now Artie, along with other spirits who inhabit the limbo known as the Ghostlands, helps Jack in his quest to track down and eliminate the Prowler threat. But Artie's latest information is startling: The Ghostlands itself is under threat from a new and terrible entity known only as the Ravenous. The Ravenous is stalking the inhabitants of the Ghostlands and destroying them. Those who fall prey to it suffer the ultimate death. For them, there is no longer the chance to move on or be at peace. There is only oblivion. So many times the spirits have helped Jack hunt down or escape the Prowlers. Now it is his turn to save them from the Ravenous -- if he can do so without endangering himself. For Jasmine, the Prowlers' new leader, has ordered her pack to wipe out Jack and his allies at any cost. Jack needs Artie to help him keep the vengeful Prowlers at bay. But the Ravenous is on Jack's trail, and contact with the Ghostlands will lead the supernatural killer straight to him. His links with the dead are a double-edged sword -- and Jack is not sure whether he can avoid being cut...\n\n4 - Wild Things\nLong have the packs lacked a great leader. Scattered far and wide, they have hunted as best they could in the hard lands, in places where their predations could be passed off as the work of true wolves. instead of Prowlers A series of mysterious deaths leads Jack Dwyer and Molly Hatcher to the fastlanes, rest stops, and all-night diners of a highway in upstate New York. Meanwhile, their friend Bill Cantwell heads to Manhattan in search of his missing niece, a fledgling musician with lots of attitude. Back in Boston, Jack's sister, Courtney, is left to hold the fort. But Jasmine, the sultry Prowler who barely survived her run-in with them in Boston, has begun to build a new pack in New York. When Bill probes the Prowler underground, he finds old friends, secret alliances, and betrayal, and his predicament draws Courtney away from Boston on a quest to make sure the man she loves gets home safely. To the north, Jack and Molly uncover the truth -- that the pack has grown larger than they could ever have realized. With Prowlers all around them, they must reach out to all of their allies, dead or alive, if they are to save Bill and Courtney and survive the final conflict with Jasmine.\n\nepub and mobi. ","torrent":{"xt":"urn:btih:6140c9cff2a95528112cb7a854023d0bb339ad21","amp;dn":"Prowlers+Series+By+Christopher+Golden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6140c9cff2a95528112cb7a854023d0bb339ad21","infoHashBuffer":{"type":"Buffer","data":[97,64,201,207,242,169,85,40,17,44,183,168,84,2,61,11,179,57,173,33]},"announce":[],"urlList":[]}}