{"title":"Maroon 5 - This Love","uid":4944868,"size":120623108,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:614b9ce64a44e1ba12a511848dc3840c5de98729&amp;dn=Maroon+5+-+This+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1244612384,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;This Love&quot; is a song by the American rock band Maroon 5. The song was written by frontman Adam Levine and keyboardist Jesse Carmichael, for their debut album Songs About Jane (2002). The track is built around a piano-led strut, which is immediately followed by synth percussions, a repeating guitar sound, and wry falsetto.\n\nThe song's lyrics are based on Adam Levine's break-up with a former girlfriend, which he admits that the relationship was ending. Levine revealed that the song was written in the &quot;most emotionally trying time&quot; in his life. He also describes some of the lyrics in the song as sexual. &quot;This Love&quot; was well-received by music critics, who noted the track's general sound. It was released on January 27, 2004 as the second single off Songs About Jane.\n\nThe single entered the top ten on most charts, topping several of Billboard magazine's component charts, including reaching the number one spot on the Hot Adult Top 40 Tracks chart. The music video was met with controversy, regarding extended intimate scenes between Levine and his then-girlfriend. &quot;This Love&quot; helped Maroon 5 win the MTV Video Music Award for Best New Artist and was the third most played song of 2004. The song won Best Pop Performance by a Duo or Group with Vocals at the 2006 Grammy Awards, and, to date, is one of Maroon 5's most successful songs.\n\nThe music video for &quot;This Love&quot; was directed by Sophie Muller. The video combines a performance footage from the band in a courtyard in a Mexico soundstage. The video also features scenes of Adam Levine parting ways with a woman. According to Levine, the concept behind the music video was based on Prince. &quot;An overt sexuality confuses people, too. That video was a very 'pop star' thing to do.&quot;\n\nThe music video for &quot;This Love&quot; features Levine and his then-girlfriend, model Kelly McKee, in extended intimate scenes. The video used creative camera angles and Kelly was wearing a minimalist G-string to show as much as possible without actually revealing any of the couple's genitalia (especially the woman's breasts, which are never seen throughout the video), thereby avoiding possible FCC action. A version of the video where a stream of computer-generated flowers cover up more was created for more conservative markets.\n\nWhen asked about the controversy surrounding the video, Levine said: &quot;It was surprisingly not weird and surprisingly not sexual. It was totally comfortable. I didn't get horny or anything, which was weird since I shot it with my girlfriend.&quot; In another interview, Levine commented, &quot;That was ridiculous.&quot; Bass player Michael Madden said that it was &quot;an absurd over-reaction.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:614b9ce64a44e1ba12a511848dc3840c5de98729","amp;dn":"Maroon+5+-+This+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"614b9ce64a44e1ba12a511848dc3840c5de98729","infoHashBuffer":{"type":"Buffer","data":[97,75,156,230,74,68,225,186,18,165,17,132,141,195,132,12,93,233,135,41]},"announce":[],"urlList":[]}}