{"title":"You Are Not Your Brain: The  Solution for Changing Bad Habits","uid":8249311,"size":1139010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:617eccab3b387ef08fac25427ae50b09fcac1083&amp;dn=You+Are+Not+Your+Brain%3A+The++Solution+for+Changing+Bad+Habits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1363128204,"description":"effrey M. Schwartz, Rebecca Gladding, &quot;You Are Not Your Brain: The 4-Step Solution for Changing Bad Habits, Ending Unhealthy Thinking, and Taking Control of Your Life&quot;\nISBN: 1583334262 | 2011 | EPUB\n\nTwo neuroscience experts explain how their 4-Step Method can help break destructive thoughts and actions and change bad habits for good.\n\nA leading neuroplasticity researcher and the coauthor of the groundbreaking books Brain Lock and The Mind and the Brain, Jeffrey M. Schwartz has spent his career studying the structure and neuronal firing patterns of the human brain. He pioneered the first mindfulness-based treatment program for people suffering from OCD, teaching patients how to achieve long-term relief from their compulsions.\n\nFor the past six years, Schwartz has worked with psychiatrist Rebecca Gladding to refine a program that successfully explains how the brain works and why we often feel besieged by bad brain wiring. Just like with the compulsions of OCD patients, they discovered that bad habits, social anxieties, self-deprecating thoughts, and compulsive overindulgence are all rooted in overactive brain circuits. The key to making life changes that you want-to make your brain work for you-is to consciously choose to &quot;starve&quot; these circuits of focused attention, thereby decreasing their influence and strength","torrent":{"xt":"urn:btih:617eccab3b387ef08fac25427ae50b09fcac1083","amp;dn":"You+Are+Not+Your+Brain%3A+The++Solution+for+Changing+Bad+Habits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"617eccab3b387ef08fac25427ae50b09fcac1083","infoHashBuffer":{"type":"Buffer","data":[97,126,204,171,59,56,126,240,143,172,37,66,122,229,11,9,252,172,16,131]},"announce":[],"urlList":[]}}