{"title":"Graphene Science Handbook - Nanostructure and Atomic Arrangement","uid":14741744,"size":50821846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:619d6e38ae9e73be553f799d770288ae48e5165c&amp;dn=Graphene+Science+Handbook+-+Nanostructure+and+Atomic+Arrangement&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1464676590,"description":"Graphene Science Handbook - Nanostructure and Atomic Arrangement - Mahmood Aliofkhazraei et al. (CRC, 2016).pdf\r\n\r\nISBN 978-1-4665-9138-7\r\n\r\nExamines the Low Resistivity, High Mobility, and Zero Bandgap of Graphene\r\n\r\nThe Graphene Science Handbook is a six-volume set that describes graphene’s special structural, electrical, and chemical properties. The book considers how these properties can be used in different applications (including the development of batteries, fuel cells, photovoltaic cells, and supercapacitors based on graphene) and produced on a massive and global scale.\r\n\r\nVolume One: Fabrication Methods\r\n\r\nVolume Two: Nanostructure and Atomic Arrangement\r\n\r\nVolume Three: Electrical and Optical Properties\r\n\r\nVolume Four: Mechanical and Chemical Properties\r\n\r\nVolume Five: Size-Dependent Properties\r\n\r\nVolume Six: Applications and Industrialization\r\n\r\nThis handbook describes the fabrication methods of graphene; the nanostructure and atomic arrangement of graphene; graphene’s electrical and optical properties; the mechanical and chemical properties of graphene; the size effects in graphene, characterization, and applications based on size-affected properties; and the application and industrialization of graphene.\r\n\r\nVolume two is dedicated to nanostructure and atomic arrangement and covers:\r\n\r\nThe potential applications of graphene heterostructures, particularly, graphene/h-BN heterostructures\r\nAtomic-scale defects in graphene and the huge impact they have on its low-energy electronic structure\r\nRecent findings on graphene plasmonics\r\nThe storage of hydrogen between graphene and inside graphene-oxide frameworks (GOFs)\r\nThe nitrogen contents, species, synthesis methods, and application on nitrogen-doped graphene\r\nModification methods and applications of graphene and graphene oxide\r\nPhonon spectra and vibrational thermodynamic characteristics of graphene nanofilms\r\nThe imaging of graphene by scanning electron microscopy (SEM)\r\nAdvances in the formation of graphene-based three-dimensional (3D) architectures and more","torrent":{"xt":"urn:btih:619d6e38ae9e73be553f799d770288ae48e5165c","amp;dn":"Graphene+Science+Handbook+-+Nanostructure+and+Atomic+Arrangement","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"619d6e38ae9e73be553f799d770288ae48e5165c","infoHashBuffer":{"type":"Buffer","data":[97,157,110,56,174,158,115,190,85,63,121,157,119,2,136,174,72,229,22,92]},"announce":[],"urlList":[]}}