{"title":"DC.Last.of.the.Czars.1of3.Nicky.and.Alix.XviD.AC3..avi","uid":7247850,"size":855255040,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:61df32c8c66f017f48fc65492b65ca5234193514&amp;dn=DC.Last.of.the.Czars.1of3.Nicky.and.Alix.XviD.AC3..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":-1,"time":1336353880,"description":"History Documentary hosted by Linda Kenyon, published by Discovery Channel in 1996 - English narration\n\n\nInformation\n------------------------------\n\n\nHistory comes to life, in the Discovery Channel's production of Last of the Czars. The viewer learns about the Tsar and Tsarina, their five children, and the holy man, Rasputin. Exploring the events leading up to the execution of the royal family in 1918, The Discovery Channel utilizes archival film footage and previously unseen photographs to illuminate the story of the doomed family. History unfolds amid the unrest of a war-ravaged Russian population as survivors from the era of the Romanovs reveal details pertaining to the family. \n\nThe Romanov family ruled Russia for 300 years; an imperial empire that crumbled in 1918 when Lenin-backed revolutionaries toppled Nicholas II in a violent upheaval. Before their world came crashing down, the Romanovs-- Nicholas, Alexandra and their five children-- enjoyed a life shrouded in mystery. But with the recent downfall of the Soviet Union, information has come to light ending generations of speculation. Rare, never-before-seen film footage, actual letters, czarist-era survivor interviews, photos, and other rare items give a finely-detailed look at Russia's most dramatic era.\n\n\n\nEpisode 1 : Nicky and Alix\n\nPreviously unseen footage, old letters, and rare photos enhance this production of the Romanov family's problems, which led to their tragic deaths and the end of monarchy in Russia. The Discovery Channel film, Last of the Czars, Pt. 1: Nicky &amp; Alix brings the principal players to life, as the viewer learns about the Czar and Czarina, known as Nicky and Alix, their five children, and the mad monk, Rasputin. The Royal family lived a life of luxury, unaware of the general condition of the country and its growing unrest. This turmoil would lead to the execution of the entire family.\n\n\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2089 kbps\nVideo Resolution: 704x528\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 49:46.320\nNumber Of Parts: 3\nPart Size: 815 MB\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:61df32c8c66f017f48fc65492b65ca5234193514","amp;dn":"DC.Last.of.the.Czars.1of3.Nicky.and.Alix.XviD.AC3..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61df32c8c66f017f48fc65492b65ca5234193514","infoHashBuffer":{"type":"Buffer","data":[97,223,50,200,198,111,1,127,72,252,101,73,43,101,202,82,52,25,53,20]},"announce":[],"urlList":[]}}