{"title":"The Savage Wars Of Peace - Small Wars And The Rise Of American P","uid":9949934,"size":5054843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62f09dea4eaffb4511e49fc0969e39ca68a8a9ab&amp;dn=The+Savage+Wars+Of+Peace+-+Small+Wars+And+The+Rise+Of+American+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AtomTPB","files":1,"time":1397385193,"description":"Paperback: 464 pages\nPublisher: Basic Books; Reprint edition (May 27, 2003)\nLanguage: English\nISBN-10: 046500721X\nISBN-13: 978-0465007219\n\n\n\nAmerica's &quot;small wars,&quot; &quot;imperial wars,&quot; or, as the Pentagon now terms them, &quot;low-intensity conflicts,&quot; have played an essential but little-appreciated role in its growth as a world power. Beginning with Jefferson's expedition against the Barbary Pirates, Max Boot tells the exciting stories of our sometimes minor but often bloody landings in Samoa, the Philippines, China, Haiti, the Dominican Republic, Nicaragua, Mexico, Russia, and elsewhere. Along the way he sketches colorful portraits of little-known military heroes such as Stephen Decatur, &quot;Fighting Fred&quot; Funston, and Smedley Butler. From 1800 to the present day, such undeclared wars have made up the vast majority of our military engagements. Yet the military has often resisted preparing itself for small wars, preferring instead to train for big conflicts that seldom come. Boot re-examines the tragedy of Vietnam through a &quot;small war&quot; prism. He concludes with a devastating critique of the Powell Doctrine and a convincing argument that the armed forces must reorient themselves to better handle small-war missions, because such clashes are an inevitable result of America's far-flung imperial responsibilities.","torrent":{"xt":"urn:btih:62f09dea4eaffb4511e49fc0969e39ca68a8a9ab","amp;dn":"The+Savage+Wars+Of+Peace+-+Small+Wars+And+The+Rise+Of+American+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62f09dea4eaffb4511e49fc0969e39ca68a8a9ab","infoHashBuffer":{"type":"Buffer","data":[98,240,157,234,78,175,251,69,17,228,159,192,150,158,57,202,104,168,169,171]},"announce":[],"urlList":[]}}