{"title":"Steve Jobs vs Bill Gates","uid":6736610,"size":180316020,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:62f6feec12ae308dfffda944d80305bdff3b6df1&amp;dn=Steve+Jobs+vs+Bill+Gates+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Oromia","files":3,"time":1318350802,"description":"Bill Gates Vs Steve Jobs - Who is the Most Powerful in Computer\n\nBBC \n\n\nSince the 1980s Steve Jobs and Bill Gates have gone head to head in the business world. They battled it out for control of the PC market during the 1990s. Jobs concentrating more on quality while Bill Gates worked on monopolizing the market itself.\n\nI don't think it's a stretch to say that the 1990s belonged to Bill Gates. Microsoft nearly cornered the market completely on PC and by 1995 Bill Gates was the richest man in the world. A spot he would hold for more than a dozen years, until he gave 24 billion dollars to charity. In contrast during the second half of the 1990s apple had contemplated going through bankruptcy. Both men had stepped on the backs of the bruised to make it to the top but Microsoft became the master of technology during the decade.\n\nDuring the 2000s it was another matter entirely. Jobs switched gears away from PCs and created the I-pod. This new device captured the imagination of the user as the new cool toy everyone had to have and it gave way to Apple establishing I-tunes to be able to sell music online for the devices. Later Jobs would come up with a new generation of devices switching even more to the portable nature of the 2000s with the I-pod touch, I-phone and eventually the I-Pad.\n\nWith both the I-phone and I-pad the demand was so great that massive shortages and even riots occurred when they were released. With the release of these devices Jobs was able to recapture the user base that was migrating from PCs to more portable devices. With their release also came the sale of not just music through the I-tunes store but games and many applications generating even more money for Apple. It is clear that the 2000s belong to Apple and that the more recent success of Apple will continue to thrive for years to come.\n\nAll in all I would have to applaud Steve Jobs for the legacy he has left behind and am glad he prospered during the 2000s. He was a testament to what one can do if they have the ability to create and the ambition to see their dreams through. Rest in peace Steve.\n &lt;a href=&quot;\nhttp://terrektwo.hubpages.com/hub/Steve-Jobs-vs-Bill-Gates-And-The-Winner-Is&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://terrektwo.hubpages.com/hub/Steve-Jobs-vs-Bill-Gates-And-The-Winner-Is&lt;/a&gt;","torrent":{"xt":"urn:btih:62f6feec12ae308dfffda944d80305bdff3b6df1","amp;dn":"Steve+Jobs+vs+Bill+Gates+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62f6feec12ae308dfffda944d80305bdff3b6df1","infoHashBuffer":{"type":"Buffer","data":[98,246,254,236,18,174,48,141,255,253,169,68,216,3,5,189,255,59,109,241]},"announce":[],"urlList":[]}}