{"title":"911 Hidden in Hollywood  (amazing 9/11 information)","uid":5824982,"size":629585314,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:639edf569de105932cc260d1805efefbb1d3fc8c&amp;dn=911+Hidden+in+Hollywood++%28amazing+9%2F11+information%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"wetmouse","files":-1,"time":1284224458,"description":"This torrent contains all 31 parts of the legendary 911 Hidden in Hollywood series, made by the YT user shmupnut. \n\nFirst parts 2, 6, 10 and 26 were censored from YT... but now, all the videos are deleted and his account is suspended. \n\nThe only thing that remains on YT are re-uploads of various parts. \n\n\n\nThis torrent contains ALL of the ORIGINALLY uploaded videos. \n\nThese files were downloaded off of YT directly from the original (shmupnut) uploads (and the best quality versions were chosen), so the quality of these files are the best available (better than what you will see on YT, since those videos are reuploads and their quality has degraded from being processed by YT once again).\n\nPart 2 was censored because of the music (yeah right), and shmupnut later uploaded a new version with new music. In this torrent, I have included both the original and the new version. \n\n\n-------\n\n\nWhat is this? \n\n911 Hidden in Hollywood is a series that documents how 9/11 was shown in advance in movies and TV series, many years before 2001. It also documents how other NWO events and ideas have been shown in a likewise manner, including martial law, mass-vaccination campaigns, and other things. \n\nThe ruling elite do this because they want to show people in advance what theyre going to do. Its a weird belief they have; They believe that they need to - in some manner - reveal to the masses their plan, and because they have done that, they can then do to the people whatever they want. \n\nIt is also because sometimes its done as Predictive Programming. \n\nPredictive Programming is, for example, inserting scenes of mass-vaccination in a movie to train people to accept that they should take vaccines. And a year or two later, after millions of people have seen the movie, they tell people to go line up and get injected for real. Now people are more willing to do it, because they have watched the movie and have been trained to accept it, and have been eased into the idea. \n\nThat is just ONE example. There are many ways programming can be used in movies. \n\nGoogle: Predictive Programming in Movies\n\n\n-------\n\n\nIf you want to upload this to YT then go ahead, but keep in mind that the quality will degrade after YT has processed the video. \n\nNote: If you are using MPC with Haali, turn up the sharpness in Haali. It makes these videos look better. I do not recommend doing that for normal watching of movies though, as it just adds fake sharpness... but for 911HiH it is actually useful. ","torrent":{"xt":"urn:btih:639edf569de105932cc260d1805efefbb1d3fc8c","amp;dn":"911+Hidden+in+Hollywood++%28amazing+9%2F11+information%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"639edf569de105932cc260d1805efefbb1d3fc8c","infoHashBuffer":{"type":"Buffer","data":[99,158,223,86,157,225,5,147,44,194,96,209,128,94,254,251,177,211,252,140]},"announce":[],"urlList":[]}}