{"title":"L'armata Brancaleone (1966)","uid":5072615,"size":1569446421,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6428b54f512d02ccbecde4b081f53afb4d375905&amp;dn=L%5C%27armata+Brancaleone+%281966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Willams","files":15,"time":1251504414,"description":"L'armata Brancaleone (1966)\n\n\nL'armata Brancaleone (known in English-speaking countries as For Love and Gold or The Incredible Army of Brancaleone) is an Italian comedy movie released in 1966, written by the famous duo Age &amp; Scarpelli and directed by Mario Monicelli. It features Vittorio Gassman in the main role. It was entered into the 1966 Cannes Film Festival.\n\nThe term Armata Brancaleone is still used today in Italian to define a group of people which are badly assembled. Brancaleone is a historical name, meaning the paw of lions in heraldry jargon. Brancaleone degli AndalÃƒÂ² was an effective governor of the Middle Ages Rome.\n\nA group of rogues steal a scroll granting its bearer the property of the land of Aurocastro in Apulia (south of Italy). They elect a shaggy knight, Brancaleone from Norcia, as their leader, and decide to get possession of this supposedly wealthy land. Many adventures will occurr during the journey.\n\nThis rip was taken from KG. Thanks to pernod, the original uploader on KG. The torrent contains some posters and covers of the film, and externals English, Italian, French, Spanish, German and Greek subtitles. \n\nIMDB: 8.0/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0060125/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0060125/&lt;/a&gt;\n\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n \n            &lt;a href=&quot; http://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************","torrent":{"xt":"urn:btih:6428b54f512d02ccbecde4b081f53afb4d375905","amp;dn":"L%5C%27armata+Brancaleone+%281966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6428b54f512d02ccbecde4b081f53afb4d375905","infoHashBuffer":{"type":"Buffer","data":[100,40,181,79,81,45,2,204,190,205,228,176,129,245,58,251,77,55,89,5]},"announce":[],"urlList":[]}}