{"title":"Carroll Quigley 1974 Interview","uid":4358369,"size":22963775,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:642d01e934d695c73541f717c7274bcb3e1fa209&amp;dn=Carroll+Quigley+1974+Interview&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"darkdata","files":2,"time":1219520239,"description":"Carroll Quigley 1974 Interview\n\nAuthor of Tragedy and Hope (tragedy is all the people who must suffer and die for the NWO, and the hope is the NEW WORLD ORDER )\n\nProfessor Quigley was a Globalist, he supported the idea NEW WORLD ORDER and wrote about it, he, unlike the elites, thought the people should know about it.\n&quot;The powers of financial capitalism had another far reaching aim, nothing less than to create a world system of financial control in private hands able to dominate the political system of each country and the economy of the world as a whole. This system was to be controlled in a feudalist fashion by the central banks of the world acting in concert, by secret agreements, arrived at in frequent private meetings and conferences. The apex of the system was the Bank for International Settlements in Basle, Switzerland, a private bank owned and controlled by the worlds&amp;#039; central banks which were themselves private corporations. The growth of financial capitalism made possible a centralization of world economic control and use of this power for the direct benefit of financiers and the indirect injury of all other economic groups.&quot; Tragedy and Hope: A History of The World in Our Time (Macmillan Company, 1966,) Professor Carroll Quigley of Georgetown University\n&quot;The Council on Foreign Relations is the American branch of a society which originated in England ... [and] ... believes national boundaries should be obliterated and one-world rule established.&quot; Dr. Carroll Quigley\n&quot;I know of this network because I have studied it for twenty years and was permitted for two years in the early 1960s to examine its papers and secret records. I have no aversion to it or to most of its aims and have, for much of my life, been close to it and to many of its instruments. I have objected, both in the past and recently, to a few of its policies ... but in general my chief difference of opinion is that it wishes to remain unknown, and I believe its role in history is significant enough to be known.&quot;\n\nDr. Carroll Quigley, Tragedy and Hope\n\n&quot;As a teenager, I heard John Kennedy&amp;#039;s summons to citizenship. And then, as a student, I heard that call clarified by a professor I had named Carroll Quigley.&quot;President Clinton, in his acceptance speech for the Democratic Party&amp;#039;s nomination for president, 16 July 1992\n\nFile Type:\nAdobe AVI\n\nFiles:\nLiveLeak-dot-com-192915-Carroll_Quigley_Interview.avi\n\nDiscuss This:  &lt;a href=&quot;\nhttp://darkdata.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://darkdata.net/&lt;/a&gt;\n&quot;Knowledge is power&quot; More information at http://DarkData.net","torrent":{"xt":"urn:btih:642d01e934d695c73541f717c7274bcb3e1fa209","amp;dn":"Carroll+Quigley+1974+Interview","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"642d01e934d695c73541f717c7274bcb3e1fa209","infoHashBuffer":{"type":"Buffer","data":[100,45,1,233,52,214,149,199,53,65,247,23,199,39,75,203,62,31,162,9]},"announce":[],"urlList":[]}}