{"title":"Haatchi &amp; Little B - Wendy Holden - Audiobook MP3","uid":10474230,"size":170024646,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:64734092f779231ef3abd1ae8faf8a44f18ab99a&amp;dn=Haatchi+%26amp%3B+Little+B+-+Wendy+Holden+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404306417,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nHaatchi &amp; Little B: The Inspiring True Story of One Boy and His Dog\n\nWritten by: Wendy Holden\nNarrated by: Gabrielle Glaister\nLength: 5 hrs and 53 mins\nFormat: Unabridged\nRelease Date:07-01-14\nProgram Type: Audiobook\n\nWhen Owen met Haatchi, the lives of one adorable little boy and one great, big dog were destined to change forever.\n\nOwen - known to his family as &quot;little buddy&quot; or &quot;Little B&quot; - has a rare genetic disorder that leaves him largely confined to a wheelchair. Before being united with Haatchi, Little B was anxious and found it difficult to make friends. Haatchi - an adorable Anatolian Shepherd puppy - was abused and left for dead on railroad tracks. He was struck by an oncoming train, and although his life was saved, his leg and tail were partially severed. Haatchi was left massively disabled and totally dispirited.\n\nBut kind-hearted Will and Colleen Howkins, Little B's father and step-mother, decided to introduce the big dog and the little boy to each other, and an unbelievable bond was formed that transformed both boy and dog in miraculous ways.\n\nHaatchi &amp; Little B is the true story of an astonishing little boy, a very special dog, and the inspiring, inseparable pair that they make together.","torrent":{"xt":"urn:btih:64734092f779231ef3abd1ae8faf8a44f18ab99a","amp;dn":"Haatchi+%26amp%3B+Little+B+-+Wendy+Holden+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64734092f779231ef3abd1ae8faf8a44f18ab99a","infoHashBuffer":{"type":"Buffer","data":[100,115,64,146,247,121,35,30,243,171,209,174,143,175,138,68,241,138,185,154]},"announce":[],"urlList":[]}}