{"title":"Kelly Fisher Lowe The Words and Music of Frank Zappa [PDF]","uid":12170477,"size":1230594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:652c53696e609b63fa5e9d0de529b662069d0bf4&amp;dn=Kelly+Fisher+Lowe+The+Words+and+Music+of+Frank+Zappa+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1438164375,"description":"&quot;The Words and Music of Frank Zappa&quot; moves beyond the details of Frank Zappa's life (1940-93) toward a focused treatment of the rock and pop songs of this great American composer. Today, Zappa's music can be appreciated as a whole, emerging as a coherent, thoughtful, and innovative - if somewhat daunting - body of work. Kelly Fisher Lowe has left no aspect of that work unexamined, from Zappa's role as a satirist of the highest order to his place in the genre of &quot;progressive rock&quot; and his importance as an influential critic of American culture and society. The volume begins with discussions of Zappa's role as a satirist and his musical style, then proceeds to an in-depth examination of his albums. Through this extended engagement with Zappa's music, a surprisingly clear perspective on his personal views emerges, shedding light on his treatment of such topics as the falsified notion of love in popular culture, the compromising influence of money on popular music, and the concept of freedom in a systematized society. The book includes an official discography and an up-to-date bibliographic essay","torrent":{"xt":"urn:btih:652c53696e609b63fa5e9d0de529b662069d0bf4","amp;dn":"Kelly+Fisher+Lowe+The+Words+and+Music+of+Frank+Zappa+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"652c53696e609b63fa5e9d0de529b662069d0bf4","infoHashBuffer":{"type":"Buffer","data":[101,44,83,105,110,96,155,99,250,94,157,13,229,41,182,98,6,157,11,244]},"announce":[],"urlList":[]}}