{"title":"Strength Training","uid":6937325,"size":32149287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6547445c3e84f6f1d6fe9ebaea027d77ea3281aa&amp;dn=Strength+Training&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gnv65","files":-1,"time":1325872704,"description":"Strength Training : The Complete Step-By-Step Guide to a Stronger, Sculpted Body\nBy Dorling Kindersley\nDK Publishing | December 2009 | ISBN-10: 0756654475 | PDF | 256 pages | 30.6 mb\n\nStrength training has been proven to have a beneficial effect on our body image and health, so it's not surprising that the number of people participating in this activity has been rising steadily over the last 20 years (in the US, for example, 21% of all adults now train with weights at least twice a week, with women making up one in five of those training). Strength Training is the ultimate personal trainer for every reader. It provides exercises for all parts of the body, taking you step-by-step through each movement and highlighting exactly which muscle should be\nworking when. You are shown the perfect stance to adopt, and how to perform the movement with optimum technique.\n\nExercises are also accompanied by helpful features such as common pitfalls to watch out for; variations to do at home or in the gym, and on fixed machines or using free weights; and adaptations you can try to tailor an exercise more closely to your particular needs. Specially commissioned programs provide easy-to-follow instruction for a variety of objectives, and each program has three different levels - beginner, intermediate, and advanced - to help you maximize its usefulness. Tailor-made programs for men and women, younger and older, ensure that the book works on many levels. One key sector to embrace strength training in recent years has been the 50+ age group, for whom the risk of injury is also relatively high. This book, with it's emphasis on clear demonstration of optimum technique, detailed outlines of the muscles used, and advice on avoiding common pitfalls, provides the maximum safeguard against the danger of injury, and helps you stay at peak fitness.","torrent":{"xt":"urn:btih:6547445c3e84f6f1d6fe9ebaea027d77ea3281aa","amp;dn":"Strength+Training","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6547445c3e84f6f1d6fe9ebaea027d77ea3281aa","infoHashBuffer":{"type":"Buffer","data":[101,71,68,92,62,132,246,241,214,254,158,186,234,2,125,119,234,50,129,170]},"announce":[],"urlList":[]}}