{"title":"The Byrds 24 Bit Vinyl Pack","uid":9498853,"size":5045496950,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6680869e2196a57d1f8ddb05ee7bc5e7f750f38a&amp;dn=The+Byrds+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"politux","files":-1,"time":1390169380,"description":"\n  The Byrds 24 Bit Vinyl Pack\n\n  Genres: Pop/Rock, Folk\n  Styles: Country-Rock, Folk-Rock, Psychedelic\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 1,500 - 3,000 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1964 Preflyte - Bumble Records GEXP 8001 UK Reissue\n  1965 Mr. Tambourine Man - Columbia CL 2372 US Mono Original\n  1966 Fifth Dimension - Columbia CL2549 US Mono Original\n  1966 Fifth Dimension - CBS S 62783 French Stereo Original\n  1967 Younger Than Yesterday - Columbia CK-9442 US Stereo Original\n  1967 Younger Than Yesterday - CBS SBPG 62988 UK Stereo Original\n  1967 Greatest Hits - Columbia CS 9516 US\n  1968 The Notorious Byrd Brothers - Columbia US Stereo \n  1989 Never Before (1965-1967) - Re-Flyte MH 70318 US   \n  \n  Although they only attained the huge success of the Beatles, Rolling Stones, and the Beach Boys for a short time in the mid-'60s, time has judged the Byrds to be nearly as influential as those groups in the long run. They were not solely responsible for devising folk-rock, but they were certainly more responsible than any other single act (Dylan included) for melding the innovations and energy of the British Invasion with the best lyrical and musical elements of contemporary folk music. The jangling, 12-string guitar sound of leader Roger McGuinn's Rickenbacker was permanently absorbed into the vocabulary of rock. They also played a vital role in pioneering psychedelic rock and country-rock, the unifying element being their angelic harmonies and restless eclecticism.\n\n  Often described in their early days as a hybrid of Dylan and the Beatles, the Byrds in turn influenced Dylan and the Beatles almost as much as Bob and the Fab Four had influenced the Byrds. the Byrds' innovations have echoed nearly as strongly through subsequent generations, in the work of Tom Petty, R.E.M., and innumerable alternative bands of the post-punk era that feature those jangling guitars and dense harmonies.\n\n  Although the Byrds had perfected their blend of folk and rock when their debut single, &quot;Mr. Tambourine Man,&quot; topped the charts in mid-1965, it was something of a miracle that the group had managed to coalesce in the first place. Not a single member of the original quintet had extensive experience on electric instruments. Jim McGuinn (he'd change his first name to Roger a few years later), David Crosby, and Gene Clark were all young veterans of both commercial folk-pop troupes and the acoustic coffeehouse scene. They were inspired by the success of the Beatles to mix folk and rock; McGuinn had already been playing Beatles songs acoustically in Los Angeles folk clubs when Clark approached him to form an act, according to subsequent recollections, in the Peter &amp; Gordon style. David Crosby soon joined to make them a trio, and they made a primitive demo as the Jet Set that was nonetheless bursting with promise. With the help of session musicians, they released a single on Elektra as the Beefeaters that, while a flop, showed them getting quite close to the folk-rock sound that would electrify the pop scene in a few months.\n \n  the Beefeaters, soon renamed the Byrds, were fleshed out to a quintet with the addition of drummer Michael Clarke and bluegrass mandolinist Chris Hillman, who was enlisted to play electric bass, although he had never played the instrument before. The band was so lacking in equipment in their early stages that Clarke played on cardboard boxes during their first rehearsals, but they determined to master their instruments and become a full-fledged rock band (many demos from this period would later surface for official release). They managed to procure a demo of a new Dylan song, &quot;Mr. Tambourine Man&quot;; by eliminating some verses and adding instantly memorable 12-string guitar leads and Beatlesque harmonies, they came up with the first big folk-rock smash (though the Beau Brummels and others had begun exploring similar territory as well). For the &quot;Mr. Tambourine Man&quot; single, the band's vocals and McGuinn's inimitable Rickenbacker were backed by session musicians, although the band themselves (contrary to some widely circulated rumors) performed on their subsequent recordings.\n\n  The first long-haired American group to compete with the British Invasion bands visually as well as musically, the Byrds were soon anointed as the American counterpart to the Beatles by the press, legions of fans, and George Harrison himself. Their 1965 debut LP, Mr. Tambourine Man, was a fabulous album that mixed stellar interpretations of Dylan and Pete Seeger tunes with strong, more romantic and pop-based originals, usually written by Gene Clark in the band's early days. A few months later, their version of Seeger's &quot;Turn! Turn! Turn!&quot; became another number-one hit and instant classic, featuring more great chiming guitar lines and ethereal, interweaving harmonies. While their second LP (Turn! Turn! Turn!) wasn't as strong as their debut full-length, the band continued to move forward at a dizzying pace. In early 1966, the &quot;Eight Miles High&quot; single heralded the birth of psychedelia, with its drug-like (intentionally or otherwise) lyrical imagery, rumbling bassline, and a frenzied McGuinn guitar solo that took its inspiration from John Coltrane and Indian music.\n\n  the Byrds suffered a major loss right after &quot;Eight Miles High&quot; with the departure of Gene Clark, their primary songwriter and, along with McGuinn, chief lead vocalist. The reason for his resignation, ironically, was fear of flying, although other pressures were at work as well. &quot;Eight Miles High,&quot; amazingly, would be their last Top 20 single; many radio stations banned the record for its alleged drug references, halting its progress at number 14. This ended the Byrds' brief period as commercial challengers to the Beatles, but they regrouped impressively in the face of the setbacks. With the band continuing as a quartet, McGuinn, Crosby, and Hillman would assume a much larger (actually, the entire) chunk of the songwriting responsibilities. The third album, Fifth Dimension, contained more groundbreaking folk-rock and psychedelia on tracks like &quot;Fifth Dimension,&quot; &quot;I See You,&quot; and &quot;John Riley,&quot; although it (like several of their classic early albums) mixed sheer brilliance with tracks that were oddly half-baked or carelessly executed.\n\n  Younger Than Yesterday, (1967) which included the small hits &quot;So You Want to Be a Rock 'n' Roll Star&quot; and &quot;My Back Pages&quot; (another Dylan cover), was another high point, Hillman and Crosby in particular taking their writing to a new level. In 1967, Crosby would assert a much more prominent role in the band, singing and writing some of his best material. He wasn't getting along so well with McGuinn and Hillman, though, and was jettisoned from the Byrds partway into the recording of The Notorious Byrd Brothers. Gene Clark, drafted back into the band as a replacement, left after only a few weeks, and by the end of 1967, Michael Clarke was also gone. Remarkably, in the midst of this chaos (not to mention diminishing record sales), they continued to sound as good as ever on Notorious. This was another effort that mixed electronic experimentation and folk-rock mastery with aplomb, with hints of a growing interest in country music.","torrent":{"xt":"urn:btih:6680869e2196a57d1f8ddb05ee7bc5e7f750f38a","amp;dn":"The+Byrds+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6680869e2196a57d1f8ddb05ee7bc5e7f750f38a","infoHashBuffer":{"type":"Buffer","data":[102,128,134,158,33,150,165,125,31,141,219,5,238,123,197,231,247,80,243,138]},"announce":[],"urlList":[]}}