{"title":"Phil Collins - I Wish It Would Rain Down (Edit) (2nafish)","uid":5911773,"size":219017220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:66bab5b6e461e00b601950dff46b0ce3b0e01629&amp;dn=Phil+Collins+-+I+Wish+It+Would+Rain+Down+%28Edit%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1288080329,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video is the Edited version: duration 6:08.\n\n\n&quot;I Wish It Would Rain Down&quot; is a song by Phil Collins, from his 1989 album ...But Seriously, and it included the guitar playing of Eric Clapton. It was also a departure from the dance-pop music style of No Jacket Required. The song was a top ten hit in many countries, including Canada where it topped the chart.\n\nThe 8:30 minute-long black-and-white music video, directed by James Yukich, contains 2:30 minutes of acting prior to the start of the music. The setting is a theatre in the 1940s or 1950s. Actor Jeffrey Tambor plays a hyper-critical, unhappy theatre director. He is rehearsing some dancers (who are dancing to the guitar/bass guitar riff from the song &quot;Sunshine of Your Love&quot; by the band Cream, in which Eric Clapton played guitar.) The director complains that the girls can't dance or sing, and then discovers that his star has appendicitis. His assistant suggests that the opening number be replaced by a song that &quot;Billy&quot; (Phil Collins), the rehearsal pianist, has written. Eric Clapton, seated on a stool, says that &quot;Billy&quot; used to be the drummer in a good band (an in-joke reference to Collins' tenure with the band Genesis, in which he played drums) and is a good singer. Members of Collins' backing band play various non-speaking parts (such as the janitor, &quot;Chester&quot; (Chester Thompson), Leland Sklar). Collins is forced to act with the play's star, and is terrible. As Collins sings, his character fantasizes about becoming a famous stage actor, singer, and movie star. &quot;Billy&quot; is shown receiving an Academy Award from Clark Gable (impersonated by actor Ralph Chelli).\n\nThe &quot;Billy&quot; character's name is inserted onto fake covers of major industry publications such as Variety and Billboard, and newspapers such as the Denver Post. Collins' face is inserted into still photographs from the television program You Bet Your Life (where he appears next to Groucho Marx) and films such as White Heat (where his image is inserted alongside that of James Cagney). &quot;Billy&quot; is depicted imitating the character of Davy Crockett (as played by Fess Parker on the television series of the same name), standing next to Marilyn Monroe, and acting out a scene from the 1941 film The Maltese Falcon (with Humphrey Bogart impersonator Robert Sacchi appearing in the scene). (Music video director James Yukich's name appears on the clapperboard.)\n\nAfter the music ends, Tambor's character decides to cut the musical number, as he feels it was not any good compared to the dancing girls. The character says the guitarist is good, but his assistant says that &quot;Eric gave a week's notice.&quot; Collins sits behind the drums, disbelieving.\n\nThe song was a significant chart hit in 1990, peaking at number three on the Billboard Hot 100 in the United States and number one on the RPM Top 100 in Canada. It also reached number seven on the UK Singles Chart.\n\nIn Canada, it was the longest-running number one single of 1990, spending six weeks atop the charts, and ranked as the top single of the year on RPM's year-end charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:66bab5b6e461e00b601950dff46b0ce3b0e01629","amp;dn":"Phil+Collins+-+I+Wish+It+Would+Rain+Down+%28Edit%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66bab5b6e461e00b601950dff46b0ce3b0e01629","infoHashBuffer":{"type":"Buffer","data":[102,186,181,182,228,97,224,11,96,25,80,223,244,107,12,227,176,224,22,41]},"announce":[],"urlList":[]}}