{"title":"Howard Stern Show 9-11-01 WTC attack","uid":4122608,"size":50865761,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:66c08f3b291ca9984986c05f9034f3975b4df9be&amp;dn=Howard+Stern+Show+9-11-01+WTC+attack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":24,"time":1207628377,"description":"Back in the days of Napster, someone released the mp3 of the Howard Stern Show for September 11th, 2001. As I recall, it was about 4 hours in length, with the first 2.5 hours discussing Pamela Anderson latest implants. Then, someone off microphone must have gotten Howard to look at CNN. This is where I edited the remainder of the file to begin, and have also tried to edit out all the radio commercials. The rest of the mp3 plays the reaction of the studio cast, and the angry or frantic calls from listeners IN lower Manhattan (Where Stern broadcasts from) at the time. The end of the file is a little abrupt. I did all this with Soundforge about 4 years ago, before I had learned much about audio editing, so please do not bother to comment that I could have done a better job or saved at a higher rate. I know, I know.\n\nWhat is really interesting here is the human reaction. Some people could not stop making Pam Anderson jokes, some were remarkably prescient with their interpretations of what was happening. It is important to keep in mind that this BEFORE most of us knew anything about Al-Queda, Bin Ladin, or the rest. It is a fascinating sociological look into how the human mind works in the midst of a crisis, and Stern deserves some credit for demonstrating coolness under pressure.\n","torrent":{"xt":"urn:btih:66c08f3b291ca9984986c05f9034f3975b4df9be","amp;dn":"Howard+Stern+Show+9-11-01+WTC+attack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66c08f3b291ca9984986c05f9034f3975b4df9be","infoHashBuffer":{"type":"Buffer","data":[102,192,143,59,41,28,169,152,73,134,192,95,144,52,243,151,91,77,249,190]},"announce":[],"urlList":[]}}