{"title":"Lost Christianities","uid":4816871,"size":7118477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66da005b6b6ed8703c6aa56fbf6c4a9fe666d8ed&amp;dn=Lost+Christianities&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"timnehguy","files":2,"time":1238601085,"description":"Lost Christianities: The Battles for scripture and the Faiths We Never Knew - by Bart D. Ehrman (PDF)\n\nWhat if Marcion's canon-which consisted only of Luke's Gospel and Paul's letters, entirely omitting the Old Testament-had become Christianity's canon? What if the Ebionites-who believed Jesus was completely human and not divine-had ruled the day as the Orthodox Christian party? What if various early Christian writings, such as the Gospel of Thomas or the Secret Gospel of Mark, had been allowed into the canonical New Testament? Ehrman, a professor of religion at UNC Chapel Hill, offers answers to these and other questions in this book, which rehearses the now-familiar story of the tremendous diversity of early Christianity and its eventual suppression by a powerful &quot;proto-orthodox&quot; faction. The proto-orthodox Christians won out over many other groups, and bequeathed to us the four Gospels, a church hierarchy, a set of practices and beliefs, and doctrines such as the Trinity. Ehrman eloquently characterizes some of the movements and scriptures that were lost, such as the Ebionites and the Secret Gospel of Mark, as he outlines the many strands of Christianity that competed for attention in the second and third centuries. He issues an important reminder that there was no such thing as a monolithic Christian orthodoxy before the fourth century. \n\nThis is a well-crafted, scholarly tale of forgeries, burned books, doctrinal feuds, and other episodes in the making of the New Testament and the early Church (or churches). If Christianity today has a bewildering number of faces, its early forms were even more various, writes Ehrman. So, too, were its writings, including many that were suppressed, forgotten, cast aside, edited out, and otherwise not encouraged to survive alongside the canonical texts. Like many ancient writings, many are known only by mentions in other texts, and those little hints are fascinating: one epistle, attributed to Barnabas, might have laid the seeds for generations of anti-Semitic scripture, for here Paul's follower &quot;argues that Judaism is a false religion&quot; and that &quot;the Old Testament is a Christian book&quot;; one wonderful, thoroughly non-canonical text, the so-called Infancy Gospel of Thomas, recounts the adventures of Jesus as a child, in which &quot;the boy has a temper and is not to be crossed,&quot; so much so that even his father of record, Joseph, tells Mary, &quot;Do not let him go outside. Anyone who makes him angry dies&quot;; another Gospel of Thomas attributes to Christ a Zen-like detachment and his assurance that &quot;it is by learning the truth of this world and, especially, of one's own divine character, that one can escape this bodily prison and return to the realm of light whence one came&quot;-all very New Age. These and dozens of other texts were not incorporated into the canon, and sometimes for obvious reasons. Yet, Ehrman wonders, what would have happened had they been? As it is, a canonical tradition arose with a rigidly structured church over the centuries, one that presented a nearly unified body of creed and dogma-but that, in time, splintered into the multifaceted Christianity, or perhaps the many Christianities, that we know today. \n\nCheck my torrents for books on related themes. Take what you want, enjoy what you take, and please seed!","torrent":{"xt":"urn:btih:66da005b6b6ed8703c6aa56fbf6c4a9fe666d8ed","amp;dn":"Lost+Christianities","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66da005b6b6ed8703c6aa56fbf6c4a9fe666d8ed","infoHashBuffer":{"type":"Buffer","data":[102,218,0,91,107,110,216,112,60,106,165,111,191,108,74,159,230,102,216,237]},"announce":[],"urlList":[]}}