{"title":"[SoM]Beetlejuice - Spiritello porcello[DvdRip-Divx-Ita-Mp3]","uid":4745708,"size":734224384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67556f4f42be62f59f58a03798e64a7d00d272a2&amp;dn=%5BSoM%5DBeetlejuice+-+Spiritello+porcello%5BDvdRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mitimex","files":1,"time":1235865883,"description":"Parodia dei film del terrore ambientati in case maledette. Con una coppia di giovani sposi, Adam e Barbara, amici degli animali, che per non investire un cagnolino finiscono nel fiume e muoiono affogati. E dunque si ritrovano fantasmi nella loro amatissima villetta fra i boschi e i prati del Connecticut, dove se ne starebbero tranquilli per l'eternitÃƒÂ  se la casa non venisse venduta a una famiglia venuta da New York, composta da un Charles affarista in cerca di relax, d'una Delia scultrice snob, e d'una giovane Lydia fotografa depressa.\nPoichÃƒÂ© i nuovi venuti sono antipatici, Adam e Barbara cercano di metterli in fuga spaventandoli, come da autorevoli consgli, ma non soltanto fanno fiasco, da ingenui dilettanti: a differenza dei genitori, Lydia li vede, parla con loro, e non ne resta per niente terrorizzata. Di fronte alla scoraggiante notizia, fornita dall'Ufficio informazioni dell'aldilÃƒÂ , che per oltre un secolo dovranno restare in casa con quegli intrusi, Adam e Barbara si risolvono a chiedere aiuto a Beetlejuice, chiamato per spregio Beetlejuice (Ã‚Â«succo di scarafaggioÃ‚Â»), un defunto malvagio e lubrico di professione bioesorcista, specializzato cioÃƒÂ¨ nel proteggere i morti dalle ingerenze dei vivi. Sembra che i suoi sistemi funzionino, perchÃƒÂ© durante una cena di riguardo i padroni di casa e i loro ospiti sono costretti a improvvisare uno show demenziale, ma tutti ne sono poi piÃƒÂ¹ divertiti che spaventati, e Charles pensa bene di sfruttare i fantasmi costruendo nella zona un Parco divertimenti ultraterreni. Finisce che, sconfitto il piano di Betelgeuse di sposare Lydia, la bella compagnia trova il modo di far coesistere in casa i vivi e i morti mentre nell'oltretomba uno stregone africano rimpiccolisce il perverso esorcista...","torrent":{"xt":"urn:btih:67556f4f42be62f59f58a03798e64a7d00d272a2","amp;dn":"%5BSoM%5DBeetlejuice+-+Spiritello+porcello%5BDvdRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67556f4f42be62f59f58a03798e64a7d00d272a2","infoHashBuffer":{"type":"Buffer","data":[103,85,111,79,66,190,98,245,159,88,160,55,152,230,74,125,0,210,114,162]},"announce":[],"urlList":[]}}