{"title":"Dr. Paul Copan Book Collection","uid":11773420,"size":19446766,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67c875992a4cc887cdf76c97a6848fd1a340afda&amp;dn=Dr.+Paul+Copan+Book+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"starxteel","files":22,"time":1427167340,"description":"\nTitles:\nContending With Christianity's Critics\nDid God Really Command Genocide?\nHow Do You Know You're Not Wrong?\nIs God a Moral Monster?\nJesus' Resurrection: Fact or Figment?\nLoving Wisdom\nPassionate Conviction\nThat's Just Your Interpretation\nThe Gospel in the Marketplace of Ideas\nThe Rationality of Theism\nWhen God Goes to Starbucks\n\nAbout the author:\nPaul Copan (Ph.D., philosophy, Marquette University) is Professor and Pledger Family Chair of Philosophy and Ethics at Palm Beach Atlantic University.\n\nHe is a Christian theologian, analytic philosopher, apologist, and author. He is currently a professor at the Palm Beach Atlantic University and holds the endowed Pledger Family Chair of Philosophy and Ethics. He has written and edited over 25 books in the area of philosophy of religion, apologetics, theology, science &amp; religion, and the historicity of Jesus Christ. He has contributed many articles to professional journals and has written many essays for edited books. For six years he served as the president of the Evangelical Philosophical Society.\n\nHe has co-authored and co-edited with William Lane Craig and he is co-editor of three books on the historical Jesus and of three other books in the philosophy of religion.\nHe has contributed articles and book reviews to various professional journals as well: Philosophia Christi, Faith and Philosophy, Trinity Journal, Southern Journal of Theology, the Journal for the Evangelical Theological Society, and The Review of Metaphysics.\n\nCurrently, Copan is the Pledger Family Chair of Philosophy and Ethics/Professor, Philosophy and Ethics at Palm Beach Atlantic University in West Palm Beach, FL, where he received the Mentor of the Year award","torrent":{"xt":"urn:btih:67c875992a4cc887cdf76c97a6848fd1a340afda","amp;dn":"Dr.+Paul+Copan+Book+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67c875992a4cc887cdf76c97a6848fd1a340afda","infoHashBuffer":{"type":"Buffer","data":[103,200,117,153,42,76,200,135,205,247,108,151,166,132,143,209,163,64,175,218]},"announce":[],"urlList":[]}}