{"title":"Geopolitics: A Very Short Introduction","uid":8888044,"size":4364558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68020d3a3f2b8fd7ca34537bf5c210b4d594588d&amp;dn=Geopolitics%3A+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1378512577,"description":"Description:\n\nIn places such as Iraq or Lebanon, moving a few feet on either side of a territorial boundary can be a matter of life or death, dramatically highlighting the connections between geography and politics. This Very Short Introduction illuminates the concept of geopolitics, revealing how a country's location and size as well as its sovereignty and resources all affect how its people understand and interact with the wider world. Using wide-ranging examples, from historical maps to James Bond films and the rhetoric of political leaders like Churchill and George W. Bush, Klaus Dodds describes how people and places are inter-connected with each other, and how our geopolitical outlook molds our understanding of the world. He shows why it is vital that we understand how and why we divide the world into zones and territories--and how these divisions depend on your perspective. The book explains how terrorism, globalization, environmental degradation, and new technologies such as the internet are all challenging the geographical basis of global politics, and it sheds light on the history of terms such as &quot;the iron curtain,&quot; &quot;the third world,&quot; and &quot;the axis of evil.&quot;","torrent":{"xt":"urn:btih:68020d3a3f2b8fd7ca34537bf5c210b4d594588d","amp;dn":"Geopolitics%3A+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68020d3a3f2b8fd7ca34537bf5c210b4d594588d","infoHashBuffer":{"type":"Buffer","data":[104,2,13,58,63,43,143,215,202,52,83,123,245,194,16,180,213,148,88,141]},"announce":[],"urlList":[]}}