{"title":"Video Game Design Revealed","uid":4727258,"size":1060755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:683fdbb2e54c20a65f2bf2114486fb470ad27a73&amp;dn=Video+Game+Design+Revealed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"VasiaZozulia","files":1,"time":1234815822,"description":"Whether you are a professional game developer working in an established studio or a creative thinker interested in trying your hand at game design, &quot;Video Game Design Revealed&quot; will show you the steps and processes involved in bringing a video game from concept to completion. Beginning with an overview of the history of video games and an examination of the elements of successful games, the book breaks down the video game design process into its simplest elements and builds from there. You'll learn how to take an idea and tweak it into a viable game based on the genre, market, game style, and subject matter, moving on to creating and organizing a timeline for the production of the game. Once you've mapped out your game production plan and gathered all the information you need, you'll learn how to choose the development platform and other technologies that best suit the game you've designed, add sound and graphics, and apply game mechanics such as whether the game will be single-player or multiplayer and what levels and objects to add to your game to make it challenging and interesting. &quot;Video Game Design Revealed&quot; concludes with guidelines on how to compose a proposal to be used to present your idea to the game industry as well as tips and information on how to find and contact game studios, publishers, and investors to help you make your game design a reality. ","torrent":{"xt":"urn:btih:683fdbb2e54c20a65f2bf2114486fb470ad27a73","amp;dn":"Video+Game+Design+Revealed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"683fdbb2e54c20a65f2bf2114486fb470ad27a73","infoHashBuffer":{"type":"Buffer","data":[104,63,219,178,229,76,32,166,95,43,242,17,68,134,251,71,10,210,122,115]},"announce":[],"urlList":[]}}