{"title":"Chelsea Light Moving (2013) [FLAC]","uid":8227830,"size":320669117,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6881704d8d8f0dc247524daf3566a82b9e7d7b04&amp;dn=Chelsea+Light+Moving+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1362656261,"description":"\n  Chelsea Light Moving (2013) [FLAC]\n\n  Released: 2013\n  Duration: 49:06\n  Genre: Pop/Rock\n  Style: Noise Rock, Alternative\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Heavenmetal\n  02 Sleeping Where I Fall\n  03 Alighted\n  04 Empires of Time\n  05 Groovy &amp; Linda\n  06 Lip\n  07 Burroughs\n  08 Mohawk\n  09 Frank O'Hara Hit\n  10 Communist Eyes\n\n  The end of Kim Gordon and Thurston Moore's 27-year marriage left Sonic Youth with an uncertain future, and the four compulsively creative members of the band lacking one of their largest outlets for sound. While none of the players had ever been short of side projects, news of the formation of Chelsea Light Moving seemed especially weighty. The first Thurston-fronted rock band in a similar mold as the recently filed away Sonic Youth could either fill the substantial void left by the legendary guitar mutilators or follow Moore's antagonistic noisy tendencies into messy, self-indulgent disappointment. The quartet's self-titled debut of what they've coined as &quot;Burroughs rock&quot; does neither, however. Tracks like &quot;Groovy &amp; Linda&quot; and &quot;Frank O' Hara Hit&quot; rely on the same signature marriage of dissonance and obscure, cloudy-headed pop in Sonic Youth's more aimlessly wandering moments on albums like Washing Machine and Murray Street. \n\n  Thurston's bohemian poetry scene lyrics are also in rare form, with songs like album opener &quot;Heavenmetal&quot; finding him spouting surreal collaged lines that evoke both heartbreak and joy over one of the album's more subdued guitar patterns. Chelsea Light Moving tend toward heavier zones than most of Moore's rock-based output. Rather than stretching out into extensive chiming guitar meditations, tracks like the blistering &quot;Alighted&quot; sound sludgy, depraved, and listlessly angry. On songs like these a closer parallel could be drawn to Bleach-era Nirvana or the Melvins albums that inspired it than any Sonic Youth material. While Moore's new group is clearly the sound of a band in a room rocking out, fronted by one of America's more legendary noise rock figures, it becomes apparent quickly that the chemistry and interplay between the four members is what made Sonic Youth's sound so densely dreamy and lovingly damaged. \n\n  Chelsea Light Moving finds Moore in a mode only somewhat removed from his more rock-oriented solo albums, certainly digging in to the wilder side of his multifaceted approach to sound, but stopping before spiraling into grating or overly self-aware histrionics. Chelsea Light Moving doesn't fill the still-warm shoes of Sonic Youth, but it isn't meant to. The album is fun, huge, and pleasantly confused (as evidenced in part by the out-of-place Germs cover that closes the album) but ultimately just another chapter in Moore's lifelong exploration of sound, poetry, and the darkest corners of American subcultures he helped build, and continues to add to.","torrent":{"xt":"urn:btih:6881704d8d8f0dc247524daf3566a82b9e7d7b04","amp;dn":"Chelsea+Light+Moving+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6881704d8d8f0dc247524daf3566a82b9e7d7b04","infoHashBuffer":{"type":"Buffer","data":[104,129,112,77,141,143,13,194,71,82,77,175,53,102,168,43,158,125,123,4]},"announce":[],"urlList":[]}}