{"title":"Green_Blood_v1 [Kotonoha]cbr","uid":10002410,"size":77335769,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6905181295ec7d6ed8052aaee72ac18ed79fa389&amp;dn=Green_Blood_v1+%5BKotonoha%5Dcbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GP67","files":-1,"time":1398000042,"description":"The end of the civil war signaled the start of the industrial revolution in the United States and immigrants from all over the world traveled to find their American dream. But what awaited the majority of them was poverty, discrimination and hopelessness. Manhattan, New York was full of immigrants flooding through the ports and the 6th district, Five Points, was considered at the time, the world worst slum. The mobsters corrupted the entire area, including the police by paying them off; Five Points was the mobs territory and they were the law. But even in Five Points, where there seemed to be nothing but robbery, prostitution and murder, showed some signs of hope. Luke Burns was a honest and righteous teenager who realized that the mob was the cause of the harsh lifestyle and that joining the mobsters would not bring him the American dream. But his older brother, Brad Burns, had become the assassin to the biggest mob group of Five Points, the Grave Diggers, a secret he kept from Luke for his own protection. Brad was known as the Grim Reaper and his reputation preceded him as a ruthless and skilled killer. \n\nenjoy","torrent":{"xt":"urn:btih:6905181295ec7d6ed8052aaee72ac18ed79fa389","amp;dn":"Green_Blood_v1+%5BKotonoha%5Dcbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6905181295ec7d6ed8052aaee72ac18ed79fa389","infoHashBuffer":{"type":"Buffer","data":[105,5,24,18,149,236,125,110,216,5,42,174,231,42,193,142,215,159,163,137]},"announce":[],"urlList":[]}}