{"title":"BBC Fake or Fortune Collection 01of10 Monet PDTV x264 AAC ","uid":9651952,"size":721208056,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6912ad7f175fed7c4b7a1babf97b25c081ef8034&amp;dn=BBC+Fake+or+Fortune+Collection+01of10+Monet+PDTV+x264+AAC+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":-1,"time":1393093225,"description":"Fake or Fortune? Collection\n\nArts Documentary hosted by Fiona Bruce and Philip Mould, published by BBC in 2012-2014 - English narration\n\n\nInformation\n------------------------------\n\nFake or Fortune? Collection\nJournalist Fiona Bruce teams up with art expert Philip Mould to investigate mysteries behind paintings. It is a world of subterfuge and intrigue as they grapple with complex battles often unseen beneath the apparently genteel art establishment. Their sleuthing takes them from New York to Cairo and Cape Town as they unpick clues behind stolen and contested works of art, and unmask the work of a master forger along the way. The art world can prove a bear pit, with a myriad of tricksters at work. Experts estimate that anything between 20%-40% of works of art on the market are faked. And they can turn up in the most unexpected places.\nThis Collection is made up from Series 1, 2 and 3\n\n\n1)  Monet: Series 1 \nIn the opening episode, Fiona and Philip discover what they believe is an unrecognised and valuable painting by Monet. But can they convince the powers that be?\n\n2)  Homer: Series 1 \nIn this episode, the focus falls on a painting found dumped by a rubbish tip which turns out to be a lost work by one of America's most important 19th century artists, Winslow Homer. In a shock for all concerned, it is valued at 250,000 dollars. But who legally owns the picture, and why was it found in such an unlikely place? Philip and Fiona investigate.\n\n3)  Van Meegeren: Series 1 \nFiona Bruce and Philip Mould investigate the career of notorious forger Han van Meegeren, who fooled galleries and buyers in the early 20th century with his fake versions of paintings by Old Masters. Using modern forensic science, the presenters unpick the intricacies of his technique, and investigate claims that a piece in a prestigious London gallery could be the final example of van Meegeren's handiwork.\n\n4)  Degas and the Little Dancer: Series 2 \nFiona Bruce and expert Philip Mould investigate more works of art with mysterious origins. They begin by examining a painting that owner Patrick Rice believes is by Edgar Degas. If correct, it could be worth about Â£500,000. However, although Patrick's father bought it from a reputable dealer in 1945, the piece failed to make the official catalogue of the artist's work - meaning it is not classed as genuine by auction houses and is currently valued at only Â£200. Fiona and Philip trace the artwork back through time to find out whether it really was created by one of France's greatest artists.\n\n5)  Turner a Miscarriage of Justice: Series 2 \nFiona Bruce and expert Philip Mould explore the history of three paintings bequeathed to the National Museum of Wales when their owner died in 1951. It was always believed the pieces were by landscape artist JMW Turner, but only months after the museum took ownership, experts branded them fakes and unfit to hang on the gallery walls. Now Philip sets out to prove their authenticity once and for all.\n\n6)  Van Dyck What Lies Beneath: Series 2 \nThe tables are turned as art detective Philip Mould puts one of his own finds under the microscope, a painting he bought that he believes could be the work of 17th-century artist Anthony van Dyck. If he is right, it could be worth a small fortune. But to prove it, the piece will have to undergo a thorough restoration, involving the removal of layers of paint - and then be authenticated by an impartial expert. Will Philip's reputation - and the painting - make it to the end of the journey unscathed?\n\n7)  Vuillard: Series 3 \nFiona Bruce and Philip Mould investigate more potentially valuable works of art, beginning by helping a man who believes he owns a painting by French post-impressionist Edouard Vuillard. The quest for provenance begins in Geneva, where Philip compares the picture with a huge Vuillard work created in 1919, trying to find out whether the same materials were used in both, while Fiona uncovers clues to the picture's origins in France and Holland. Once they have enough evidence, they seek the approval of the Wildenstein Institute in Paris - but these are the same experts who notoriously rejected a highly credible Monet back in the very first episode. Have they done enough to prove this picture is genuine?\n\n8)  Constable: Series 3 \nFiona Bruce and Philip Mould take on a double challenge as they try to prove two paintings are missing works by one of Britain's best-loved artists, John Constable. They are helping west London woman Gillie Dance, whose picture of Yarmouth Jetty turns out to have a close connection to the artist's family, and American lawyer Tom Toppin, who has been struggling to prove the authenticity of his picture, Sea Beach Brighton, ever since buying it in the early 1990s. Will it be good news for either of the owners?\n\n9)  Chagall: Series 3 \nFiona Bruce and Philip Mould help property developer Martin Lang try to prove the painting he bought in 1992 is by modern master Marc Chagall. The search for clues leads to the artist's home town of Vitebsk in the former Soviet republic of Belarus, where Fiona makes a connection between the work and Chagall's life story. However, things take a more negative turn with news of a fake Chagall being sold in Minsk, and when scientific testing raises more questions than answers, Philip travels to Los Angeles to consult a forger. Will the Â£100,000 the owner spent 22 years ago turn out to have been a shrewd investment or an expensive mistake?\n\n10)  Gainsborough: Series 3 \nThe focus turns to Britain's public art collections, in which 17,000 paintings are listed as `artist unknown'. From these Philip Mould and his research director Bendor Grosvenor identify several works they believe are by Thomas Gainsborough. They choose two paintings, the first being an 18th-century portrait of St Albans mayor Joseph Gape that Bendor thinks dates back to the artist's days as a high-society portrait painter - although he'll need to convince the world's leading Gainsborough expert. Philip's choice is a rare landscape, painted when the artist was experimenting with dreamlike scenes. But why is conservationist Aviva Burnstock troubled by a distinctive blue pigment?\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img31.imageshack.us/img31/8812/xezs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img31.imageshack.us/img31/8812/xezs.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img35.imageshack.us/img35/8015/w0if.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img35.imageshack.us/img35/8015/w0if.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img802.imageshack.us/img802/5070/4jmg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img802.imageshack.us/img802/5070/4jmg.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img577.imageshack.us/img577/1524/5wcx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img577.imageshack.us/img577/1524/5wcx.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img89.imageshack.us/img89/2194/7p5i.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img89.imageshack.us/img89/2194/7p5i.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img593.imageshack.us/img593/6729/m9zx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img593.imageshack.us/img593/6729/m9zx.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img22.imageshack.us/img22/5725/fmyd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img22.imageshack.us/img22/5725/fmyd.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img585.imageshack.us/img585/3880/qt5o.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img585.imageshack.us/img585/3880/qt5o.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img585.imageshack.us/img585/4158/iaij.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img585.imageshack.us/img585/4158/iaij.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;cf82aea6a18f83fce1ff&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1648 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 59mins\n * Framerate: 25fps\n * Number of Parts: 10\n * Part Size: average 687 MB\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b01mxxz6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b01mxxz6&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Art%20on%20Your%20Wall&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Art%20on%20Your%20Wall&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:6912ad7f175fed7c4b7a1babf97b25c081ef8034","amp;dn":"BBC+Fake+or+Fortune+Collection+01of10+Monet+PDTV+x264+AAC+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6912ad7f175fed7c4b7a1babf97b25c081ef8034","infoHashBuffer":{"type":"Buffer","data":[105,18,173,127,23,95,237,124,75,122,27,171,249,123,37,192,129,239,128,52]},"announce":[],"urlList":[]}}