{"title":"Locks, Safes and Security 2nd Edition {BBS}","uid":6629846,"size":192130299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69949b3434dac17cedbda3c37318b964a068d415&amp;dn=Locks%2C+Safes+and+Security+2nd+Edition+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314288696,"description":"If you are a locksmith who is interested in obtaining detailed information on the very complex and diverse components of the profession, then you will find LSS+ an interesting and valuable reference. This is especially true if you are pursuing a career  in forensic locksmithing. Some of the best experts in the world provide detailed audio and video information within LSS+. There are extensive graphics regarding the analysis of locks and safes for evidence of both covert and forced entry, as well as discussions relating to insurance fraud.\n\nIf you are interested in the history of locks and safes since their initial development, then you will find equally interesting the edited versions of two of the world's most comprehensive works on the subject. These were written by George Price and Alfred C. Hobbs more than one hundred and fifty years ago. They have been rewritten and edited by the author.\n\nAlso rewritten is the small handbook entitled The Art of Manipulation. This classic manual was perhaps the first to describe the method of opening a combination lock by manipulation, and was written in 1955.\n\n\nIf you work for a government agency, are an investigator, or criminalist, you will find LSS+ to be a rich source of information regarding locks and safes, and their bypass. Detailed information, complemented by extensive audio and video, detail many of the tools that are available for covertly bypassing high security locking mechanisms. Equally comprehensive information is provided regarding the tools and techniques of forced entry. The government version of LSS+ will only be sold to government agencies. A network license may be obtained from the author.\n\n\n# Hardcover: 4049 pages\n# Publisher: Charles C Thomas Pub Ltd; 2nd edition (December 2000)\n# Language: English\n# ISBN-10: 0398070792\n# ISBN-13: 978-0398070793","torrent":{"xt":"urn:btih:69949b3434dac17cedbda3c37318b964a068d415","amp;dn":"Locks%2C+Safes+and+Security+2nd+Edition+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69949b3434dac17cedbda3c37318b964a068d415","infoHashBuffer":{"type":"Buffer","data":[105,148,155,52,52,218,193,124,237,189,163,195,115,24,185,100,160,104,212,21]},"announce":[],"urlList":[]}}