{"title":"Space Invaders - William Schnoebelen","uid":11724245,"size":275580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6995e8a252dcb04bb7c415e22b29253909ec50b5&amp;dn=Space+Invaders+-+William+Schnoebelen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424993685,"description":"\n&quot;Unidentified Flying Objects, Space Aliens? Are they only the stuff of Hollywood legends and people's overactive imaginations; or are they an omen of soimething more serious, more deadly? Are they something foretold for thousands of years? If you want to kow the truth about the heavens, you need to consult the Book written by the Creator of the heavens, Almighty Go! This of course, is the Holy Bible.\n\n\nAbout the author:\nWilliam Schnoebelen has been a serious student of the UFO phenomenon for thirty years. For half that time, he was involved in high level occult and satanic groups. Now, he is a Born Agian servant of Jesus Christ. From his unique background and perspective, he is able speak to the UFO mystery both from the standpoint of the Bible, and from the inner councils of the Satanic brotherhood. Is Satan behind UFOs and what is he trying to do? This book offers an explanation for the sudden rise of interest and media ttention in UFOs, the mysterious terror of alien abductions, and what this all should mean to us as followers of the Lord Jesus Crhis and students of End-times Prophecy. A compelling and informative book!&quot;","torrent":{"xt":"urn:btih:6995e8a252dcb04bb7c415e22b29253909ec50b5","amp;dn":"Space+Invaders+-+William+Schnoebelen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6995e8a252dcb04bb7c415e22b29253909ec50b5","infoHashBuffer":{"type":"Buffer","data":[105,149,232,162,82,220,176,75,183,196,21,226,43,41,37,57,9,236,80,181]},"announce":[],"urlList":[]}}