{"title":"AGI Building The Custom Ruger 10/22","uid":7835631,"size":7897600938,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:69aac7bebd698ce6a51cdce0795632cc265cffdc&amp;dn=AGI+Building+The+Custom+Ruger+10%2F22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shadowfoxs","files":1,"time":1353181056,"description":"Product ID# 345DVD\n\nRuger has built over 5,000,000 of these rifles and AGI shows you how to make yours &quot;All It Can Be&quot;!\n\nIn this course Instructor Jack Landis covers all the major topics in depth including barrels, receivers, trigger mechanisms, stocks, magazines, optics, accessories and more. Jack will show you dozens of options from Target to Varmint to Tactical, and where to get them! Plus, hell help you determine just what kind of rifle you want, and how to assemble it hassle free.\n\nJack will cover:\nhow to true your bolt and adjust for minimum headspace (critical for .17 caliber guns!), or where to have it done for you.\nhow to get rid of the infamous &quot;Ruger Barrel Droop&quot; and get ALL of your scope's vertical adjustment back.\nhow to make a simple fixture to drill and tap a hole in the rear of the receiver, in-line with the bore, in order to clean your barrel from the breech.\nhow to bed a threaded aftermarket receiver with a &quot;blind&quot; rear bedding tab and discuss different bedding techniques.\nhow various aftermarket fire control parts (sears &amp; hammers) interact with each other as well as other manufacturers parts.\nhow to do a proper trigger job and how to correctly fit the safety AFTER doing a trigger job if necessary.\nhow to make your own &quot;automatic&quot; bolt release and a &quot;quicky&quot; extended magazine release.\naftermarket trigger housings and trigger assemblies and show what is different and unique about them.\n\n\nThe rifle Jack built for under $450 during this course delivered 5 shot groups under .25 at 25 yards with inexpensive standard grade ammunition. If you desire to improve or customize your 10/22, this is a MUST HAVE course!\n","torrent":{"xt":"urn:btih:69aac7bebd698ce6a51cdce0795632cc265cffdc","amp;dn":"AGI+Building+The+Custom+Ruger+10%2F22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69aac7bebd698ce6a51cdce0795632cc265cffdc","infoHashBuffer":{"type":"Buffer","data":[105,170,199,190,189,105,140,230,165,28,220,224,121,86,50,204,38,92,255,220]},"announce":[],"urlList":[]}}