{"title":"Isochronic Tones Pure Series Blackballed on YouTube","uid":7826919,"size":10408380552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6a7b22258854bd6d0924472054a0cc111d282671&amp;dn=Isochronic+Tones+Pure+Series+Blackballed+on+YouTube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NeonYouki","files":1308,"time":1352951635,"description":"Haters reported 4 of my videos and got my account suspended for 2 weeks. YouTube doesn't allow people to appeal their strikes like they say you can. It simply forces you to acknowledge it and let them do it to you. If it stays down, I'll disclose how much I make from AdSense since I'll no longer be making money from it. This way many people can start working to get the income I had and be informed. So, if they don't want my heavily trafficked sight disclosing that information, they can't touch me.\n\nA lot of people were wanting the videos I make and a lot of people have viewed them quite often. As people's lives are getting better, I'm healing people of AIDS, Cancer, and the like, I'd imagine the dark ones have someone reporting my videos on me as part of what they are doing to stop the light. I have thousands of unique visits a moth on here and I have (had?) thousands of subscribers and viewers on my YouTube channel. That makes me a low-level target for the dark ones, so that's why I think they did that.\n\nWell, I'm not letting people suffer, so I'm posting a torrent file on here for people to get the help they need. Download the full thing and seed, please.\n\nThe file below consists of thousands of isochronic tones including the ones that had yet to be released.\n\n\n\nUPDATE! My account is now officially terminated and here's the email they sent me. Pay close attention to the part that says, &quot;We are unable to provide specific detail regarding your account suspension or your video's removal.&quot; I think I know why. &quot;Someone&quot; wanted it gone. Well, I always dreamed of the day the dark ones would take a bit of hash action on me because it tells me that I have something quite valuable that is helping people. I'll disclose how much I made from AdSense after December if we're still here. You'll be surprised how much I made from helping people. I don't want to jeopardize what I still have in my account by publicly posting that info.\n\nIf I forget and its January, please remind me. If you don't care about having your YouTube account terminated and want to help as many people as possible before the dark ones kill your account, upload my videos if you wish.\n\nNOTE: They said I was in violation of the spamming guidelines on the first strike. So, as spam is unsolicited and unwanted junk, perhaps the dark ones see it as such as it could get so big that it could kill the medical industry and ruin their checkbooks?\n\n\t\t\n\n\n\nRe: [#1155015225] [EMAIL REMOVED]\nHide Details\n\nFROM:\n\nYouTube Support\n\nTO:\n\n[EMAIL REMOVED]\n\nMessage flagged\nWednesday, November 14, 2012 9:01 PM\nHi FingerprintDiVA,\n\nThanks for your email. Your &quot;FingerprintDiVA&quot; account has been found to\nhave violated our Community Guidelines. Your account has now been\nterminated. Please be aware that you are prohibited from accessing,\npossessing or creating any other YouTube accounts.\n\nPenalty 1:\n&quot;Edema, Hangover, Muscular Dystrophy, Mental Disorders, etc. - 146Hz\nIsochronic Tones - Pure Series&quot; formerly at\nRemoved for violating our Terms of Use on 11/14/2012.\nPlease seeand\n\n\n\nYouTube staff review flagged videos 24 hours a day, seven days a week to\ndetermine whether they violate our Community Guidelines. When a video or\naccount is brought to our attention we investigate and take action if\nnecessary.\n\nWe are unable to provide specific detail regarding your account suspension\nor your video's removal. For more information on our what we consider\ninappropriate content or conduct while using YouTube, please visit our\nCommunity Guidelines and Tips at\nand our Help Center article\nat\n\nRegards,\n\n\nThe YouTube Team\n\n\n\nOriginal Message Follows:\n------------------------\nFrom: [EMAIL REMOVED]\nSubject: [EMAIL REMOVED]\n\n\n\nAutoDetectedBrowser: Firefox 1\nAutoDetectedOS: Windows XP\nIIILanguage: en\nIssueType: suspended\nLanguage: en\nUsername: [EMAIL REMOVED]\ncontact_email: [EMAIL REMOVED]\nfield_with_p_value: youtube","torrent":{"xt":"urn:btih:6a7b22258854bd6d0924472054a0cc111d282671","amp;dn":"Isochronic+Tones+Pure+Series+Blackballed+on+YouTube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a7b22258854bd6d0924472054a0cc111d282671","infoHashBuffer":{"type":"Buffer","data":[106,123,34,37,136,84,189,109,9,36,71,32,84,160,204,17,29,40,38,113]},"announce":[],"urlList":[]}}