{"title":"Tracks4Africa 2011.05.1-Full  Africa Maps-PC-Garmin","uid":7351001,"size":252144790,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6ad93ff708443eed2557d26d1a20084e6b2718a2&amp;dn=Tracks4Africa+2011.05.1-Full++Africa+Maps-PC-Garmin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bvmapper","files":3,"time":1339601450,"description":"ALREADY UNLOCKED - ENJOY !\n \nJUST INSTALL AND COPY TO SD CARD VIA MAP SOURCE\n \nINCLUDED:\n \nTRACKS4AFRICA Full Africa Mapset\n \nGarmin MapSource\n \nGarmin BaseCamp\n Tracks4Africa GPS Maps\n\n T4A GPS Maps are a set of 16 regional GPS maps covering most parts of the African continent. If you are a tourist or business traveller and looking for a GPS map to guide you through Africa then you would appreciate the accuracy and detail of T4A GPS Maps.\n\n T4A GPS Maps can be bought as individual downloads from our website or on a Plug &amp; Navigate SD card from our online store or see our comprehensive list of retailers. For updates and coverage of our latest maps, see what is new on our latest T4A GPS Maps.\n\n Our maps are constructed from GPS data sourced from the T4A Community of travellers. People just like you who record their travel experience and share it with the community via our maps.\n Tracks4Africa collects, catalogue and process these data submissions in order to create a very reliable GPS map. We link a name of a data contributor to a place or a road and this gives our maps integrity.\n\n Our uniquely African GPS maps are routable in most parts of Africa and can in fact give you turn-by-turn directions from Cape to Cairo. Do not expect complete wall to wall coverage from our maps. We only map places that are relevant to travellers and we endeavour to construct the safest routable GPS maps in Africa.\n\n We have the most comprehensive and accurate list of protected areas in Africa and we support the Mapa project in order to keep this resource the most relevant and accurate inventory of conservation areas in Africa.\n\n T4A GPS Maps will take you to the most incredible places on the African continent and we boast a very comprehensive set of tourist destinations. Be it the Ngorongoro Crater or Gorilla trekking in Rwanda or simply a very good restaurant in Cape Town you are after, we have them mapped.\n\n We have an incredibly rich set of points of interest which is absolutely relevant to the independent traveller in Africa. Our maps cover more than 85,000 points of interest ranging from activities, attractions to fuel stops and emergency services. We have accommodation such as hotels, guest lodges, backpackers as well as the most comprehensive listing of camp sites in Africa. For each point of interest we have a little landing page on Padkos where people can share photos and details about these places.\n\n ENJOY","torrent":{"xt":"urn:btih:6ad93ff708443eed2557d26d1a20084e6b2718a2","amp;dn":"Tracks4Africa+2011.05.1-Full++Africa+Maps-PC-Garmin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad93ff708443eed2557d26d1a20084e6b2718a2","infoHashBuffer":{"type":"Buffer","data":[106,217,63,247,8,68,62,237,37,87,210,109,26,32,8,78,107,39,24,162]},"announce":[],"urlList":[]}}