{"title":"Het.Debuut.1977.Dvd5.Hollands.Glorie","uid":10451423,"size":4270768453,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6b587f56e436ea4c8a421e070d164a146c905284&amp;dn=Het.Debuut.1977.Dvd5.Hollands.Glorie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"hendriknld","files":12,"time":1404027954,"description":"Het debuut is een Nederlandse film uit 1977 onder regie van Nouchka van Brakel. Het is een verfilming van het boek Het debuut van Hester Albach en tot filmscenario verwerkt door Carel Donck en Nouchka van Brakel. De film heeft als internationale titel The Debut.\nNouchka van Brakel zou als eerste vrouwelijke regisseur de boeken in gaan van de Nederlandse film, die hiermee haar debuut maakte, evenals hoofdrolspelers Gerard Cox en Marina de Graaf.\n\nDe 14-jarige Carolien krijgt een relatie met de 41-jarige Hugo, een vriend van haar ouders die vanuit Zambia op kerstvakantie is in Nederland. De twee spreken af op geheime locaties zoals in hotels. De relatie loopt uit op een drama als de vrouw van Hugo, Rita, zwanger wordt, en Hugo zijn relatie voor Carolien niet wil verbreken. Carolien reageert op een laconieke manier, dat ze makkelijk zonder Hugo kan. Op school wordt ze echter voor ouwe vrijster uitgemaakt en uit emotie knoopt ze het aan met de versierder van de school, waardoor ze depressief wordt. Uiteindelijk komt het goed nadat Hugo vertrokken is naar Afrika.\n","torrent":{"xt":"urn:btih:6b587f56e436ea4c8a421e070d164a146c905284","amp;dn":"Het.Debuut.1977.Dvd5.Hollands.Glorie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b587f56e436ea4c8a421e070d164a146c905284","infoHashBuffer":{"type":"Buffer","data":[107,88,127,86,228,54,234,76,138,66,30,7,13,22,74,20,108,144,82,132]},"announce":[],"urlList":[]}}