{"title":"Sex - Sex-Ploytation - How Women Use Their Bodies to Extort Mone","uid":4384486,"size":775245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b6ac69356299bb70599868510809fec9585b8aa&amp;dn=Sex+-+Sex-Ploytation+-+How+Women+Use+Their+Bodies+to+Extort+Mone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"leraconteur","files":1,"time":1220840423,"description":"Sex-Ploytation - How Women Use Their Bodies to Extort Money from Men - By Matthew Fitzgerald.pdf\n\nNot only is this book skillfully written, it hits America's dirty secret with lethal accuracy.  Although at times, I have felt that Mr. Fitzgerald treats human mating rituals like those between animals, but for the most part, I completely agreed with his position.  The fallacious principles behind the now perverted &quot;Feminist Movement&quot; have been finally revealed to the public.  In a way, the insight of this book is depressing, because it abolishes all our fantasies of &quot;love&quot; and &quot;holy matrimony&quot; and &quot;eternal bliss&quot;.  But in the long run, I would rather be rid of such childish dillusions than pay dearly for them in a divorce. They say that no one should identify a problem without providing a solution, and Mr. Fitzgerald provides one.\n\nEvery American should read this. It is a true shame that such a legendary masterpiece is no longer published and mostly forgotten. If anything is capable of ending the Gender Wars, it would be this book.\n\nFile Under:\nMGTOW, Men's Rights,mens rights, MRA, FRA, anti-feminism, feminism, mra, fra, Father's Rights, fathers rights, misandry, anti-misandry\n\nThe Essential Men's Rights Library - Torrent #7","torrent":{"xt":"urn:btih:6b6ac69356299bb70599868510809fec9585b8aa","amp;dn":"Sex+-+Sex-Ploytation+-+How+Women+Use+Their+Bodies+to+Extort+Mone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b6ac69356299bb70599868510809fec9585b8aa","infoHashBuffer":{"type":"Buffer","data":[107,106,198,147,86,41,155,183,5,153,134,133,16,128,159,236,149,133,184,170]},"announce":[],"urlList":[]}}