{"title":"Dreamchild (1985)","uid":5047004,"size":841810423,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6bc62516cca3ba8055b5c286f8706d57f7cdbb14&amp;dn=Dreamchild+%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FreeTibet","files":-1,"time":1249687162,"description":"Dreamchild (1985)\n\nWriter: Dennis Potter\nDirector: Gavin Millar\nMusic: Stanley Myers\nLucy: Nicola Cowper\nJack Dolan: Peter Gallagher\nLittle Alice: Amelia Shankley\nAlice Hargreaves: Coral Browne\nCharles Lutwidge Dodgson: Ian Holm\nMakeup and creature effects: Jim Henson's Creature Shop\n\nThe story is told from the point of view of the elderly Alice Hargreaves (nÃƒÂ©e Liddell) as in 1932 she travels to the United States from England to receive an honorary degree from Columbia University celebrating the centenary of Lewis Carroll's birth.\n\nThe film evolves from the factual to the hallucinatory as Alice revisits her memories of the Reverend Charles Lutwidge Dodgson (aka Lewis Carroll), in Victorian-era Oxford to her immediate present in the unruly wonderland of depression-era New York.\n\nAccompanied by a shy young orphan named Lucy, old Alice must navigate her way through the modern world of tabloid journalism and commercial exploitation and come to peace with her conflicted childhood with the whimsical and repressed Oxford don whose deep affection for her produced one of the most beloved classics of children's literature.\n\n\nN.B. Though technically this is a DVD rip, the video/audio quality doesn't exceed that of a VHS rip. This is because the only available DVD edition of this movie (published by &quot;EastWest DVD&quot;, you can find these in superstore bargain bins) is itself a transfer from VHS. Lets hope there comes a day we see a proper DVD release of this film!\n\nUntil then - enjoy and, if possible, please keep seeding until you have uploaded at least as much as you have downloaded!","torrent":{"xt":"urn:btih:6bc62516cca3ba8055b5c286f8706d57f7cdbb14","amp;dn":"Dreamchild+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bc62516cca3ba8055b5c286f8706d57f7cdbb14","infoHashBuffer":{"type":"Buffer","data":[107,198,37,22,204,163,186,128,85,181,194,134,248,112,109,87,247,205,187,20]},"announce":[],"urlList":[]}}