{"title":"The Stand  [TV miniseries 1994]  H.264 .m4v/.mp4   --PLUS-- The ","uid":5950447,"size":4714262885,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6c0bdd44cbac783c3492cc107e887f93d061ccee&amp;dn=The+Stand++%5BTV+miniseries+1994%5D++H.264+.m4v%2F.mp4+++--PLUS--+The+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tmax666","files":27,"time":1289509263,"description":"The Stand  [TV miniseries 1994]  H.264 .m4v/.mp4  \n--PLUS--\nThe Stand [Original TV Soundtrack] MP3 (192 kbps)\n---------------------------------------------------------------------------\n\nI took VIDEO TS files of each of the two DVD's and ripped H.264 MP4 files of each movie.  The files have a suffix of .m4v as they were ripped using HandBrake 0.9.4 so they can be played on any current iPod, iPhone, iPad, Apple TV or in iTunes.  They can also be played on any compliant player but you may need to change the suffix from .m4v to .mp4.  PLEASE keep seeding this.\n\n\n---------------------------------------------------------------------------\nThe Stand\n\nThis is the way the world ends\nThis is the way the world ends\nThis is the way the world ends\nNot with a bang but a whimper. - T.S. Eliot\n===========================================================================\nHailed as one of the best fantasy/horror novels ever written, Stephen King's The Stand has been published in two different versions -- a slimmed down original edition in 1978 and a slightly updated and unabridged version in 1991. And although both stick to the same story -- a U.S. government-created strain of the flu wipes out 99% of humanity and the survivors join two opposing camps in the ultimate face-off between good and evil -- they differ somewhat, particularly at the very end.\nOf all of King's novels, The Stand is the one most of his readers ask about or comment on, and until 1994, when ABC commissioned a miniseries based on this sprawling opus, one question always was &quot;Will there be a movie based on this one?&quot; (King replied in the foreword to the &quot;uncut and unabridged&quot; edition that he thought there might be...)\n\nUnlike most of King's novels, the sheer scope of the novel guaranteed that The Stand would have to be a miniseries made for TV. To have compressed the 1,000-plus pages into a three-hour movie would have been impossible without deleting many characters and situations, a very risky proposition since The Stand is to King's legions of fans what The Lord of the Rings is to Tolkien's readers. And to have hired someone else to adapt it from book to teleplay would have been a risky proposition, so ABC asked King to take the writing reins.\n\nHappily, the 1994 &quot;Stephen King's The Stand&quot; turned out to be a marvelous miniseries, and while it did not break any Nielsen ratings as &quot;Alex Haley's Roots&quot; did in 1977, it did fairly well and earned many good reviews.\n\nThe Artisan Home Entertainment Special Edition DVD of &quot;Stephen King's The Stand&quot; presents the complete miniseries on two DVDs, with The Plague and The Dreams on Disc One and The Betrayal and The Stand on Disc Two. Stripped of commercials and station identification/local news promos, the eight-hour running time is pared down to 366 minutes.\n\nParts One and Two (The Plague, The Dreams) deal with the accidental release of a super-deadly strain of the flu from a secret military laboratory known as Project Blue. Although the base's security attempts to lock down the facility before the virus escapes, one guard and panics attempts to flee, unwittingly infecting his wife and daughter and beginning a chain reaction that will lead to the deaths of millions. Even so, a handful of people survive, and as they try to cope with the disaster and move on, they are guided by their dreams to join either the evil Randall Flagg or the good 106-year-old Mother Abigail. While Flagg sets up his police-state in Sin City itself, Las Vegas, the good guys (and gals) set up the Boulder Free Zone in Colorado...but this is only the setup for the darker conflict to come.\n\nParts Three and Four (The Betrayal, The Stand) describe the apocalyptic conflict between good and evil as Flagg's people race to acquire weapons of mass destruction to assure their demonic master's victory over the power of the Light side represented by the Boulder Free Zone. Flagg, who was seen only in a few brief scenes in the first half, gets more airtime as the story finally focuses on the final conflict. It's an old storytelling technique but it works well here, and Jamey Sheridan (Law &amp; Order: Criminal Intent) plays the evil demon with a mixture of charm and menace.\n\nDespite the leeway allowed by the miniseries format and unusually open-mindedness from ABC's Standards and Practices division, the teleplay more closely follows the 1978 version rather the 1991 edition, particularly in the ending. King has to compress some parts here, combine some characters there to make the miniseries flow seamlessly and not go over budget (If ABC had commissioned a 12-hour teleplay, maybe the condensing would not have been necessary, but that's Monday-morning quarterbacking 10 years after the show aired). Even so, The Stand captures the spirit of the novel brilliantly.\n\nCredit is also due to director Mick Garris, who not only got great performances from such actors as Gary Sinise, Molly Ringwald, Jamey Sheridan, Ossie Davis, Ruby Dee, Ray Walston and Rob Lowe, but also kept the huge storyline from dragging or getting too heavy-handed on the gross-out scale.\n===========================================================================\nStephen King's The Stand: Original Television Soundtrack [Soundtrack]\nW.G. Snuffy Walden (MP3 192 kbps)\n---------------------------------------------------------------------------\nThese compositions are magnificent on many levels. Snuff Walden is one of music's greatest composers. You wouldn't know his name, but you've most certainly heard his music. His credits include the incidental music for TV shows such as Thirtysomething, The Wonder Years, and I'll Fly Away. Walden also plays all the guitar parts for his scores. For The Stand mini-series Stephen King approached Walden to do the music. In that request King wanted what he termed &quot;Blue Jean Music.&quot; And that's exactly what he got. Each track on this CD invokes many emotions, from hope and struggle to turmoil and simple pleasure. The third track on the CD, &quot;On the Road to Kansas,&quot; is Walden at his best, creating an acoustic masterpiece. One word that sums it up for me is &quot;Tasty.&quot; And this blend of acoustic work is what Snuff Walden is best known for. Equally impressive is the more rocky track, &quot;The Trashman in Vegas.&quot; Here Walden switches directions employing a harder feel with a Mark Knopfler style of guitar playing. His versatility really shows, however, in the title track, where he uses a full orchestral arrangement for the climax of the film. Many things are impressive about this soundtrack. The mood, feel, and emotion created throughout this work is an incredible achievement. Anyone listening to this entire CD would swear that it was impossible for one guy to have written all the music on this thing. But that is what Snuff Walden is all about. Versatility and sheer musicianship.","torrent":{"xt":"urn:btih:6c0bdd44cbac783c3492cc107e887f93d061ccee","amp;dn":"The+Stand++%5BTV+miniseries+1994%5D++H.264+.m4v%2F.mp4+++--PLUS--+The+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c0bdd44cbac783c3492cc107e887f93d061ccee","infoHashBuffer":{"type":"Buffer","data":[108,11,221,68,203,172,120,60,52,146,204,16,126,136,127,147,208,97,204,238]},"announce":[],"urlList":[]}}