{"title":"VA - 25 Hits From The British Invasion (2002)","uid":8649443,"size":327188523,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6c56c17dec4da3765ab8caed3fa6d9ff178a0d02&amp;dn=VA+-+25+Hits+From+The+British+Invasion+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":31,"time":1373065599,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nVarious Artists - 25 Hits From The British Invasion (2002)\n  &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/412J6W2XRSL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/412J6W2XRSL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nAll Music Album Review (by Richie Unterberger):\n\nAs a single-disc compilation of British Invasion hits, this has a lot of shortcomings that prevent it from being close to an optimum British Invasion best-of, though it has a good deal of fine music. The strongest point in its favor is its quantity: there are 25 songs here of various British Invasion styles, which is good value for one CD. The drawbacks are several, starting with the most obvious one, which is the absence of any hits from the Beatles, the Rolling Stones, the Kinks, or the Who, presumably due to licensing restrictions. Also, however, several important British Invasion artists are not represented with one of their best hits, again probably due to licensing restrictions. No one would place the Dave Clark Five's &quot;I Knew It All the Time&quot; as one of their more memorable singles; it just happens to be available because it predates the body of work (including all of their important hits) that can't be licensed. The Animals' &quot;Boom Boom&quot; is not the hit studio version, but a live 1963 performance. Several of the songs filling out the program are pop-oriented tunes that are not what anyone would consider upper-crust British Invasion classics, like Chris Farlowe's &quot;Out of Time,&quot; Jonathan King's &quot;Everyone's Gone to the Moon,&quot; Twice As Much's &quot;Sittin' on a Fence,&quot; David &amp; Jonathan's &quot;Michelle,&quot; the Herd's &quot;I Don't Want Our Loving to Die,&quot; and Long John Baldry's &quot;Let the Heartaches Begin.&quot; On the other hand, you do get a number of classics, like Donovan's &quot;Catch the Wind,&quot; the Zombies' &quot;Tell Her No,&quot; Lulu's &quot;To Sir With Love,&quot; the Yardbirds' &quot;I'm a Man,&quot; the Small Faces' &quot;Itchycoo Park,&quot; the Searchers' &quot;Love Potion Number Nine,&quot; and the Easybeats' &quot;Friday on My Mind&quot; (recorded in the U.K., though the group was Australian). There are also some good just-below-first-level hits like Ian Whitcomb's &quot;You Turn Me On,&quot; Unit 4+2's &quot;Concrete and Clay,&quot; and the Hollies' &quot;Carrie-Anne,&quot; and some good singles that did much better in Britain and might not be familiar to the casual listener, like the Alan Price Set's &quot;I Put a Spell on You&quot; and Hedgehoppers Anonymous' &quot;It's Good News Week.&quot; But as a whole, this gives a rather distorted and too-pop-slanted picture of a great phase of '60s rock music that really needs several discs (and a better selection of material) to do it justice.\n\nTaken from:  &lt;a href=&quot;\nhttp://www.allmusic.com/album/25-hits-from-the-british-invasion-r597706/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/25-hits-from-the-british-invasion-r597706/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000069HJQ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000069HJQ&lt;/a&gt;\n\nTrack List:\n\n01. Unit Four Plus Two - Concrete And Clay\n02. The Zombies - Tell Her No\n03. Chad &amp; Jeremy - Yesterday's Gone\n04. Donovan - Catch The Wind\n05. The Dave Clark Five - I Knew It All The Time\n06. Petula Clark - My Love\n07. Alan Price Set - I Put A Spell On You\n08. The Animals - Boom Boom (Live From 1963)\n09. The Tornadoes - Telstar\n10. The Yardbirds - I'm A Man\n11. The Searchers - Love Potion Number Nine\n12. Ian Whitcomb And Bluesville - You Turn Me On (Turn On Song)\n13. Hedgehoppers Anonymous - It's Good News Week\n14. David And Jonathan - Michelle\n15. The Hollies - Carrie-Anne\n16. Crispian St. Peters - Pied Piper\n17. Jonathan King - Everyone's Gone To The Moon\n18. The Ivy League - Tossing &amp; Turning\n19. Lulu - To Sir With Love\n20. Twice As Much - Sitting' On A Fence\n21. The Herd - I Don't Want Our Loving To Die\n22. Long John Baldry - Let The Heartaches Begin\n23. Chris Farlow - Out Of Time\n24. The Easybeats - Friday On My Mind\n25. The Small Faces - Itchycoo Park\n","torrent":{"xt":"urn:btih:6c56c17dec4da3765ab8caed3fa6d9ff178a0d02","amp;dn":"VA+-+25+Hits+From+The+British+Invasion+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c56c17dec4da3765ab8caed3fa6d9ff178a0d02","infoHashBuffer":{"type":"Buffer","data":[108,86,193,125,236,77,163,118,90,184,202,237,63,166,217,255,23,138,13,2]},"announce":[],"urlList":[]}}