{"title":"2014 Intravenous Medications [PDF] [StormRG]","uid":9971428,"size":10264948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c6439b160a233cb67ac581562ce245acd6fb895&amp;dn=2014+Intravenous+Medications+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":-1,"time":1397622984,"description":"Author: Betty L. Gahart, Adrienne R. Nazareno \nSeries: Intravenous Medications\nSpiral-bound: 1312 pages\nPublisher: Mosby; 30 edition (July 29, 2013)\nLanguage: English\nISBN-10: 0323084788\nISBN-13: 978-0323084789\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n____________________________________________________________________________________\n\n\nThe #1 IV drug handbook for 40 years, Intravenous Medications: A Handbook for Nurses and Health Professionals is trusted for its accuracy and comprehensive coverage. Whether you prefer the portable print version or the convenient electronic format, this new edition provides essential data on administering more than 350 intravenous (IV) drugs, entries for new IV drugs recently approved by the FDA, hundreds of new drug facts, a detailed index of generic and trade names and more - all alphabetically organized to help you find drug information quickly and easily.\n\n* UNIQUE! Published annually to ensure you have essential information on the most recently approved IV drugs as well as updated information on existing drugs.\n\n* UNIQUE! Contains thorough coverage of more than 350 IV drugs - supplying you with far more than any other comparable handbook.\n\n* UNIQUE! Time-tested page layout keep all dosage information for each drug on either a single page or a two-page spread to prevent hand contamination by having to turn a page.\n\n* Consistent, easy-to-use format provides all the essential clinical information you need on IV drug administration.\n\n* Lists IV drugs alphabetically by generic name for quick clinical reference.\n\n* Updated IV drug dilution and dosage charts within monographs provide quick access to essential information.\n\n* Special sections highlight dosage variances for geriatric, pediatric, infant, and neonatal patients.\n\n* Black Box Warnings, screening, and highlighting make locating key information quick and easy.\n\nPrinted thumb tabs help you find information faster.\n\n* NEW! Four new drug monographs provide you with current, clinically relevant drug information for new IV drugs recently approved by the FDA.\nNEW! Updated drug monographs reflect the latest changes in IV drug therapy.","torrent":{"xt":"urn:btih:6c6439b160a233cb67ac581562ce245acd6fb895","amp;dn":"2014+Intravenous+Medications+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c6439b160a233cb67ac581562ce245acd6fb895","infoHashBuffer":{"type":"Buffer","data":[108,100,57,177,96,162,51,203,103,172,88,21,98,206,36,90,205,111,184,149]},"announce":[],"urlList":[]}}