{"title":"Modem Astronomy - Startling Facts (gnv64)","uid":7514078,"size":15441731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6cb8c736babfd707bf95b903ecdad867134b6520&amp;dn=Modem+Astronomy+-+Startling+Facts+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gnv65","files":-1,"time":1344416766,"description":"Modem Astronomy - Startling Facts With 1001 Questions and Answers\nBy C Sivaram, Kenath Arun\nAne Books | 2009 | ISBN 10: 93-80156-05-7 | PDF | 174 pages | 14.7 mb\nscanned to PDF by me.\n\nThe year 2009 is being recognised as the international year of astronomy (IYA) to mark the four hundredth anniversary of the historical occasion in the year 1609 when Galileo Galilei used the then newly invented telescope to observe astronomical objects. Many activities have been planned to commemorate IYA-09. Towards this we feel that an Astronomy Quiz book, along with introductory notes on a wide variety of topics in astronomy, would be very timely.\nWe have, in this book, a thousand interesting trivia related to all aspects of astronomy. Also included are introduction to wide range of topics on modern astronomy, including planets, stars, space probes, astronomers: facts and discoveries, historical facts, observatories, etc. This book will be of good interest to both general public as well as to students interested in astronomy and its many interesting fields.\n\nAbout the Authors\nC Sivaram is a senior professor and Chairman of Theoretical Astrophysics group at Indian Institute of Astrophysics, Bangalore. He is the recipient of prestigious international awards like Martin Foster Gold Medal and the Ettore Majorana fellowship. He has served as the Joint Director of projects of the World Laboratory (Geneva) and collaborated with Nobel Laureate, Abdus Salam. He has over 200 papers in International journals and author of two books in varied fields in astronomy.\nKenath Arun is a lecturer in the Department of Physics, Christ Junior College, Bangalore. He is the recipient of six gold medals from Bangalore University (MSc in Physics) and is currently pursuing his Ph.D in Cosmology under the guidance of Prof C Sivaram. He has presented papers at National and International Seminars.\n\nCONTENTS\nPreface, International Year of Astronomy, 2009,\n1. The Solar System,\n2. Stellar Evolution,\n3. Black Holes,\n4. Galaxies,\n5. Dark Matter and Dark Energy,\nAstronomy Quiz Questions,\nAstronomy Quiz Answers.","torrent":{"xt":"urn:btih:6cb8c736babfd707bf95b903ecdad867134b6520","amp;dn":"Modem+Astronomy+-+Startling+Facts+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cb8c736babfd707bf95b903ecdad867134b6520","infoHashBuffer":{"type":"Buffer","data":[108,184,199,54,186,191,215,7,191,149,185,3,236,218,216,103,19,75,101,32]},"announce":[],"urlList":[]}}