{"title":"Emotional Intelligence :-- Why it can matter more than IQ","uid":4870365,"size":78670576,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6d36d49384fe49f56b2f5064c1ba944791a11093&amp;dn=Emotional+Intelligence+%3A--+Why+it+can+matter+more+than+IQ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NannySis","files":1,"time":1240771445,"description":"&quot;Emotional Intelligence: Why it can matter more than IQ By by Daniel Goleman\nMp3 | 76 Mb \n\nIs IQ destiny? Not nearly as much as we think. This fascinating and persuasive program argues that our view of human intelligence is far too narrow, ignoring a crucial range of abilities that matter immensely in terms of how we do in life.\n\nDrawing on groundbreaking brain and behavioral research, Daniel Goleman shows the factors at work when people of high IQ flounder and those of modest IQ do well. These factors add up to a different way of being smart -- one he terms &quot;emotional intelligence.&quot; This includes self-awareness and impulse control, persistence, zeal and self-motivation, empathy and social deftness.\n\nThese are the qualities that mark people who excel in life, whose relationships flourish, who are stars in the workplace. Lack of emotional intelligence can sabotage the intellect and ruin careers. Perhaps the greatest toll is on children, for whom risks include depression, eating disorders, unwanted pregnancies, aggressiveness and crime.\n\nBut the news is hopeful. Emotional intelligence is not fixed at birth, and the author shows how its vital qualities can be nurtured and strengthened in all of us. And because the emotional lessons a child learns actually sculpt the brain's circuitry, he provides guidance as to how parents and schools can best use this window of opportunity in childhood. The message of this eye-opening program is one we must take to heart: the true &quot;bell curve&quot; for a democracy must measure emotional intelligence\n","torrent":{"xt":"urn:btih:6d36d49384fe49f56b2f5064c1ba944791a11093","amp;dn":"Emotional+Intelligence+%3A--+Why+it+can+matter+more+than+IQ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d36d49384fe49f56b2f5064c1ba944791a11093","infoHashBuffer":{"type":"Buffer","data":[109,54,212,147,132,254,73,245,107,47,80,100,193,186,148,71,145,161,16,147]},"announce":[],"urlList":[]}}