{"title":"The Guantanamo Files  [Malestrom]","uid":5235669,"size":13430326,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d6f6e528002944ab762210d6ba509a83f289f3c&amp;dn=The+Guantanamo+Files++%5BMalestrom%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1261519872,"description":"\n\n\nAndy Worthington, &quot;The Guantanamo Files: The Stories of the 759 Detainees in America's Ille&quot;\nPublisher: Pluto Press | 2007 | ISBN 0745326641 | PDF | 351 pages \n\nAn important book. If you care about our Government's complicity in these illegal and horrific acts then this book provides the evidence.' Ken Loach&quot;Extraordinary rendition, false imprisonment, inhumane treatment - including torture and death in secretive detention sites - has forever destroyed the lives of hundreds of men, of whom I was one. This book is the first of its kind to collate accounts from the prisoners themselves.&quot;Moazzam Begg, former Guantanamo detainee and spokesman for CagePrisoners&quot;Guantanamo Bay is a legal black hole. ... This book is the closest many of the prisoners will come to a fair trial. Andy Worthington [uses] the US government's own documents to prove that innocent people were swept up in the post-9/11 panic. \n\nThis is important work, impressively written.&quot; Clive Stafford Smith, Legal Director of Reprieve, and author of Bad Men: Guantanamo Bay and the Secret Prisons&quot;Stunning. ... [Worthington] undermines claims that the prison camp is filled with vicious killers and terrorists.&quot;Marc Falkoff, lawyer for 17 Yemeni prisoners and editor of Poems from Guantanamo: The Detainees Speak&quot;A meticulous [book] about torture at the beginning of the twenty-first century. [Written with] poignancy, compassion and outrage.&quot;Marty Fisher, Co-Producer of the film, 'Taxi to the Dark Side' &quot;[This book is] an important tool for coming to grips with how we as a nation allowed indefinite detention without charge, extraordinary rendition and torture to become national policies.&quot;Candace Gorman, lawyer for two Guantanamo prisoners.","torrent":{"xt":"urn:btih:6d6f6e528002944ab762210d6ba509a83f289f3c","amp;dn":"The+Guantanamo+Files++%5BMalestrom%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d6f6e528002944ab762210d6ba509a83f289f3c","infoHashBuffer":{"type":"Buffer","data":[109,111,110,82,128,2,148,74,183,98,33,13,107,165,9,168,63,40,159,60]},"announce":[],"urlList":[]}}