{"title":"Live for Speed","uid":4353018,"size":157068653,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d729badba474cd6463c0ffbfb598be7d0ef7662&amp;dn=Live+for+Speed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"scionjec","files":3,"time":1219266699,"description":"Live for Speed - the simulator of formula and body racing automobiles on the asphalt and rallikross (asphalt + soil) annular routes.\n\nIt is free for the running off and the competitions on-line into demo regime, it possesses outstanding physics, variety of the types of automobiles and good net code, which makes it possible to use even dial-up modem. LFS is supported imposing kolichesvo of languages including Russian, and in spite of very narrow purposeful audience it has many worshippers 0 0N throughout the world. Became conqueror in the nominations &quot;best mul&amp;#039;tipleyer&quot;, &quot;best physics&quot; and &quot;simulator of year&quot; into the 2005- ohm.Chief characteristic LFS - high realism of physical model, which is reached due to the detailed simulation of machines according to the rules of Newtonian mechanics. Suspensions are in detail modelled, their work can be examined directly in the game, the levers of suspension it is bent and they break from the impacts, machines obtain the damages, which are also simulated directly during the impacts. The temperature of tires changes dynamically and it is calculated for many separate uchastov of their surface. \n","torrent":{"xt":"urn:btih:6d729badba474cd6463c0ffbfb598be7d0ef7662","amp;dn":"Live+for+Speed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d729badba474cd6463c0ffbfb598be7d0ef7662","infoHashBuffer":{"type":"Buffer","data":[109,114,155,173,186,71,76,214,70,60,15,251,251,89,139,231,208,239,118,98]},"announce":[],"urlList":[]}}