{"title":"Death of a Generation: How the Assassinations of Diem and JFK Pr","uid":11739385,"size":5705539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d9b486e024d4b2379b43f4cf15f145f39f2b47b&amp;dn=Death+of+a+Generation%3A+How+the+Assassinations+of+Diem+and+JFK+Pr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425711173,"description":"When John F. Kennedy was shot, millions were left to wonder how America, and the world, would have been different had he lived to fulfill the enormous promise of his presidency. For many historians and political observers, what Kennedy would and would not have done in Vietnam has been a source of enduring controversy. Now, based on convincing new evidence--including a startling revelation about the Kennedy administration's involvement in the assassination of Premier Diem--Howard Jones argues that Kennedy intended to withdraw the great bulk of American soldiers and pursue a diplomatic solution to the crisis in Vietnam. Drawing upon recently declassified hearings by the Church Committee on the U.S. role in assassinations, newly released tapes of Kennedy White House discussions, and interviews with John Kenneth Galbraith, Robert McNamara, Dean Rusk, and others from the president's inner circle, Jones shows that Kennedy firmly believed that the outcome of the war depended on the South Vietnamese. In the spring of 1962, he instructed Secretary of Defense McNamara to draft a withdrawal plan aimed at having all special military forces home by the end of 1965. The &quot;Comprehensive Plan for South Vietnam&quot; was ready for approval in early May 1963, but then the Buddhist revolt erupted and postponed the program. Convinced that the war was not winnable under Diem's leadership, President Kennedy made his most critical mistake--promoting a coup as a means for facilitating a U.S. withdrawal. In the cruelest of ironies, the coup resulted in Diem's death followed by a state of turmoil in Vietnam that further obstructed disengagement. Still, these events only confirmed Kennedy's view about South Vietnam's inability to win the war and therefore did not lessen his resolve to reduce the U.S. commitment. By the end of November, however, the president was dead and Lyndon Johnson began his campaign of escalation. Jones argues forcefully that if Kennedy had not been assassinated, his withdrawal plan would have spared the lives of 58,000 Americans and countless Vietnamese. Written with vivid immediacy, supported with authoritative research, Death of a Generation answers one of the most profoundly important questions left hanging in the aftermath of John F. Kennedy's death","torrent":{"xt":"urn:btih:6d9b486e024d4b2379b43f4cf15f145f39f2b47b","amp;dn":"Death+of+a+Generation%3A+How+the+Assassinations+of+Diem+and+JFK+Pr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d9b486e024d4b2379b43f4cf15f145f39f2b47b","infoHashBuffer":{"type":"Buffer","data":[109,155,72,110,2,77,75,35,121,180,63,76,241,95,20,95,57,242,180,123]},"announce":[],"urlList":[]}}