{"title":"Paul K. Moser &amp; J. D. Trout - Contemporary Materialism: A Re","uid":10994159,"size":2647933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e29197b633b07572aaf5b62ebd7dc7f9db13c6f&amp;dn=Paul+K.+Moser+%26amp%3B+J.+D.+Trout+-+Contemporary+Materialism%3A+A+Re&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"philosophi","files":-1,"time":1410044576,"description":"Paul K. Moser &amp; J. D. Trout - Contemporary Materialism: A Reader\n\nContemporary Materialism brings together the best recent work on materialism from many of our leading contemporary philosophers. This is the first comprehensive reader on the subject. The majority of philosophers and scientists today hold the view that all phenomena are physical, as a result materialism or 'physicalism' is now the dominant ontology in a wide range of fields. Surprisingly no single book, until now, has collected the key investigations into materialism, to reflect the impact it has had on current thinking in metaphysics, philosophy of mind and the theory of value. The classic papers in this collection chart contemporary problems, positions and themes in materialism. At the invitation of the editors, many of the papers have been specially up-dated for this collection: follow-on pieces written by the contributors enable them to appraise the original paper and assess developments since the work was first published. The book's selections are largely non-technical and accessible to advanced undergraduates. The editors have provided a useful general introduction, outlining and contextualizing this central system of thought, as well as a topical bibliography. Contemporary Materialism will be vital reading for anyone concerned to discover the ideas underlying contemporary philosophy.","torrent":{"xt":"urn:btih:6e29197b633b07572aaf5b62ebd7dc7f9db13c6f","amp;dn":"Paul+K.+Moser+%26amp%3B+J.+D.+Trout+-+Contemporary+Materialism%3A+A+Re","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e29197b633b07572aaf5b62ebd7dc7f9db13c6f","infoHashBuffer":{"type":"Buffer","data":[110,41,25,123,99,59,7,87,42,175,91,98,235,215,220,127,157,177,60,111]},"announce":[],"urlList":[]}}