{"title":"The Movielife - Discography (1999-2003) [FLAC]","uid":8854247,"size":899959774,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ef035920a8e817d635762900627b99df61248af&amp;dn=The+Movielife+-+Discography+%281999-2003%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1377609844,"description":"\n  The Movielife - Discography (1999-2003) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Punk-Pop, Punk Revival, Alternative\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 800 - 1,000 kbps\n  Bit Depth: \n  Sampling Rate: 44,100 Hz\n\n  1999 It's Go Time\n  2000 This Time Next Year\n  2001 Has a Gambling Problem EP\n  2001 The Movielife and Ex Number Five Split EP\n  2003 Forty Hour Train Back to Penn \n\n  The Movielife comprised vocalist Vinnie Caruana, bassist Phil Navetta, guitarist Brandon Reilly, drummer Evan Baken, and guitarist Alex Amiruddin. (Future Taking Back Sunday guitarist Ed Reyes was a founding member, but left before anything notable was released.) Forming on Long Island in 1997, the punk revivalist, hardcore-influenced quintet soon went from basement shows to self-releasing its first LP, It's Go Time. A heavy tour load followed, further spreading the word. This Time Next Year was then issued in late 2000 through Revelation, but while on tour to support the record, The Movielife's van crashed, causing minor injuries and mental anguish. The band rallied hard, touring with New Found Glory and Glassjaw in the process. In 2001, The Movielife signed to Drive -Thru Records and issued the Movielife Has a Gambling Problem EP, which was tinged with a more punk-pop sound in line with that label's guiding principal. Navetta's younger brother Dan signed on for guitar duties in place of Amiruddin soon after, and two years later, Forty Hour Train Back to Penn appeared; The Movielife again set out on tour in support of the effort. But tensions in the group were rising and in September 2003, a note on the band's website revealed that The Movielife had decided to break up. Most notably, Caruana went on to form I Am the Avalanche and Reilly started Nightmare of You.","torrent":{"xt":"urn:btih:6ef035920a8e817d635762900627b99df61248af","amp;dn":"The+Movielife+-+Discography+%281999-2003%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ef035920a8e817d635762900627b99df61248af","infoHashBuffer":{"type":"Buffer","data":[110,240,53,146,10,142,129,125,99,87,98,144,6,39,185,157,246,18,72,175]},"announce":[],"urlList":[]}}