{"title":"Kerbal Space Program v1.0.5.1028","uid":12760565,"size":609415162,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6f5df87e14e0255167a497d7995376ba522001fb&amp;dn=Kerbal+Space+Program+v1.0.5.1028&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1447527175,"description":"About This Game\r\nIn KSP you must build a space-worthy craft, capable of flying its crew out into space without killing them. At your disposal is a collection of parts, which must be assembled to create a functional ship. Each part has its own function and will affect the way a ship flies (or doesn't). So strap yourself in, and get ready to try some Rocket Science!\r\n\r\nThe game offers three gameplay modes: Sandbox, in which you are free to build anything you can think of; Science Mode, which lets you perform Scientific experiments to advance the knowledge of Kerbalkind and further the available technology; and Career Mode, in which you must manage every aspect of your Space Program, including administration strategies, Crew Management, Reputation, as well as taking up Contracts to earn Funds and upgrade your Space Center Facilities (or repair them).\r\n\r\nAdd to this the ability to capture asteroids (a feature done in collaboration with NASA), Mining for resources out across the furthest reaches of the Solar System, Constructing Bases and Space Stations in and around other worlds; plus literally thousands of mods from a huge active modding community, all add up into the award-winning game that has taken the space sim genre by storm.\r\nKey Features\r\n\r\n    The Vehicle Assembly Building and the Space Plane Hangar allows players to build spacecraft out of any imaginable combination of parts.\r\n    Fully-fledged, Physics-based Space Flight Simulation ensures everything will fly (and crash) as it should.\r\n    Take your Kerbal crew out of the ship and do Extra Vehicular Activities.\r\n    Fly out to Moons and other Planets.\r\n    Procedural Terrain delivers detailed terrain at a vast scale. The Kerbal Planet is 600km in radius!\r\n    Mod-enabled, allows players to create new content and modify the game.\r\n    Ship systems. Keep an eye out for engine temperatures and fuel levels, and try not to explode.\r\n    Build ships with multiple stages, and jettison parts away as they burn out.\r\n    Full control over the ship’s setup allows for complex ships and advanced functionality.\r\n    Dock spacecraft together to build Space Stations, Massive Starships, or even surface bases on other worlds.\r\n    Manage your crewmembers, hire them, and send them out into space and make them into heroes.\r\n    Research and Develop new technologies to advance your Space Program.\r\n    Take on Missions to attract interest in your Space Program.\r\n    Discover new worlds and expand the scientific knowledge of Kerbalkind.\r\n    Extract valuable resources from all over the solar system.\r\n    And a whole lot more!","torrent":{"xt":"urn:btih:6f5df87e14e0255167a497d7995376ba522001fb","amp;dn":"Kerbal+Space+Program+v1.0.5.1028","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f5df87e14e0255167a497d7995376ba522001fb","infoHashBuffer":{"type":"Buffer","data":[111,93,248,126,20,224,37,81,103,164,151,215,153,83,118,186,82,32,1,251]},"announce":[],"urlList":[]}}