{"title":"The.Central.Nervous.System.-.Structure.and.Function.(3rd Edition","uid":6603749,"size":106868091,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7029f5b3516fd6eb49a5137d1bca76404db4cf81&amp;dn=The.Central.Nervous.System.-.Structure.and.Function.%283rd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"betadoctor","files":-1,"time":1313320936,"description":"The Central Nervous System: Structure and Function (3rd Edition)\nOxford University Press, USA | 2003 | ISBN: 0195165608 | 536 pages | PDF | 102MB\n\nA major goal of this well-established textbook is to provide knowledge and understanding of neuroscience as a basis for clinical thinking. The strong emphasis on linking basic sciences with their clinical application has implications for the choices of which topics to treat in depth and which to treat more summarily - making this different from most other neuroscience textbooks. For example, topics of great practical importance like the cranial nerves, the autonomic nervous system, and pain are treated in depth.\n\nThe book provides clear descriptions of brain structures and relates them to their functional properties by incorporating data ranging from molecular biology to clinical neurology and psychiatry. The focus is on fostering understanding of how the brain works rather than on the memorization of many details. Critical thinking is encouraged by providing information about the scientific basis for many &quot;facts,&quot; and pointing out where the evidence is insufficient to reach final conclusions. The many two-color illustrations - based on the author's long experience in teaching medical students - make it easy to grasp complex structural and functional relationships.","torrent":{"xt":"urn:btih:7029f5b3516fd6eb49a5137d1bca76404db4cf81","amp;dn":"The.Central.Nervous.System.-.Structure.and.Function.%283rd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7029f5b3516fd6eb49a5137d1bca76404db4cf81","infoHashBuffer":{"type":"Buffer","data":[112,41,245,179,81,111,214,235,73,165,19,125,27,202,118,64,77,180,207,129]},"announce":[],"urlList":[]}}