{"title":"Emily Osment - All The Right Wrongs EP [2009]","uid":5629399,"size":46770649,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70c7afde3ccfd089435d32c83cbc95f7726ff7cc&amp;dn=Emily+Osment+-+All+The+Right+Wrongs+EP+%5B2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"piratetorrent1989","files":6,"time":1276608323,"description":"Emily Jordan Osment (born March 10, 1992)[3] is an American teen actress and singer-songwriter. After working in several television films in her childhood, Osment gained fame for co-starring as Gerti Giggles in Spy Kids 2: Island of Lost Dreams and Spy Kids 3-D: Game Over which earned her several nominations and awards. Osment went on to co-star in the Emmy Award-nominated[4] Disney Channel sitcom Hannah Montana as Lilly Truscott as well as the series movie, Hannah Montana: The Movie.[5] She also starred as Cassie in R. L. Stine's: The Haunting Hour Volume One: Don't Think About It and most recently the Disney Channel Original Movie, Dadnapped as Melissa Morris.\n\nOsment expanded her repertoire into pop music and more recently alternative/indie rock where she has recorded teen pop hits like &quot;I Don't Think About It,&quot; &quot;If I Didn't Have You&quot; alongside her Hannah Montana co-star Mitchel Musso, and most recently &quot;Once Upon a Dream.&quot;\n\nShe is recording her debut album, which features several songs written by her,[6] due for release in June 2010,[7] on Wind-up Records[8] where she recently signed. Emily collaborated on the album with Tom Higgenson of the Plain White T's and Eve 6's Max Collins &amp; Tony Fagenson. The first single from the album, &quot;All the Way Up,&quot; premiered on Radio Disney on August 14, 2009\n\n--------------------------------------------------\n\nAll the Right Wrongs is the debut EP by American singer-songwriter Emily Osment. The extended play album was released on October 26, 2009, by Wind-up Records.[3] The EP debuted at number 117 on the Billboard 200, and at number one on the Heatseekers Album chart for the chart issue of November 17, 2009. [4] The album's lead single is the indie rock song &quot;All the Way Up&quot;, which managed to enter several international singles charts such as the Canadian Hot 100 where it peaked at number 76. Osment co-wrote all of the songs in the EP. Osment toured the United States two times in her &quot;Halloween Bash&quot; and &quot;Clap your Hands&quot; tours, which were both set in House of Blues-arenas.\n\nTrack Listing:\n\n1. \t&quot;All The Way Up&quot;   Anthony Fagenson, James Maxwell Collins \t3:12\n2. \t&quot;Average Girl&quot;   \tThomas Higgenson \t3:27\n3. \t&quot;Found Out About You&quot;   \tMattew Bair, Tim Pagnotta \t3:25\n4. \t&quot;I Hate the Homecoming Queen&quot;   \tFagenson, Collins \t2:48\n5. \t&quot;You Are the Only One&quot;   \tFagenson, Collins \t2:57\n6. \t&quot;What About Me&quot;   \tBair \t3:42\n\n320kbps","torrent":{"xt":"urn:btih:70c7afde3ccfd089435d32c83cbc95f7726ff7cc","amp;dn":"Emily+Osment+-+All+The+Right+Wrongs+EP+%5B2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70c7afde3ccfd089435d32c83cbc95f7726ff7cc","infoHashBuffer":{"type":"Buffer","data":[112,199,175,222,60,207,208,137,67,93,50,200,60,188,149,247,114,111,247,204]},"announce":[],"urlList":[]}}