{"title":"Classic.Albums.The.Who.Who's.Next.XviD.AC3.MVGroup.Forum.avi","uid":7096810,"size":940699648,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:70ce1e6d0ed35ac46aa802c738e97c04b70c2739&amp;dn=Classic.Albums.The.Who.Who%27s.Next.XviD.AC3.MVGroup.Forum.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":-1,"time":1331580784,"description":"Arts Documentary hosted by Pete Townshend and Roger Daltrey and John Entwistle, published by ISIS Productions in 1999 - English narration\n\n\nInformation\n------------------------------\n\nWho's Next is viewed by many as the greatest testament to the songwriting talent of Pete Townshend and the musical power of The Who. When the album was released in 1971 it climbed to the Number 1 spot on the British Album chart and remained in the Top 50 for over three months. In the United States, the album went to Top 5 on the Billboard chart and remained in the top 40 for five months.\n\nThe story of how The Who came to record the album is told by group members Pete Townshend, Roger Daltrey, and John Entwistle, together with contributions by those who were close to the group during the making of this classic album. Early archive footage of The Who performing classic tracks such as I Can't Explain and My Generation help to illustrate how the group made the transition from performing in small London clubs, to the rock giants they became upon the release of the pioneering Tommy Album.\n\nPete Townshend explains the difficulties the group faced in trying to bring to fruition the idea he planned for the group's follow up, the ground breaking &quot;rock-opera&quot; Tommy. The original idea, as Roger Daltrey tells us, was for a multimedia event that would incorporate a live concert, a film and a soundtrack album. When Townshend's version proved beyond the grasp of his fellow group members, The Who set about recording the songs that would have made up the soundtrack to the proposed movie.\n\nThe songs recorded for the Who's Next album and featured here include such classics as Won't Get Fooled Again, Baba O'Riley and Behind Blue Eyes. We hear from the group members how these songs would have fitted into the original concept. We are also given an insight as to the importance of the late great Keith Moon to the success of The Who, and hear how great his larger than life personality often overshadowed his musical contribution to the group.\n\nIncluded in this documentary programme are previously unseen performances of songs from the album that prove the longevity and lasting appeal of Who's Next, a true Classic Album.\n\n\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1626 kbps\nVideo Resolution: 720x544\nVideo Aspect Ratio: 1.324:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: english\nRunTime Per Part: 1:00:12\nNumber Of Parts: 1\nPart Size: 897 MB\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:70ce1e6d0ed35ac46aa802c738e97c04b70c2739","amp;dn":"Classic.Albums.The.Who.Who%27s.Next.XviD.AC3.MVGroup.Forum.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70ce1e6d0ed35ac46aa802c738e97c04b70c2739","infoHashBuffer":{"type":"Buffer","data":[112,206,30,109,14,211,90,196,106,168,2,199,56,233,124,4,183,12,39,57]},"announce":[],"urlList":[]}}