{"title":"Wall Street Raider v6.40.exe","uid":8833238,"size":3537966,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7175de09683cba575e0c4445784a5e43b4d60841&amp;dn=Wall+Street+Raider+v6.40.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"forthelulz0000","files":1,"time":1377043145,"description":"6.40 -- Released: July 1, 2012 (Minor release)\n\n    A new &quot;ethical scenario&quot; has been added (involving sale of untested vaccines to a Third World country), for biotech or pharmaceutical companies that a player controls.\n    A number of players of Wall Street Raider have requested that the program rules be modified so that they can buy out the stock of a corporate stockholder of XYZ Company when they do not control that stockholder, since the only way that was possible was either by a merger (not always feasible) or, if they already controlled XYZ Company, by having it do a &quot;greenmail&quot; buyback to buy out the (unwanted) stockholder. That was often not possible where XYZ Company's credit was too poor to do the buyback. Thus, it was often impossible to obtain 100% of the stock of XYZ Company, even if the player or his other companies had more than enough money or credit to do so, unless the player was able to get control of the unwanted shareholder and have it sell its stock to the player or one of the player's other controlled companies.\n\n    In this release, we have made it possible for a player or company to make a formal offer to buy out an unwanted corporate shareholder (but not stock owned by another player or owned by a company controlled by another player). Now, if you wish to buy out some or all of the stock of a shareholder of XYZ Company, you can select it as the seller, and can make a tender offer for some or all of its shares (incurring legal fees when you do so). Your offer must be at a price at least 10% above the current market price to be considered, or often much higher. Sometimes the unwanted stockholder will accept your offer, sometimes not. The higher your bid, the better your chances of having your offer accepted. (A bit of advice: make your first offer a good one, as the seller will often demand an even higher price if it rejected your first, &quot;lowball&quot; bid.)\n\n    The same procedure now also applies when doing a &quot;greenmail&quot; buyback of stock from an uncontrolled corporate stockholder of XYZ Company. Previously, you could do so at a flat 25% premium over the market price of the XYZ stock. Now you must make an offer that is least 10% over the market price and wait to see if it is accepted or not. As before, you cannot do a greenmail buyback of stock from a shareholder you control (conflict of interest!) or from another player or from a corporate stockholder that is controlled by another player. (You can't make another player sell his or her stock, in short.)\n    Several refinements have been made to the algorithms that sometimes prevent you from buying stock in an industry that you would dominate or monopolize if you controlled that company. In prior versions, you would be blocked from buying ANY stock in such a company, even if your intended purchase would not give you control of it. As revised, you are now allowed to buy stock in such a competitor, as long as the purchase does not give you control of it. Also, in some cases you may be warned that your companies will be saddled with antitrust lawsuits if you go ahead with a takeover, giving you a chance to cancel the acquisition, or go ahead and take the risk. In other cases, as before, a government antitrust agency will block your takeover.\n    Research Reports now tell you, for industrial companies, if the company and other companies affiliated with it (under common control by one player or by one company) have a combined market share of more than 25% in their industry. This will save you from having to do additional research to determine if a particular company may be a target for antitrust lawsuits, if you invest in it (or if you are looking for a company that is vulnerable on antitrust grounds, so that you can file suit against it).\n    In prior versions, if the program selected an antitrust &quot;target&quot; for a lawsuit, when 2 or more companies under common control dominated market share in an industry, it always targeted the company with the largest market share of the affiliated group of companies. Now, the largest company (by market share) will usually be the target of such suits, but occasionally one of the related companies will instead be selected as the defendant.\n    Various loopholes have been plugged. For example, a company may no longer buy back or call any of its bonds prior to maturity if it has a weak credit rating, if allowing it to do so would impair the assets available for the senior creditors, such as bank lenders or, in the case of banks or insurance companies, their depositors or insurance policyholders. Also, when a player loses control of a company that is spending at a very high rate on R&amp;D or marketing, or is growing at an extremely rapid rate, the company will now immediately cut back its spending rate and growth rate. This makes it more difficult for a player to establish settings, just before selling a stock, that will cause earnings (and the stock price) to soon drop precipitously, after which a player could buy back control once the stock is depressed and then lower those settings again, to instantly improve its profitability. That large loophole is now (mostly) closed.\n    The algorithms that calibrate the effects of contango (or backwardation) on commodity futures prices have been tweaked in various ways to make their effects more realistic and to better take into account the influence of interest rates, spot price levels (elevated or depressed), and price trends in the commodity, when determining the degree of contango or backwardation. The net effect is to (generally) create more volatility in the pricing of the longer-term futures contracts (which may be created for terms as long as five years).\n    Fixed minor bug that sometimes displayed the wrong date for the next earnings release on the main screen for the current &quot;Active Entity,&quot; an error that could occasionally occur when the end of a quarter coincided with the end of the player's turn.\n    This release is file-compatible with saved game files from prior versions 6.0 to 6.35, but not with versions prior to v. 6.0. (Note that files saved with a newer version cannot be used in an older version, so if you are playing with another person and by e-mailing the saved data file back and forth after you each take your turns, you must both be using the same registered version of Wall Street Raider.) Note also, however, that if a game saved by an older version like 6.21 or earlier is loaded, the ETF's will not be activated, as they will have been saved in the past as &quot;dormant&quot; holding companies. Thus, you will need to start a new game, if you want ETF's to be available to invest in. ","torrent":{"xt":"urn:btih:7175de09683cba575e0c4445784a5e43b4d60841","amp;dn":"Wall+Street+Raider+v6.40.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7175de09683cba575e0c4445784a5e43b4d60841","infoHashBuffer":{"type":"Buffer","data":[113,117,222,9,104,60,186,87,94,12,68,69,120,74,94,67,180,214,8,65]},"announce":[],"urlList":[]}}