{"title":"The Psilocybin Library Public Release","uid":6595811,"size":5197363477,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:71abf06e7e8865b2d81881d15b05dbf1ea6e4855&amp;dn=The+Psilocybin+Library+Public+Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"evolutioned","files":1729,"time":1313007982,"description":"The Psilocybin Library\n\nOver a period of 8 months I created this archive with the sole purpose of helping the mushroom grower community. The Psilocybin Library is a picture archive consisting of no less than 1700 pictures of mushroom growth in all stages and shapes, directed to help both the new grower as well as the more experienced in their journey towards success. \n\nThe archive is the first of its kind and my gift to the Shroomery forum as well as the Myco-tek forum and all of their members and affiliates and friends. When I first started out in this hobby I had no idea I would land here, at this stage where I would make my journey immortal through artistic photography as well as carefully depicting the process. I am proud to bring this to you today, as it marks the end of my own journey and my efforts to produce this. I am tired, yet very happy to be able to bestow upon you all this archive as I hope it will inspire and create love for the Fungi Kingdom. \n\nMy hands go out to each and every mushroom grower in hope that I have spread a spore that will make thousands and thousands more interested in growing mushrooms, if I can inspire even one of you to start a grow then I am more than happy and pleased to have completed this. \n\nMy name is Kdmmontana and I reside at Mycotek at this point and I will remain there, however I can be reached through my Shroomery.org account. Just type in my name and send me a PM if you wish to talk and I hope I can answer. \n\nI Sincerely thank you for your time and I will let you enjoy the fruits of my labour in peace. \n\nLove from Kdmmontana:) ","torrent":{"xt":"urn:btih:71abf06e7e8865b2d81881d15b05dbf1ea6e4855","amp;dn":"The+Psilocybin+Library+Public+Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71abf06e7e8865b2d81881d15b05dbf1ea6e4855","infoHashBuffer":{"type":"Buffer","data":[113,171,240,110,126,136,101,178,216,24,129,209,91,5,219,241,234,110,72,85]},"announce":[],"urlList":[]}}