{"title":"Charlie Parker - Bird: The Complete Charlie Parker on Verve 10CD","uid":12645597,"size":604809441,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:71db1bf5a16903743adce10e3ed4bd9148adf4d0&amp;dn=Charlie+Parker+-+Bird%3A+The+Complete+Charlie+Parker+on+Verve+10CD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"greenjey","files":204,"time":1446054122,"description":".:Bird:.\r\n.:The Complete Charlie Parker on Verve:.\r\n\r\n\r\n\r\nDati Album\r\n\r\n\r\n\r\n\r\nAnno:\r\n- Pubblicazione: 25 Ottobre 1990\r\n- Registrazione: 1945-1954\r\nGenere: Jazz\r\nFormato: Mp3 128 Kbps\r\nEtichetta: Verve\r\nDurata: 10:19:10\r\nDimensione: 576 Mb\r\nContenuti: Mp3 + Cover\r\n\r\n\r\n\r\n\r\nThe Artist\t\r\n\r\nENG\r\n\r\nCharles Parker, Jr. (August 29, 1920 – March 12, 1955), also known as &quot;Yardbird&quot; and &quot;Bird&quot;, was an American jazz saxophonist and composer.\r\n\r\nParker was a highly influential jazz soloist and a leading figure in the development of bebop, a form of jazz characterized by fast tempos, virtuosic technique and improvisation. Parker introduced revolutionary harmonic ideas including rapid passing chords, new variants of altered chords, and chord substitutions. His tone ranged from clean and penetrating to sweet and somber. Parker acquired the nickname &quot;Yardbird&quot; early in his career; this and its shortened form, &quot;Bird&quot;, which continued to be used for the rest of his life, inspired the titles of a number of Parker compositions, such as &quot;Yardbird Suite&quot;, &quot;Ornithology&quot;, &quot;Bird Gets the Worm&quot;, and &quot;Bird of Paradise&quot;. Parker was an icon for the hipster subculture and later the Beat Generation, personifying the jazz musician as an uncompromising artist and intellectual rather than just an entertainer.\r\n\r\nITA\r\nCharlie Parker Jr. (Charles &quot;Bird&quot; Parker, Jr.) (Kansas City, 29 agosto 1920 – New York, 12 marzo 1955) è stato un sassofonista e compositore statunitense di musica jazz, ricordato per essere stato uno dei padri fondatori del movimento musicale chiamato bebop, oltre che per la sua padronanza della tecnica sassofonistica.\r\n\r\nLa figura di Charlie Parker si identifica con la nascita, lo sviluppo e il declino del bebop (del quale fu - secondo alcuni - il padre vero e proprio). Virtuoso del proprio strumento, che suonava con una tecnica che pochi sono riusciti ad eguagliare, fu anche un personaggio dalla vita tormentata, segnata dalla dipendenza dalla droga e dall'alcol.\r\n\r\nParker finì per personificare, come pochi altri musicisti (Dizzy Gillespie, Thelonious Monk, Bud Powell), il meglio e, troppo spesso, il peggio di uno stile di vita che echeggiò al di fuori del campo strettamente musicale, ispirando i poeti della Beat Generation, nelle cui liriche il jazz e Parker stesso sono spesso citati.\r\nby Wikipedia\r\n\r\nBird: The Complete Charlie Parker on Verve is a 1990 box set by jazz musician Charlie Parker. It features every extant note Parker recorded for the Verve label as well as his appearances at Jazz at the Philharmonic. Parker recorded for Verve primarily in the last five years of his life, a period during which, besides playing with his famous quintet, he experimented with strings, Afro-Cuban jazz and mixed chorus. Among the albums produced during Parker’s Verve years were Bird &amp; Diz, Charlie Parker with Strings, and Swedish Schnapps.\r\n\r\nITA\r\n\r\nBird: The Complete Charlie Parker on Verve è un cofanetto box set del musicista jazz Charlie Parker, pubblicato dalla Verve Records nel 1990.\r\n\r\nIl cofanetto include tutte le incisioni effettuate da Parker per l'etichetta Verve e anche le sue esibizioni durante il Jazz at the Philharmonic. Charlie Parker registrò per la Verve principalmente negli ultimi cinque anni di vita, periodo durante il quale, oltre che a suonare con il suo celebre quintetto, sperimentò nuove vie musicali registrando con grandi orchestre d'archi, e musiche Afro-Cubane. Tra gli album pubblicati da Parker su etichetta Verve abbiamo Bird &amp; Diz, Charlie Parker with Strings, e Swedish Schnapps","torrent":{"xt":"urn:btih:71db1bf5a16903743adce10e3ed4bd9148adf4d0","amp;dn":"Charlie+Parker+-+Bird%3A+The+Complete+Charlie+Parker+on+Verve+10CD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71db1bf5a16903743adce10e3ed4bd9148adf4d0","infoHashBuffer":{"type":"Buffer","data":[113,219,27,245,161,105,3,116,58,220,225,14,62,212,189,145,72,173,244,208]},"announce":[],"urlList":[]}}