{"title":"Computed Radiation Imaging","uid":6499574,"size":3499896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72132c2835c31ba18d96d81c29066c6cddaf357b&amp;dn=Computed+Radiation+Imaging&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1309199432,"description":"Esam M A Hussein, &quot;Computed Radiation Imaging: Physics and Mathematics of Forward and Inverse Problems&quot;\nEl..vier | 2011 | ISBN: 0123877776 | 302 pages | PDF | 3.34 MB\n\nComputer-assisted imaging with radiation (x- and gamma rays) is an integral part of modern medical-diagnostic practice. This imaging technology is also slowly finding its way into industrial applications. Although the technology is well developed, there is a need for further improvement to enhance image quality, reduce artifacts, minimize patient radiation exposure, compete with and complement other imaging methods (such as magnetic resonance imaging and ultrasonics), and accommodate dense and large objects encountered in industrial applications.\n\nScientists and engineers, attempting to progress this technology, are faced with an enormous amount of literature, addressing the imaging problem from various view points. This book provides a single source that addresses both the physical and mathematical aspects of the imaging problem in a consistent and comprehensive manner.\n\nDiscusses the inherent physical and numerical capabilities and limitations of the methods presented for both the forward and inverse problems\n\nProvides information on available Internet resources and software\n\nWritten in a manner that makes it readable by physicists, mathematicians, engineers and computer scientists - avoids, as much as possible, the use of specialized terminology without clear introduction and definition","torrent":{"xt":"urn:btih:72132c2835c31ba18d96d81c29066c6cddaf357b","amp;dn":"Computed+Radiation+Imaging","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72132c2835c31ba18d96d81c29066c6cddaf357b","infoHashBuffer":{"type":"Buffer","data":[114,19,44,40,53,195,27,161,141,150,216,28,41,6,108,108,221,175,53,123]},"announce":[],"urlList":[]}}