{"title":"Pocket Companion to Robbins &amp; Cotran Pathologic Basis of Dis","uid":9897713,"size":11684074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:721655fa312358a346d563423e065d6b6e9a5a1d&amp;dn=Pocket+Companion+to+Robbins+%26amp%3B+Cotran+Pathologic+Basis+of+Dis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":-1,"time":1396732739,"description":"Author: Richard Mitchell, Vinay Kumar , Nelson Fausto , Abul K. Abbas , Jon Aster \nPaperback: 800 pages\nPublisher: Saunders; 8th edition (March 8, 2011)\nLanguage: English\nISBN-10: 1416054545\nISBN-13: 978-1416054542\nFormat: Retail Epub and mobi\nReader Required: \nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle App, Calibre, MoonReader for Android\n\nNOTE: no PDF available. If you want the book to scroll like a PDF, use the mobi file in Kindle or either in Calibre\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\n\nThis Pocket Companion to Robbins and Cotran Pathologic Basis of Disease, 8th Edition offers rapid, portable access to the most important pathology facts and concepts. Richard Mitchell, MD, PhD, Vinay Kumar, MBBS, MD, FRCPath, Nelson Fausto, MD, Abul K. Abbas, MBBS, and Jon Aster, MD assemble all of the key data and principles of pathology in a concise, at-a-glance format and fit them into your pocket for quick reference anytime. The result is a superb source for quick answers and an efficient review tool on any aspect of pathology.\n\n* Assembles all of the key data and principles you need to know for exams and rotations.\n* Presents information in a concise, at-a-glance format.\n* Fits into your pocket, for a convenient reference any time.\n* Offers abundant page references to the parent text, making additional information easy to find.\n* Completely updated to reflect the latest knowledge and techniques across all areas of pathology.\n\nThis pocket-sized resource offers rapid, portable access to the most important facts and concepts from Robbins and Cotran Pathologic Basis of Disease, 8th Edition","torrent":{"xt":"urn:btih:721655fa312358a346d563423e065d6b6e9a5a1d","amp;dn":"Pocket+Companion+to+Robbins+%26amp%3B+Cotran+Pathologic+Basis+of+Dis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"721655fa312358a346d563423e065d6b6e9a5a1d","infoHashBuffer":{"type":"Buffer","data":[114,22,85,250,49,35,88,163,70,213,99,66,62,6,93,107,110,154,90,29]},"announce":[],"urlList":[]}}