{"title":"Textual Criticism: Fact and Fiction - Dr. Thomas Cassidy","uid":11773427,"size":1061569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:726dbfee94a6fd2faffb9a943160d53907531b49&amp;dn=Textual+Criticism%3A+Fact+and+Fiction+-+Dr.+Thomas+Cassidy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427167527,"description":"\nTextual Criticism Fact and Fiction - a fresh look at Bible Inspiration Preservation And Translation\n\nWhy another book about the controversy surrounding the Inspiration of the Bible, it's Preservation, and it's Translation? There has been much discussion in recent years, much of it of such a mean spirited nature that much more heat then light has been thrown on the very important subject of our Bible. However, all of the discussion has done very little to answer the questions most often asked by the average Christian in the pew on Sunday morning: Is my Bible inspired? Is it without error? Can I have full assurance in my Bible as the Word of God, or do only the &quot;Scholars&quot; know for sure what really is the Word of God, and what isn't? Hopefully and prayerfully this book will help shed a little light on the subject.\n\n\nAbout the author:\nThomas Cassidy was born in Altadena, California but brought up in the Midwest. Following high school, he served in the military until 1972. Two years later, in 1974, he was saved through the ministry of First Baptist Church in Rockford, Illinois. God called him to the gospel ministry shortly after and he moved to Minneapolis, Minnesota to attend Central Seminary from 1975-1978.\n\nIn February of 1976, while in seminary, Tom married Bonnie Hanson. In 1978, they returned to Rockford, Illinois, and served with the Windsor Baptist Church in Loves Park until the late 1980?s when they relocated to California. They ministered at the Fundamental Baptist Church in Escondido (San Diego?s north county area) until Tom was called to pastor First Baptist Church of Spring Valley in September of 1985.\n\nTom and Bonnie have purchased a home in the beautiful Rio Grande Valley of South Texas where they intend to thoroughly enjoy their retirement years","torrent":{"xt":"urn:btih:726dbfee94a6fd2faffb9a943160d53907531b49","amp;dn":"Textual+Criticism%3A+Fact+and+Fiction+-+Dr.+Thomas+Cassidy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"726dbfee94a6fd2faffb9a943160d53907531b49","infoHashBuffer":{"type":"Buffer","data":[114,109,191,238,148,166,253,47,175,251,154,148,49,96,213,57,7,83,27,73]},"announce":[],"urlList":[]}}