{"title":"Black.Anal.Beauties.XXX.DVDRip.XviD-Jiggly","uid":6170071,"size":1461512192,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7289d78a8d589492231ab0cbd68ecc32490cbabf&amp;dn=Black.Anal.Beauties.XXX.DVDRip.XviD-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kelvin09","files":2,"time":1297534306,"description":"\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/4312_1.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/4312_1.jpg.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/4311_2.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/4311_2.jpg.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.seedimage.com/show.php/4310_3.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.seedimage.com/show.php/4310_3.jpg.html&lt;/a&gt;\n\n\n\nEvanni Solei, Nyomi Banxxx, Mike Adriano, Megan Vaughn , Imani Rose.\n\n\nIn Mike Adriano's Black Anal Beauties, four gorgeous, black sistas go one-on-one with the ass-obsessed king of &quot;POV+,&quot; indulging in deep, intimate anal worship, face-fucking and ass-to-mouth fun. This DVD, released on the Buttman Magazine Choice imprint, explores a special brand of WM/BF interracial porn we don't see enough of! Petite, 18-year-old stunner Megan Vaughn is eager to please, and she repeatedly declares her love for all forms of anal play before gagging and drooling on Mike's big white cock. He slides four fingers deep inside Megan's dark bunghole, following it with his prick, and lets her experience the flavor of her own ass by sucking his dick again. Megan's ass is smeared with baby oil and her throat fucked before she's fed a thick load of the director's cum; she swallows it all. Sophisticated slut Imani Rose is a shorthaired cutie with an all-natural body and some serious sexual skills. In her first-ever interracial scene, Imani gives Mike a messy, salivating blowjob and gets her big, round &quot;honey muffin&quot; greased up, drilled by Mike's sizable dick and splattered with his semen. Evanni Solei is a super-fine teenager with a slender, petite frame that includes a respectable pair of natural boobs and a perfect, cushiony ass. She gets it invaded with a rubber toy, pushes it out with her talented sphincter, then takes Mike's cock in her ass and mouth, and even jacks his shaft between her fine tits. Evanni's oily buttocks receive a hot spray of jizz for all her hard work. And big-assed starlet Nyomi Banxxx gets her big, round rack worshiped and her black browneye expanded in a scene that includes more oily visuals, ass-to-mouth flavor, throat-gagging blowjobbery and tit-fucking. Interracial ass play will unite the world!","torrent":{"xt":"urn:btih:7289d78a8d589492231ab0cbd68ecc32490cbabf","amp;dn":"Black.Anal.Beauties.XXX.DVDRip.XviD-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7289d78a8d589492231ab0cbd68ecc32490cbabf","infoHashBuffer":{"type":"Buffer","data":[114,137,215,138,141,88,148,146,35,26,176,203,214,142,204,50,73,12,186,191]},"announce":[],"urlList":[]}}