{"title":"116 Social Science Springer Books - Guerrilla Open Access","uid":8638705,"size":438990806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:733d4730feffded977c3078723ebd08d8f1c0e4a&amp;dn=116+Social+Science+Springer+Books+-+Guerrilla+Open+Access&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"senseinai","files":118,"time":1372820740,"description":"#################################################################################\n#\tTorrent File: \t\t\t\t\t\t\t\t#\n# \t116 Social Science Springer Books [Guerrilla Open Access]\t\t#\n#\thttp://openaccessmanifesto.org/guerilla-open-access-manifesto/\t\t#\n#\t14K md5sum.txt\t\t\t\t\t\t\t\t#\n#\ttotal 418M\t\t\t\t\t\t\t\t#\n#################################################################################\n#\t\t\t\tSize|Author|Title\t\t\t\t#\n#################################################################################\n 1.1M Abbott L. Ferriss - Approaches to Improving the Quality of Life.pdf\n 5.4M Alex Conte - Human Rights in the Prevention and Punishment of Terrorism.pdf\n  12M Alex R. Piquero, David Weisburd - Handbook of Quantitative Criminology.pdf\n 2.1M Alicia R. Crowe - Advancing Social Studies Education through Self-Study Methodology.pdf\n 5.4M Amber M. VanDerwarker, Tanya M. Peres - Integrating Zooarchaeology and Paleoethnobotany.pdf\n 1.3M Andrei Rogers, James Raymer, Jani Little - The Indirect Estimation of Migration.pdf\n 5.9M Annalies Corbin, Matthew Russell - Historical Archeology of Tourism in Yellowstone National Park.pdf\n 2.6M Anna Spiegel - Contested Public Spheres.pdf\n 1.9M Bahira Trask - Globalization and Families.pdf\n 2.9M Bas van Vliet, Gert Spaargaren, Peter Oosterveer - Social Perspectives on the Sanitation Challenge.pdf\n1014K Beatrice Hale, Patrick Barrett, Robin Gauld - The Age of Supported Independence.pdf\n 2.4M Benjamin Gidron, Michal Bar - Policy Initiatives Towards the Third Sector in International Perspective.pdf\n 6.4M Berenike Jung - Narrating Violence in Post-9_11 Action Cinema.pdf\n 1.3M Bert Klandermans, Conny Roggeband - Handbook of Social Movements Across Disciplines.pdf\n 9.5M Bin Jiang, Xiaobai Yao - Geospatial Analysis and Modelling of Urban Structure and Dynamics.pdf\n 2.5M Kai-Uwe Schrogl, Wolfgang Rathgeber, Blandina Baranes, Christophe Venet - Yearbook on Space Policy 2008_2009.pdf\n.\n.\n.\n.\n.\n.\n.\n 1.6M Rainer Thiel - Nested Games of External Democracy Promotion.pdf\n 5.2M Rais Akhtar, Ashok K. Dutt, Vandana Wadhwa - Malaria in South Asia.pdf\n 1.3M Reinhard Slepcevic - Litigating for the Environment.pdf\n 1.9M Richard Joyce, Simon Kirchin - A World Without Values.pdf\n 1.3M Roger Pielke, Roberta A. Klein - Presidential Science Advisors.pdf\n 2.0M Roland Berger, David Grusky, Tobias Raffel, Geoffrey Samuels, Chris Wimer - The Inequality Puzzle.pdf\n 1.9M Ronald A. Francisco - Collective Action Theory and Empirical Evidence.pdf\n 1.3M Ronald E. Hall - An Historical Analysis of Skin Color Discrimination in America.pdf\n 2.4M Ruiping Fan - Reconstructionist Confucianism.pdf\n 2.4M Rupert Taylor - Third Sector Research.pdf\n 1.4M Russell DiSilvestro - Human Capacities and Moral Status.pdf\n 1.9M Sabine Andresen, Isabell Diehm, Uwe Sander, Holger Ziegler - Children and the Good Life.pdf\n 2.0M Sabine Roeser - Emotions and Risky Technologies.pdf\n 2.9M Serge Gutwirth, Yves Poullet, Paul De Hert - Data Protection in a Profiled World.pdf\n 4.7M Sheila B. Kamerman, Shelley Phipps, Asher Ben-Arieh - From Child Welfare to Child Well-Being.pdf\n 7.4M Sherene Baugher, Suzanne M. Spencer-Wood - Archaeology and Preservation of Gendered Landscapes.pdf\n 5.4M Shripad Tuljapurkar, Naohiro Ogawa, Anne H. Gauthier - Ageing in Advanced Industrial States.pdf\n 1.6M Stan van Hooft, Wim Vandekerckhove - Questioning Cosmopolitanism.pdf\n 7.6M Stephen Lycett, Parth Chauhan - New Perspectives on Old Stones.pdf\n 5.3M Steven Hitlin, Stephen Vaisey - Handbook of the Sociology of Morality.pdf\n 4.6M T. Douglas Price, Gary M. Feinman - Pathways to Power.pdf\n 8.6M Terence Lovat, Ron Toomey, Neville Clement - International Research Handbook on Values Education and Student Wellbeing.pdf\n 3.8M Thomas Salzmann, Barry Edmonston, James Raymer - Demographic Aspects of Migration.pdf\n 1.4M Tjip de jong - Linking Social Capital to Knowledge Productivity.pdf\n 1.2M Tommy Bengtsson - Population Ageing - A Threat to the Welfare State_.pdf\n  12M Vittorio Capecchi, Massimo Buscema, Pierluigi Contucci, Bruno D_Amore - Applications of Mathematics in Models, Artificial Neural Networks and Arts.pdf\n 3.7M William R. Avison, Carol S. Aneshensel, Scott Schieman, Blair Wheaton - Advances in the Conceptualization of the Stress Process.pdf\n 5.0M Yupo Chan - Location Theory and Decision Analysis.pdf\n\n &lt;a href=&quot;\nhttps://pastee.org/83sm4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pastee.org/83sm4&lt;/a&gt;","torrent":{"xt":"urn:btih:733d4730feffded977c3078723ebd08d8f1c0e4a","amp;dn":"116+Social+Science+Springer+Books+-+Guerrilla+Open+Access","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733d4730feffded977c3078723ebd08d8f1c0e4a","infoHashBuffer":{"type":"Buffer","data":[115,61,71,48,254,255,222,217,119,195,7,135,35,235,208,141,143,28,14,74]},"announce":[],"urlList":[]}}