{"title":"(1986) Megadeth - Peace Sells.. But Who's Buying? (320+Cover)","uid":5637872,"size":87316335,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74650804bf7ffd26abdf057d37ae833664b9991e&amp;dn=%281986%29+Megadeth+-+Peace+Sells..+But+Who%5C%27s+Buying%3F+%28320%2BCover%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"David_PL99","files":10,"time":1276960861,"description":"Peace Sells... But Who's Buying? is the second studio album by American thrash metal band Megadeth, released in 1986. Originally, the project was handled by Combat Records, and this resulted in the first mix of the album. Eventually Capitol Records bought the rights to the album and a producer was hired to mix it himself. It was remixed and remastered in 2004 by Dave Mustaine.\nContents\n\nProfessional rock critic Steve Huey noted the album's combination of &quot;punkish political awareness with a dark, threatening, typically heavy metal worldview.&quot; For instance, the album's cover makes an ironic statement about the Cold War. On the backdrop of a red and orange sky, it shows the United Nations headquarters soon after a nuclear attack. In the foreground is the band's mascot, Vic Rattlehead, who is leaning against a sign reading &quot;For Sale&quot; (&quot;Vic Realtors&quot; appearing on the bottom of the sign in some copies), implying that the United Nations is for sale. The cover and the title suggest that while peace is a popular theme, it has become commodified. These themes carry into the title track, with its strong themes of youth disillusionment. Dave Mustaine lifted the title from a Reader's Digest article, which was titled, &quot;Peace Would Sell But No One Would Buy It&quot;.\n\n&quot;As long as people keep stealing, hurting and mistreating people, there's always going to be something that you can pick up on and say, 'Look, this is wrong.' Granted, we sing about it, but we take a negative approach to what we do sing about. 'Hey the devil is there, but he's a moron. That's why he's buried in dirt'.&quot; (Mustaine, 1987)\n\nThe recording of the album was very difficult for the band, as guitarist Chris Poland and drummer Gar Samuelson wouldn't show up for hours because of their extreme heroin addictions. Shortly after the band finished the final recordings of the album for the independant label Combat, they were approached by an A&amp;R person Tim Carr of Capitol Records. After securing the contract, the label hired producer Paul Lani to remix the original mixes done by Randy Burns, the previous producer.\n\n&quot;There was even a time when we were considered black metal! When people heard &quot;Black Friday&quot; and &quot;Bad Omen&quot;, they thought we were satanic. The worst thing is, like, going to a truck stop in Des Moines, Iowa, and having someone go [imitates Southern redneck voice], 'You guys in Megadeth? I heard you are satanic.' They expect us to have dead goats and babies in our buses. You couldn't get any further from the truth!&quot; (Mustaine, 1997)\n\nAccording to &quot;National Album Positioning Charts,&quot; Peace Sells...But Who's Buying? sold 2,372,458 albums in United States, achieving double platinum status in just the United States alone.[citation needed]\n\nThis is one of the early albums to contain a Parental Advisory label, developed by the Parents Music Resource Center, an organization made to censor music that was deemed &quot;inappropriate&quot;. On the 1986 Capitol Records pressing on vinyl record, it says on the back of the sleeve, &quot;Explicit Lyrics - Parental Advisory&quot;.\n\n\n\nArtist: Megadeth\nAlbum: Peace Sells... but Who's Buying?\nSource: CD\nGenre: Thrash metal, speed metal\nYear: 1986\nBitrate: 320 kbit/s [Stereo]\nQuality: Very High [mp3]\nAlbum Gain: -\nCovers: Yes\nSize: 83,2 MB\n\n\n\nTrack listing:\n\n\n   1. &quot;Wake Up Dead&quot; - 3:41\n   2. &quot;The Conjuring&quot; - 5:04\n   3. &quot;Peace Sells&quot; - 4:04\n   4. &quot;Devil's Island&quot; - 5:06\n   5. &quot;Good Mourning/Black Friday&quot; - 6:42\n   6. &quot;Bad Omen&quot; - 4:05\n   7. &quot;I Ain't Superstitious&quot; - 2:46\n   8. &quot;My Last Words&quot; - 4:48\n\n\n\n\nEnjoy! And please SEED! :)\n\nIf You like this torrent, please rate and comment! :)","torrent":{"xt":"urn:btih:74650804bf7ffd26abdf057d37ae833664b9991e","amp;dn":"%281986%29+Megadeth+-+Peace+Sells..+But+Who%5C%27s+Buying%3F+%28320%2BCover%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74650804bf7ffd26abdf057d37ae833664b9991e","infoHashBuffer":{"type":"Buffer","data":[116,101,8,4,191,127,253,38,171,223,5,125,55,174,131,54,100,185,153,30]},"announce":[],"urlList":[]}}