{"title":"The Velvet Underground - Caught Between the Twisted Stars (Bootl","uid":3837165,"size":1919797687,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:746bc79b1006db3f17d07125d01951fa5d852b22&amp;dn=The+Velvet+Underground+-+Caught+Between+the+Twisted+Stars+%28Bootl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"poly_mn","files":73,"time":1192047154,"description":"The Velvet Underground, Caught Between the Twisted Stars (Bootleg Boxset)\n=========================================================================\n\n&gt;   The package is a CD size cardboard one, with 4 individual CD sleeves inside, each made to look like a 45 RPM singles picture sleeve. There is a photo of the Trip Club poster, Poor Richard&amp;#039;s poster, Balloon Farm poster, and a few photos of the band and a photo of Andy Warhol peeling a large banana on the back cover. The 64-page booklet includes a Sterling Morrison interview with Greg Barrios, a review of VU &amp; Nico album by Timothy Jacobs from Vibrations No. 2, July, 1967, Chicago Happenings by Larry McCombes from Zig Zag, Vol. 5, No. 1, April/May, 1974, New York Art And The Velvet Underground by Jonathan Richman from Vibrations, September 1967, A Quiet Night at the Balloon Farm by Richard Goldstein, Problems in Urban Living by Richard Somma, and another interview with Sterling, Reflections In A Lone Star Beer. This set is supposedly a limited edition of 500 copies. **some guy from the internet**\n\n&gt;   A magnificent CD compilation of the most legendary (and deservedly so) of all Velvet Underground bootleg material, Caught Between the Twisted Stars is a four-disc collection drawn from throughout the original band&amp;#039;s career (plus the 1993 reunion), lavishly packaged, beautifully annotated by an epic 64 page booklet, packed with interviews and press reports, and just about all the live VU you could possibly need. From 1966, the legendary showing at Chicago&amp;#039;s ~Poor Richard&amp;#039;s, where John Cale took lead vocals from an unwell Lou Reed for &quot;Heroin&quot; and &quot;Venus in Furs,&quot; appears in best ever sound. From 1968, the mystery-draped &quot;Sweet Sister Ray&quot; transforms the band&amp;#039;s best-known soundscape into a &quot;Pale Blue Eyes&quot;-esque ballad; from 1969, the truly infamous and utterly devastating &quot;guitar amp&quot; version of &quot;Sister Ray&quot; explodes with such vivacity that even if you know it by heart, it&amp;#039;ll still take you by surprise. The performance was taped, apparently, with the recording equipment connected straight to Lou Reed&amp;#039;s guitar monitor, rendering band and vocals a ghost in the distance while unimagined chords, riffs, and solos slice the top off your skull. Elsewhere, &quot;A Short Lived Torture of Cacophony,&quot; from a New York performance in 1965, turns out to be a gripping rendition of the pre-Velvets Reed composition &quot;Fever in My Pocket,&quot; while a pair of performances from Reed, John Cale, and Nico&amp;#039;s 1972 reunion at the Paris ~Bataclan, have a sparse, acoustic charm which stands in absolute polarity to everything else on the box. Occasionally across the four discs, the sound quality lets you down a little -- &quot;Chic Mystique,&quot; a rare jam from early 1966, is essentially hiss and drum beat with dissonant ambience somewhere in the distance, while the oft-praised &quot;Venus Heroin&quot; medley is scarcely even discernible. So, not everything in the collection bears repeated listens, although it&amp;#039;s interesting that the flattest moments actually come from the 1993 reunion -- and are, as such, the most hi-fi things in sight. Whether the original Velvets rehearsed regularly or not, in concert their every movement appeared to be a step into the absolute unknown. Reformed, there was no room for any kind of unexpected maneuver, and so they recite &quot;The Gift&quot; with weary familiarity, or plod through &quot;Hey Mr Rain&quot; like they left their umbrellas at home. Musically, it&amp;#039;s exemplary. Spiritually, it&amp;#039;s crushing. Such lowlights, however, are the exception. Regardless of quality, the performances from 1966-1970 (and 1972) not only capture some scintillating highs, they represent a band going hell-for-leather toward a level of artistic accomplishment which even they were only partially aware of -- and whose actual significance would not be realized for years to come. A murderous mystery indeed. **Dave Thompson, All Music Guide**\n\nThe FLAC files are tagged with as much information as possible. If you&amp;#039;re converting to another format your best bet is probably gonna be to burn 4 CDs from these here FLAC files and then let CDDB do the tagging for you.\n\nFingerprints, checksums, packaging images (front, back &amp; inside), album covers (front &amp; back) and cd images included (all images in both 72dpiRGB.png &amp; 300dpiCMYK.tif).\n\nDisc 1: Exploding Plastic Inevitable b/w Poor Richard&amp;#039;s\n-------------------------------------------------------\n1.  Melody Laughter\n2.  Femme Fatale\n3.  Venus in Furs\n4.  Black Angels Death Song\n5.  All Tomorrow&amp;#039;s Parties\n6.  Waiting for the Man\n7.  Heroin\n8.  Run Run Run\n9.  Poor Richard&amp;#039;s\n    \n    *   1-8: November 4, 1966 - Valleydale Ballroom, Columbus, Ohio\n    *   9: June 23, 1966 - Poor Richard&amp;#039;s Club, Chicago, Illinois. This track is actually Heroin and Venus In Furs from Ronald Nameth&amp;#039;s &amp; Andy Warhol&amp;#039;s EPI film and ends with 1:17 of an unidentified Sister Ray.\n\nDisc 2: The Chic Mystique of Nothing Songs\n------------------------------------------\n1.  Nothing Song\n2.  Venus Heroin\n3.  Chic Mystique\n4.  Train &amp;#039;Round the Bend/Oh! Sweet Nuthin&amp;#039;\n\n    *   1: November 4, 1966 - Valleydale Ballroom, Columbus, Ohio\n    *   2: February 7, 1966 - USA Artists, WNET TV, New York City, New York\n    *   3: January 8, 1966 - Delmonico&amp;#039;s Hotel, New York City, New York\n    *   4: May 1970 - Second Fret, Philadelphia, Pennsylvania. This track ends with a 2:20 instrumental - same source as the hidden track on Ostrich/Hilltop CD but longer excerpt.\n\nDisc 3: Sweet Sister Rayn&amp;#039;s Heroin\n----------------------------------\n1.  Sweet Sister Ray\n2.  Sister Ray\n3.  Hey Mr. Rain\n4.  Heroin\n\n    *   1,4: April 30, 1968 - La Cave, Cleveland, Ohio\n    *   2: March 15, 1969 - The Boston Tea Party, Boston, Massachusetts\n    *   3: June 6, 1993 - Wembley Arena, London, England\n\nDisc 4: Illuminations of Atonality\n----------------------------------\n1.  Searchin&amp;#039; &quot;Swan mix&quot;\n2.  Lady Godiva&amp;#039;s Operation &quot;mono mix&quot;\n3.  The Gift\n4.  Run Run Run\n5.  What Goes On\n6.  Guess I&amp;#039;m Falling in Love\n7.  A Short Lived Torture of Cacophony\n8.  Black Angels Death Song\n9.  The Biggest, Loudest, Hairiest Group of All\n10. A Distant Mirror\n\n    *   1,2: September 1967 - Mayfair Recording Studio, New York City, New York\n    *   3: June 6, 1993 - Wembley Arena, London, England\n    *   4: August 2, 1969 - Hilltop Rock Festival, Ringe, New Hampshire\n    *   5: listed as &quot;1968 live&quot; - this is really the same version as 1969 Live album\n    *   6: April 1967 - Gymnasium, New York City, New York\n    *   7: listed as &quot;New York City 1965&quot;, actually a part of Columbus &amp;#039;66 Melody Laughter recorded backwards\n    *   8,9: January 29, 1972 - Bataclan Club, Paris, France\n    *   10: the VU Rock &amp; Roll Hall of fame introduction by Patti Smith, the band accepting the award, the band playing Last Night I Said Goodbye To A Friend, then Ghost Story from the Bataclan show, then 53 seconds of I&amp;#039;m Waiting For The Man from Max&amp;#039;s Kansas City &amp;#039;70","torrent":{"xt":"urn:btih:746bc79b1006db3f17d07125d01951fa5d852b22","amp;dn":"The+Velvet+Underground+-+Caught+Between+the+Twisted+Stars+%28Bootl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746bc79b1006db3f17d07125d01951fa5d852b22","infoHashBuffer":{"type":"Buffer","data":[116,107,199,155,16,6,219,63,23,208,113,37,208,25,81,250,93,133,43,34]},"announce":[],"urlList":[]}}