{"title":"Hot Water Music - Ultimate Discography (1996-2012) [FLAC]","uid":8006884,"size":3473921813,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:75270fee1d936788b706c70a783ca1fb39b65c8e&amp;dn=Hot+Water+Music+-+Ultimate+Discography+%281996-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1357910752,"description":"\n  Hot Water Music - Ultimate Discography (1996-2012) [FLAC]\n\n  Albums:\n\n  1996 - Finding the Rhythms\n  1997 - Forever and Counting\n  1998 - Fuel for the Hate Game\n  1999 - No Division\n  2001 - A Flight and A Crash\n  2002 - Caution\n  2004 - The New What Next\n  2012 - Exister\n  \n  EP's\n \n  1999 - Moonpies for Misfits\n  2002 - Alkaline Trio / Hot Water Music Split\n \n  Compilations \n\n  2004 - Never Ender\n  2008 - Till the Wheels Fall Off\n  \n  Live\n\n  1999 - Live at the Hardback\n  \n\n  The Gainesville, Florida-based post-hardcore quartet Hot Water Music were formed in 1994 by bassist Jason Black, drummer George Rebelo, and singer/guitarists Chuck Ragan and Chris Wollard. Debuting in 1995 with the 7&quot; &quot;Eating the Filler,&quot; they soon returned with the EP Push for Coin, rounding out the year with the release of their first full-length effort, Finding the Rhythms, on No Idea. Fuel for the Hate Game followed in 1996, but in the wake of their third album, Forever and Counting, Hot Water Music disbanded. The group soon re-formed, however, with a series of split singles as well as a new 7&quot; single, &quot;Alachua,&quot; spread across 1998. The following year saw the release of a new studio album, No Division, as well as the Live at the Hardback set and the Moonpies for Misfits EP. \n \n  Flight and a Crash marked the band's first release for Epitaph and of the new millennium, soon followed by 2002's Caution. The roundup compilation Never Ender appeared in early 2004, and The New What Next followed that fall. Hot Water Music took an extended break in spring 2005, allowing Ragan to devote his time to life outside of the band. Meanwhile, the remaining bandmates went on to form the Draft with Todd Rockhill, and subsequent nationwide touring followed. A formal announcement appeared in May 2006 that HWM had officially called it quits, and the Draft continued full-time as Ragan began to issue solo acoustic material. The split didn't last long, however; Hot Water Music announced their reunion in late 2007 and embarked on a tour the following year, while No Idea issued the rarities collection Till the Wheels Fall Off that January. Exister, their first album of new material since 2004, arrived on Rise Records in 2012.","torrent":{"xt":"urn:btih:75270fee1d936788b706c70a783ca1fb39b65c8e","amp;dn":"Hot+Water+Music+-+Ultimate+Discography+%281996-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75270fee1d936788b706c70a783ca1fb39b65c8e","infoHashBuffer":{"type":"Buffer","data":[117,39,15,238,29,147,103,136,183,6,199,10,120,60,161,251,57,182,92,142]},"announce":[],"urlList":[]}}