{"title":"Person of Interest S01 Complete (Xvid)","uid":7511017,"size":8463798693,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:752fc526b80ecbef9ea68074ffc77023de4a91bb&amp;dn=Person+of+Interest+S01+Complete+%28Xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Wldsthrnboy","files":-1,"time":1344322375,"description":"&quot;You are being watched. The government has a secret system: a machine that spies on you every hour of every day. I know because I built it. I designed the machine to detect acts of terror, but it sees everything. Violent crimes involving ordinary people, people like you. Crimes the government considered irrelevant. They wouldn't act, so I decided I would. But I needed a partner, someone with the skills to intervene. Hunted by the authorities, we work in secret. You'll never find us, but victim or perpetrator, if your number's up...we'll find you.&quot;\nOpening voice-over by Mr. Finch\nJohn Reese (Jim Caviezel), a former Green Beret and CIA field officer, is living as a derelict in New York City after an unspecified incident, and is presumed dead. He is approached by Harold Finch (Michael Emerson), a reclusive billionaire computer genius who is living under an assumed identity. Finch explains that after 9/11, he built a computer system for the government which uses information gleaned from omnipresent surveillance to predict future terrorist attacks. Finch discovers that the computer was predicting ordinary crimes as well. While the government was not interested in these results, Finch is determined to find a way to stop the predicted crimes. He hires Reese to conduct surveillance and intervene as needed, using his repertoire of skills gained in the military and CIA. Through a back door built into the system, Finch receives a social security number for someone who will be involved in an imminent crime, at which time he contacts Reese. Without knowing what the crime will be, when it will occur, or even if the person they're after is a victim or perpetrator, Reese and Finch must try to stop the crime from occurring. They are helped by NYPD Detectives Lionel Fusco (Kevin Chapman), a corrupt cop whom Reese coerces into helping them, and Joss Carter (Taraji P. Henson) who had originally been investigating Reese for his vigilante activities. Although Carter and Fusco are partners in the NYPD, for a time, neither was aware that the other is working with Finch and Reese.\nA major subplot concerns &quot;HR&quot;, an organization of corrupt NYPD cops in league with a budding mob boss, Carl Elias. Led by several high-ranking officers, the members of HR work with Elias to return New York to the old order, when the mob and police worked together. Elias, on the other hand, is merely using HR as a means to regain complete control of New York's organized crime. Despite his desire to be seen as a good cop, Fusco must appear to be in league with HR, which allows Reese to keep tabs on the activities of both HR and Elias.\n","torrent":{"xt":"urn:btih:752fc526b80ecbef9ea68074ffc77023de4a91bb","amp;dn":"Person+of+Interest+S01+Complete+%28Xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"752fc526b80ecbef9ea68074ffc77023de4a91bb","infoHashBuffer":{"type":"Buffer","data":[117,47,197,38,184,14,203,239,158,166,128,116,255,199,112,35,222,74,145,187]},"announce":[],"urlList":[]}}