{"title":"Moving On - Series 1 - Complete [BBC One] (2009) [PDTV (H.264)] ","uid":5058271,"size":1834075740,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:755bd0e3bbc7ab1bcb04c7205f3f508e9290a503&amp;dn=Moving+On+-+Series+1+-+Complete+%5BBBC+One%5D+%282009%29+%5BPDTV+%28H.264%29%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Frank_UK","files":5,"time":1250537027,"description":"Moving On - Series 1 - Complete\n\nBBC One\n\nMoving On is a series of five unique, contemporary dramas starring Shelia Hancock, Bhasker Patel, Mark Womack, Richard Armitage, Christine Tremarco, Dervla Kerwin, Ian Hart, Julia Ford, Lesley Sharp and Joanne Frogatt and executive produced by Jimmy McGovern (The Street) for BBC One Daytime.\n\nThe five dramas in the series are:\n\nThe Rain Has Stopped by Karen Brown \n\nBully by Marc Pye \n\nDrowning Not Waving by Sarah Deane \n\nDress To Impress by Arthur Ellison \n\nButterfly Effect by Esther Wilson \n\nStripped over one week, starting on Monday 18 May 2009 at 2.15pm, the dramas are all linked by one central theme: how to &quot;move on&quot; and reach a turning point in your life. \n\nCommissioned by the Controller of BBC Daytime, Liam Keelan, the dramas have been written by up-and-coming writers and experienced writers, who were all chosen by, and worked closely with, Executive Producer Jimmy McGovern. \n\nSpeaking about the series Liam Keelan says: &quot;Moving On is one of the most ambitious contemporary dramas to be showcased on BBC One Daytime. The new writing talent and star names backed by Jimmy McGovern offer a breadth of stories unique to BBC Daytime and which is bound to resonate with our audience.&quot; \n\nThanks to the quality of the writing the series has attracted a well-known and high-profile cast. \n\nThe series has been made by Liverpool-based production company LA Productions, and producer Colin McKeown says he and Jimmy McGovern set out to find the right writers for the series by offering the opportunity to as many people as possible. \n\n&quot;The process of selecting these stories was a challenge that was thrown out to all levels of writers, from the inexperienced to those who have had some writing success. A shortlist was formed and five stories were then entered into a script process presided over by the BAFTA and Emmy award-winning Jimmy McGovern, who worked closely with the writers to produce the final shooting drafts. \n\n&quot;It's thanks to Jimmy's tutorage to the writers that the quality of the scripts were such that it enabled us to put together a stellar cast and deliver a first-class drama series.&quot; \n\nAspect Ratio: 720 x 576 : 16:9 Anamorphic Widescreen\n\nVideo: H.264 High Profile : 1000kbps 25fps : 2 Pass Encoded\n\nAudio: AAC-LC 48000Hz 128kbps ABR Stereo\n\nFrank_UK","torrent":{"xt":"urn:btih:755bd0e3bbc7ab1bcb04c7205f3f508e9290a503","amp;dn":"Moving+On+-+Series+1+-+Complete+%5BBBC+One%5D+%282009%29+%5BPDTV+%28H.264%29%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"755bd0e3bbc7ab1bcb04c7205f3f508e9290a503","infoHashBuffer":{"type":"Buffer","data":[117,91,208,227,187,199,171,27,203,4,199,32,95,63,80,142,146,144,165,3]},"announce":[],"urlList":[]}}