{"title":"3D Ultra Pinball CreepNight","uid":4152809,"size":123919773,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:75b06398b2be6822c4b8d62b7398ad5ddb8973ca&amp;dn=3D+Ultra+Pinball+CreepNight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"oracenelson","files":59,"time":1209023101,"description":"\nFOR COMPLETE DESCRIPTION AND PICTURES,SEE: &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=123799&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=123799&lt;/a&gt;\n\n\nThe game\nAs the first pinball in this series 3DUP it is for windows and the table layout is pretty much the same. The tables are split in three areas, one small to the left, one big area in the middle and one to the right. The tables have lots of stupid sprites walking/flying around on the table, one of the tables even have a water tank (FT2 has one too) in which you can shoot the ball, time to time an octopus appears in it. This is by no mean a pinball simulator, it is definitively a pinball game only there for you to kill some time, it is nothing for those looking for a real challenge.\nThe tables:\nCastle\nIt is not not hard to guess that the table looks like some sort of castle, trying to involve knights and fire. As all the tables here this one is mainly mode based, with graveyards, car-driving-goblins and such things (&quot;such&quot; things). In about all of the modes some stupid sprite appear on the table. In the mode with the car driving goblin, a car driving goblin drives a car around on the table and you must run the ball over him to earn points. These modes are all amusing in some strange way, and you will probably find joy in playing the pinball trying out the modes. Yes it is sort of fun, but as a pinball it is not what at least I want, even tough it might be needed a little skill to shoot the goblin, it is not the same as lighting a jackpot ramp or hole and then try to get it. In all it will probably be fun for younger people to play this table, but a pro or someone looking for some bigger challenge and serious playing.. close your eyes. Positive is that there is a lot of things to score on, small video games, many modes and some main goal, but it all gets to unreal and even tough you play the hardest level settings it is not that though.\nTower\nI think the title is Tower since you are in a tower..? Anyway that's just a guess since the main thing to do is wake someone who looks like Frankenstein. The same here, complete lots of modes and get high scores, and the same problem with it, it is a pinball game, and I seldom get any fun out of pinball games, I want a simulator that gives you the feeling you are competing against something (no, I wont go to a videostore and play a real one, that's not what I mean and you know it..). Still you get lots of fun out of the strange modes in the table, even tough I personally like the other two tables better than this one since that water tank in the middle of the screen is just in the way for everything (not only because of it).\nDungeon\nThis table looks least packed with stuff and, if to say one of the table beats the other two, I'd say this one do. Some of the modes are a little to easy but some require a little more technique to manage. To say what you understand at first when you start playing the table, a lot of evil is going on in the dungeon and you must stop it. You shoot around trying to start a mode, one of the probably first modes to occur is one where prisoners flee their cell and you must get them back in (I think that is what you are doing!). Even tough the layout is in the ground exactly the same in all the three tables this ones look most serious (uhm...).\nThe feeling\nThe feeling is halfgood, it has a backhand shoot that both is useful but still very hard to control, if not uncontrollable. Also the ball speeds up about the same wherever you shoot, which means you can't control the shoot very good. On one table when the ball is dropped to the left flipper through some hole nearby it seems to always have the same speed when it comes out to the flipper, because if you hold up the flipper the ball will bounce up on it and then always drain directly. You might wonder why you would want to hold up the flipper, it could be because you want the ball to sort of &quot;jump&quot; over to the right flipper. There are lots of these irritating thing all over the tables. In all the feeling is not very much, still it is enough there to enjoy the pinball for what it was designed for, whatever that was, kill some time, for the younger players who don't want so much out of it maybe?\nYou can choose gravity for the ball &quot;light&quot;, &quot;normal&quot;, &quot;heavy&quot;. You can also choose between easy and hard game play. Of course it is good that you can choose ball physics, so guess I can't complain about that.\nThe whole\nIn the whole it is not a pinball I would recommend someone I care the slightest for. Not that it is mean to recommend it to someone, it is just so that there is so many better to find. This is by all means a pinball game, something that doesn't simulate a real pinball very good, something that only tries to be fun but fails in many ways. My biggest problem with this pinball, what makes me not so thrilled over it, is its attitude, then come layout, the sprites and the feeling. It is hard to explain what is wrong with the tables, but to compare it:\nTake something like Pinball Fantasies and this one, Fantasies is serious, it looks good, feels good, it feels naturally to play. Then look at this one, it feels halfgood, it looks strangely odd, and it doesn't feel natural when you play it, instead you feel like you are throwing a ball at a wall waiting for it to collapse.\nIf you don't understand what I mean I can understand that, but is not all to hard to understand that there is a big! difference between those two pinballs (except for one is 3D and on 2D), you can't deny that. If Sierra were to make a third pinball in this series I would have hard to understand why, maybe because they make money since this is one of the pinballs most marketed (not that it deserve so much marketing).\n\n\n\nDati\nDimensione file: Mb 118\nLingua : ENG\nGenere : Arcade - Flipper\nSviluppatore : Sierra\nData di uscita : 1996\nPrezzo: $ 40,99\n\n\nRequisiti\nWindows 95/98/2000/XP\nPentium 133\n16MB RAM\n640x480 256 colors\nMouse","torrent":{"xt":"urn:btih:75b06398b2be6822c4b8d62b7398ad5ddb8973ca","amp;dn":"3D+Ultra+Pinball+CreepNight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75b06398b2be6822c4b8d62b7398ad5ddb8973ca","infoHashBuffer":{"type":"Buffer","data":[117,176,99,152,178,190,104,34,196,184,214,43,115,152,173,93,219,137,115,202]},"announce":[],"urlList":[]}}