{"title":"[PDF] [2004] Progress on Cryptography  25 Years of Cryptography ","uid":6449878,"size":3122457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75bf24b2f557500f6e508c6525199036ed284fb2&amp;dn=%5BPDF%5D+%5B2004%5D+Progress+on+Cryptography++25+Years+of+Cryptography+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307386437,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nCryptography in Chinese consists of two characters meaning &quot;secret coded&quot;. Thanks to Ch'in Chiu-Shao and his successors, the Chinese Remainder Theorem became a cornerstone of public key cryptography. Today, as we observe the constant usage of high-speed computers interconnected via the Internet, we realize that cryptography and its related applications have developed far beyond &quot;secret coding&quot;. China, which is rapidly developing in all areas of technology, is also writing a new page of history in cryptography. As more and more Chinese become recognized as leading researchers in a variety of topics in cryptography, it is not surprising that many of them are Professor Xiao's former students.\n\nProgress on Cryptography: 25 Years of Cryptography in China is a compilation of papers presented at an international workshop in conjunction with the ChinaCrypt, 2004. After 20 years, the research interests of the group have extended to a variety of areas in cryptography. This edited volume includes 32 contributed chapters. The material will cover a range of topics, from mathematical results of cryptography to practical applications. This book also includes a sample of research, conducted by Professor Xiao's former and current students.\n\nProgress on Cryptography: 25 Years of Cryptography in China is designed for a professional audience, composed of researchers and practitioners in industry. This book is also suitable as a secondary text for graduate-level students in computer science, mathematics and engineering.","torrent":{"xt":"urn:btih:75bf24b2f557500f6e508c6525199036ed284fb2","amp;dn":"%5BPDF%5D+%5B2004%5D+Progress+on+Cryptography++25+Years+of+Cryptography+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75bf24b2f557500f6e508c6525199036ed284fb2","infoHashBuffer":{"type":"Buffer","data":[117,191,36,178,245,87,80,15,110,80,140,101,37,25,144,54,237,40,79,178]},"announce":[],"urlList":[]}}