{"title":"Emily Gets Her Gun: But Obama Wants to Take Yours - Emily Miller","uid":11196652,"size":306757454,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:75c439a678082324f4b07e01708e571e3c500fe1&amp;dn=Emily+Gets+Her+Gun%3A+But+Obama+Wants+to+Take+Yours+-+Emily+Miller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1413100371,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nEmily Gets Her Gun: But Obama Wants to Take Yours\n\nWritten by: Emily Miller\nNarrated by: Carla Mercer-Meyer\nLength: 10 hrs and 37 mins\nUnabridged Audiobook\nRelease Date:09-03-13\n\nIn the wake of tragic shootings in Newtown and Aurora, the anti-gun lobby has launched a campaign of lies, distortion, misrepresentation, and emotional manipulation that is breathtaking in its vitriol and its denial of basic facts. Their goal is to take away our Second Amendment rights and then disarm law-abiding Americans.\n\nEmily Miller tells her personal story of how being a single, female victim of a home invasion drove her to try to obtain a legally registered gun in Washington, D.C. The narrative - sometimes shocking, other times hilarious in its absurdity - gives the listener a real-life understanding of how gun-control laws only make it more difficult for honest, law-abiding people to get guns, while violent crime continues to rise.\n\nUsing facts and newly uncovered research, Miller exposes the schemes politicians on Capitol Hill, in the White House, and around the country are using to deny people their Second Amendment rights. She exposes the myths that gun grabbers and liberal media use to get new laws passed that infringe on our right to keep and bear arms.\n\nThe gun rights debate isn't just about firearms. It's about protecting a fundamental right that is enshrined in the U.S. Constitution. It's about politicians who lie, manipulate, and outright break existing laws to get what they want. It's about President Obama wanting a bigger federal government to control you. Not just your guns - you. The fight for gun rights is the fight for freedom. Emily Miller says stand up and fight back now because your Second Amendment will only be the first to go.","torrent":{"xt":"urn:btih:75c439a678082324f4b07e01708e571e3c500fe1","amp;dn":"Emily+Gets+Her+Gun%3A+But+Obama+Wants+to+Take+Yours+-+Emily+Miller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75c439a678082324f4b07e01708e571e3c500fe1","infoHashBuffer":{"type":"Buffer","data":[117,196,57,166,120,8,35,36,244,176,126,1,112,142,87,30,60,80,15,225]},"announce":[],"urlList":[]}}