{"title":"Bob Marley and The Wailers - Catch a Fire [DVDrip Eng Ac3 - Hard","uid":6617056,"size":734588928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:75f5a8c96fe6cd61a93247d2d42e851e5e750b0c&amp;dn=Bob+Marley+and+The+Wailers+-+Catch+a+Fire+%5BDVDrip+Eng+Ac3+-+Hard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"l.diliberto","files":1,"time":1313833349,"description":"Bob Marley and The Wailers - Catch a Fire [DVDrip Eng Ac3 - HardSub Ita] TNT Village\n\n.: Release Originale :.\n\n[url]http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=71497[/url]\n\nIn the late '60s, the notion that reggae would become more than just a novelty act would have been laughed at. To break into the mainstream, the movement needed a powerful voice of prophetic proportions. This voice emerged from the collective work of three pioneering friends from Jamaica, Peter Tosh, Bunny Wailer, and Robert Nesta Marley, who sought to bring about an ideological revolution through deeply meditative, hypnotic, and spiritual music. Catch a Fire was the Wailers' and reggae's introduction to the world and turned Bob Marley into a mega-icon of enormous proportions. It was the first album to remain true to the traditions of reggae music while having enough elements that were accessible to popular culture. This documentary, Bob Marley and the Wailers: Catch a Fire, returns to Dynamic Studios in Kingston, Jamaica, shedding light on the development of the album, the thought process of Bob, Peter, and Bunny, and the importance of the music on a song-by-song basis. The story of Catch a Fire is presented through interviews with the band members, studio musicians, and former head of Island Records Chris Blackwell. Throughout are raw studio rehearsal footage, BBC TV footage, and home movies that include performances of &quot;Concrete Jungle,&quot; &quot;Slave Driver,&quot; &quot;Stir It Up,&quot; and &quot;Stop That Train.&quot; The documentary wraps up with rare black-and-white footage of the Wailers' tour in Edmonton, London, in 1973 with an electrifying performance of the Burnin' song &quot;Get Up, Stand Up.&quot; \n\nThe songs and story of Bob Marley's reggae music masterpiece. The Wailers, featuring the legendary Bob Marley, Peter Tosh, and Bunny Wailer, became the most influential band in the history of reggae music. Catch a Fire, their first Island album, released in 1973, introduced them to an international rock audience. Here the principal figures in the creation of Catch a Fire tell the story of how this record was designed to &quot;cross over.&quot; The DVD features a unique interview and performance by Bunny Wailer, rare archival interviews with Bob Marley and Peter Tosh, and contributions from many of those who performed on the record. Featuring home movies of the Wailers in Jamaica, previously unseen footage, and unique performances of many album tracks such as &quot;Stir It Up,&quot; &quot;Stop That Train,&quot; and &quot;Kinky Reggae,&quot; this is a documentary that will endlessly fascinate the viewer. 60 minutes.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img818.imageshack.us/img818/6107/bobmarleyp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img818.imageshack.us/img818/6107/bobmarleyp.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nDirector: Jeremy Marre\nWriter: Terence Dackombe (storyliner)\nStars: Chris Blackwell\nJohn Bundrick\nRita Marley\nChris Blackwell\nPeter Tosh\n\n.: Screenshot :.\n &lt;a href=&quot;\nhttp://img854.imageshack.us/img854/473/bobmarletscreen.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img854.imageshack.us/img854/473/bobmarletscreen.png&lt;/a&gt;\n\n0=============================0\n\n.: Info Ripping :.\n\nDimensione: 700 MB\nDurata: 1:00:02\n\nVideo Codec: DivX 5.x/6.x (DX50)\nVideo Bitrate: 1435 kbps\nRisoluzione: 592 x 448\nFPS (Frames/sec): 25.000\nQF (Frame quality):0.216\n\nAudio Codec: (Dolby AC3) AC3\nAudio Bitrate: 192 kb/s tot , stereo (2/0)\nFreq Audio: 48000Hz","torrent":{"xt":"urn:btih:75f5a8c96fe6cd61a93247d2d42e851e5e750b0c","amp;dn":"Bob+Marley+and+The+Wailers+-+Catch+a+Fire+%5BDVDrip+Eng+Ac3+-+Hard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75f5a8c96fe6cd61a93247d2d42e851e5e750b0c","infoHashBuffer":{"type":"Buffer","data":[117,245,168,201,111,230,205,97,169,50,71,210,212,46,133,30,94,117,11,12]},"announce":[],"urlList":[]}}