{"title":"A Canterbury Tale (1944)","uid":4889832,"size":1463670873,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:761dada57a235ec00b5af2ebb36dcb2bd00adce9&amp;dn=A+Canterbury+Tale+%281944%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":4,"time":1241914641,"description":"Movies : Drama : DVD Rip : English\n\n\nA Canterbury Tale (1944) is a British film by the film-making team of Michael Powell and Emeric Pressburger. It stars Eric Portman, Sheila Sim, Dennis Price and Sgt. John Sweet; Esmond Knight provided narration and played several small roles. For the American release, Raymond Massey narrated and Kim Hunter was added to the film. The film was made in black and white, and was the first of two collaborations between Powell and Pressburger and cinematographer Erwin Hillier.\n\nA Canterbury Tale takes its title from The Canterbury Tales of Geoffrey Chaucer, and loosely uses Chaucer's theme of 'eccentric characters on a religious pilgrimage' to highlight the wartime experiences of the citizens of Kent, and encourage wartime Anglo-American friendship and understanding.\n\nThe film was photographed in East Kent in the countryside within the triangle of Faversham, Ashford and Canterbury and the River Stour can clearly be seen in some of the scenes. Canterbury is shown with the terrible scars it received during the war and one can only wonder at the fact that the great cathedral remained unscathed. It is a wonderful sight to see sheep being herded through the Westgate Towers. Oh how things have changed!\n\n\n\nPlot:\n \nThe story concerns three young people: British Sergeant Peter Gibbs (Dennis Price), US Sergeant Bob Johnson (played by real-life Sergeant John Sweet), and a 'Land Girl', Miss Alison Smith (Sheila Sim). The group arrive at the railway station in the fictitious small Kent town of Chillingbourne, near Canterbury, late on Friday night. Peter has been stationed at a nearby Army camp, Alison is due to start working on a farm in the area, Bob had left the train by mistake, hearing the announcement &quot;next stop Canterbury&quot; and thinking he was in Canterbury. As they leave the station together Alison is attacked by a mysterious assailant in uniform who pours glue on her hair, before escaping. It transpires that this has happened quite a few times before. Alison asks Bob if he could spend the weekend in Chillingbourne to help her solve the mystery. The next day, while riding a farm cart in the countryside, Alison meets Peter, who surrounds her cart with his platoon of three Bren Gun Carriers. Alison agrees to meet Peter again. The three decide to investigate the attack, enlisting the help of the locals, including several young boys who play large-scale war games.\n\nThey soon identify the culprit as a local magistrate, Mr Thomas Colpeper (Eric Portman), a gentleman farmer and pillar of the community, who also gives local history lectures to soldiers stationed in the district. On a train journey to Canterbury on the Monday morning, they find themselves in the same compartment with Colpeper. They confront him with their suspicions, which he doesn't deny, and they discover that his motive is to prevent the soldiers from being distracted away from his lectures by female company and to help keep the local women faithful to their absent British boyfriends.\n\nIn Colpeper's words, Chaucer's pilgrims travelled to Canterbury to &quot;receive a blessing, or to do penance&quot;. On arriving in the city of Canterbury, devastated by wartime bombing, all three young people receive blessings of their own. Alison discovers that her boyfriend, believed killed in the war, has survived after all; his father, who had blocked their marriage because he thought his son could do better than a shopgirl, finally relents. Bob receives long-delayed letters from his sweetheart, who is now a WAC in Australia. Peter, a cinema organist before the war, gets to play the music of J.S. Bach on the large organ at Canterbury Cathedral, before leaving with his unit. He decides not to report Mr Colpeper to the Canterbury police, as he had planned to do - in its way a blessing for Colpeper, when he had expected instead to do penance.\n\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:761dada57a235ec00b5af2ebb36dcb2bd00adce9","amp;dn":"A+Canterbury+Tale+%281944%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"761dada57a235ec00b5af2ebb36dcb2bd00adce9","infoHashBuffer":{"type":"Buffer","data":[118,29,173,165,122,35,94,192,11,90,242,235,179,109,203,43,208,10,220,233]},"announce":[],"urlList":[]}}