{"title":"MommysGirl/GirlsWay] (The Secret Package / 03.09.2016)","uid":15744239,"size":1863591771,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:765518aab19eef116ffa1ed4ce31e8a44cab8e81&amp;dn=MommysGirl%2FGirlsWay%5D+%28The+Secret+Package+%2F+03.09.2016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"nItroxxx2","files":1,"time":1472950282,"description":"iNfo:\r\n\r\n[MommysGirl.com / GirlsWay.com] August Ames, Jelena Jensen (The Secret Package / 03.09.2016) [Big Tits, Girl on Girl, Member Fantasy, MILF &amp; Mature, Tattoos, Pussy Licking, Family Roleplay, Tribbing, 1080p]\r\n\r\n\r\nWhen August Ames gets spooked while her husband's away, mother-in-law Jelena Jensen comes over carrying a mysterious package left at the door. The box contains a weird doll and an old book. August thinks it's book of dark magic that belongs to a witch, and sure enough, when she recites a passage, a spell is cast. The day gets weirder when Jelena hits on her. Confused and disturbed, she rebukes the sexual advance, and Jelena retreats to the kitchen with the doll, and performs a voodoo spell that works like a charm. Suddenly, August is crawling out of her clothes, and her pussy is tingling. She knows Jelena's behind this, but it's too weird to fuck her husband's mother, of all people. Plus, she's not a lesbian! Her pussy needs release and she begs Jelena for an orgasm, bucking and writhing, legs spread and big juicy tits exposed. Why won't she just let her pussy cum!? Lesbian Jelena straddles her face, making August even more desperate to cum from having Jelena's pussy in her mouth, and August finally succumbs to her lesbian desires, riding Jelena's pussy till they're both moaning and shuddering and cumming with sweet relief","torrent":{"xt":"urn:btih:765518aab19eef116ffa1ed4ce31e8a44cab8e81","amp;dn":"MommysGirl%2FGirlsWay%5D+%28The+Secret+Package+%2F+03.09.2016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"765518aab19eef116ffa1ed4ce31e8a44cab8e81","infoHashBuffer":{"type":"Buffer","data":[118,85,24,170,177,158,239,17,111,250,30,212,206,49,232,164,76,171,142,129]},"announce":[],"urlList":[]}}