{"title":"Chasing the Scream: The First and Last Days of the.. Johann Hari","uid":12113911,"size":410139220,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:765f85a0f0d164a6596f66ce0d0b842fe25ad079&amp;dn=Chasing+the+Scream%3A+The+First+and+Last+Days+of+the..+Johann+Hari&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Horisarte","files":22,"time":1436640970,"description":"Johann Hari - Chasing the Scream: The First and Last Days of the War on Drugs\n\nJohann Hari (Author), Tim Gerard Reynolds (Narrator)\n &lt;a href=&quot;\nhttps://i.imgur.com/jMPS2BK.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://i.imgur.com/jMPS2BK.jpg&lt;/a&gt;\n\nIt is now 100 years since drugs were first banned in the United States. On the eve of this centenary, journalist Johann Hari set off on an epic three-year, 30,000-mile journey into the war on drugs. What he found is that more and more people all over the world have begun to recognize three startling truths: Drugs are not what we think they are. Addiction is not what we think it is. And the drug war has very different motives to the ones we have seen on our TV screens for so long. \n\nIn Chasing the Scream, Hari reveals his discoveries entirely through the stories of people across the world whose lives have been transformed by this war. They range from a transsexual crack dealer in Brooklyn searching for her mother, to a teenage hit-man in Mexico searching for a way out. It begins with Hari's discovery that at the birth of the drug war, Billie Holiday was stalked and killed by the man who launched this crusade - and it ends with the story of a brave doctor who has led his country to decriminalize every drug, from cannabis to crack, with remarkable results. \n\nChasing the Scream lays bare what we really have been chasing in our century of drug war - in our hunger for drugs, and in our attempt to destroy them. This audiobook will challenge and change how you think about one of the most controversial - and consequential - questions of our time.\n\nAudible Audio Edition\n\nListening Length: 14 hours and 14 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Audible Studios for Bloomsbury\nAudible.com Release Date: January 20, 2015\nLanguage: English\nASIN: B00S5ASH9I","torrent":{"xt":"urn:btih:765f85a0f0d164a6596f66ce0d0b842fe25ad079","amp;dn":"Chasing+the+Scream%3A+The+First+and+Last+Days+of+the..+Johann+Hari","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"765f85a0f0d164a6596f66ce0d0b842fe25ad079","infoHashBuffer":{"type":"Buffer","data":[118,95,133,160,240,209,100,166,89,111,102,206,13,11,132,47,226,90,208,121]},"announce":[],"urlList":[]}}