{"title":"EXPLOITED COLLEGE GIRLS - Farrah - 19 Year Old Redhead 720P *NEW","uid":9984984,"size":1817295200,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:76a51252a5bb1e1198aa1d9c04c30bb17f16429a&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Farrah+-+19+Year+Old+Redhead+720P+%2ANEW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"beta2008x","files":1,"time":1397777077,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=1jt1j_fhr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=1jt1j_fhr.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=8hylj_ecg_14_04_17_farrah_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=8hylj_ecg_14_04_17_farrah_.jpg&lt;/a&gt;\n\n\n\nWhen we open on Farrah you will know in 3 seconds how hot this update is going to be. She's smiling, happy and enthusiastic and blessed with a mane of red hair, perky B cups and a nice curvy ass. As Jay interviews her we find out that while she's a little giggly and nervous, she's really excited to shoot for ECG.\n\nAs Jay converses with her he gets her to show off her perfect little B cups and her surprisingly curvy ass, as she turns to show off her booty prepare to be wowed. Jay does his best to shoot it and gets a lot of nice shots of her entire bod. To start he has Farrah get on her back and spread to show off her firecrotch and perfect pink puss, which she's already fingering as Jay gets between her legs.\n\nIt doesn't take much for Farrah to orgasm, she cums quickly and vocally for Jay and it's extremely hot. After her first O, she forgets her nervousness and really gets into the shoot. She gets on her knees and gives Jay an extremely passionate BJ with lots of ball cupping and head licking. Any viewer can see how much this girl loves sucking on a dick. Once she gets our star hard, he gets her on the bed and fucks her to several more orgasms. You can see how much she gets into the shoot by the split screen shots of her face as she gets nailed, it's incredibly sexy.\n\nWe'll certainly see more of Farrah, she's too sexy to keep a secret. She's got an amazing body from the top of her strawberry head to the bottom of her freckly feet. Not to mention she barks like a chihuahua when she orgasms and giggles like a schoolgirl during her facial. Both of which make her a natural in front of the porn camera.\n","torrent":{"xt":"urn:btih:76a51252a5bb1e1198aa1d9c04c30bb17f16429a","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Farrah+-+19+Year+Old+Redhead+720P+%2ANEW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76a51252a5bb1e1198aa1d9c04c30bb17f16429a","infoHashBuffer":{"type":"Buffer","data":[118,165,18,82,165,187,30,17,152,170,29,156,4,195,11,177,127,22,66,154]},"announce":[],"urlList":[]}}