{"title":"Funkadelic - Free Your Mind and Your Ass Will Follow .flac files","uid":6221794,"size":281974981,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7746e91b1aae58921fcfb2a90e7afe5e378280ed&amp;dn=Funkadelic+-+Free+Your+Mind+and+Your+Ass+Will+Follow+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ulikes","files":10,"time":1299355714,"description":"1971 was a very important year for Funkadelic, the year that they recorded their earliest masterpiece albums: &quot;Free Your Mind and Your Ass Will Follow&quot; and &quot;Maggot Brain&quot;.\n\n&quot;Free Your Mind&quot; stands out as one of the most psychedelic albums known to man, a nonstop freak out festival that you'd swear was a bad trip. Many bands suffer from &quot;Sophomore Syndrome&quot;, producing a mediocre second album: Funkadelic avoided this mishap and produced a masterpiece that improved on its first album.\n\nNaturally, with this album's title, it makes perfect sense that the album was recorded entirely while the band was tripping on acid (George Clinton's idea). A very experimental record, &quot;Free Your Mind&quot; was FAR ahead of its time, using immense amounts of feedback and electric effects. What the title means is subject to MUCH interpretation, but I prefer the concept that by opening yourself up to new ideas (in this case wild, funky music) you will reap the benefits. Funkadelic in this case meant dancing (with this album, more so moshing) like there was no tomorrow.\n\nMany complain that this album has a very rough, harsh sound to it; this actually is the point of the experimentation, to see what extreme feedback could do for the band's sounds. Needless to say, the feedback was a complete success, producing some sublime works of music.\n\nAt the opening track (the album's namesake), the intense trip begins. Bursts of feedback and &quot;warm-up&quot; guitar and keyboard riffs sound as George Clinton mutters &quot;Free your mind and your ass will follow...the kingdom of heaven is within.&quot; For two whole minutes strange comments such as these are made, before suddenly Eddie Hazel's WICKED guitar jumps into action and catapults the band into an awesome bridge. Accompanying Hazel is Bernie Worrell, the band's keyboard wizard, who uses his keyboard (also laden with feedback) to create numerous psychedelic sounds. Then, Worrell begins to play the amazing core of this jam, indicating that the trip is in FULL FORCE. To be honest, the effect of this song is indescribably cool. It's a 10-minute jam that doesn't end, and is DEFINITELY worth the entire album. All the instruments are perfectly aligned, with a driving bassline holding the jam together. It's like a modern classical symphony (in acid), so complex and intricate that it has yet to get old for me. Worrell and Hazel give up numerous incredible solos on their instruments. And the song is perfectly engineered to shift from one speaker to another each few seconds, which actually makes your head feel a little funny. This song, as said by another reviewer, was a definite reason to have stereo sound in the 1970s.\n\nNeedless to say, &quot;Free Your Mind&quot; isn't the only awesome song on the album. Immediately following it is &quot;Friday Night, August the 14th&quot;. This song picks up after &quot;Free Your Mind&quot; with more psychedelia, this time using echoing drums and wahwah guitars. More masterwork from Eddie Hazel; need I say more?\n\nNext on the album is &quot;Funky Dollar Bill,&quot; the third standout from the album. A brilliantly-written piece about what money does to America, this song features more psychedelic instrumentation (what a shock), another killer guitar riff, and an amazing keyboard solo by Bernie Worrell in the middle. This album is definitely the playground for Hazel and Worrell, showing off their skills as a two-man team of musical geniuses that would work brilliantly in concert.\n\nThe fourth track, &quot;I Wanna Know If It's Good To You Baby&quot;, is another track for Hazel to show off on. This time driving the song by himself, Hazel plays an amazing guitar riff that jumps into a frightening feedback-driven solo. The echoing effects of the guitar (is it a delay, I wonder) are intensely psychedelic.\n\nSadly, the album's near-perfection is marred by mediocrity: a song that simply does NOT fit, &quot;Some More&quot;, is the 5th track. This song, a much more upbeat and non-psychedelic one, is clearly filler material. It does not belong on an album all about finding a new perspective on things.\n\nThe final track of the album, &quot;Eulogy and Light&quot;, is the early Funkadelic trademark: a song designed to freak out whoever ever listens to it. Featuring Christian prayers playing backwards, the feedback-driven song is spoken by a slowed-down voice that prays to &quot;our father who art on Wall Street.&quot; Another political message from George that comes across perfectly.\n\nThis version is the far better British sound and mix. The original artwork is included. Mix in the .flac format to capture every sound. Those who are Funkadelic fans should bookmark my list as I will at some point be offering every Funkadelic album for you to download.\n\nMp3 is dead! Long live Flac!!!","torrent":{"xt":"urn:btih:7746e91b1aae58921fcfb2a90e7afe5e378280ed","amp;dn":"Funkadelic+-+Free+Your+Mind+and+Your+Ass+Will+Follow+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7746e91b1aae58921fcfb2a90e7afe5e378280ed","infoHashBuffer":{"type":"Buffer","data":[119,70,233,27,26,174,88,146,31,207,178,169,14,122,254,94,55,130,128,237]},"announce":[],"urlList":[]}}