{"title":"Assassins.Creed.III.The.Tyranny.of.King.Washington.The.Betrayal.","uid":8267252,"size":1511028382,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:77b3919a56a008426cbec521ada03ac67b5e0bfd&amp;dn=Assassins.Creed.III.The.Tyranny.of.King.Washington.The.Betrayal.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr.Stifmeister","files":161,"time":1363538975,"description":"                           S  K  I  D  R  O  W\n                           .the leading force.\n\n                            proudly presents\n    Assassins Creed III The Tyranny of King Washington The Betrayal\n\n\n  17-03-2013......Release Date  Protection............Ubisoft DRM\n  Action.............Game Type  Disk(s).......................DOX\n\n\n   RELEASE NOTES\n\n\nIn Episode 2: The Betrayal, you gain the Power of the Eagle which\ngrants access to a unique set of gifts that enable lightning-fast\nreactions and adds another dimension of stealth beyond even the\nprevious chapters Power of the Wolf!\n\nSimilar to the Power of the Wolf, Power of the Eagle has two different\nuses. First, it enables Ratonhnhakton to soar from one location to\nanother quickly and invisibly as a ghostly eagle. You activate this\nability by looking in the direction you want to go - if the Power of\nthe Eagle is available to use, you will see a reticle appear with two\nwings.\n\nOnce you press the button to activate the ability, Raton will transform\ninto an eagle and streak towards the new location completely unseen!\nBest of all, you can use this ability while running or jumping to\ndramatically increase the distance of your jumps or even save yourself\nfrom a nasty fall.\n\nOf course, the Power of the Eagle would not be complete if it didnt\ninclude some kind of offensive component as well. Consequently, we've\nincluded the Eagle Strike, which will enable you to power dive into a\nfoe, ending their life with the swiftness of a deadly raptor! Will this\nextraordinary ability be enough to ensure that Ratonhnhakton can stand\nagainst King Washington and his remaining lackeys Israel Putnam and\nBenjamin Franklin?\n\n\nPROPER NOTE:\nReloaded's proper of our Patch 1.04 is not valid, furthermore there\nAssassins.Creed.III.The.Tyranny.of.King.Washington.The.Betrayal.DLC\n-RELOADED corrupt ur saves.\nNo Uplay is needed, but if you got one installed it will not interrupt,\nno matter which version, plus our proper also unlock all DLC's.\n\nFixnote: RegOpenKeyEx is now supporting gamestart without launcher\nregistry entrys, but who cares.\n\n\n   INSTALL NOTES\n\n\n1. Unpack this release\n2. Run AssassinsCreed3_DLC2.exe (Make sure our Patch 1.04 has been\n   installed)\n3. Copy the cracked content from the Crack folder and into the main\n   install folder and overwrite\n4. Block the game in your firewall and mark our cracked content as\n   secure/trusted in your antivirus program\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\n\n   ADDITIONAL NOTES\n\n\nThis has only been tested on own Assassins.Creed.III-SKIDROW release,\nas RELOADED's release is nothing more than a dupe!\n\nWe decided to implent and emulate the latest version of the Ubisofts\norbit launcher, to enable every offline function, that their orbit\nservice gives users who actually owns the original. Simply to offer\nemulated functions that noone else in the scene currently offers.\n\nYou'll notice it when you see it!\n\n\n   GREETINGS\n\n\nTo all friends of the family and honorable rival groups!\n\n\n                                ascii art by the\n                               godlike &amp; terrific duo\n                                   malodix + irokos\n                                    titan artdivision\n","torrent":{"xt":"urn:btih:77b3919a56a008426cbec521ada03ac67b5e0bfd","amp;dn":"Assassins.Creed.III.The.Tyranny.of.King.Washington.The.Betrayal.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b3919a56a008426cbec521ada03ac67b5e0bfd","infoHashBuffer":{"type":"Buffer","data":[119,179,145,154,86,160,8,66,108,190,197,33,173,160,58,198,123,94,11,253]},"announce":[],"urlList":[]}}