{"title":"Scourge of the Gods (2009) (Minutemen-Toothman)cbz","uid":9384923,"size":240498565,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:77f19103582e8e2780360d7ea93629bac1508ce6&amp;dn=Scourge+of+the+Gods+%282009%29+%28Minutemen-Toothman%29cbz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GP67","files":-1,"time":1387786649,"description":"Scourge of the Gods\n\nAfter a thousand years of peace, the Orbis the Roman Galactic Empire that thought itself almighty trembles down to its foundations. The Huns, savage warriors that came out of nowhere, are trying to conquer it. King Attila has already pillaged and burned dozens of planets without any legion being able to stop him or even slow him down. And unfortunately for Rome Kerka, the Hun goddess of chaos herself is back. But the Gods have a taste for tragedy: Kerka has been reincarnated in the body of Flavia Aetia, a young Roman girl. Is Flavia truly this macabre divinity? Is she the by-product of a terrifying plot? Or is she only the victim of a terrible destiny? A free adaptation of Hun king Attila and the Roman general Flavius Aetius confrontation, SCOURGE OF THE GODS replays the eternal struggle between order and chaos on the galactic level. Halfway between sci-fi and heroic fantasy, the huge epic fresco proclaims antique grandeur as well as the barbarism that lies in our future.\n\nScourge of the Gods - The Fall\n\nCan even the Gods themselves control their destiny when everything seems to prove that their lives are a tragedy written thousands of years ago, that is now replaying itself on a cosmic level? The Hun king Atilla finally got what he wanted: the secret stellar coordinates of Rome, the capital planet of the Orbis. He will finally be able to become not only master of the Roman Empire, but the entire known universe. Finally, he will be a God. There is but one obstacle standing between him and eternal glory: the patrician Aetius, who is secretly Atilla's lost lover Flavia Aetia, the immortal incarnation of the goddess of chaos, in disguise. Their confrontation will be merciless...\n\nenjoy\nhappy holidays","torrent":{"xt":"urn:btih:77f19103582e8e2780360d7ea93629bac1508ce6","amp;dn":"Scourge+of+the+Gods+%282009%29+%28Minutemen-Toothman%29cbz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77f19103582e8e2780360d7ea93629bac1508ce6","infoHashBuffer":{"type":"Buffer","data":[119,241,145,3,88,46,142,39,128,54,13,126,169,54,41,186,193,80,140,230]},"announce":[],"urlList":[]}}