{"title":"Card Puzzle and Word Games (June 2014) [Matching Games]","uid":10273266,"size":32671072,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:78aeaf2343e04a11516ff60779d208539f313b34&amp;dn=Card+Puzzle+and+Word+Games+%28June+2014%29+%5BMatching+Games%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LastEnd","files":-1,"time":1401619754,"description":"3 Games\n\n\n\n+WORDZABLE - Mix and twist jumbled letters to make words. Look for patterns and put your vocabulary to the test in 48 stages containing over 450 level that change each time you play. If you can find all the words in a stage that stage will unlock and allow you to return the next time you play the game.\n\nFull game just install and play.\n[Image above]\n\n\n\n\n\n\n+Lucky Farm - great way to test your kids memory speed and recall limits as they have fun matching cows, pigs, and other animals cards, and is also somewhat challenging for adults. The goal is to match cards before the timer runs out and don't waste all the remaining turns. Some of the levels move the cards up, down, and some times zoom in an out to test to see if you can follow them. Features an online high scoreboard that allow you to compare your memory against other players from around the world. Lucky Farm contains 20 levels that change the card placement each time the game is played.\n\n\n\n\n\n\n\n\n+Manic Matching - Manic Matching is a great way to test your memory speed and recall limits. The goal is to match cards before the timer runs out and don't waste all the remaining turns. Some of the levels move the cards up, down, and some times zoom in an out to test to see if you can follow them. In later levels special cards start to appear that give more time, remaining turns, and allow for the player to see through the cards for a few seconds. \n\nManic Matching contains 50 levels that change the card placement each time the game is played. features an online high scoreboard that allow you to compare your memory against other players from around the world. So come see if your the best. ","torrent":{"xt":"urn:btih:78aeaf2343e04a11516ff60779d208539f313b34","amp;dn":"Card+Puzzle+and+Word+Games+%28June+2014%29+%5BMatching+Games%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78aeaf2343e04a11516ff60779d208539f313b34","infoHashBuffer":{"type":"Buffer","data":[120,174,175,35,67,224,74,17,81,111,246,7,121,210,8,83,159,49,59,52]},"announce":[],"urlList":[]}}