{"title":"Dropkick Murphys [Discografia] ","uid":5105115,"size":479748660,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78b9400a65580cce95a9479e3bc4e4ba07f4e3cc&amp;dn=Dropkick+Murphys+%5BDiscografia%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sahae","files":125,"time":1254310728,"description":"Dropkick Murphys, frecuentemente abreviado como DKM, es una banda de punk y celtic punk (o punk celta) formada en los barrios de trabajadores inmigrantes irlandeses, en South Boston, uno de los barrios de Boston. Ensayaban en el sÃƒÂ³tano de una barberÃƒÂ­a propiedad de un amigo, combinando varios tipo de mÃƒÂºsica como punk rock, Oi!, folk irlandÃƒÂ©s, rock y hardcore, dando como resultado un estilo propio. Sus referencias musicales incluyen formaciones tales como Stiff Little Fingers, The Pogues, The Clash, AC/DC y Swingin' Utters.\n\nDe dÃƒÂ³nde procede su nombre, que literalmente significa Ã‚Â«patada de bote prontoÃ‚Â»,[1] es motivo de conflicto. La posibilidad mÃƒÂ¡s admitida es que el nombre fuese cogido de un centro de rehabilitaciÃƒÂ³n, una especie de albergue donde se alojaban alcohÃƒÂ³licos y Murphy serÃƒÂ­a la persona encargada de ir recogiÃƒÂ©ndolos por las calles. Esto es lo que afirma Marc Orrell, uno de los componentes de la banda.[2] El grupo se ha hecho un hueco en el panorama musical y le han salido seguidores incondicionales. Famosos son sus fines de semana del DÃƒÂ­a de San Patricio celebrados en su ciudad de origen, Boston.\n\nLos Dropkick Murphys se formaron en 1996. La banda publicÃƒÂ³ una serie de EP's y firmÃƒÂ³ con la discogrÃƒÂ¡fica Hellcat Records. En 1998 sacaron su primer ÃƒÂ¡lbum, Do or Die. El vocalista principal, Mike McColgan, abandonÃƒÂ³ la formaciÃƒÂ³n posteriormente en ese mismo aÃƒÂ±o sustituyÃƒÂ©ndole Al Barr, el cantante de The Bruisers. En 1999 sacaron su siguiente ÃƒÂ¡lbum, The Gang's All Here. 2001 fue el turno del tercero, Sing Loud, Sing Proud. Ese disco exhibÃƒÂ­a el desarrollo que estaba tomando su mÃƒÂºsica e incluÃƒÂ­a colaboraciones con el antiguo lÃƒÂ­der de los Pogues Shane MacGowan y con el de Cock Sparrer Colin McFaull. TambiÃƒÂ©n significÃƒÂ³ la despedida del grupo de alguno de sus componentes y la llegada de nuevos: Rick Barton, guitarra, dejÃƒÂ³ su sitio a James Lynch, antiguo guitarrista de Ducky Boys y a Marc Orrel; tambiÃƒÂ©n se aÃƒÂ±adieron nuevos instrumentos que eran tocados por Ryan Foltz y Spicy McHaggis.\n\nSu siguiente ÃƒÂ¡lbum, Blackout, saliÃƒÂ³ a la luz en 2003. Ese disco incluye canciones importantes como Walk Away y Fields of Athenry. Cabe destacar por encima de todas The Dirty Glass con voz principal femenina a cargo de Stephanie Dougherty (Deadly Sins) y que trata sobre un bar sito en Milton Massachusetts que se llama Darcys. Sobre la misma ÃƒÂ©poca, la banda saca una versiÃƒÂ³n del himno de los Red Sox de Boston que se convirtiÃƒÂ³ en la versiÃƒÂ³n oficial en las series mundiales de 2004 que terminarÃƒÂ­an ganando. Tessie, como se llama la canciÃƒÂ³n, tambiÃƒÂ©n fue utilizada en 2005 en la pelÃƒÂ­cula Fever Pitch que protagonizan Jimmy Fallon y Drew Barrymore. La banda fue incluso invitada al estreno de la pelÃƒÂ­cula.\n\nEn 2005 los Dropkick Murphys sacaron Singles Collection Volume 2, que incluye versiones, caras b y mÃƒÂ¡s material que no habÃƒÂ­a entrado en discos anteriores. TambiÃƒÂ©n en ese aÃƒÂ±o participaron en el recopilatorio Rock Against Bush, Volume 2.\n\nEl quinto ÃƒÂ¡lbum de estudio se llama The Warriors Code y fue publicado el 21 de Junio de 2005 e incluye los temas Sunshine Highway, The Walking Dead, The Warriors Code y tambiÃƒÂ©n Tessie como bonus track. AdemÃƒÂ¡s, una de las canciones pertenecientes al disco, I'm Shipping up to Boston, estÃƒÂ¡ inspirada en un poema de Woody Guthrie que fue encontrado en los archivos de la fundaciÃƒÂ³n del poeta. Este tema pertenece tambiÃƒÂ©n a la banda sonora de Infiltrados, una adaptaciÃƒÂ³n de Martin Scorsese del thriller Juego sucio (Honk Kong, 2002).Y en 2007 saliÃƒÂ³ el sexto llamado &quot;The Meanest of Times&quot; el cual contiene uno de sus mejores temas llamado &quot;State of Massachusetts&quot; que estÃƒÂ¡ teniendo mucho ÃƒÂ©xito.\n    * Do or Die (1998)\n    * The Gang's All Here (1999)\n    * Sing Loud Sing Proud (2001)\n    * Blackout (2003)\n    * The Warrior's Code (2005)\n    * The meanest of Times (2007)\n","torrent":{"xt":"urn:btih:78b9400a65580cce95a9479e3bc4e4ba07f4e3cc","amp;dn":"Dropkick+Murphys+%5BDiscografia%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78b9400a65580cce95a9479e3bc4e4ba07f4e3cc","infoHashBuffer":{"type":"Buffer","data":[120,185,64,10,101,88,12,206,149,169,71,158,59,196,228,186,7,244,227,204]},"announce":[],"urlList":[]}}