{"title":"Front 242 - Front By Front","uid":5194216,"size":469550483,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:790453abad663034da632bbe58dbcbb916e5190d&amp;dn=Front+242+-+Front+By+Front&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":18,"time":1259854111,"description":"With 'Front by Front' Front 242 made a giant leap forward. Combining hard, EBM beats to politically motivated lyrics, this album served both as a 'how to' to other bands in making aggressive dance music, and also as a statement in its own right.\n\nMany will know 'Headhunter' as the album's centrepiece and highlight, but there is much more to admire here. 'Circling Overland' is as ominous as it sounds, all forboding bass and dense electronics layering a song about war and aerial attacks by bomber planes. 'First In First Out' shows they could also make modern, more commercial sounding dance music if they really wanted to and what is more, it sounded much better than most other groups' efforts, and also was ahead of many other groups in making that kind of music.\n\n'Never Stop' is a classic Front 242 song. Much more accessible than much of 242's work, it features a strong beat and shifting bass combining it into a strong, dance song.\n\nOf course 'Headhunter' is the star and there is two versions of it on here.\n\nA band at their peak making strong, excellent aggressive dance music. This is a must have for fans of the EBM/hard dance genre. ","torrent":{"xt":"urn:btih:790453abad663034da632bbe58dbcbb916e5190d","amp;dn":"Front+242+-+Front+By+Front","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"790453abad663034da632bbe58dbcbb916e5190d","infoHashBuffer":{"type":"Buffer","data":[121,4,83,171,173,102,48,52,218,99,43,190,88,219,203,185,22,229,25,13]},"announce":[],"urlList":[]}}