{"title":"SecondlÃƒÂ¸itnanten (1993) [NTSC] Engl.hardsub","uid":4299252,"size":731985920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:797885e2912bbea594627e3cf1105e18bc0060cd&amp;dn=Secondl%C3%83%C2%B8itnanten+%281993%29+%5BNTSC%5D+Engl.hardsub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mesothorax","files":1,"time":1216202749,"description":"[NTSC, og videokvaliteten i denne DVD-overfÃƒÂ¸ringa er litt uskarp]\n\nSecondlÃƒÂ¸itnanten er en norsk film produsert i 1993, filmen er regissert av Hans Petter Moland.\n\nFilmen handler om den pensjonerte skipskapteinen og secondlÃƒÂ¸itnant Thor Espedal (spilt av Espen SkjÃƒÂ¸nberg) som melder seg til tjeneste igjen rett etter den tyske okkupasjonen av Norge, 9. april 1940. Den aldrende Espedal mÃƒÂ¸ter til tjeneste for ÃƒÂ¥ slÃƒÂ¥ss mot tyskerne, men defaitismen rÃƒÂ¥der blant de norske offiserene og de norske styrkene overgir seg uten kamp. Espedal organiserer da ny motstand og tar i bruk kreative gerilja-metoder for ÃƒÂ¥ stoppe den tysk fremrykkingen. Etter flere suksessfulle trefninger blir han humoristisk forfremmet til second-oberst, men mÃƒÂ¥ til slutt overgi seg og sin lille avdeling under trussel om tilintetgjÃƒÂ¸relse og represalier fra en stor tysk overmakt.\n\nFilmen bygger lÃƒÂ¸slig pÃƒÂ¥ Thor Olaf Hannevig og hans improviserte motstand mot tyskerne med Ã‚Â«IR-3Ã‚Â» rundt Vinje i Indre Telemark i april og mai 1940. Filmen fremstiller ikke disse hendelsene historisk korrekt, men gir et bilde av de kaotiske kampene som utspant seg mange steder i SÃƒÂ¸r-Norge i april 1940. Store norske avdelinger kapitulerte uten ÃƒÂ¥ ha lÃƒÂ¸snet skudd blant annet i Setesdal og pÃƒÂ¥ Heistadmoen ved Kongsberg.\n\n[Wikipedia]\n\n_____________________________________________\nThe old sea-captain retires, but the next day German WWII occupation of Norway begins. He then kisses his wife good-bye and is off to Army HQ. There he finds a lack of leadership and morale that offends him. They even laugh at him and his out-dated uniform and officer-rank. Secondloitnanten then finds and leads his private troop of volunteers against the German attack. The movie tells the story of a man that refuses to give up, even when everybody else leaves. He will fight for the country he loves and do his duty.  ","torrent":{"xt":"urn:btih:797885e2912bbea594627e3cf1105e18bc0060cd","amp;dn":"Secondl%C3%83%C2%B8itnanten+%281993%29+%5BNTSC%5D+Engl.hardsub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"797885e2912bbea594627e3cf1105e18bc0060cd","infoHashBuffer":{"type":"Buffer","data":[121,120,133,226,145,43,190,165,148,98,126,60,241,16,94,24,188,0,96,205]},"announce":[],"urlList":[]}}