{"title":"Bauhaus 24 Bit Vinyl Pack","uid":9626607,"size":2289574644,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79d127028fcaa20be7e758af295adaa0c61b9070&amp;dn=Bauhaus+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1392601357,"description":"\n  Bauhaus 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Gothic Rock, Post-Punk\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 KHz\n\n  1981 Mask - Beggars Banquet BEGA 29 (UK)\n  1981 In the Flat Field - 4AD CAD 2901 2013 Remaster (US)\n  1983 Burning from the Inside - A&amp;M Records SP-4953 (US)\n\n  Bauhaus are the founding fathers of goth rock, creating a minimalistic, overbearingly gloomy style of post-punk rock driven by jagged guitar chords and cold, distant synthesizers. Throughout their brief career, the band explored all the variations on their bleak musical ideas, adding elements of glam rock, experimental electronic rock, funk, and heavy metal. While their following has never expanded beyond a cult, they kept their cult alive well into the '90s, a full decade after they disbanded.\n\n  The group formed in 1978 in Northampton, England. Guitarist/vocalist Daniel Ash, bassist/vocalist David J (born David Jay Haskins), and drummer Kevin Haskins had played together as a trio called the Craze before forming Bauhaus with vocalist Peter Murphy. Originally, the band was called Bauhaus 1919 after the German art movement; by 1979, they had dropped the 1919 from their name.\n\n  In August of 1979, the group released their debut single, &quot;Bela Lugosi's Dead,&quot; on the independent record label Small Wonder Records. Although it did not make the pop charts, it became the de facto goth rock anthem, staying in the U.K. independent charts for years. Three months later, the group signed with Beggars Banquet's subsidiary label, 4AD. The group's second single, &quot;Dark Entries,&quot; was released in January 1980. Following their first European tour, Bauhaus released their third single, &quot;Terror Couple Kill Colonel,&quot; in the summer of that year, which became a hit on the indie charts.\n\n  After touring America for the first time in September, the group released a version of T. Rex's &quot;Telegram Sam.&quot; In October, they released their debut album, In the Flat Field, which reached number one on the independent charts and number 72 on the pop charts. The success of the album led to their first hits on the pop charts; both &quot;Kick in the Eye&quot; and &quot;The Passion of Lovers&quot; made the U.K. Top 60 in 1981. In October, they released their second album, Mask, which revealed a more ambitious musical direction; the new direction, which featured elements of metal and electronic sonic textures, made the music more accessible without abandoning the dark, foreboding core of their music. Mask was a commercial success, peaking at number 30 on the U.K. charts.","torrent":{"xt":"urn:btih:79d127028fcaa20be7e758af295adaa0c61b9070","amp;dn":"Bauhaus+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d127028fcaa20be7e758af295adaa0c61b9070","infoHashBuffer":{"type":"Buffer","data":[121,209,39,2,143,202,162,11,231,231,88,175,41,90,218,160,198,27,144,112]},"announce":[],"urlList":[]}}