{"title":"Voodoo Child - Illustrated Legend Of Jimi Hendrix + CD","uid":4429816,"size":170787865,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:79d3de3c2030c3368598758b55d22ec6f4fdb80a&amp;dn=Voodoo+Child+-+Illustrated+Legend+Of+Jimi+Hendrix+%2B+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mmdsx","files":-1,"time":1223227136,"description":"Note: For more than a month I wasn't able to upload .torrent files to TPB.\nNow that I am, I'll be uploading my other comic torrents here, hope you like 'em\n\n\nVoodoo Child - Illustrated Legend Of Jimi Hendrix - Original English version by Penguin Studios.\nVoodoo Child - La Leyenda De Jimi Hendrix - Spanish translation by Glenat.\n\n\n&quot;This is a graphic docudrama, an account in comic-strip format of the turbulent life of rock star Jimi Hendrix. Like a cinematic docudrama, it hews to the events of Hendrix's career but creates dialogue and uses various devices--notably, snippets of Hendrix's lyrics as commentary on the action at appropriate moments--to heighten the drama of the guitarist's colorful life. Unfortunately, the events themselves are overly familar to most rock fans, and their treatment here generally falls into rock-star cliches. The banality of much of the imagined dialogue, which frequently lapses into sixties-speak (&quot;Far out,&quot; &quot;Dig it man&quot; ), doesn't help. The project is saved, however, because it marks the return to comics of one of the medium's most innovative artists, Bill Sienkiewicz, who's been largely absent from the field for several years. His imaginative, evocative full-color illustrations and narrative mastery supply much-needed substance that turns a rock-bio-in-comics into a genuinely compelling package.&quot;\n\n&quot;La leyenda de Jimi Hendrix. Un excitante viaje poÃƒÆ’Ã‚Â©tico como un solo de guitarra o una de sus actuaciones a corazÃƒÆ’Ã‚Â³n abierto. Un recorrido por el tiempo de Hendrix quien elevÃƒÆ’Ã‚Â³ el rock and roll a un nivel de virtuosismo tÃƒÆ’Ã‚Â©cnico e innovaciÃƒÆ’Ã‚Â³n creativa hasta entonces desconocido. Letras de canciones, cartas, comentarios,... un entramado de texto e imÃƒÆ’Ã‚Â¡genes de la mano de Bill Sienkiewicz.&quot;\n\nThis original graphic novel was created and produced by Martin I. Green, the original script was written by Jeff Young and it was illustrated by the always superb Bill Sienkiewicz. It was first published in 1995 by Viking Penguin.\n\nEsta novela grÃƒÆ’Ã‚Â¡fica fue creada y producida por Martin I. Green, con guÃƒÆ’Ã‚Â³n original de Jeff Young y fue ilustrada por el siempre magnÃƒÆ’Ã‚Â­fico Bill Sienkiewicz. La versiÃƒÆ’Ã‚Â³n en espaÃƒÆ’Ã‚Â±ol fue publicada por Glenat en el aÃƒÆ’Ã‚Â±o 2006.\n\n-------------------------------------------\n\nJimi By Himself - The Home Recordings\n\n\n\nThe original graphic novel included a free CD with six of Jimi's home recordings from 1968, that were previously available only as a bootleg. I took the liberty of including the six songs in mp3 format (192 kbps). If there's enough interest, I can post an APE lossless version of this recording that I found in another network.\n\nLa novela grÃƒÆ’Ã‚Â¡fica original incluÃƒÆ’Ã‚Â­a un disco compacto grÃƒÆ’Ã‚Â¡tis con seis grabaciones caseras de Jimi en 1968. mismas que solo circulaban como bootlegs o ediciones piratas antes de estar disponibles en esta publicaciÃƒÆ’Ã‚Â³n. Me tomÃƒÆ’Ã‚Â© la libertad de incluir las seis canciones en formato mp3 (192 kbps). Si hay suficiente interÃƒÆ’Ã‚Â©s, puedo crear un torrent con esta grabaciÃƒÆ’Ã‚Â³n en formato APE lossless que encontrÃƒÆ’Ã‚Â© en otra red P2P.\n\nTracklist / Lista de pistas\n\n1 - 1983... A Merman I Should Turn to Be - 7:47 min\n2 - Angel - 3:24 min\n3 - Cherokee Jam - 3:15 min\n4 - Hear My Train A'Comin - 2:06 min\n5 - Voodoo Chile--Cherokee Mist - 9:12\n6 - Gypsy Eyes - 3:09 *\n* In the last track, Gypsy Eyes, a phone ringing can be heard. Jimi just keeps playing and ignores it absolutely.\n\nTechnical info / InformaciÃƒÆ’Ã‚Â³n tÃƒÆ’Ã‚Â©cnica\n\nCombined Size: 39.74 MB (13% of original, 7 to 1 compression)\nOriginal Size: 292.01 MB\nCombined Length: 28 minutes 55 seconds\nChannels: 2 (stereo)\nSample Rate: 44.1 KHz;\nSample Size: 16 bit\nAverage Bit Rate: 192 kbps\n\n--------------------------\n\nThe content of this torrent / El contenido de este torrent\n\nVoodoo Child - Illustrated Legend Of Jimi Hendrix.cbr\nVoodoo Child - La Leyenda De Jimi Hendrix (By Batty CRG).cbr\nJimi By Himself - The Home Recordings (Mp3 192kbps)\n\nNOTE: If you want to download the English version (or just the music), most recent torrent clients have the &quot;cherry-pick&quot; option enabled.\nNOTA: Si deseas descargar solo la versiÃƒÆ’Ã‚Â³n en EspaÃƒÆ’Ã‚Â±ol (ÃƒÆ’Ã‚Â³ sÃƒÆ’Ã‚Â³lo la mÃƒÆ’Ã‚Âºsica), la mayorÃƒÆ’Ã‚Â­a de las aplicaciones de manejo de torrents recientes permiten la descarga selectiva de archivos.","torrent":{"xt":"urn:btih:79d3de3c2030c3368598758b55d22ec6f4fdb80a","amp;dn":"Voodoo+Child+-+Illustrated+Legend+Of+Jimi+Hendrix+%2B+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d3de3c2030c3368598758b55d22ec6f4fdb80a","infoHashBuffer":{"type":"Buffer","data":[121,211,222,60,32,48,195,54,133,152,117,139,85,210,46,198,244,253,184,10]},"announce":[],"urlList":[]}}