{"title":"The Israel Lobby and U.S. Foreign Policy {BBS}","uid":6862066,"size":9222608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79ed01009341577c4ba2d4b7b4e6e687d98401ee&amp;dn=The+Israel+Lobby+and+U.S.+Foreign+Policy+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322936382,"description":"The Israel Lobby,&quot; by John J. Mearsheimer of the University of Chicago and Stephen M. Walt of Harvard's John F. Kennedy School of Government, was one of the most controversial articles in recent memory. Originally published in the London Review of Books in March 2006, it provoked both howls of outrage and cheers of gratitude for challenging what had been a taboo issue in America: the impact of the Israel lobby on U.S. foreign policy.\n \nNow in a work of major importance, Mearsheimer and Walt deepen and expand their argument and confront recent developments in Lebanon and Iran. They describe the remarkable level of material and diplomatic support that the United States provides to Israel and argues that this support cannot be fully explained on either strategic or moral grounds. This exceptional relationship is due largely to the political influence of a loose coalition of individuals and organizations that actively work to shape U.S. foreign policy in a pro-Israel direction. Mearsheimer and Walt provocatively contend that the lobby has a far-reaching impact on America's posture throughout the Middle East--in Iraq, Iran, Lebanon, and toward the Israeli-Palestinian conflict--and the policies it has encouraged are in neither America's national interest nor Israel's long-term interest. The lobby's influence also affects America's relationship with important allies and increases dangers that all states face from global jihadist terror.\n \nWriting in The New York Review of Books, Michael Massing declared, &quot;Not since Foreign Affairs magazine published Samuel Huntington's 'The Clash of Civilizations?' in 1993 has an academic essay detonated with such force.&quot; The publication of The Israel Lobby and U.S. Foreign Policy is certain to widen the debate and to be one of the most talked-about books of the year.\n\n\n# Paperback: 496 pages\n# Publisher: Farrar, Straus and Giroux; 1st edition (September 2, 2008)\n# Language: English\n# ISBN-10: 0374531501\n# ISBN-13: 978-0374531508","torrent":{"xt":"urn:btih:79ed01009341577c4ba2d4b7b4e6e687d98401ee","amp;dn":"The+Israel+Lobby+and+U.S.+Foreign+Policy+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79ed01009341577c4ba2d4b7b4e6e687d98401ee","infoHashBuffer":{"type":"Buffer","data":[121,237,1,0,147,65,87,124,75,162,212,183,180,230,230,135,217,132,1,238]},"announce":[],"urlList":[]}}