{"title":"Ray Donovan.S01E07.720p.HDTV.DD5.1.x264(NLsub)sharky-TBS","uid":8979945,"size":1715870966,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7ae2e9094e7daecefa07998a04d916b08825363e&amp;dn=Ray+Donovan.S01E07.720p.HDTV.DD5.1.x264%28NLsub%29sharky-TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sharky57","files":-1,"time":1380537864,"description":"Ray Donovan.S01E07.720p.HDTV.DD5.1.x264(NLsub)sharky-TBS\n\n\n\n\n\n\n\nRay Donovan is een Amerikaanse dramaserie van de zender Showtime. De serie ging juni 2013 in premiere.\n\nRay Donovan is professionele fixer voor de rijke en bekende mensen in LA. \nHij kan er voor zorgen dat elk probleem verdwijnt behalve de problemen die worden veroorzaakt door zijn eigen familie. \nOok Jon Voight en Elliot Gould spel en hierin een rol.\n\n\n\nRay Donovan is een reeks van Southland.bedenkster Ann Biderman en Mark Gordon. \nHoofdrollen in de reeks zijn er voor Liev Schreiber, Paula Malcomson, Jon Voight, Eddie Marsan, Sash Mihok en Peter Jacobson. \nDe regie van de pilootaflevering lag in handen van Allen Coulter, de man die eerder al regisseur was voor Damages, \nSons of Anarchy en Nurse Jackie.\n\n\n\nEpisode.07. New Birthday\n\n\nRay Donovan is een donker familiedrama dat draait rond een manusje.van.alles die voor de rijkelui uit L.A. hun problemen probeert op te lossen. \nDaarbij komt Ray vaak hun diepste geheimen te weten. \nMaar terwijl het hem professioneel voor de wind gaat, is hij thuis minder sterk om de problemen op te lossen. \nZijn vrouw Abby heeft moeite om zich aan te passen aan het drukke leventje van Hollywood. \nZijn oudste broer Terry is dan weer een voormalige bokser die lijdt aan de ziekte van Parkinson. \nToch weerhoudt dit Terry niet om nieuwe talenten te blijven trainen. \nRay's jongste broer Bunchy werd dan weer in zijn jonge jaren seksueel misbruikt, iets wat Bunchy nog steeds niet verwerkt heeft \nen met hulp van alcohol probeert te vergeten. \nDe gemoederen lopen hoog op in de familie wanneer pater familias Micky Donovan na een jarenlange gevangenisstraf \nterug contact wilt opnemen met zijn zonen.\n\n\nRay heads for Boston to track down Sully with a very generous offer. \nTracking Sully proves to be more difficult than expected. Rays past re-emerges as Agent Miller moves forward \nwith his investigation into the murder for which Mickey was framed. \nFor this Miller requests a witness testimony from Sean Walker - though Mickey has other things on his mind when he meets with Walker. \nAs the investigation moves on, Frank receives some interesting videos that will cause problems for Agent Miller. \nTension between Ray and his family builds as Marvin brings up Rays knowledge of ...\n \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2249007/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2249007/&lt;/a&gt;\n\n\n\n\n\t\tinfo\n\n\n\tAudio\t\t: Engels DD 5.1\n\tBewerking\t: Savales\n\tSubs\t\t: NL\n\tVertaling\t: S1l3nc0r, Seba28, TinusTussengas &amp; wgm50\n\tControle\t: TinusTussengas &amp; Quetsbeek.\n\n\n\n\n\t\nmet dank aan savales\n\n\nVeel plezier gewenst met deze film \n\nHave fun with this movie \n\n\n\n\neen bedankje wordt altijd graag ontvangen!!\n\nuploaded by sharky\n\n","torrent":{"xt":"urn:btih:7ae2e9094e7daecefa07998a04d916b08825363e","amp;dn":"Ray+Donovan.S01E07.720p.HDTV.DD5.1.x264%28NLsub%29sharky-TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ae2e9094e7daecefa07998a04d916b08825363e","infoHashBuffer":{"type":"Buffer","data":[122,226,233,9,78,125,174,206,250,7,153,138,4,217,22,176,136,37,54,62]},"announce":[],"urlList":[]}}