{"title":"First Aid (gnv64)","uid":7280347,"size":7556565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b1f0a65321dd0b2b6c9fbf332f28f84280a0dd7&amp;dn=First+Aid+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1337419541,"description":"First Aid\nBy V.M.Buyanov\nTranslated from the Russian by Elena Koltsova\nMir Publishers | 1985 | ISBN - N/A | PDF | 230 pages | 7.2 mb\nscanned to PDF by me\n\nFirst aid is a combination of the emergency medical measures used in case of sudden ill-ness or accident. The first aid rendered on the spot or as the victim is being transported to medical facilities may vary and is classified as follows:\n(1) unskilled first aid rendered by a layman who often has none of the necessary means or medicines;\n(2) qualified first aid (before the arrival of a doctor) rendered by a specially trained medical worker (medical technician&quot;, nurse, laboratory or dental technician);\n(3) first aid rendered by a doctor who has the necessary instruments, apparatus, medicines, blood and blood substitutes, and so on at his disposal.\nThe textbook deals with general concepts and essentials of First Aid in various accidents and sudden illnesses. General problems discussed in the book include the concepts of asepsis and antisepsis, the principles of applying bandages and basic aspects and methods of resuscitation. First Aid in haemorrhages, wounds, injuries to the soft tissues and bones, electric shock, heat- and sun-stroke, poisoning, acute surgical and non-surgical diseases, and emergency labour are dealt with in detail.\n\nCONTENTS\nIntroduction 9\nChapter I. Essentials of Antisepsis and Asepsis 13\nChapter 2. Techniques for Applying Bandages 31\nChapter 3. General Principles for Rendering First Aid 54\nChapter 4. Shock 75\nChapter 5. Principles and Methods of Resuscitation 80\nChapter 6. First Aid for Haemorrhages 101\nChapter 7. First Aid in Wounds Wounds 125\nChapter 8. First Aid in Injuries to the Soft Tissues, Joints and Bones 138\nChapter 9. First Aid for Burns and Frostbite 152\nChapter 10. First Aid for Accidents and Sudden Illness 161\nChapter 11. Care of Patients: Elements of Rendering First Aid 200\nSupplement 1. Table of Common Poisons and Their Antidotes 206\nSupplement 2. Specific (Antidote) Treatment of Acute Poisoning 211\nSupplement 3. Hypothetical Situations for Studying the Principles of First Aid: Tasks for Self-control 214\nSubject Index 224","torrent":{"xt":"urn:btih:7b1f0a65321dd0b2b6c9fbf332f28f84280a0dd7","amp;dn":"First+Aid+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b1f0a65321dd0b2b6c9fbf332f28f84280a0dd7","infoHashBuffer":{"type":"Buffer","data":[123,31,10,101,50,29,208,178,182,201,251,243,50,242,143,132,40,10,13,215]},"announce":[],"urlList":[]}}