{"title":"THE WAY WE'RE WORKING ISN'T WORKING - Tony Schwartz","uid":8772579,"size":361108681,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7ba2eab99ca8a5a2cb7be4ce0c50236e4ba36515&amp;dn=THE+WAY+WE%27RE+WORKING+ISN%27T+WORKING+-+Tony+Schwartz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"leopardog","files":1,"time":1375487758,"description":"The Way We're Working Isn't Working: How Intense Focus and Frequent Renewal Fuel Great Performance\nby Tony Schwartz\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/B003NGXOO2/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/B003NGXOO2/4353-20&lt;/a&gt;\n\nThe Way We're Working Isn't Working is one of those rare books with the power to profoundly transform the way we work and live.\n\nDemand is exceeding our capacity. The ethic of &quot;more, bigger, faster&quot; exacts a series of silent but pernicious costs at work, undermining our energy, focus, creativity, and passion. Nearly 75 percent of employees around the world feel disengaged at work every day.\n\nThe Way Were Working Isnt Working offers a groundbreaking approach to reenergizing our lives so were both more satisfied and more productive, on the job and off. By integrating multidisciplinary findings from the science of high performance, Tony Schwartz, coauthor of the number-one best-selling The Power of Full Engagement, makes a persuasive case that were neglecting the four core needs that energize great performance: sustainability (physical); security (emotional); self-expression (mental); and significance (spiritual). Rather than running like computers at high speeds for long periods, we're at our best when we pulse rhythmically between expending and regularly renewing energy across each of our four needs.\n\nOrganizations undermine sustainable high performance by forever seeking to get more out of their people. Instead they should seek systematically to meet their four core needs so they're freed, fueled, and inspired to bring the best of themselves to work every day.\n\nDrawing on extensive work with an extraordinary range of organizations, among them Google, Ford, Sony, Ernst &amp; Young, Shell, IBM, the Los Angeles Police Department, and the Cleveland Clinic, Schwartz creates a road map for a new way of working.","torrent":{"xt":"urn:btih:7ba2eab99ca8a5a2cb7be4ce0c50236e4ba36515","amp;dn":"THE+WAY+WE%27RE+WORKING+ISN%27T+WORKING+-+Tony+Schwartz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ba2eab99ca8a5a2cb7be4ce0c50236e4ba36515","infoHashBuffer":{"type":"Buffer","data":[123,162,234,185,156,168,165,162,203,123,228,206,12,80,35,110,75,163,101,21]},"announce":[],"urlList":[]}}