{"title":"John Horne - A Companion to World War I (2012)","uid":10741476,"size":5012004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c3b7f5569abb853e9f20ec86b1bc1d8477220b5&amp;dn=John+Horne+-+A+Companion+to+World+War+I+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SectorVector","files":-1,"time":1407758139,"description":"\nA Companion to World War I\n\nby John Horne.\n\n# ISBN-13: 978-1119968702\n# Wiley-Blackwell; 1 edition\n# Published: January 2012\n# 724 pages (PDF)\n\n\nA Companion to the First World War brings together an international team of distinguished historians who provide a series of original and thought-provoking essays on one of the most devastating events in modern history.\n\n- Comprises 38 essays by leading scholars who analyze the current state\n  of historical scholarship on the First World War \n\n- Provides extensive coverage spanning the pre-war period, the military \n  conflict, social, economic, political, and cultural developments, and\n  the war's legacy \n\n- Offers original perspectives on themes as diverse as strategy and tactics,\n  war crimes, science and technology, and the arts \n\n- Selected as a 2011 Outstanding Academic Title by CHOICE\n\n\n\nFrom the Back Cover\n===================\n\nA Companion to the First World War brings together a team of distinguished historians from 10 countries who contribute 38 substantial and thought-provoking chapters. The volume opens with a section on the state of the world before 1914, as it prepared for war without anticipating its true nature, and concludes with an examination of the conflict's military, diplomatic, and cultural legacies. In addition to covering the military history of the war and the individual states involved, contributors explore major themes such as war crimes, occupations, film, and gender.\n\n\nReflecting the latest historical research, this Companion enriches our understanding of the origins, nature, and impact of what remains one of the most devastating events in modern history.\n\n\n\n-_-\n","torrent":{"xt":"urn:btih:7c3b7f5569abb853e9f20ec86b1bc1d8477220b5","amp;dn":"John+Horne+-+A+Companion+to+World+War+I+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c3b7f5569abb853e9f20ec86b1bc1d8477220b5","infoHashBuffer":{"type":"Buffer","data":[124,59,127,85,105,171,184,83,233,242,14,200,107,27,193,216,71,114,32,181]},"announce":[],"urlList":[]}}