{"title":"The Art of Deception: Controlling the Human Element of Security","uid":4434413,"size":5446842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c68770014c6345078a1c9ca99bee645dea55823&amp;dn=The+Art+of+Deception%3A+Controlling+the+Human+Element+of+Security&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":2,"time":1223471673,"description":"The Art of Deception: Controlling the Human Element of Security- Kevin Mitnick\n\n&quot;Mitnick is the most famous computer hacker in the world. Since his first arrest in 1981, at age 17, he has spent nearly half his adult life either in prison or as a fugitive. He has been the subject of three books and his alleged 1982 hack into NORAD inspired the movie War Games. Since his plea-bargain release in 2000, he says he has reformed and is devoting his talents to helping computer security. It's not clear whether this book is a means toward that end or a, wink-wink, fictionalized account of his exploits, with his name changed to protect his parole terms. Either way, it's a tour de force, a series of tales of how some old-fashioned blarney and high-tech skills can pry any information from anyone. As entertainment, it's like reading the climaxes of a dozen complex thrillers, one after the other. As a security education, it's a great series of cautionary tales; however, the advice to employees not to give anyone their passwords is bland compared to the depth and energy of Mitnick's descriptions of how he actually hacked into systems. As a manual for a would-be hacker, it's dated and nonspecific better stuff is available on the Internet but it teaches the timeless spirit of the hack. Between the lines, a portrait emerges of the old-fashioned hacker stereotype: a socially challenged, obsessive loser addicted to an intoxicating sense of power that comes only from stalking and spying.&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!\n\n","torrent":{"xt":"urn:btih:7c68770014c6345078a1c9ca99bee645dea55823","amp;dn":"The+Art+of+Deception%3A+Controlling+the+Human+Element+of+Security","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c68770014c6345078a1c9ca99bee645dea55823","infoHashBuffer":{"type":"Buffer","data":[124,104,119,0,20,198,52,80,120,161,201,202,153,190,230,69,222,165,88,35]},"announce":[],"urlList":[]}}