{"title":"PMDG 777 300 Er torrent","uid":10597591,"size":135627296,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7cb544204f76670b2bc7b17833b4fee28665cb99&amp;dn=PMDG+777+300+Er+torrent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FridgyCZE","files":1,"time":1405876171,"description":"PMDG 777 300 ER cracked thanks to @FSX_2014 for torrent and @asgrad_x for crack:\n\nExperience an airliner simulation unlike any in the history of simulation with this feature rich and magnificently detailed simulation of the Boeing 777-300ER. Packed with detail, authenticity and a plethora of options to keep you learning and experiencing new avenues of flight simulation flying. \n\nCreated by experts for the enjoyment of experts, the PMDG 777-300ER Expansion Package will please new flight simulation enthusiasts looking for their first true airliner experience while it simultaneously thrills experienced simmers looking for the kind of depth and authenticity that only PMDG can provide. \n\nWhether your desire is to &quot;push up the power and go flying&quot; or to dig deeply into the most obscure details of the 777 airplane, the PMDG 777-300ER Expansion Package will give you the longest 777 airplane made by Boeing, with a level of realism as high as you could want in an airliner package. \n\nThe PMDG 777-300ER Expansion Package spares no detail with incredibly accurate cockpit displays, a full-featured flight management system, highly accurate LNAV/VNAV and auto-thrust modes, precise and realistic ground and satellite approach navigation capability, dozens upon dozens of optional pieces of equipment with which you can customize your 777 cockpit and literally hundreds of potential mechanical failure scenarios that you can activate to challenge your flying skills and your airplane knowledge. \n\nBuilt from the ground up as a completely new generation of simulator, PMDG has once again raised the bar on visual quality with an incredibly detailed, accurate and functional virtual cockpit, hundreds of switch animations along with their accompanying sounds, a visually stunning exterior model accurate to the finest detail. The PMDG 777-300ER includes numerous new features including a ground movement camera system to help keep your wheels on the taxiway, a tailskid option, larger GE90-115BL1 engines, and fully animated cantilevered main landing gear trucks. \n\nWith all of this incredible detail comes incredible performance as the PMDG 777-300ER has been optimized for best performance in Flight Simulator X. \n\nThis product contains the 777-300ER expansion package for use with the PMDG 777-200LR/F Base Package in FSX. The aircraft performance and operating characteristics for each type of aircraft is unique and highly accurate to their real-world counterparts. \n\nA compliment of free liveries is available through PMDG Operations Center as always!","torrent":{"xt":"urn:btih:7cb544204f76670b2bc7b17833b4fee28665cb99","amp;dn":"PMDG+777+300+Er+torrent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cb544204f76670b2bc7b17833b4fee28665cb99","infoHashBuffer":{"type":"Buffer","data":[124,181,68,32,79,118,103,11,43,199,177,120,51,180,254,226,134,101,203,153]},"announce":[],"urlList":[]}}