{"title":"The Happenings - Greatest Golden Hits (2001)","uid":8632054,"size":274804331,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7cbda8bdbce347dbdd480eeb39f10d4e04fa52fd&amp;dn=The+Happenings+-+Greatest+Golden+Hits+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":27,"time":1372652931,"description":"This is the same torrent that was uploaded to Demonoid in September 2008.\n\n\nThe Happenings - Greatest Golden Hits (1969) [2001]\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41XGHNVM6CL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41XGHNVM6CL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop.\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBiography from All Music:\n\nThe '60s pop outfit the Happenings enjoyed a three-year run of several hit singles late in the decade. Formed in 1961 in Patterson, NJ, the group has seen their lineup change from time to time, but founding member/lead singer Bob Miranda has been a constant member through it all. Soon after, the Happenings began scoring hit singles, including such number ones as &quot;See You in September&quot; and &quot;I Got Rhythm,&quot; as well as other moderate hits (&quot;Go Away Little Girl,&quot; &quot;My Mammy,&quot; and &quot;Girl on a Swing,&quot; among others). In addition to their singles, the Happenings issued several full-length recordings, including 1966's self-titled debut, 1967's Psycle, and 1969's Piece of Mind, performed on such popular TV shows as The Tonight Show With Johnny Carson, The Smothers Brothers Show, and The Merv Griffin Show, and shared the concert stage alongside such notables as the Beach Boys, Roy Orbison, Joan Rivers, John Denver, the Drifters, and the Kingston Trio, among others. In the '90s, Miranda formed a new version of the Happenings, playing out live alongside members Bob Kulik and George Rizzi.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kpfpxqe5ld0e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kpfpxqe5ld0e&lt;/a&gt;\n\nAll Music Album Review:\n\nThe Happenings, the '60s vocal group known for their updated, four-part harmony arrangements of pop standards, scored a series of hits, starting in the summer of 1966 with their Top Ten revival of the Tempos' 1959 Top 40 hit &quot;See You in September.&quot; The Happenings recorded for fellow vocal group the Tokens' label, B.T. Puppy Records. In the summer of 1968, after they had placed eight singles in the Hot 100, B.T. Puppy issued the 12-track LP Golden Hits!, which collected those eight hits -- &quot;See You in September&quot; and the group's other Top Ten, &quot;I Got Rhythm&quot;; the Top 20 hits &quot;Go Away Little Girl&quot; and &quot;My Mammy&quot;; and the chart entries &quot;Goodnight My Love,&quot; &quot;Why Do Fools Fall in Love,&quot; &quot;Music Music Music,&quot; and &quot;Breaking Up Is Hard to Do&quot; -- as well as three non-charting singles, &quot;Girl on a Swing,&quot; &quot;Randy,&quot; and &quot;Sealed With a Kiss,&quot; and a previously unreleased revival of &quot;Tea for Two.&quot; In 1969, B.T. Puppy switched distributors from Jubilee Records to Warner Bros., and in the shuffle the Happenings ended up on Jubilee. After issuing their Piece of Mind LP, Jubilee decided to compile its own Happenings hits collection and released an album called Greatest Hits that duplicated much of the contents of the previous year's Golden Hits! disc. Fast-forwarding 32 years brings us to this CD reissue on Wounded Bird Records, its tracks licensed from that great repository of old record catalogs, Rhino. Wounded Bird has combined the contents of the Happenings' Golden Hits! and Greatest Hits albums for Greatest Golden Hits, eliminating the many duplications, of course. What is left might easily have been called &quot;Golden Hits! [Bonus Tracks]&quot; since it is actually the 12 tracks from Golden Hits! with a couple more non-charting singles (&quot;Girls on the Go,&quot; &quot;Crazy Rhythm&quot;) and a couple of B-sides (&quot;You're in a Bad Way,&quot; &quot;He Thinks He's a Hero&quot;) added at the end. The Happenings' last chart single, a medley of &quot;Where Do I Go/Be-In/Hare Krishna&quot; from the Broadway musical Hair, released on Jubilee, is not included; all the added tracks are from 1966-68 and were originally released on B.T. Puppy. And with a running time of only 42 minutes, the album cannot be called the best possible single-disc Happenings CD. As of its release in 2001, however, it could be called the only one, and that counts for plenty.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kvftxqq5ld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kvftxqq5ld6e&lt;/a&gt;\n\nReviews and for sale here: &lt;a href=&quot; http://www.amazon.com/dp/B00005B56W&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B00005B56W&lt;/a&gt;\n\nTrack List:\n\n01. I Got Rhythm\n02. Sealed With A Kiss\n03. Breaking Up Is Hard To Do\n04. Go Away Little Girl\n05. Tea For Two\n06. Randy\n07. See You In September\n08. Girl On A Swing\n09. Goodnight My Love\n10. My Mammy\n11. Why Do Fools Fall In Love\n12. Music Music Music\n13. You're In A Bad Way Baby\n14. Girls On The Go\n15. Crazy Rhythm\n16. He Thinks He's A Hero\n","torrent":{"xt":"urn:btih:7cbda8bdbce347dbdd480eeb39f10d4e04fa52fd","amp;dn":"The+Happenings+-+Greatest+Golden+Hits+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cbda8bdbce347dbdd480eeb39f10d4e04fa52fd","infoHashBuffer":{"type":"Buffer","data":[124,189,168,189,188,227,71,219,221,72,14,235,57,241,13,78,4,250,82,253]},"announce":[],"urlList":[]}}