{"title":"Action Comics (2009-10) 880-889 (digital) (OkC.O.M.P.U.T.O.-Novu","uid":10587606,"size":408526171,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7dd641b21b95243e8195f1efc2e542fa0fc3a29e&amp;dn=Action+Comics+%282009-10%29+880-889+%28digital%29+%28OkC.O.M.P.U.T.O.-Novu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1405766091,"description":"\nA Novus Release\n\n\n\n\nThis torrent includes the HD version.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n\n#880  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 41  &quot;Codename: Patriot&quot; Part 2! Nightwing &amp; Flamebird are hot on the trail of the psycho sleepers when they run into another deadly duo--Reactron and Metallo! What do these two want and how does it tie in with General Lane's plans? Meanwhile, Superman and Supergirl arrive on Earth searching for the shooter, but will their actions end up causing more harm than good? And in part 2 of the new co-feature, Captain Atom's memory is falling apart right in the heat of battle--can he keep it together without annihilating an entire town? Luckily a deadly new player is about to take that choice out of his hands--permanently... \n\n#881  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 46  &quot;The Hunt for Reactron&quot; starts here! Spilling out of the stunning finale of &quot;Codename: Patriot,&quot; Supergirl and Flamebird find themselves at each other's throats! What's happened to these two childhood friends to put them at such odds, and can Nightwing calm them down before the situation escalates? And just what are they going to do about all of the guys who are surrounding them? You know, the guys in the tanks? Continued in SUPERGIRL #45! Plus! James Robinson and Greg Rucka's Captain Atom co-feature continues! What is happening to Captain Atom, and more important, what's happening to his mind? Team Breach is on hand to lend some answers, but Atom probably isn't going to like them. \n\n#882  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 48 &quot;The Hunt for Reactron&quot; part 3! Supergirl and Flamebird continue their slugfest, with poor Nightwing caught in the middle! Wait, isn't that man standing over there the same Reactron who murdered Supergirl's dad and Flamebird's surrogate father? Get him! Continued in SUPERGIRL #46... And in the new Captain Atom co-feature, the mystery of where (and when) Captain Atom is heats up when someone with a connection to Metropolis arrives on the scene. But are they friend or foe? \n\n#883  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 55  Since &quot;Codename: Patriot,&quot; Earth's hatred for Kryptonians has only escalated which is what makes it so odd that Nightwing and Flamebird pick now to become public Super Heroes! Meanwhile, Lois Lane finally meets with the man she thought long dead--her father, General Lane. But he has a message to deliver to his journalist daughter: you're either with us or against us.  And in part 5 of the new co-feature, Captain Atom, now back on Earth and knowing the truth about his mission, must face his archenemy, Major Disaster! \n\n#884  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 56 When Lois tries to run the story that will clear Flamebird and Nightwing once and for all, she finds herself blocked at every turn. With the world's anti-Kryptonian sentiment escalating to a near-frenzy, not even being General Lane's daughter will keep her safe! Plus, to the shock and horror of Flamebird, the problems with Nightwing's uncontrolled aging reach a critical juncture! In part 6 of the co-feature, Captain Atom squares off against his old adversary Major Force just as some troubling memories start to resurface--one word: Monarch! \n\n#885  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 57 With a new lease on life, Nightwing and Flamebird return to Metropolis determined to hunt down one of General Zod's few remaining sleeper agents. Continued in SUPERMAN #696! And in the co-feature, Captain Atom is back on Earth, but his struggle to break his ties with Mirabai and Project 7734 aren't over yet. Guest-starring Metropolis's own super-powered protector, Mon-El! \n\n#886  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 60 Nightwing and Flamebird race the clock to capture Jax-Ur, the most dangerous of Zod's sleeper agents. And in the Captain Atom co-feature, our hero explores the horrors of his past with the help of Mon-El and Starfire! \n\n#887  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 61 In this corner - the already beaten, exhausted and bruised Nightwing and Flamebird! And in this corner - the reincarnation of the all-powerful Kryptonian sun god Rao! Place your bets! (Smart money's on the sun god.) And in the co-feature, Captain Atom has to answer for his past sins by fighting the entire Justice League of America single-handedly! \n\n#888  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 62 With Nightwing nowhere in sight, we find Flamebird face-to-face with the rampaging Rao! But can she defeat him by herself? Luckily, it looks like she won't have to! Enter: Wonder Woman and the Justice Society of America! And in the co-feature, Captain Atom discovers that to complete his journey, he must first travel through the lost world of Skartaris! \n\n#889  SUPERMAN: THE COMPLETE NEW KRYPTON SAGA, Part 63 With the fate of both New Krypton and Earth weighing on their young shoulders, are Nightwing &amp; Flamebird prepared to make the ultimate sacrifice? And in the co-feature, Captain Atom has managed to find a way back to Mirabai's world, intent on confronting the woman who made him a tool of destruction--but what stunning revelation awaits him there? \n\n\n\nThanks goes to the OkC.O.M.P.U.T.O for this release.\n","torrent":{"xt":"urn:btih:7dd641b21b95243e8195f1efc2e542fa0fc3a29e","amp;dn":"Action+Comics+%282009-10%29+880-889+%28digital%29+%28OkC.O.M.P.U.T.O.-Novu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd641b21b95243e8195f1efc2e542fa0fc3a29e","infoHashBuffer":{"type":"Buffer","data":[125,214,65,178,27,149,36,62,129,149,241,239,194,229,66,250,15,195,162,158]},"announce":[],"urlList":[]}}