{"title":"Wiseguy - Season 2 [DVDRip] - cOOt","uid":7696878,"size":5504643072,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7dde903ff5de308e35727bb1c3ef3f1a4b67a56a&amp;dn=Wiseguy+-+Season+2+%5BDVDRip%5D+-+cOOt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jerry7_57","files":-1,"time":1349382462,"description":"Vinnie Terranova does time in a New Jersey penitentiary to set up his undercover role as an agent for the OCB (Organized Crime Bureau) of the United States. His roots in a traditional Italian city neighborhood form the underlying dramatic base throughout the series, bringing him into conflict with his conservative mother and other family members while acting undercover as syndicate enforcer. The segments, which ran several shows each, included in-depth and empathetic characterizations of the players on both sides of the law. Scenarios include the underbelly of the recording industry, protection rackets, international arms dealing, foiling white supremacist plotters, uncovering a government conspiracy to set up a compliant new head of state in a third-world country, and Vinnie's final reconciliation with his Italian mother and her new husband, the purely legendary Mafia figure Don Aiupo.\n\n\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0092484/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0092484/&lt;/a&gt;\n\nNotes regarding missing episodes: Unfortunately due to rights issues with the music contained in the show, the 'Dead Dog Records' arc from season 2 is not included on the DVD's. A lot of collectors are refusing to purchase the dvd's because of this but these episodes are free to you. This series is suffering much the same fate as are beloved Cold Case.\n\n\n\nEnjoy the show, and thanks for choosing cOOt torrents!\t","torrent":{"xt":"urn:btih:7dde903ff5de308e35727bb1c3ef3f1a4b67a56a","amp;dn":"Wiseguy+-+Season+2+%5BDVDRip%5D+-+cOOt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dde903ff5de308e35727bb1c3ef3f1a4b67a56a","infoHashBuffer":{"type":"Buffer","data":[125,222,144,63,245,222,48,142,53,114,123,177,195,239,63,26,75,103,165,106]},"announce":[],"urlList":[]}}