{"title":"Chris Pureka - How I Learned to See in the Dark [2010] [FLAC]","uid":8201716,"size":309075257,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e2dae761549935f03e315d621deb155000a5474&amp;dn=Chris+Pureka+-+How+I+Learned+to+See+in+the+Dark+%5B2010%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":25,"time":1362031516,"description":"one of Dicks Americana collection\n\nArtist: Release: How I Learned to See in the Dark\nMusicBrainz: 83fd3095-bfa8-4cd7-b111-b187396f6490\nReleased: 2010-04-13\nLabel: Sad Rabbit Music\nCountry: US\n\nTracklisting:\n\n01. Wrecking Ball (04:09)\n02. Hangman (04:52)\n03. Shipwreck (04:05)\n04. Barn Song (05:03)\n05. Broken Clock (04:40)\n06. Landlocked (04:22)\n07. Song for November (04:30)\n08. Lowlands (03:33)\n09. Time Is the Anchor (05:32)\n10. Damage Control (prelude) (01:10)\n11. Damage Control (04:14)\n12. August 28th (03:58)\n\nHow I Learned To See In The Dark is an honest and direct record that sidles up to you, puts its arm around you, and leads away from whatever you think is important, walks you into a private, pastoral place, sits you down, and looks you in the eye for 50 s\n\nChris Pureka's had it with your bull. You think you're so clever, don't you? With your phones and pods and pads, and your clear expensive drinks, and your tweets and blogs [...] . She does not have the patience to put up with your modern sensibility or your middle-class 'issues' because life is too full of itself far too short to cover everything up with glib sardonicism. Get your heart on your sleeve and get earnest. Ok. I'm listening.\n\nNorthampton MA lets-have-a-seat-and-listen-closely singer Chris Pureka's third LP How I Learned To See In The Dark paws gently at the substance of your melancholy until you're ready to acquiesce. Pureka should be a welcome voice in playlists everywhere, for it is one without pretense, a growing commodity these days. There's not much to think about, and more often than not, that is a wonderful thing.\n\n\n&quot;Wrecking Ball&quot; out of the gate is an immediately catchy slice out of the americana singer/songwriter pie. Hints of blues, hints of alt-country, and beautiful orchestration (the dissonant electric guitar stings are choice) all make for a stand-out song a la Calexico. Pureka is at her best here when she turns up the amps and lets the band play a little louder. Her energy on &quot;Broken Clocks&quot; brings about the album's highlight. Again, the orchestration and collaboration of the ensemble allows Pureka to be boosted by the energy of her backing band. It works in spades. &quot;Broken Clocks&quot; adds a welcome up-beat nature to an often down-trodden collection of minor-key torch songs, laments about expanse, distance, and the unfortunate fact that she's been running around and waiting in this void for a while. \n\nPureka's voice is rather innocuous, but its her economic melodies that breathe over her guitar playing that are worth remarking. If there is a stand-out quality about Pureka, it is her subtle touch and ease on the guitar. Her riffs are dynamic and gentle and fit precisely with the groove of the album. Nothing is ever forced, nothing feels out of place, nothing jars your ears, no eyebrows get crooked. There are very few surprises throughout the album, and when they come, they shine, but otherwise by about half-way through, you get Pureka's number and a sad feeling akin to &quot;didn't we hear this song already?&quot; By the time &quot;Time Is An Anchor&quot;'s maudlin and tired pre-chorus comes in crooning &quot;you just don't know me at all&quot;, I couldn't help but thinking that I actually kind of do.\n\nIt's not until &quot;Damage Control&quot; do we get a sense of her full potential as a solo artist without a drum kit holding her up. Here she transcends mere sincerity and becomes vulnerable. Guitar and voice come together and groove and connect with lyrics that balance passion and poetry.\n\nLike many other right-minded individuals, I've lain in my bed, drank nameless booze, and listened to Ryan Adams' Heartbreaker and thought about life-choices and felt an amazing catharsis at the simplicity and sadness of it all. Sometimes a cliche is not just a useless aphorism, but rather the core of something real. Pureka writes and plays from her core and if you can put down your phone and stop checkingfor a second and give her some time lying in your bed, you'll understand. How I Learned To See In The Dark is an honest and direct record that sidles up to you, puts its arm around you, and leads away from whatever you think is important, walks you into a private, pastoral place, sits you down, and looks you in the eye for 50 straight minutes. Adams analogy notwithstanding, this album doesn't need booze to succeed where Heartbreaker does. How mature. How peaceful.","torrent":{"xt":"urn:btih:7e2dae761549935f03e315d621deb155000a5474","amp;dn":"Chris+Pureka+-+How+I+Learned+to+See+in+the+Dark+%5B2010%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e2dae761549935f03e315d621deb155000a5474","infoHashBuffer":{"type":"Buffer","data":[126,45,174,118,21,73,147,95,3,227,21,214,33,222,177,85,0,10,84,116]},"announce":[],"urlList":[]}}