{"title":"Sandie Shaw - The Very Best of Sandie Shaw  FLAC","uid":5530335,"size":480031310,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e6029cb9e5aa1f0abbd6a5b4f2f67fba44e9e78&amp;dn=Sandie+Shaw+-+The+Very+Best+of+Sandie+Shaw++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"keeybee","files":34,"time":1272905767,"description":"Please seed!\n\nSandie Shaw (born Sandra Ann Goodrich, 26 February 1947) is an English pop singer, who was one of the most successful British female singers of the 1960s. In 1967 she was the first UK act to win the Eurovision Song Contest. She has been described as &quot;the barefoot pop princess of the 1960s&quot;.(Wiki)\n  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Sandie_Shaw&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Sandie_Shaw&lt;/a&gt;\n\n\nSandie Shaw - The Very Best Of Sandie Shaw\nThis compilation 2005 (Digital remaster)\nWith covers\n\n01  Sandie Shaw - The Very Best Of Sandie Shaw - (There's) Always Something There To Remind Me  \n02  Sandie Shaw - The Very Best Of Sandie Shaw - Girl Don't Come  \n03  Sandie Shaw - The Very Best Of Sandie Shaw - I'll Stop At Nothing  \n04  Sandie Shaw - The Very Best Of Sandie Shaw - Long Live Love  \n05  Sandie Shaw - The Very Best Of Sandie Shaw - Message Understood  \n06  Sandie Shaw - The Very Best Of Sandie Shaw - How Can You Tell  \n07  Sandie Shaw - The Very Best Of Sandie Shaw - Tomorrow  \n08  Sandie Shaw - The Very Best Of Sandie Shaw - Nothing Comes Easy   \n09  Sandie Shaw - The Very Best Of Sandie Shaw - Run  \n10  Sandie Shaw - The Very Best Of Sandie Shaw - Think Sometimes About Me  \n11  Sandie Shaw - The Very Best Of Sandie Shaw - I Don't Need Anything  \n12  Sandie Shaw - The Very Best Of Sandie Shaw - Puppet On A String  \n13  Sandie Shaw - The Very Best Of Sandie Shaw - Tonight in Tokyo  \n14  Sandie Shaw - The Very Best Of Sandie Shaw - You've Not Changed  \n15  Sandie Shaw - The Very Best Of Sandie Shaw - Today  \n16  Sandie Shaw - The Very Best Of Sandie Shaw - Together  \n17  Sandie Shaw - The Very Best Of Sandie Shaw - Those Were The Days  \n18  Sandie Shaw - The Very Best Of Sandie Shaw - Monsieur Dupont  \n19  Sandie Shaw - The Very Best Of Sandie Shaw - Think It All Over   \n20  Sandie Shaw - The Very Best Of Sandie Shaw - Heaven Knows I'm Missing Him Now  \n21  Sandie Shaw - The Very Best Of Sandie Shaw - Rose Garden  \n22  Sandie Shaw - The Very Best Of Sandie Shaw - Father And Son  \n23  Sandie Shaw &amp; B.E.F. - The Very Best Of Sandie Shaw - Anyone Who Had A Heart  \n24  Sandie Shaw - The Very Best Of Sandie Shaw - Hand In Glove (Album Version)  \n25  Sandie Shaw - The Very Best Of Sandie Shaw - Are You Ready To Be Heartbroken?  \n26  Sandie Shaw - The Very Best Of Sandie Shaw - Nothing Less Than Brilliant\n","torrent":{"xt":"urn:btih:7e6029cb9e5aa1f0abbd6a5b4f2f67fba44e9e78","amp;dn":"Sandie+Shaw+-+The+Very+Best+of+Sandie+Shaw++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e6029cb9e5aa1f0abbd6a5b4f2f67fba44e9e78","infoHashBuffer":{"type":"Buffer","data":[126,96,41,203,158,90,161,240,171,189,106,91,79,47,103,251,164,78,158,120]},"announce":[],"urlList":[]}}