{"title":"Stephen Baxter - Exultant (Destiny's Children #2)","uid":12722162,"size":548217946,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7e6de59572a4080759e9ce39231a48c8ea68f5b8&amp;dn=Stephen+Baxter+-+Exultant+%28Destiny%27s+Children+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":16,"time":1447005521,"description":"When it comes to cutting-edge science fiction, Stephen Baxter is in a league of his own. His mastery of hard science, his fearlessly speculative imagination, and his ability to combine grand philosophical questions with tales of rousing adventure make him essential reading for anyone concerned with the future of humankind. Now, in Exultant, Baxter takes us to a distant future of dazzling promise and deadly threat, in which a far-flung humanity battles for survival against an implacable alien foe.\r\n\r\n\r\nFor more than twenty thousand years, humans have been at war with the alien race of Xeelee. It is a war fought with armaments so advanced as to be godlike, a war in which time itself has become an ever-shifting battleground. At the cost of billions of lives, and with ruthless and relentless efficiency, the ruling Coalition has pushed the Xeelee back to the galactic core, where the supermassive black hole known as Chandra serves the Xeelee as both fortress and power source.\r\n\r\nThere, along a front millions of light-years long, a grisly stalemate reigns, until a young pilot, Pirius, faced with certain death, disobeys orders and employs an innovative time-travel maneuver that, for the first time in the history of the war, results in the capture of a Xeelee fighter. But far from being hailed as a hero when he returns to base with his prize, Pirius is court-martialed, disgraced, and sentenced to penal servitude on a bleak asteroid.\r\n\r\nIt is not only Pirius who pays the price. In flying into the future and back again, Pirius returned to a time before he’d left, a time inhabited by his younger self. And that younger self, by the pitiless logic of Coalition justice, shares the older Pirius guilt and must be punished. Not everyone in the Coalition agrees. Commissary Nilis believes that the elder Pirius, whom he dubs Pirius Blue, may have found a way to defeat the Xeelee. But Nilis can do nothing for Pirius Blue. Instead, he takes charge of the younger Pirius (Pirius Red), and brings him back to Earth, the capital of a vast empire seething with intrigue.\r\n\r\nThere Pirius Red will discover truths that will shatter his preconceived notions of all that he is fighting for, even of what it means to be human. Pirius Blue, meanwhile, will learn truths harsher and more discomfiting still. Yet the most shocking revelation of all is still to come, waiting for them at a place called Chandra. . . .\r\n\r\n\r\n\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:7e6de59572a4080759e9ce39231a48c8ea68f5b8","amp;dn":"Stephen+Baxter+-+Exultant+%28Destiny%27s+Children+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e6de59572a4080759e9ce39231a48c8ea68f5b8","infoHashBuffer":{"type":"Buffer","data":[126,109,229,149,114,164,8,7,89,233,206,57,35,26,72,200,234,104,245,184]},"announce":[],"urlList":[]}}