{"title":"The Saturdays - Just Cant Get Enough (Video Mix)","uid":5646057,"size":7936580,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7e817001fc4fe5f68690f1a6a76c6fc93f0d01f4&amp;dn=The+Saturdays+-+Just+Cant+Get+Enough+%28Video+Mix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LynnPsycho","files":-1,"time":1277252927,"description":"Artist : The Saturdays\nTitle  : Just Can't Get Enough\nAlbum  : Wordshaker (2009)\n\n\nThe Saturdays are a British/Irish girl group formed in London in 2007, consisting of Frankie Sandford, Mollie King, Vanessa White, Rochelle Wiseman and Una Healy. They made their recording debut in 2008 under the record label Fascination Records, a sub-division of Polydor Records. Their debut album, Chasing Lights, produced four top 10 singles on the UK Singles Chart. The final single &quot;Work&quot; peaked at number 22. The band embarked on their first headlining UK tour, The Work Tour, in June 2009. The band started work on their second album during this tour.[1]\nThe band released their new single &quot;Forever Is Over&quot; on 5 October 2009 which debuted at number #2, being the first single lifted from their new album, Wordshaker, released on 12 October. The album peaked at #9 on the UK Albums Chart, dropping to #40 a week later. Their best selling singles are 'Ego' and 'Up'\n\n\n&quot;Just Can't Get Enough&quot; is the third UK single by Depeche Mode. It was originally released in the UK in September 1981, and was also the band's first single to be released in the United States, on February 18, 1982. The song, a riff-driven Synthpop piece, was the final single to be written by founder member Vince Clarke, who would leave the band in December 1981. The song was included on the band's first album, Speak and Spell, which was released a month after the single.\nThe single version of &quot;Just Can't Get Enough&quot; is the same version that appears on the UK version of Speak and Spell. The 12&quot; single featured a &quot;Schizo Mix&quot;, which is an extended version with a different intro and an ambient tune popping up after the choruses. This version appears on the US version of Speak and Spell, the UK rerelease of Speak and Spell, the rerelease of The Singles (81-85) and Remixes 81 - 04.\nIn addition, the single's B-side &quot;Any Second Now&quot; was the first commercially available Depeche Mode instrumental. It shows up on the UK rerelease of Speak and Spell. A version including vocals (the first Depeche Mode vocals to be handled by Martin Gore) would appear on the album as &quot;Any Second Now (Voices)&quot;. There is also an extended version, the &quot;Altered&quot; Mix. In the United States, the B-side is &quot;Tora! Tora! Tora!&quot;. On the album, the song is crossfaded with the previous track, &quot;Photographic&quot;, but on the single, the introduction is clean.\nThe single reached #8 on the UK Singles Chart and #26 on the US Hot Dance Music/Club Play chart, making it their highest-charting single at the time on both counts. It also became the band's first (and biggest) hit in Australia, reaching #4.\n&quot;Just Can't Get Enough&quot; was the first Depeche Mode song to get a music video. It is the only Depeche Mode video with Vince Clarke. The director was Clive Richardson.\n\n\nPlease seed and enjoy !\n\nLynnPsycho :)","torrent":{"xt":"urn:btih:7e817001fc4fe5f68690f1a6a76c6fc93f0d01f4","amp;dn":"The+Saturdays+-+Just+Cant+Get+Enough+%28Video+Mix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e817001fc4fe5f68690f1a6a76c6fc93f0d01f4","infoHashBuffer":{"type":"Buffer","data":[126,129,112,1,252,79,229,246,134,144,241,166,167,108,111,201,63,13,1,244]},"announce":[],"urlList":[]}}