{"title":"[FS9/FSX] Just Flight - 747-200/300 Serirs F-Lite","uid":7966703,"size":3941338510,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7eb1561c9b259098faa0d486b1c5c64df57d3e3f&amp;dn=%5BFS9%2FFSX%5D+Just+Flight+-+747-200%2F300+Serirs+F-Lite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"_SnakEye","files":-1,"time":1356704176,"description":"747-200/300 Series for FSX and FS2004 is a great addition to our growing F-Lite range, and features highly detailed versions of the regular, combi and cargo 747-200/300 models.\n \nThe 747 is probably the most recognised airliner in the world, with its distinctive hump on the forward fuselage which houses the cockpit as well as the upper passenger deck. Having been in service since the 1970s there can't be many air travellers who haven't flown long distance in this icon of the airways.\n \nThe experts at CLS (Commercial Level Simulations) have worked their magic to design superb models of the 747 in both the -200 and -300 variants, and included in this package are 21 liveries from around the world along with different flight models for the different versions. As well as being superbly modelled, these aircraft are also great to fly without having to learn and operate complex procedural systems.\n \nThe panels features full analogue Pilot, Co-Pilot and Flight Engineer panels, as well as the overhead panel, throttle quadrant and radio stack. The Flight Engineer's station has expanded pop-ups for easier viewing.\n \nA limited function F-Lite FMC allows for SIDs and STARs in the Flight Simulator database, Radio and Navigation frequency entry, V-speed calculation, 'direct to' waypoint features, progress display, estimated fuel on board and more.\n","torrent":{"xt":"urn:btih:7eb1561c9b259098faa0d486b1c5c64df57d3e3f","amp;dn":"%5BFS9%2FFSX%5D+Just+Flight+-+747-200%2F300+Serirs+F-Lite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eb1561c9b259098faa0d486b1c5c64df57d3e3f","infoHashBuffer":{"type":"Buffer","data":[126,177,86,28,155,37,144,152,250,160,212,134,177,197,198,77,245,125,62,63]},"announce":[],"urlList":[]}}