{"title":"Aguirre, der Zorn Gottes","uid":4197107,"size":687108743,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ec4eb18f56b3e62a4c77abc032a07b3a92edb4c&amp;dn=Aguirre%2C+der+Zorn+Gottes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"megalilo","files":5,"time":1211292305,"description":"Aguirre, der Zorn Gottes (1972)\t\n     \nAguirre, the Wrath of God (German: Aguirre, der Zorn Gottes) is an independent 1972 German film written and directed by Werner Herzog. Klaus Kinski stars in the title role. The soundtrack was composed and performed by German progressive/Krautrock band Popol Vuh. Aguirre was given an extensive arthouse theatrical release in the United States in 1977, and remains one of the director&amp;#039;s most famous films.\n\nThe story follows the travels of Spanish soldier Lope de Aguirre, who leads a group of conquistadores down the Amazon River in South America in search of the legendary city of gold, El Dorado. Using a minimalist story and dialogue, the film creates a vision of madness and folly, counterpointed by the lush but unforgiving Amazonian jungle. Although based loosely on what is known of the historical figure of Aguirre, the film&amp;#039;s story line is, as Herzog acknowledged years after the film&amp;#039;s release, a work of imagination. Some of the people and situations may have been inspired by Gaspar de Carvajal&amp;#039;s account of an earlier Amazonian expedition, although Carvajal was not present on the historical voyage represented in the film.\n\nAguirre was the first of five filmic collaborations between Herzog and the volatile Kinski. Herzog knew Kinski would be perfect as the mad Aguirre, but the director and actor had differing views as to how the role should be played, and they clashed throughout the film&amp;#039;s production. Kinski&amp;#039;s legendary angry tantrums terrorized the crew and local natives who assisted the production. The production was shot entirely on location, and was fraught with unusual difficulties. Filming took place in the Peruvian rainforest on the Amazon River during an arduous five week period, shooting on tributaries of the Ucayali region. The cast and crew climbed mountains, cut through heavy vines to open routes to the various jungle locations, and rode treacherous river rapids on rafts built by natives.\n\nAguirre opened to widespread critical acclaim, and quickly developed a large international cult film following. Several critics have declared the film a masterpiece, and it has appeared on Time Magazine&amp;#039;s list of &quot;All Time 100 Best Films&quot;. Aguirre?s visual style and narrative elements would have a strong influence on Francis Ford Coppola&amp;#039;s 1979 film Apocalypse Now.\n\nObs: This rip don&amp;#039;t have english subtitles hardsubed, but there are a english subtitle into the torrent.\n\nIMDB: 8.1/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0068182/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0068182/&lt;/a&gt;","torrent":{"xt":"urn:btih:7ec4eb18f56b3e62a4c77abc032a07b3a92edb4c","amp;dn":"Aguirre%2C+der+Zorn+Gottes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ec4eb18f56b3e62a4c77abc032a07b3a92edb4c","infoHashBuffer":{"type":"Buffer","data":[126,196,235,24,245,107,62,98,164,199,122,188,3,42,7,179,169,46,219,76]},"announce":[],"urlList":[]}}