{"title":"Sandy Posey - Born to Be Hurt - The Anthology 1966-1982 [2004][F","uid":8739547,"size":492547802,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7f60b69a5864bed9abf892387850b07dedfd66d3&amp;dn=Sandy+Posey+-+Born+to+Be+Hurt+-+The+Anthology+1966-1982+%5B2004%5D%5BF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":41,"time":1374750538,"description":"Artist: Sandy Posey\nRelease: Born to Be Hurt - The Anthology 1966-1982\nReleased: 2004\nLabel: Raven\nCatalog#: RVCD-186\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: pop,folk,country\n\n1. Born A Woman\n2. Single Girl\n3. See Ya Round On The Rebound\n4. Here Comes My Baby Back Again\n5. What A Woman In Love Won't Do\n6. Hey Mister\n7. Bread &amp; Butter\n8. Love Of The Common People\n9. I Take It Back)\n10. Standing In The Rain\n11. Sunglasses\n12. Are You Never Coming Home?\n13. . Just You, Just Me (And Love For Company)\n14. One Man Woman\n15. Silly Girl, Silly Boy\n16. Deep In Kentucky\n17. Ways Of The World\n18. Your Conception Of Love\n19. Bring Him Safely Home To Me\n20. Why Don't We Go Somewhere &amp; Love?\n21. Lonesome City Blues\n22. Happy Happy Birthday Baby\n23. Don't\n24. Why Do We Carry On (The Way We Do)\n25. It's Midnight (Do You Know Where Your Baby Is?)\n26. Born To Be With You\n27. Love, Love, Love/Chapel Of Love\n28. Love Is Sometimes Easy\n29. Can't Get Used To Sleeping Without You\n\nAt 29 tracks on a single CD, Raven's 2004 release Born to Be Hurt: The Anthology 1966-1982 is by far the biggest Sandy Posey collection yet released, and it's also the most comprehensive, being the first collection to cover all of her major labels. Prior to this, the two main Posey CDs, Collectables' 1996 release The Best of Sandy Posey and RPM's 2002 disc A Single Girl: The Very Best of the MGM Recordings, covered only her MGM recordings, which admittedly were her most popular work, containing the hit singles &quot;Born a Woman,&quot; &quot;Single Girl,&quot; &quot;I Take It Back,&quot; and &quot;What a Woman in Love Won't Do.&quot; However, her story did not end there. After leaving MGM in 1968, she turned toward country, signed with Columbia, and went through several labels during the '70s -- Monument, Warner, and, finally, Audiograph in the early '80s -- before leaving the music business, and Born to Be Hurt is the first time any of this material has been released on CD. Over half of the CD is still devoted to the MGM recordings, but only ten of those tracks overlap with RPM's collection (and only six overlap with the Collectables release, including &quot;Silly Girl, Silly Boy,&quot; which doesn't appear on A Single Girl), and there's a fair amount of MGM-era songs on the Raven disc that don't appear on RPM, either, which means the hardcore need to have all three in their collections. But for those looking for a single Posey disc in their collections, it comes down to this: A Single Girl focuses on Posey at her peak and is preferable for those who only want her '60s recordings, while Born to Be Hurt gets the nod as an overview and introduction. Her '70s country recordings -- including the two hits &quot;Bring Him Safely Home to Me&quot; and &quot;Why Don't We Go Somewhere and Love,&quot; both included here -- are excellent pieces of country-pop, and while some of the overly clean late-'70s/early-'80s material featured here is a far cry from the dense pop and countrypolitan sound of the '60s and '70s, there are still some strong cuts, like &quot;Why Do We Carry On (The Way We Do),&quot; that make up for the slightly sterile soft rock that ends the collection. Admittedly, it would have been nice if Raven had included some discographical annotation -- it's impossible to tell where or when the 29 tracks were released. Still, Born to Be Hurt is a very welcome release overall -- not only is it the first comprehensive Sandy Posey collection, but it's hard to imagine a disc that covers this same material better than this.","torrent":{"xt":"urn:btih:7f60b69a5864bed9abf892387850b07dedfd66d3","amp;dn":"Sandy+Posey+-+Born+to+Be+Hurt+-+The+Anthology+1966-1982+%5B2004%5D%5BF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f60b69a5864bed9abf892387850b07dedfd66d3","infoHashBuffer":{"type":"Buffer","data":[127,96,182,154,88,100,190,217,171,248,146,56,120,80,176,125,237,253,102,211]},"announce":[],"urlList":[]}}