{"title":"Internet Download Accelerator PRO 5.17.1.1377+Keygen - CORE","uid":9400564,"size":6263338,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7fa2c0b104b9f7a155f7295926fd589e65dbd2d5&amp;dn=Internet+Download+Accelerator+PRO+5.17.1.1377%2BKeygen+-+CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"or1gins","files":4,"time":1388065000,"description":"Internet Download Accelerator is a simple and user-friendly download manager that can significantly increase your file downloading speed. It uses intellectual multi-section download to provide the best possible performance for all connection types. \nThe acceleration is achieved by splitting a file being downloaded into several parts and downloading these parts at the same time. \nIDA resumes downloads, broken due to lost connections, network problems, and computer shutdowns, from where they left off. IDA supports download from HTTP and FTP servers, and can work through proxy-servers.\nTo increase usability it integrates into Internet Explorer to automatically take over your downloads. Also IDA adds a toolbar to Internet Explorer to improve your download experience. \nInternet Download Accelerator will monitor the system clipboard and detect copied URLs. IDA cooperates with your antivirus program to automatically scan files after completing download.\n\nFeatures:\n- intuitive, user-friendly, and customizable user interface; \n- download lists support with rich sorting options;\n- the floating window including download speed indicator, active downloads indicators, cart for dragging links;\n- original Advanced Visual Cart Active Visual Cart technology which lets you to work with IDA without opening the main program window;\n- support for plug-ins;\n- skins support;\n- Fast Update - check for availability of new versions of the program;\n- multilingual support.\n\nWhat's New in Version 5.17 (25th Dec, 2013)\n-Added support for 180p size when downloading from video hosting services; \n-Improved downloading HD-video from video hosting services; \n-Added new connection type for high-speed links; \n-Reworked algorithms for generating extensions; \n-Improved link copy behavior in the download list and in the download history; \n-Improved handling of files which have very long file names (including the path) -exceeding 260 characters; \n-Improved automatic mp3-file renaming using tags; \n-Added ability to rename files with the same size automatically for the current site; \n-Released new IDA plug-in for Firefox allowing to download video and music from any site; \n-Improved integration into Opera 16 and above; \n-Updated extension for Google Chrome; \n-Restored integration into the Internet Explorer 11 context menu; \n-Improved integration into Yandex.Browser; \n-Fixed bug with adding a group of UTF8-encoded links; \n-Fixed bug with not deleting the download when using Shift + Del and if there is no -file on the disk; \n-Fixed bug with deleting two files when using Shift + Del with disabled deletion confirmation dialog; \n-Fixed other minor bugs.","torrent":{"xt":"urn:btih:7fa2c0b104b9f7a155f7295926fd589e65dbd2d5","amp;dn":"Internet+Download+Accelerator+PRO+5.17.1.1377%2BKeygen+-+CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fa2c0b104b9f7a155f7295926fd589e65dbd2d5","infoHashBuffer":{"type":"Buffer","data":[127,162,192,177,4,185,247,161,85,247,41,89,38,253,88,158,101,219,210,213]},"announce":[],"urlList":[]}}