{"title":"Roger Waters The Wall on Tour 2010 (iShoot, iEdit) (HRV DVD 019)","uid":6158585,"size":7202871348,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:810ee8e4d4e8633182a4b9ceddd8e9e26b10aeb8&amp;dn=Roger+Waters+The+Wall+on+Tour+2010+%28iShoot%2C+iEdit%29+%28HRV+DVD+019%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xxgitsumoldmanxx","files":24,"time":1297129040,"description":"Roger Waters The Wall on Tour 2010\n&quot;iShoot, iEdit&quot; (HRV DVD 019)\nFilmed at The United Center, Chicago, IL September 20 &amp; 21\nAdditional footage filmed at The Nassau Coliseum, Long Island, NY October 12 &amp; 13\n\nFormat: NTSC DVD (16 x 9 widescreen), 5.1 Dolby Digital Stereo (48kHz)\n\niShoot: tapehead 2\niEdit: rontoon\niRemaster: MOB\niCheck: Big Ed\niDesign: Christopher for Ediskrad Studios\niHelp: Pinkerton, volcso, selbst93, Robert Perry (additional photopraphy)\n\nVideo: Sony HDR-CX520V @ 1920x1080i (AVCHD) &gt; MPEG2 720x480 (16 x 9 widescreen, CBR 8)\nAudio: (tapehead2): SP-CMC-8 (AT943s) &gt; SP-SPSB-10 &gt; M10 (24/44.1) &gt; FLAC &gt; WAVE (front left, center, and right speakers)\nAudio: (Rick B) Mics: DPA 4022, Recorder: Sound Devices 722 (16/44.1K) &gt; FLAC &gt; WAVE (rear speakers and LFE)\n\nDVD ONE: Approx. 58 mins\n\nIntro\nIn The Flesh?\nThe Thin Ice\nAnother Brick In The Wall (Part 1)\nThe Happiest Days Of Our Lives\nAnother Brick In The Wall (Part 2)\nMother\nGoodbye Blue Sky\nEmpty Spaces\nWhat Shall We Do Now\nYoung Lust\nOne Of My Turns\nDon't Leave Me Now\nAnother Brick In The Wall (Part 3)\nThe Last Few Bricks\nGoodbye Cruel World\n\n\nDVD TWO: Approx. 53 mins\n\nHey You\nIs There Anybody Out There?\nNobody Home\nVera\nBring The Boys Back Home\nComfortably Numb\nThe Show Must Go On\nIn The Flesh\nRun Like Hell\nWaiting For The Worms\nStop\nThe Trial\nOutside the Wall\n\nAll songs are chapter indexed.\n\nThe foundation of all the footage (and audio) was taken from 9/20. Additional shots are from the 9/21, 10/12 and 10/13 shows and all are from tapehead2's HD master files. \n\nThanks to all those who shared their footage for this project. Thanks once again to the HVR team, MOB for the appropriate EQ work and Big Ed for checking and correcting, and for the quick turn around. Thanks to Chris for the artwork, you always have the coolest sigs on the forum. Thanks to Rick B. for this and 30+ years of recording shows in Chicago.\n\nBut the biggest thanks of all goes to my new friend tapehead2 (TH2) for shooting these shows so brilliantly. After posting the initial clips on YouTube I contacted TH2 to see if a multi-camera edit was ever considered. The response was that TH2 wished for the shows to be shared &quot;as is&quot;. I decided to cut together a few songs just to show TH2 the possibilities and after watching them on YouTube agreed to send me the master HD footage. The 9/20 and 9/21 shows cut together beautifully, but I still wished that we had a few more shots covered. Since TH2 had tickets to the Nassau Coliseum shows and was planning on shooting them as well I offered some camera suggestions, a lot of them in fact, to get some of the shots I still wanted. The dude abides. So thanks to TH2 for the ultimate sacrifice of not being able to enjoy these shows like the rest of us have. That's a hefty price, especially when considering that Pink Floyd isn't on the top of TH2's favorites list. Perhaps inspired by being embraced by the PF &quot;communities&quot; has changed that? And of course thanks to Roger for putting on such a kick ass show.\n\nThis was great fun and a labor of love. The biggest challenge was not in the synching up of all the various shows. Since this is all run to a precise click track synchronization was fairly easy. The challenge was finding matching choreography from shot to shot while at the same time retaining my shot preference and length as well. I'm sure you'll find a few transitions that reveal such continuity blunders, but I'll bet that there's even more that you don't catch. It's amazing how much did actually work. It's all part of the fun and we hope you enjoy the product of our collaboration.\n\nReleased on Veteran's Day (November 11, 2010) and dedicated to all fallen loved ones.\n\nEnjoy!\nRonToon\nHarvested Records","torrent":{"xt":"urn:btih:810ee8e4d4e8633182a4b9ceddd8e9e26b10aeb8","amp;dn":"Roger+Waters+The+Wall+on+Tour+2010+%28iShoot%2C+iEdit%29+%28HRV+DVD+019%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"810ee8e4d4e8633182a4b9ceddd8e9e26b10aeb8","infoHashBuffer":{"type":"Buffer","data":[129,14,232,228,212,232,99,49,130,164,185,206,221,216,233,226,107,16,174,184]},"announce":[],"urlList":[]}}