{"title":"leo4allv3","uid":4148699,"size":3631658321,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:815a03960517bbd49afdbe243915a165b7195d44&amp;dn=leo4allv3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bhast2","files":38,"time":1208836247,"description":"So here we are with Leo4Allv3. MD5 checksum should be :\n48b3bea091a9247238b6534098e102f9\n\n\nYou might wonder what\\&amp;#039;s new and why bother downloading. I will try to list the main changes with this update and a comprehensive list of what options are available.\n\nPlease visist http://osx86leo4all.wikidot.com for assistance or if you like my work to donate.\n\nFirst and most importantly is a totally rebuilt filesystem. The advantage with this is I no longer had to script a repair permissions from the DVD. This speeds install a good bit for most people. Don\\&amp;#039;t worry if the timer says some outrageous time, as it does not calculate it correctly. The initial package install is very large and takes the most time, but once its done the install is almost done. I still recommend running repair permissions from Leopard once your all loaded up to fix some errors, but none of these will stop the system from booting. If you run it twice you should see zero errors on Intel and 2 SUID files on AMD. There is an install script that crashes on AMD machines causing this, but to keep everything perfect on intel I chose to leave the script intact. \nThis DVD now supports AHCI with more than 2 drives thanks to the updated kext\\&amp;#039;s posted by Cyclonefr. \nAlso fixed this go around is X11 for both Intel and AMD. If, when you close it the first time, cpu usage jumps to 100% open terminal and type xeyes &amp; to fix it. You will need to reboot after, but it should never glitch again. \nDue to some complaints I removed my old logo and replaced it with my favorite desktop background, hope you like it.\n\nThere is no longer a ./RemoveVideo script, it has been updated and is now called\n./options. \nIf you boot with -s at the Darwin prompt and mount your drive with \n/sbin/fsck -fy\n/sbin/mount -uw /\n./options\nyou will see options to remove video drivers, account loop fix, and extensions repair. These are the most common issues so I have just automated them. If you do the account loop fix be sure to setup a proper account once booted into Leopard.\n\nFrom inside the installer you will notice alot of new options, I will cover the main ones of interest:\n\nACPIPlatform:\n\nYou now have a choice between ACPIPlatforms, version 1.1.0 is the default install if nothing else is selected. This is needed for the laptop Power Management bundle to function,  but if you have an older system you can choose 1.0.3 from Tiger. Alternately you can choose the stock version 1.2.1. Included inside version 1.1.0 and 1.2.1 is ACPIPS2Nub(proper version) for your PS2 support. There should be more PS2 issues! !\n\nAppleSMBIOS:\n\nI put in lots of choices for different versions based on bus speed if you want it to show your proper memory speed, or if you want your hack to look like a real mac. The default install if nothing is selected is Netkas improved version 27.\nOptions are:\nDDR667\nDDR800\nDDR1066\nDDR1333\niMac\nMacBook\nMacPro\n\nKernel:\n\nI have added Netkas 9.2.0 sleep kernel, and 9.2.2 binpatched kernel ny Modbin(Be warned this does not work on all AMD machines! SSE3 CPU is required!). The default install is still Netkas 9.2.0 speedstep kernel. There are also the Stock kernels(vanilla) 9.2.0/9.2.2\n\nRemoveFireWire:\n\nFor those that have issues with FireWire, or those that just want to speed their boot time a little. This moves all of the IOFireWire kext\\&amp;#039;s to /FireWire folder in the root of your install drive.\n\nAbout This Mac:\n\nThis is my own little installer to customize \\&quot;About this Mac\\&quot; with your processor info. No it does not fix memory speed, you have to do that with AppleSMBIOS. It should work for all languages and should report overclocked CPU\\&amp;#039;s properly.\n\nPower Management:\n\nBy popular demand I added the laptop power management bundle to the install. You will still need to set it up in system preferences. This is known to have a few minor bugs. It may not report the proper time remaining or any time remaining for that matter, so use at your own risk. If you select this please do not select an ACPIPlatform, as this requires version 1.1.0.\n\nAMD System Fix:\n\nYou will notice it is checked and greyed out by default. To take out alot of user error (people forgetting to check it for their AMD systems) I have added a script to detect the CPU and patch accordingly. When its running it will echo your processor information in the install log (if you show all). It will then skip the patch process if your on Intel or patch if its an AMD. I hope it works well for everyone!\n\nBootloader:\n\nThis option is checked and greyed out by default. It is Dense\\&amp;#039;s script to install EFI and make the partition active. If you already have an existing bootloader (like from Vista) on the same logical drive it will not overwrite it. It will however flag the partition you installed to active, so you will have to manually set your Windows partition active again if needed.\n\nChipset Drivers:\n\n(NOTE- JMicron is the only driver that always installs so please choose at least 1 option, some will have to choose 2 [if you have Marvell IDE and Intel SATA for example] ) There are only 6 choices here.\n\nNforce Old - This is the older version of Medevils Nforce(1.0.2) driver. Install this if you have issues with SATA enabled causing a panic. Known to work for some Nforce3 users.\n\nNforce Test- If you have a SATA DVD or do not have issues booting the DVD normally choose the NforceTest. \n\nSiliconImage3132 - I have not found anyone that uses this specific chipset to confirm if it works.\n\nVIA, SiS, Marvell and SB - Please install this if you are using any of these chipsets. If you have a Marvell IDE drive please install this as they should be supported. I have added many ID\\&amp;#039;s here so I hope they all work! This chioce installs AppleVIAATA, AppleOnboardPCATA and AppleGenericPCATA. Confirmed working for SiS!\n\nSAS - By request I added support for this, as of my writing this its untested. Hopefully it works.\n\nIntel ICHx- If you have ICH7/8/9 chipsets you should install this. This is the modified version by -Dune- to support more than 2 drives and fix the over 2Gigs of RAM panics.\n\nAudio:\n\nThese choices have not changed much, only added support for STAC9271 by request. If your not sure what chipset you have, please choose AzaliaAudio(for most HD) or AC97Audio. \nChioces are:\nALC850/882/883/888/889\nAC97Audio\nADI1988\nSTAC9271\nAzaliaAudio\n\nGraphics Drivers:\n\nI have updated many of these packages.\nATI- there are options for:\n3850\n3870\n2600XT(PCIE)\n2600XT(AGP)\n3870X2\n2600PRO(PCIE)\n2600PRO(AGP)\nX1600(PCIE)\nX1600(AGP)\nX19X0\nX1400 Mobility\n\nNvidia- I have updated the drivers to the latest available from the Mac Pro\\&amp;#039;s and editied to include all Device ID\\&amp;#039;s I could verify. This should cover mostly all 6XXX/7XXX/8XXX series cards.\nNVinject- By request I have added options for different version of Nvinject(0.1.3/0.2.0/0.2.1). If your not sure choose version 0.2.1 with the proper amount of RAM your video card.\nGMA950 - QE/CI+resolution change with some artifacts\nGMA950 - No Aritfacts QE/CI but no resolution.\nGMAX3100 - suppose to give QE/CI(confirmed for device ID 0x2a02)\n\nNetwork Drivers:\n\nForceDeth- This is compatible with most Nforce LAN.\nForceDeth-V - This is compatible with most Nforce LAN(recommended version)\nSkge - Driver for most Marvell LAN cards.\nRTL8187- Just as it says for Realtek 8187\nZydas USB- For the USB Wireless LAN adapter\nTiger IO80211- Some Atheros cards require this Tiger version to work. Default install is IO80211 from 10.5.2\nBroadcom- WLAN driver for BCM4306/4309/4318/4320/4324\nRT2500- Suppose to support Dlink WMP54G v4.0, may support some others.\nViaRhine- Just as it says, for ViaRhine chipsets\nIntel 100Pro VE- Just as it says, for the Intel 100Pro VE chipset\nRT2860- Driver for some chipsets like WL-181, may also work on some others.\n\nGood Applications:\n\nYou can choose to install or not, but I do recommend many of these useful programs. They include:\nAdium\nAppZapper\nBBEdit\nCandyBar\nColloquy\nFireFox\nGumby 50c\nInvisibles\nKCNScrew\nKextHelper\nMarvin\\&amp;#039;s AMD Utility\nMD5\nPacifist\nPackageMaker version 2.1(old harder to find)\nStuffit Expander\nTextmate\nTransmission\nTubeSock\nUnison\nVLC\nXbench\n\n","torrent":{"xt":"urn:btih:815a03960517bbd49afdbe243915a165b7195d44","amp;dn":"leo4allv3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"815a03960517bbd49afdbe243915a165b7195d44","infoHashBuffer":{"type":"Buffer","data":[129,90,3,150,5,23,187,212,154,253,190,36,57,21,161,101,183,25,93,68]},"announce":[],"urlList":[]}}