{"title":"Voodoo Histories- the Role of the Conspiracy Theory in Shaping M","uid":11035865,"size":4084992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:817f096c4af6f79c49f8f95fcd5e12ecc11a23de&amp;dn=Voodoo+Histories-+the+Role+of+the+Conspiracy+Theory+in+Shaping+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410798010,"description":"Our age is obsessed by the idea of conspiracy. We see it everywhere - from Pearl Harbour to 9/11, from the assassination of Kennedy to the death of Diana. Bookshop shelves threaten to collapse under the weight of texts devoted to proving myriad conspiracy theories true, while even quality newspapers and serious TV channels are prepared to give them credence.\n\n\n\n\n\nFor David Aaronovitch, there came a time when he started to see a pattern. These theories used similar dodgy methods with which to insinuate their claims: they linked themselves to the supposed conspiracies of the past (it happened then so it can happen now); they carefully manipulated their evidence to hide its holes; they relied on the authority of dubious academic sources. Most importantly, they elevated their believers to membership of an elite - a group of people able to see beyond lies to a higher reality. But why believe something that entails stretching the bounds of probability so far? Surely it is more likely that men did actually land on the moon in 1969 than that thousands of people were enlisted to fabricate a deception that they did.\n\n\n\n\n\nIn this entertaining and enlightening book - aimed to provide ammunition for those who have found themselves at the wrong end of a conversation about moon landings or twin towers - Aaronovitch carefully probes and explodes a dozen of the major conspiracy theories. In doing so, he looks at why people believe them, and makes an argument for a true scepticism: one based on a thorough knowledge of history and a strong dose of common sense.","torrent":{"xt":"urn:btih:817f096c4af6f79c49f8f95fcd5e12ecc11a23de","amp;dn":"Voodoo+Histories-+the+Role+of+the+Conspiracy+Theory+in+Shaping+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"817f096c4af6f79c49f8f95fcd5e12ecc11a23de","infoHashBuffer":{"type":"Buffer","data":[129,127,9,108,74,246,247,156,73,248,249,95,205,94,18,236,193,26,35,222]},"announce":[],"urlList":[]}}