{"title":"BYTE magazine full-res scans PDF JC2.0 20130101","uid":7978965,"size":32136285512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81980d10ac966b7140b2f261e048b47b276b0f95&amp;dn=BYTE+magazine+full-res+scans+PDF+JC2.0+20130101&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"ChingaTuu","files":173,"time":1357102833,"description":"These are the scans of BYTE magazine that are currently available. (see http://www.atariage.com/forums/topic/167235-byte-magazine/ ) They are in their original form.\n\n\nFrom the README:\n\n2013/01/01\n\nVersion 2.0 of this torrent contains 84 new scans made by an anonymous\ncontributor. Half of the scans are badly needed replacements for the Marcus\nscans, of which there are only 7 left.\n\nThe new scans are significantly smaller than the replaced Marcus scans so\neven though there are many new issues, the torrent is actually smaller.\n\nThis torrent contains ALL of the available issues, not just differences \nfrom 1.0. If you already have 1.0 then there is obviously no reason to \nre-download many of the files. The most general directions I can give that \nshould work with all BitTorrent clients is to momentarily stop the download\nof the new torrent, copy/move/link the old files into the new directory \n(sans the 0README.TXT file), and resume downloading the new torrent. After\nverifying the hashes it should see those files as already downloaded. (This \nwon't work if you changed the names!)\n\nThese are the only scans that are left in the marcus sub-directory:\n\n    197911 BYTE 04-11 Fun and Games.pdf\n    198004 BYTE 05-04 Printed Software Becomes a Reality.pdf\n    198207 BYTE 07-07 Computers in the Arts and Sciences.pdf\n    198210 BYTE 07-10 Computers in Business.pdf\n    198509 BYTE 10-09 Homebrewing.pdf\n    198510 BYTE 10-10 Simulating Society.pdf\n    198512 BYTE 10-13 Computer Conferencing.pdf\n\nIf you can I guess it wouldn't hurt to simultaneously seed version 1.0 of\nthis torrent a little while longer until version 2.0 becomes better known \non the index sites, etc. But please configure your client to seed version \n1.0 at a lower priority!\n\nPLEASE HELP OTHERS AND SEED THIS TORRENT! I was seeding ~10 clients a few\ndays ago and shortly after they finished up there were only three people\nseeding, which was myself and two other very reliable long-time seeders. \n(MANY people owe thanks to them!)\n\n\n2012/06/22\n\nThese are the ThumpNugget and tosteve scans of BYTE magazine. Please \nvisit http://www.atariage.com/forums/topic/167235-byte-magazine/ to learn\nmore. These are the full resolution PDFs, not the down-sampled PDFs found\nin another torrent which is considerably smaller (11GB) but still very \nhigh-quality. \n\nNon-overlapping issues from Marcus B. have also been included. For various\nreasons these issues should be rescanned and replaced.\n\nThis is a work-in-progress so *please* contribute if you have missing \nissues and the time and resources to create *high-quality* scans!\n\nIf you're wondering where Out of the Inner Circle is, it's not here. \nSeeing that it has nothing to do with BYTE I removed it and will put it in\nits own torrent. It looks very interesting and I look forward to reading it\nbut I figured this torrent was big enough. (but will hopefully be getting \nbigger....)\n\nPlease seed this torrent. Even if you only download a few issues please\nleave your BitTorrent client running in order to help others.\n\nJC\n\n\nP.S. Sorry I had to rename everything. It was driving me crazy while \nworking with them at the command line.\n","torrent":{"xt":"urn:btih:81980d10ac966b7140b2f261e048b47b276b0f95","amp;dn":"BYTE+magazine+full-res+scans+PDF+JC2.0+20130101","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81980d10ac966b7140b2f261e048b47b276b0f95","infoHashBuffer":{"type":"Buffer","data":[129,152,13,16,172,150,107,113,64,178,242,97,224,72,180,123,39,107,15,149]},"announce":[],"urlList":[]}}