{"title":"The Shadows - The Shadows At Abbey Road, The Collector's Edition","uid":8643546,"size":366387566,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:81eb41f66ff1c00c7b83f5c96f94baaad1b536d7&amp;dn=The+Shadows+-+The+Shadows+At+Abbey+Road%2C+The+Collector%27s+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":31,"time":1372932286,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nThe Shadows - The Shadows At Abbey Road: The Collector's Edition (1997)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61NLvPJX8hL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61NLvPJX8hL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nHas cover art only.\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Bruce Eder):\n\nThe Shadows are usually thought of as the quintessential British instrumental group and, along with the American band the Ventures and the Swedish group the Spotnicks, one of the most popular instrumental groups in the world. But that barely tells the story of their true significance in the history of British rock &amp; roll -- including the fact that they were the first home-grown British rock &amp; roll band to dominate the U.K. charts; or that they weren't originally an instrumental group, either. The band's roots go back to Chesthunt, Hertfordshire, in early 1958, when a young Indian-born singer/guitarist named Harry Webb joined with drummer Terry Smart and guitarist Norman Mitham to form a group that they ended up calling the Drifters -- at the time, none of the records by the American R&amp;B group of the same name, founded by Clyde McPhatter, had been released in England, so they had no inkling of the name's already being used.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/the-shadows-p5399/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/the-shadows-p5399/biography&lt;/a&gt;\n\nAll Music Album Review (by Dave Thompson):\n\nReleased, as its title suggests, within EMI's rightfully applauded At Abbey Road series of archive exhumations, this collection can also be regarded as the first truly essential Shadows compilation since 1976's Rarities package, in that it's the first since then to truly offer up something we've not already experienced a myriad times, in a mountain of forms, before. The cover blurb tells only part of the story -- 23 tracks, alternate versions, and previously unreleased recordings, after all, can constitute a multitude of sins, particularly when such ruthless perfectionists as the Shadows are at large. But onwards from the ragged mono version of &quot;Gonzales&quot; which opens the set, the inner workings of this most studio-secretive of acts are lain bare. Nothing leaps out as especially revelatory. Unissued versions of even the most familiar hits sound no less perfect than the ones we know; undubbed takes of others simply shine a new light in old corners. But the snatches of studio conversation which filter between numbers actually seem to say more than the meaningless babble which such interludes usually deliver, and there are occasional moments when one wonders whether the group's ceaseless search for ultimate impact somehow diluted their actual vision. &quot;Guitar Tango&quot; without its orchestral Spanish interludes, &quot;Wonderful Land&quot; with unaccustomed imperfections, and &quot;Atlantis&quot; shorn of the girlie vocal chorus may not improve on the hit versions, but are at least their equals. Elsewhere, &quot;Scotch on the Rocks&quot; is revealed as a somewhat peculiar hybrid of Jefferson Airplane's &quot;White Rabbit&quot; (the rhythm) and Pink Floyd's &quot;Pow R Toc H&quot; (the effects), while the latter half of the album's headlong rush towards the late '70s throws up some equally delightful discoveries -- a rendition of Richard Rodgers' &quot;Slaughter on 10th Avenue&quot; which punctures the long-standing belief that Mick Ronson recorded rock's only definitive version; an unedited epic take on &quot;Don't Cry for Me, Argentina,&quot; and, finally, the Beach Boys' &quot;God Only Knows,&quot; recorded in 1975, overdubbed in 1979, and then left to languish on a shelf for 25 years. It isn't the best thing the Shadows ever recorded by a long chalk, but it is one of the most informative. American fans with very long memories might well recall how the Shadows were once promoted in the U.S. as Britain's answer to the surfing craze. Now we know why.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-shadows-at-abbey-road-the-collectors-edition-r471621/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-shadows-at-abbey-road-the-collectors-edition-r471621/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000007V63&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000007V63&lt;/a&gt;\n\nTrack List:\n\n01. Gonzales (Original mono LP version)\n02. Wonderful Land (Unissued version)\n03. Witch Doctor (The Savage)(Unissued film version)\n04. What A Lovely Tune(Unissued stereo version)\n05. The Boys Theme  (Un-dubbed version\n06. The Shadows - Guitar Tango  (Un-dubbed version)\n07. All Day (Unissued alternative version)\n08. The Shadows - Atlantis  (Un-dubbed version)\n09. It's Been A Blue Day (Unissued alternative un-dubbed version)\n10. Razzmataz (Unissued alternative version)\n11. Nothing, Folks (Unissued instrumental track)\n12. John's Rocker (Unissued version of &quot;I wish I Could Shimmy Like My Sister Arthur&quot;))\n13. Don't Stop Now (Alternative version)\n14. Benno-San (Alternative version)\n15. Zero X Theme (Stereo re-mix)\n16. Thunderbirds Theme (Stereo re-mix)\n17. Scotch On The Rocks (Stereo re-mix)\n18. Tennessee Waltz   (Unissued version)\n19. The Shadows - Slaughter On 10th Avenue\n20. Chitty Chitty Bang Bang (Unissued instrumental)\n21. No No Nina (Unissued full studio version)\n22. Don't Cry For Me Argentina (Unissued full studio version)\n23. God ONly Knows (Unissued re-mixed and modified version)\n","torrent":{"xt":"urn:btih:81eb41f66ff1c00c7b83f5c96f94baaad1b536d7","amp;dn":"The+Shadows+-+The+Shadows+At+Abbey+Road%2C+The+Collector%27s+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81eb41f66ff1c00c7b83f5c96f94baaad1b536d7","infoHashBuffer":{"type":"Buffer","data":[129,235,65,246,111,241,192,12,123,131,245,201,111,148,186,170,209,181,54,215]},"announce":[],"urlList":[]}}