{"title":"Mortal Combat 3","uid":7789014,"size":3432357,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:82c3cea4405e677fbc29e133b7e0da57bc9d39c9&amp;dn=Mortal+Combat+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":1,"time":1351969085,"description":"Mortal Kombat 3 is a fighting game developed by Midway and released in 1995, first as an arcade game. It is the third game in the Mortal Kombat series. MK3 was later updated into Ultimate Mortal Kombat 3 for the arcade and home consoles, and later Mortal Kombat Trilogy for home consoles only. The game's overall style was envisioned differently than in the previous Mortal Kombat games. Opposed to the heavily Oriental themes of Mortal Kombat and Mortal Kombat II, MK3's theme is much more Western contemporary. The game's stages are set in modern locations, three of the characters are cyborgs, and traditional character designs (such as Sub-Zero's or Kano's) have been dropped or modified in favor of modern replacements. The overall game has a much darker tone than its predecessors, and uses a noticeable darker and less vibrant color palette. Characters are now heavily digitized (as opposed to the hybrid digitized/hand-drawn style of MKII.) Many of the game's backgrounds are now, for the first time, created using pre-rendered 3D graphics. This change is also reflected in the sound track, in which all Oriental motifs have been dropped in favor of modern instrumentation.","torrent":{"xt":"urn:btih:82c3cea4405e677fbc29e133b7e0da57bc9d39c9","amp;dn":"Mortal+Combat+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82c3cea4405e677fbc29e133b7e0da57bc9d39c9","infoHashBuffer":{"type":"Buffer","data":[130,195,206,164,64,94,103,127,188,41,225,51,183,224,218,87,188,157,57,201]},"announce":[],"urlList":[]}}