{"title":"Monster Hunter Tri","uid":9258975,"size":2837446656,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:83a18982c2d2363730a2a4edcce2afa38afe9129&amp;dn=Monster+Hunter+Tri+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"realis10","files":-1,"time":1385603139,"description":"\nReleased: 04/20/2010\nGenre : Action, RPG\nDeveloper : Capcom Production Studio 1\nPublisher: Capcom Platform : Wii\nMultiplayer: (2 ) Local.\nPublication Type: License\nRegion: NTSC\nLanguage: English, Spanish\nLanguage: English\nImage Format : WBFS\nGame ID: RMHE08 \n\nDescription:\nSeries Monster Hunter, spawned a whole subculture in Japan, reaches new heights in Monster Hunter Tri: a fascinating story that turns a single game in the thrilling adventure in the world of hunting for monsters , new varieties of the environment and wildlife, including the underwater world and its inhabitants, new weapons . Add to this incredibly beautiful landscapes, allowing Monster Hunter Tri for the right to boast the most impressive graphics of games for the Nintendo Wii. History with an open ending, revealed through a series of epic task with many possible solutions , requires at least 100 hours spent playing and a great opportunity to not just beat the game on the new route .\nIf you prefer a collective hunting career Hypericum single , Monster Hunter Tri is ready to offer you excellent entertainment ! Joint play together in split-screen invites battle with monsters for a couple with a friend or relative to a designated arena. If you like a team game with mutual mode, online play for four hunters offers a truly epic battle with the huge and tricky monsters .\nAnother unique feature of the game Monster Hunter Tri is full , alive and breathing ecosystem where animals truly interact with each other , nature and you. Battles with such clever opponents will teach you to think tactically , with care and caution to choose the opponent, respect the borders of habitats of animals and not to attack them unless absolutely necessary. ","torrent":{"xt":"urn:btih:83a18982c2d2363730a2a4edcce2afa38afe9129","amp;dn":"Monster+Hunter+Tri+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83a18982c2d2363730a2a4edcce2afa38afe9129","infoHashBuffer":{"type":"Buffer","data":[131,161,137,130,194,210,54,55,48,162,164,237,204,226,175,163,138,254,145,41]},"announce":[],"urlList":[]}}