{"title":"Supreme Justice - Max Allan Collins - Audiobook MP3","uid":10474223,"size":215827592,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:840e4df8c1ac5df2e0ee05af6a4fd93b0861799c&amp;dn=Supreme+Justice+-+Max+Allan+Collins+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404306271,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nSupreme Justice\n\nWritten by: Max Allan Collins\nNarrated by: Dan John Miller\nLength: 7 hrs and 18 mins\nFormat: Unabridged\nRelease Date:07-01-14\nProgram Type: Audiobook\n\nAfter taking a bullet for his commander-in-chief, Secret Service agent Joseph Reeder is a hero. But his outspoken criticism of the president he saved - who had stacked the Supreme Court with hard-right justices to overturn Roe v. Wade, amp up the Patriot Act, and shred the First Amendment - put Reeder at odds with the Service's apolitical nature, making him an outcast.\n\nFBI agent Patti Rogers finds herself paired with the unpopular former agent on a task force investigating the killing of Supreme Court Justice Henry Venter. Reeder - nicknamed &quot;Peep&quot; for his unparalleled skills at reading body language - makes a startling discovery while reviewing a security tape: the shooting was premeditated, not a botched robbery. Even more chilling, the controversial Venter may not be the only justice targeted for death.\n\nIs a mastermind mounting an unprecedented judicial coup aimed at replacing ultra-conservative justices with a new liberal majority? To crack the conspiracy and save the lives of not just the justices but also Reeder's own family, rising star Rogers and legendary investigator Reeder must push their skills - and themselves - to the limit.","torrent":{"xt":"urn:btih:840e4df8c1ac5df2e0ee05af6a4fd93b0861799c","amp;dn":"Supreme+Justice+-+Max+Allan+Collins+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"840e4df8c1ac5df2e0ee05af6a4fd93b0861799c","infoHashBuffer":{"type":"Buffer","data":[132,14,77,248,193,172,93,242,224,238,5,175,106,79,217,59,8,97,121,156]},"announce":[],"urlList":[]}}