{"title":"Lee Morgan - Search For The New Land (1966) 2014 HDTracks 24-192","uid":11188710,"size":1586722017,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:841f5a41c5737956a551a6116a90545c84042e82&amp;dn=Lee+Morgan+-+Search+For+The+New+Land+%281966%29+2014+HDTracks+24-192&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"hal4000","files":-1,"time":1412962513,"description":"Edward Lee Morgan was born in Philadelphia on July 10, 1938, the youngest of Otto Ricardo and Nettie Beatrice Morgan's four children. A leading trumpeter and composer, he recorded prolifically from 1956 until a day before his death in February 1972. Originally interested in the vibraphone, he soon showed a growing enthusiasm for the trumpet. Morgan also knew how to play the alto saxophone. On his thirteenth birthday, his sister Ernestine gave him his first trumpet. His primary stylistic influence was Clifford Brown, who gave the teenager a few lessons before he joined the Dizzy Gillespie Big Band at 18, and remained a member for a year and a half, until the economic situation forced Dizzy to disband the unit in 1958. He began recording for Blue Note Records in 1956, eventually recording 25 albums as a leader for the company, with more than 250 musicians. He also recorded on the Vee-Jay label and one album for Riverside Records on its short-lived Jazzland subsidiary.\n\nJust look at that cover shot. Lee Morgan is trying to tell you something: This ain't no Sidewinder, folks. It's a much mellower, probing, and at times downright serious session, at a time when listeners were accustomed to the opposite from Morgan.\nIf the other four tracks were static-riddled renditions of 'Looney Tunes' cartoon music, this album would still be worth double its price for the title song itself, an invaluable fifteen minute epic that could well serve as an introductory model for everything immortally great about Blue Note in the mid 1960s. 'Search For the New Land' is comprised of two central, repeating themes which Wayne Shorter, Morgan, Grant Green and Herbie Hancock get extended turns soloing over: the first, an evocative sequence in which the ensemble's quietly dramatic phrasing is sifted through a zephyr of cymbals; the glistening waves of sound then give way to the solitude of Reggie Workman's bass establishing the framework of the two chords which embody the more strident, jazzy passage. Shorter's interpretation is typically introspective, dark, and minimalist, each note perfectly chosen and placed; Morgan intensifies his portion of the song to a degree (not to where it topples the mood of the piece, but clearly he just isn't much at holding back), and Hancock just ices the event with one of the most brilliant moments of his career, a breathtaking, block-chorded extrapolation, daring yet understated, that punctuates and fully realizes the dynamics the music had been striving toward.\nSubsequent tracks 'Mr. Kenyatta' and 'Morgan the Pirate' are somewhat more standardly uptempo, but melodically keep with this contemplative mood. They are just two more choice pearls in the Morgan catalogue, which is full of distinctive, catchy, and extremely well-crafted jazz compositions that have escaped the attention of later generations; Morgan, who wrote all the music on this record and on most of his others, is for some reason a hugely underrated songwriter. The wistful ballad 'Melancholee' weighs the level of somberness to new depths, and the disc is rounded out by a more characteristically buoyant track, 'The Joker', which registers as an unmemorable misfit alongside the meditative vein connecting the other songs.\nLee Morgan was always a sure bet for enjoyable, quality output, but especially so here as he 'searches for new land', a direction his music would not again take until some of the very last recordings he would make in the early '70s.\n\nHDTracks PCM-24Bit-192Khz-FLAC","torrent":{"xt":"urn:btih:841f5a41c5737956a551a6116a90545c84042e82","amp;dn":"Lee+Morgan+-+Search+For+The+New+Land+%281966%29+2014+HDTracks+24-192","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"841f5a41c5737956a551a6116a90545c84042e82","infoHashBuffer":{"type":"Buffer","data":[132,31,90,65,197,115,121,86,165,81,166,17,106,144,84,92,132,4,46,130]},"announce":[],"urlList":[]}}