{"title":"The Faces of Janus: Marxism and Fascism in the Twentieth Century","uid":11727071,"size":12628893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8426146868ed32ea1ae83d415b947bac37e0ee0c&amp;dn=The+Faces+of+Janus%3A+Marxism+and+Fascism+in+the+Twentieth+Century&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425113633,"description":"Attempting to understand the catalogue of horrors that has characterised much of twentieth-century history, Western scholars generally distinguish between violent revolutions of the &quot;right&quot; and the &quot;left&quot;. Fascist regimes are assigned to the evil right, Marxist-Leninist regimes to the benign left. But this distinction has left us without a coherent understanding of the revolutionary history of the twentieth century, contends A. James Gregor in this insightful book. He traces the evolution of Marxist theory from the 1920s through the 1990s and argues that the ideology of Marxism-Leninism devolved into fascism. Fascist regimes and Communist regimes - both anti-democratic ideocracies - are far more closely related than has been recognised. Employing wide-ranging primary source materials in Italian, German, Russian, and Chinese, the book opens with an examination of the first standard Marxist interpretation of Mussolini's fascism in the early 1920s and proceeds through the emergence of fascist phenomena in post-Communist Russia. A clearer understanding of the relation between fascism and communism provides a sharper lens through which to view twentieth-century history as well as the present and future politics of Russia, Communist China, and other non-democratic states, Gregor concludes","torrent":{"xt":"urn:btih:8426146868ed32ea1ae83d415b947bac37e0ee0c","amp;dn":"The+Faces+of+Janus%3A+Marxism+and+Fascism+in+the+Twentieth+Century","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8426146868ed32ea1ae83d415b947bac37e0ee0c","infoHashBuffer":{"type":"Buffer","data":[132,38,20,104,104,237,50,234,26,232,61,65,91,148,123,172,55,224,238,12]},"announce":[],"urlList":[]}}