{"title":"James Otto - Shake What God Gave Ya 2010","uid":6492656,"size":312201080,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8430725d26b9669329f3ce0f74d1871d38511954&amp;dn=James+Otto+-+Shake+What+God+Gave+Ya+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1308942032,"description":"Shake What God Gave Ya is the third studio album from American country artist James Otto. It was released in the United States on September 14, 2010 through Warner Bros. Nashville.\n\nIn an interview with The Boot, Otto described his new record saying, This is a declaration of who I am, this country-soul sound is where we're going, and if you like it, this is for you. In an interview with Music Row, Otto called the content on the album sexy, sultry, and soulful, and went on to say that Musically I would say I am the love child between Ronnie Milsap and Barry White.\n\nStephen Thomas Erlewine called it a fully formed, seductive country-soul record and said it rolls smooth and easy, locking into a cool relaxed groove early on and never leaving it. Jessica Phillips with Country Weekly rated the album three-and-a-half stars out of five, saying Otto's raw, impassioned style brought out many soul-influenced songs, and that the album focuses on lighthearted or romantic fare.\n\nGreg Victor with Parcbench called it the best country-meets-soul-meets-rock-meets-blues album to hit the scene since the early days of Lyle Lovetts Large Band, and said the album put Otto in a class all by himself. Allen Jacobs with Roughstock called the tracks on the album smart, soulful and sexy country songs and said the album was nowhere near a traditional country record but is nonetheless a strong third album.  (wikipedia)\n\n- - -\n\nJames Otto - Shake What God Gave Ya 2010 \n\n 1. Are Ya With Me\n 2. Groovy Little Summer Song\n 3. Lover Man\n 4. Soldiers &amp; Jesus\n 5. Love Don't Cost A Thing\n 6. Sun Comes 'Round Again\n 7. Shake What God Gave Ya\n 8. It's A Good Time (For A Good Time)\n 9. Just Like Sunshine\n10. Let's Just Let Go\n11. She Comes To Me\n12. Good Thing's Gone Bad (featuring Ronnie Milsap)\n","torrent":{"xt":"urn:btih:8430725d26b9669329f3ce0f74d1871d38511954","amp;dn":"James+Otto+-+Shake+What+God+Gave+Ya+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8430725d26b9669329f3ce0f74d1871d38511954","infoHashBuffer":{"type":"Buffer","data":[132,48,114,93,38,185,102,147,41,243,206,15,116,209,135,29,56,81,25,84]},"announce":[],"urlList":[]}}