{"title":"Essential JavaFX","uid":5034733,"size":3963620,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8463e5e25a2eaf8e400379f897d76cdb7695b1e6&amp;dn=Essential+JavaFX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JRepin","files":-1,"time":1249064717,"description":"A complete introduction for beginners to Sun's powerful JavaFX scripting \nlanguage \n\nJavaFX is a scripting language which provides built-in properties for \nmanipulating objects within a 2D coordinate system. JavaFX provides the tools to fill and pen stroke colors, and create special effects, shapes and lines. It \nalso manipulates images and play videos and sound and defines animations \nthat affect objects over time. This complete introduction for any level \ndoesn't bury you with details. It starts quickly with an introduction to \nthe power of JavaFX key features--scene node graphs, nodes as \ncomponents, the coordinate system, layout options, colors and gradients, \ncustom classes with inheritance, animation, binding, and event handlers. \nIt then shows step-by-step how these features could be used in a real \nJavaFX application and will help an application look professionally \ndesigned. Commissioned by JavaFX product team and reviewed by renowned \nJava author, Brian Goetz, this guide is intended as the first and most \naccessible book for people new to JavaFX.\n\n* The Andersons are working directly with the JavaFX team at Sun for a \ncomplete and authoritative guide \n* Gets you started on building rich Web apps quickly without having to \nsort through unnecessary details or search the Web for answers \n* Focuses on most useful features and shows how to build apps that tap \nthe full potential of JavaF\n\nThe type of the release is: eBook \nIn the PDF format with ISBN: 0137042795 and Pub Date: June 11, 2009 \nThe size of the release is: 02 disks x 2.88mb \nAnd released on: 07/17/2009\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/tg/detail/-/0137042795/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/tg/detail/-/0137042795/&lt;/a&gt;","torrent":{"xt":"urn:btih:8463e5e25a2eaf8e400379f897d76cdb7695b1e6","amp;dn":"Essential+JavaFX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8463e5e25a2eaf8e400379f897d76cdb7695b1e6","infoHashBuffer":{"type":"Buffer","data":[132,99,229,226,90,46,175,142,64,3,121,248,151,215,108,219,118,149,177,230]},"announce":[],"urlList":[]}}