{"title":"Man vs Wild - Season 01","uid":3732705,"size":3303591983,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8520adcc4a82e2c2267ae14df4fbd7893cb4d6e7&amp;dn=Man+vs+Wild+-+Season+01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"parquedematt","files":10,"time":1183582435,"description":"From Wikipedia:\n\nMan vs. Wild is a survival television series on the Discovery Channel hosted by Bear Grylls. The series is produced by British television production company Diverse Bristol. The show premiered on November 10, 2006 after airing a pilot episode entitled The Rockies on October 27, 2006. The program follows Grylls as he survives harsh conditions with minimal resources and finds his way back to civilization. The series is currently airing on Channel 4 in the UK and Discovery Channel Europe as Born Survivor: Bear Grylls. Grylls is currently filming for the next season.\n\nMan vs. Wild shows Grylls purposefully demonstrating more extreme methods of survival in harsh conditions. The program has shown him eating raw meat and live fish, staving off hypothermia after intentionally jumping in a frozen lake, and drinking the fluids of elephant feces for hydration. The format of this show is similar to that of Survivorman, with the exception being that Survivorman is recorded by the host, while Grylls travels with a two-man camera crew during daylight. Grylls contends that the crew is \\\\\\&quot;under very strict instructions not to get involved or help\\\\\\&quot; unless he is in a fatal situation. Despite these claims theres is often much speculation about the true reality of the show. Many times Grylls will state that there is only one way to get closer to his destination and it usually involves jumping off a waterfall or going down a whitewater river without a boat, yet after taking his only way out his cameramen always seem to be waiting at the end.\n\nThe series accentuates the dramatic aspects of wilderness survival, as Grylls goes out of his way to demonstrate techniques usually required only under extremely dire circumstances. In advertisements for the upcoming Season Two of Man vs. Wild, the screen shows a disgusted Grylls eating an enormous grub while the announcer states, \\\\\\&quot;Does Bear Grylls really need to do these things? Probably not. But you might.\\\\\\&quot;\n\nEpisodes:\n\n1  \tThe Rockies   \t\t\t10/27/2006\n2 \tMoab Desert in Utah \t\t11/10/2006\n3 \tCosta Rican Rain Forest \t11/17/2006\n4 \tAlaskan Mountain Range \t\t11/24/2006\n5 \tHawaii ? Mount Kilauea \t\t12/1/2006\n6 \tSierra Nevada \t\t\t12/8/2006\n7 \tAfrican Savanna ? Kenya \t12/15/2006\n8 \tEuropean Alps \t\t\t12/26/2006\n9 \tDesert Island \t\t\t12/29/2006\n\nAn awesome series which keeps you on the edge of your seat.  Enjoy!\n\nPlease be patient while I seed and help seed once finished.","torrent":{"xt":"urn:btih:8520adcc4a82e2c2267ae14df4fbd7893cb4d6e7","amp;dn":"Man+vs+Wild+-+Season+01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8520adcc4a82e2c2267ae14df4fbd7893cb4d6e7","infoHashBuffer":{"type":"Buffer","data":[133,32,173,204,74,130,226,194,38,122,225,77,244,251,215,137,60,180,214,231]},"announce":[],"urlList":[]}}