{"title":"Neil Peart - Anatomy Of A Drum Solo","uid":4494317,"size":9282734992,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:85a5c46163d592449d4df6ff1a17c1ec46873f86&amp;dn=Neil+Peart+-+Anatomy+Of+A+Drum+Solo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"shemyaza","files":-1,"time":1226114364,"description":"Neil Peart - Anatomy Of A Drum Solo\n\nAnatomy Of A Drum Solo presents newly-recorded in-studio footage of Rush's celebrated drum star Neil Peart discussing his approach to soloing. Using a solo recorded in Frankfurt 2004 as a framework, Neil talks about each segment of this nine-minute tour-de-force which has become a famed feature of the Rush live experience. Techniques are explained in detail, as Peart guides you through the thought processes and inspirations that combine to form the solo.\n\nAlso included are two 'explorations' - completely improvised workouts at the drums, each over 30 minutes long, a never-before released solo recorded in Hamburg 2004, a previously unreleased solo from the 1994 Counterparts tour, Neil's Grammy-nominated solo, and two full Rush performances from 2004, all shot from the drum-camera perspective.\n\nThis remarkable collection of performance footage and interviews is complimented by a host of special DVD features including:\n\n    * Camera Option - the viewer can choose several different camera perspectives\n    * Alternate edits - showing examples in full screen without commentary\n    * Audio-only tracks Momo's Dance Party and Pieces Of Eight\n    * A PDF transcription of Neil's entire performance of Der Trommler\n    * Photo Gallery\n    * Interviews with Lorne Wheaton - Neil's drum tech.\n\nDisc 1: ANATOMY OF A DRUM SOLO\n\n1. &quot;Der Trommler&quot; Neil's analysis and discussion of &quot;Der Trommler&quot;\n2. Sidebar 1 - Exclusive Hamburg solo (&quot;Ich Bin Ein Hamburger&quot;)\n3. Sidebar 2 - &quot;Exploration #1&quot;\n\nDisc 2: Bonus Features:\n\n1.Paul Northfield, Rush co-producer and engineer\n2.Lorne Wheaton, Neil's drum tech Lorne Wheaton setting up and talking about Neil's drumkit\n\nTwo Rush performances from the perspective of the drum cameras\nPreviously unreleased solo from Rush's 1994 Counterparts tour\nTracks\n\n1. &quot;Exploration #2&quot;\n2. &quot;O Baterista&quot; (solo from Rush in Rio)\n","torrent":{"xt":"urn:btih:85a5c46163d592449d4df6ff1a17c1ec46873f86","amp;dn":"Neil+Peart+-+Anatomy+Of+A+Drum+Solo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85a5c46163d592449d4df6ff1a17c1ec46873f86","infoHashBuffer":{"type":"Buffer","data":[133,165,196,97,99,213,146,68,157,77,246,255,26,23,193,236,70,135,63,134]},"announce":[],"urlList":[]}}