{"title":"Cool Down - Getting Further by Going Slower - EPUB","uid":9672184,"size":389838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85f7654612dbe4966dbd47016e6bfa636ddf466b&amp;dn=Cool+Down+-+Getting+Further+by+Going+Slower+-+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393484984,"description":"ISBN: 0470839023\nPublished: 2007\nFormat: EPUB\nPages: 288 pages\n\nTap into the power that cool thinking generates-learn how going slower can actually help you get more done, faster.\nBefore you check your wireless e-mail for the fourth time this hour, ask yourself, is this truly helping you get further ahead? Or is the pressure to address the immediate actually pushing you backwards?\nCool Down takes a look at our innate and powerful addiction to high-speed activity, and shows how it is robbing us of the ability to think creatively and to connect with others (clients, colleagues, managers, and even family) just when we need to the most.\nCool Down offers a provocative look at the value of slowing down in many aspects of our lives and demonstrates clearly that to get further ahead, faster, people do actually need to cool down. It's not about doing less; it's about achieving more by slowing down. Cool Down highlights the harmful effects of speed on productivity and reveals the value of slow in helping us to think clearly and prioritize more effectively.\nCool Down is a fascinating look at the world of work, revealing how and why slow is the next tool of strategic advantage.\nShows why and how to consciously step away from reactionism, pressure, and overload.\nReveals the numerous ways in which cooling down will improve your potential and abilities--intellectually, emotionally, and creatively--making you more productive by going slower.\nContains practical advice that will help you apply cool techniques to real-world situations: at work, on the road, and at home.\nExplains how to improve communication with your boss, your colleagues, and your family.\nFeatures lots of examples, practical tips, to-dos, and concepts that are memorable and easy to apply. Each end-of-chapter summary includes &quot;Key Points to Take Away&quot; and assessment questions to help you honestly observe and change your current habits.\nA complete approach to managing the pressures of life in a fast-paced world, Cool Down allows you to slow down so you can get ahead--and stay there.","torrent":{"xt":"urn:btih:85f7654612dbe4966dbd47016e6bfa636ddf466b","amp;dn":"Cool+Down+-+Getting+Further+by+Going+Slower+-+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85f7654612dbe4966dbd47016e6bfa636ddf466b","infoHashBuffer":{"type":"Buffer","data":[133,247,101,70,18,219,228,150,109,189,71,1,110,107,250,99,109,223,70,107]},"announce":[],"urlList":[]}}