{"title":"Blind Spot","uid":5549806,"size":733163520,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:86133a56e23165fb564f52e553abe9ab4290011d&amp;dn=Blind+Spot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"NevenAcropolis","files":1,"time":1273500376,"description":"Ever since I had read about this documentary on The Oil Drum I was eagerly awaiting its arrival on one of the torrent sites. And no wonder, as this documentary film has the following talking heads:\n\nWilliam Catton Jr., Max Fraad Wolff, Richard Heinberg, Kenneth Deffeyes, Albert Bartlett, Roscoe Bartlett, James Hansen, David Pimentel, Joseph Tainter, David Korten, Jason Bradford, Elke Weber, Mary-Ann Hitt, Terry Tamminen, Ted Caplow and Derrick Jensen\n\nThat's quite a star cast for discussing things like peak oil, global warming and societal collapse. And in this respect the documentary doesn't disappoint for one moment. Unlike many other films on these themes (and I think I have seen most of them) this documentary delves into the psychology that is causing the cocktail of converging crises that human society is facing in my opinion. Very little is left out.\n\nI was quite amazed that the film didn't show up on any torrent sites and finally decided to buy it (I normally do that afterwards when a documentary really appealed to me and I want the makers to continue doing what they do by buying a dvd of their work or by donating). I hope the makers of Blind Spot will forgive me for ripping their dvd and seeding it, but their film is so excellent that it has to be seen by as many people as possible. I believe it's in the same league as documentaries as The Century of the Self, The Corporation and Blue Gold: World Water Wars, all of them eye- and mind-openers.\n\nI encourage everyone who downloaded this documentary to seed AND buy it (it's pretty cheap on eBay).\n\n\nIMDB (9.0 score): http://www.imdb.com/title/tt1285158/\nTrailer:","torrent":{"xt":"urn:btih:86133a56e23165fb564f52e553abe9ab4290011d","amp;dn":"Blind+Spot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86133a56e23165fb564f52e553abe9ab4290011d","infoHashBuffer":{"type":"Buffer","data":[134,19,58,86,226,49,101,251,86,79,82,229,83,171,233,171,66,144,1,29]},"announce":[],"urlList":[]}}