{"title":"Sony Vegas Pro 9.0c Build 896 [32.64 bit][MULTi][Full+Plug-in]","uid":5386475,"size":471062528,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:862d807897f4df055b33ed438a8317b85ae5c399&amp;dn=Sony+Vegas+Pro+9.0c+Build+896+%5B32.64+bit%5D%5BMULTi%5D%5BFull%2BPlug-in%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"whiteXmatter","files":-1,"time":1266914070,"description":"Sony Vegas Pro 9.0c Build 896 [32.64 bit][MULTi][Full+Plug-in]\n\nOperating system: Windows XP (32 and 64 bit), Vista (32 and 64 bit) and Windows 7 (32 and 64 bit) \nLanguages: English, Spanish, French, German and Japanese \nFormat: Iso\n\nSony Vegas Pro 9 is a powerful video editor aimed at users looking for professionals or professional results. It combines powerful audio and video editing in a single, comprehensive development platform. \nThis comprehensive suite offers the most robust and progressive platform for content creation and production. Sony Vegas Pro 9, improving its interface and includes new editing tools, among which include the ability to capture AVCHD video without the need for intermediate conversions. \n\nAs for video editing, capture devices Vegas offers high quality, over 300 effects and transitions, support for editing and creating subtitles, encoding MPEG2 (for DVDs), import SWF files (Flash animation), and much more . \n\nIts capacity in terms of audio processing is also not far behind, supporting an unlimited number of simultaneous tracks, support for 5.1 channel more than 30 customizable effects and the possibility of increasing its capacity and range thanks to support for VST plugins. \n\nPrecise editing tools. You can edit video in HD or SD with drag and drop, cut with the mouse or keyboard. Features include ProType Titling technology, multicamera editing tools, 32-bit video processing, customizable window layouts, improved HDV / SDI / XDCAM, Cinescore plug-in support, A / V synchronization detection and repair, and auto-frame quantization. \n\nWhat are the top features to consider Sony Vegas Pro 9? \n\nMainly are 6: \nNative support for all video formats in SD and HD. \nExtensive format support, including XDCAM EX and Red One \nAuthoring for Blu-Ray very intuitive. \nSupport for projects in 4K, about 4096 x 4096 resolution. \nThe most powerful audio editing tools available in a nonlinear editing system. [Edit audio without using other software] \nIt includes native versions of Vegas Pro 9 to 32 and 64 bits. \n\nIn addition, other details: \nYou can use an unlimited number of video tracks when creating your work. \nSophisticated effects liluminaciÃƒÂ³n; The Vegas Pro 9 includes over 190 customizable video effects, including a series of lighting effects. \nLarge multi-format video support: Supports natively on the new line of professional cameras XDCAM EX and RED One, very fashionable these days. It also includes support for still images over 1 Gigapixel resolution. Pan-Crop can use to create film sequences with large-size images, keeping the HD resolution. \nSuperior Audio Control; Use unlimited tracks, 24-bit/192 kHz audio, 5.1 surround mixing, effects automation, and compression / expansion of time. Apply audio effects in real time, like EQ, Reverb, Delay, and more, all customizable. Expand your audio processing and mixing options with support for DirectX Ã‚Â® and VST audio plug-ins. Use the mixing console for a more precise audio control. \n\n\n==============================================================\n\n==============================================================\n\nSistema Operativo: Windows XP ( 32 y 64 bits ), Vista ( 32 y 64 bits ) y Windows 7 ( 32 y 64 bits )\nIdiomas: InglÃƒÂ©s,EspaÃƒÂ±ol, FrancÃƒÂ©s, AlemÃƒÂ¡n y JaponÃƒÂ©s\nFormato: Iso\n\nSony Vegas Pro 9 es un potente editor de vÃƒÂ­deo orientado a profesionales o a usuarios que busquen resultados profesionales. AÃƒÂºna una potente ediciÃƒÂ³n de audio y vÃƒÂ­deo en una ÃƒÂºnica y completa plataforma de creaciÃƒÂ³n.\nEsta completa suite ofrece la mÃƒÂ¡s sÃƒÂ³lida y progresiva plataforma para la creaciÃƒÂ³n y producciÃƒÂ³n de contenidos. Sony Vegas Pro 9, mejora su interfaz e incluye nuevas herramientas de ediciÃƒÂ³n, entre las que se incluye la posibilidad de capturar vÃƒÂ­deo AVCHD sin necesidad de hacer conversiones intermedias.\n\nEn cuanto a la ediciÃƒÂ³n de vÃƒÂ­deo, Vegas ofrece captura de dispositivos de alta calidad, mÃƒÂ¡s de 300 efectos y transiciones, soporte para ediciÃƒÂ³n y creaciÃƒÂ³n de subtÃƒÂ­tulos, codificaciÃƒÂ³n MPEG2 (para DVD), importa archivos SWF (animaciones Flash), y mucho mÃƒÂ¡s.\n\nSu capacidad en cuanto a tratamiento de audio tampoco queda muy atrÃƒÂ¡s, soportando un nÃƒÂºmero ilimitado de pistas simultÃƒÂ¡neas, soporte para canales 5.1, mÃƒÂ¡s de 30 efectos personalizables y con la posibilidad de aumentar su capacidad y variedad gracias al soporte de plugins VST.\n\nPrecisas Herramientas de EdiciÃƒÂ³n. Puede editar vÃƒÂ­deo en HD o SD con un simple arrastrar y soltar, recortar con el mouse o teclado. Las caracterÃƒÂ­sticas incluyen la tecnologÃƒÂ­a ProType de TitulaciÃƒÂ³n, herramientas de ediciÃƒÂ³n multicÃƒÂ¡mara, 32-bits de procesamiento de vÃƒÂ­deo, diseÃƒÂ±os de ventana personalizables, la mejora de HDV / SDI / XDCAM, plug-in Cinescore de apoyo, A / V de sincronizaciÃƒÂ³n de detecciÃƒÂ³n y reparaciÃƒÂ³n, y cuantizaciÃƒÂ³n auto-frame.\n\nÃ‚Â¿CuÃƒÂ¡les son las caracterÃƒÂ­sticas top para considerar Sony Vegas Pro 9?\n\nPrincipalmente son 6:\nSoporte nativo para todos los formatos de video en SD y HD.\nAmplio soporte de formatos, incluyendo XDcam Ex y Red One.\nAutorÃƒÂ­a para discos Blu-Ray muy intuitiva.\nSoporte para proyectos en 4K, sobre 4096 x 4096 de resoluciÃƒÂ³n.\nLas mÃƒÂ¡s poderosas herramientas para ediciÃƒÂ³n de audio disponibles en un sistema de ediciÃƒÂ³n no lineal. [ editar el audio sin usar otro software]\nIncluye versiones nativas de Vegas Pro 9, para 32 y 64 bits.\n\nAdemÃƒÂ¡s, otros detalles:\nPuedes utilizar un nÃƒÂºmero ilimitado de pistas de video a la hora de crear tu obra.\nSofisticados efectos de liluminaciÃƒÂ³n; El Vegas Pro 9 incluye mÃƒÂ¡s de 190 efectos de video personalizables, incluida una serie de efectos para iluminaciÃƒÂ³n.\nAmplio soporte multiformato de video: Soporta en forma nativa la nueva lÃƒÂ­nea de cÃƒÂ¡maras profesionales XDCam Ex y RED One, muy de moda por estos dÃƒÂ­as. TambiÃƒÂ©n incluye soporte para imÃƒÂ¡genes fijas de mÃƒÂ¡s de 1 GigaPixel de resoluciÃƒÂ³n. Puedes utilizar Pan-Crop para crear secuencias de pelÃƒÂ­cula con las imÃƒÂ¡genes a gran tamaÃƒÂ±o, manteniendo asÃƒÂ­ la resoluciÃƒÂ³n HD.\nControl de Audio Superior; Uso ilimitado de pistas, 24-bit/192 kHz de audio, mezcla surround 5.1, automatizaciÃƒÂ³n de efectos, y compresiÃƒÂ³n / expansiÃƒÂ³n de tiempo. Aplicar efectos de audio en tiempo real, como EQ, Reverb, Delay, y mucho mÃƒÂ¡s, todos personalizables. AmplÃƒÂ­a tu proceso de audio y opciones de mezcla con el apoyo de DirectX Ã‚Â® y VST plug-ins de audio. Usa la consola de mezclas para un control de audio mÃƒÂ¡s preciso.\n\n","torrent":{"xt":"urn:btih:862d807897f4df055b33ed438a8317b85ae5c399","amp;dn":"Sony+Vegas+Pro+9.0c+Build+896+%5B32.64+bit%5D%5BMULTi%5D%5BFull%2BPlug-in%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"862d807897f4df055b33ed438a8317b85ae5c399","infoHashBuffer":{"type":"Buffer","data":[134,45,128,120,151,244,223,5,91,51,237,67,138,131,23,184,90,229,195,153]},"announce":[],"urlList":[]}}