{"title":"Hogtied------HT-28194 Beretta James","uid":8060921,"size":3415525716,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:864b958dacfa5c0dccce2f4d81f13d3e05c1b03f&amp;dn=Hogtied------HT-28194+Beretta+James&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"merzedes","files":-1,"time":1359063721,"description":"Beretta - Challenged with Wanton Cruelty\n\nJan 24, 2013 - Performers: Beretta James \n\n\nMP4 and WMV + Pics.    \n        \n\nWhat do you do to one of Kink's toughest models? Anything and everything. Honey skinned and gorgeous Beretta returns for another serving of hard rope bondage and intense orgasms. In scene one, Beretta is bound in a hogtie with her hair attached to the pulley. Helpless, she can only watch as Claire torments her face and with flat sticks. Claire like's Beretta's belt. She takes it off her and adds it to Beretta's neck to choke her. After more torment, Beretta is transitioned into a kneeling position with a very cruel mouth gag to keep her tame. Second, our saucy cunt is bound in an uncomfortable chair tie with her hair nice and tight to the pulley again. A tube gag is added and Claire insists that Beretta no longer be able to breathe through her nose, only her mouth. She enforces this demand by spraying whipped cream all over Beretta's face - how humiliating! After more delicious twine and suction on this cunt's tits, Beretta is worked thoroughly into an erotic frenzy of cum and squirt. Finally Beretta is bound on the box in a pretzel tie. Her exposed ass is warmed and reddened by the flip cat with a stern guide on taking the pain like a lady and not a pussy. She is suspended in her predicament and fucked repeatedly in the ass like a good slut and pushed far, hard, and without hesitation.\n\nScreens   &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=28194&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=28194&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:864b958dacfa5c0dccce2f4d81f13d3e05c1b03f","amp;dn":"Hogtied------HT-28194+Beretta+James","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"864b958dacfa5c0dccce2f4d81f13d3e05c1b03f","infoHashBuffer":{"type":"Buffer","data":[134,75,149,141,172,250,92,13,204,206,47,77,129,241,61,62,5,193,176,63]},"announce":[],"urlList":[]}}