{"title":"BATMAN (1966) 23-34 [retr?tv]","uid":3961329,"size":2202361903,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:869721d60e0502d5baa3b49e40f2f5b99d787bb6&amp;dn=BATMAN+%281966%29+23-34+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"flixer","files":13,"time":1199468986,"description":"BATMAN (1966) 23-34\nStars: Adam West (Bruce Wayne/Batman), Burt Ward (Richard Grayson/Robin: The Boy Wonder), Alan Napier (Alfred Pennyworth), Neil Hamilton (Commissioner James Gordeon), Stafford Repp (Chief O&amp;#039;Hara), William Dozier (Narrator)\n\n23. THE RING OF WAX  (3/30/1966)\nThe Riddler&amp;#039;s latest scheme involves stealing a wax figure to melt down for its wax that is powerfully corrosive when exposed to direct flame. The Caped Crusader and The Boy Wonder track their foes back to The Wax Museum, where they are immediately overpowered and taken to Riddler&amp;#039;s hideout, where they are suspended by rope over a huge vat of boiling wax, which Riddler plans to use to convert them into giant human candles!\nGuest star: David Lewis (Warden Crichton), Byron Keith (Mayor Lindseed), Frank Gorshin (The Riddler) , Joe E. Tata (Tallow), Michael Greene (Matches), Linda Gaye Scott (Moth), Anne Ayars (Madame Soleil), Elizabeth Harrower (Miss Prentice), Al McGranary (Mayor)\n\n24. GIVE &amp;#039;EM THE AXE  (3/31/1966)\nTaking advantage of the Riddler&amp;#039;s mistaken belief that they were killed escaping his deathtrap, the Dynamic Duo must stop the villain from stealing a treasure of Incan jewels that would mean destroying an archaeological treasure as well.\nGuest star: David Lewis (Warden Crichton), Byron Keith (Mayor Lindseed), Frank Gorshin (The Riddler) , Joe E. Tata (Tallow), Michael Greene (Matches), Linda Gaye Scott (Moth), Anne Ayars (Madame Soleil), Elizabeth Harrower (Miss Prentice), Al McGranary (Mayor)\n\n25. THE JOKER TRUMPS AN ACE  (4/6/1966)\nThe Clown Prince Of Crime, The Joker launches a new crime wave with robberies that appear to make no sense, such as stealing hairpins from rich women and a hole from a golf course. But the Joker knows exactly what he&amp;#039;s doing. Batman and Robin are in pursuit and eventually invade the villain&amp;#039;s headquarters. The heroes are placed in a chamber and are told if they can float for an hour, they&amp;#039;ll go free. The Joker then begins to flood the chamber with poison gas. The Joker says the Dynamic Duo may not be able to swim in the gas &quot;but you can drown in it!&quot;\nGuest star: David Lewis (Warden Crichton), Cesar Romero (The Joker), Byron Keith (Mayor Lindseed) , Jane Wald (Jill), Dan Seymour (Maharajah), Tol Avery (Mr. Prescott Belmont), Angela Greene (Mrs. Belmont), Norman Alden (Lookout), Johnny Seven (Henchman #2), Bebe Louie (Girl Clerk)\n\n26. BATMAN SETS THE PACE  (4/7/1966)\nAfter an ingenious escape, Batman and Robin again pick up the trail of the Joker. The villain&amp;#039;s ultimate crime is designed not only to make him rich but to ruin Batman&amp;#039;s reputation.\nGuest star: Cesar Romero (The Joker), Byron Keith (Mayor Lindseed) , Jane Wald (Jill), Dan Seymour (Maharajah), Tol Avery (Mr. Prescott Belmont), Angela Greene (Mrs. Belmont), Norman Alden (Lookout), Johnny Seven (Henchman #2), Bebe Louie (Girl Clerk)\n\n27. THE CURSE OF TUT  (4/13/1966)\nA former academic who thinks he is really King Tut has returned. Batman and Robin seek his capture. A twist occurs, however, when King Tut&amp;#039;s gang kidnaps Bruce Wayne. They are taking the millionaire in an ambulance. As Bruce tries to get free, the rear doors of the ambulance open and Bruce rides a cart toward a cliff.\nGuest star: Byron Keith (Mayor Lindseed), Victor Buono (King Tut) , Olan Soule (Newscaster), William Boyett (Policeman), Don &amp;#039;Red&amp;#039; Barry (Grand Vizier), Frank Christi (Royal Scrivener), Ziva Rodann (Nefertiti), Bill Quinn (I) (Board Member), Emmanuel Thomas (Reporter)\n\n28. THE PHARAOH&amp;#039;S IN A RUT  (4/14/1966)\nBatman sets a trap for King Tut, but is captured along with Tut&amp;#039;s faithless Queen Nefertiti.\nGuest star: David Lewis (Warden Crichton), Byron Keith (Mayor Lindseed), Victor Buono (King Tut) , Olan Soule (Newscaster), William Boyett (Policeman), Don &amp;#039;Red&amp;#039; Barry (Grand Vizier), Frank Christi (Royal Scrivener), Ziva Rodann (Nefertiti), Bill Quinn (I) (Board Member), Emmanuel Thomas (Reporter)\n\n29. THE BOOKWORM TURNS  (4/20/1966)\nIn order to lure Batman and Robin to Police Headquarters, The Bookworm, a nororious master of stolen book plots, stages a phony assassination attempt on Commissioner Gordon. Lydia uses a trick book to gas Robin to sleep and she contacts Bookworm, who, along with his henchmen Printer&amp;#039;s Devil, Typesetter, and Pressman, transfer Robin to The Wayne Memorial Clock Tower, erected in memory of Dr. Thomas Wayne, Bruce&amp;#039;s late father (oh, the treacherous irony!), where The Boy Wonder is strapped to the clapper of the giant bell of Big Benjamin. When the clock strikes @ midnight, the bell will begin to toll the hour. The Bookworm departs, leaving Robin to be &quot;rung&quot; out!\nGuest star: Byron Keith (Mayor Lindseed) , Roddy McDowall (The Bookworm), Jim O&amp;#039;Hara (Sergeant), Tony Aiello (Pressman), John Crawford (Printer&amp;#039;s Devil), Jan Peters (Typesetter), Francine York (Lydia Limpet)\n\n30. WHILE GOTHAN CITY BURNS  (4/21/1966)\nRecalling one of Lydia&amp;#039;s cryptic remarks (&quot;He strikes at midnight,&quot; she said) Batman divines the meaning, and races to Big Benjamin to attempt to stop the clock and save Robin before it&amp;#039;s too late. Our heroes eventually subdue The Pernicious Plagiarist and his bookish crew at the library, saving Gotham City yet again.\nGuest star: Byron Keith (Mayor Lindseed) , Roddy McDowall (The Bookworm), Jim O&amp;#039;Hara (Sergeant), Tony Aiello (Pressman), John Crawford (Printer&amp;#039;s Devil), Jan Peters (Typesetter), Francine York (Lydia Limpet)\n\n31. DEATH IN SLOW MOTION  (4/27/1966)\nThe Riddler and his felonious fimmaking cronies (Pauline, C.B., Von Bloheim and Wolf) interrupt a silent film festival of a famous silent film collector Mr. Van Jones dressed as Charlie Chaplin and The Keystone Cops (much to the disgust of Van Jones, who believes the act takes all the attention from the movies!), and steal the box-office receipts! Batman and Robin trace Riddler via one of his Riddles to Mother Gotham&amp;#039;s Bakery, where he not only plans to pilfer its payroll, but film the whole robbery in the style of an old film comedy. The cliffhanger comes when, Pauline, The Riddler&amp;#039;s moll, disguises herself as Little Bo Peep and gasses The Boy Wonder to sleep, kidnapping him and taking him to the abandoned Gotham Lumberyard, where in a matter of minutes a giant buzzsaw threatens to slice him in two!\nGuest star: David Lewis (Warden Crichton), Byron Keith (Mayor Lindseed), Frank Gorshin (The Riddler), Richard Bakalyan (C.B.) , Virginia Wood (Sylvia), Judy Pace (Cashier), Walter Woolf King (Theater Manager), Francis X. Bushman (Van Jones), Theodore Marcuse (VonBloheim), Sherry Jackson (Pauline), Burt Brandon (Wolf), Alex Bookston (Guard), Theodore Marcuse (Von Bloheim)\n\n32. THE RIDDLER&amp;#039;S FALSE NOTION  (4/28/1966)\nWhen Batman reaches the boy at the saw, he finds he has been duped by a Robin-disguised dummy. Again, The Caped Crusader finds The Riddler filming The Boy Wonder, this time as Robin is about to be pushed off a ledge onto the street below, and the crooked crew is preparing to film Robin&amp;#039;s fatal fall during an unsuccessful &quot;Harold Lloyd&quot;-style scene. Batman tosses down a Batarang just as Riddler thrusts Robin over the edge, and the boy catches it between his teeth.\nGuest star: David Lewis (Warden Crichton), Byron Keith (Mayor Lindseed), Frank Gorshin (The Riddler), Richard Bakalyan (C.B.) , Virginia Wood (Sylvia), Judy Pace (Cashier), Walter Woolf King (Theater Manager), Francis X. Bushman (Van Jones), Theodore Marcuse (VonBloheim), Sherry Jackson (Pauline), Burt Brandon (Wolf), Alex Bookston (Guard), Theodore Marcuse (Von Bloheim)\n\n33. FINE FINNY FIENDS  (5/4/1966)\nThe Penguin kidnaps Alfred Pennyworth after luring him to a phony fish store selling cut-rate caviar. Alfred is then brainwashed by the pudgy purveyor of perfidy in preparation for his plan to rob The Multimillionaires&amp;#039; Annual Award Dinner. Later, a fishook which had fallen out of Alfred&amp;#039;s morning coat appears inside one of the canapes the butler prepared for the buffet before the awards. The hook tips off The Caped Crusader that The Penguin&amp;#039;s hideout is on a fishing pier owned by the bird under the moniker of Knott A. Fish (&quot;not a fish,&quot; get it?! Never mind.). The Penguin and his Finks capture The Dynamic Duo and places them inside a vaccum tank filled with balloons for a trap that will take Batman and Robin&amp;#039;s breath away--literally! As the air is slowly sucked out of the room, the balloons begin to break; The Dynamic Duo will become a Doomed Duo once the final balloon has burst!\nGuest star: David Lewis (Warden Crichton), Byron Keith (Mayor Lindseed), Burgess Meredith (The Penguin) , Bill Williams (Multimillionaire), Frank Wilcox (Millionaire), Ann Reece (Beauty), Lisa Mitchell (Miss Natural Resources), Charles La Torre (Manager), Dal Jenkins (Shark), Julie Gregg (Finella), Louie Elias (Swordfish), Victor Lundin (Octopus)\n\n34. BATMAN MAKES THE SCENES  (5/5/1966)\nAll goes well at the Millionaires&amp;#039; Dinner until time arrives for dessert with the giant cake containing Finella. As she pops out of the cake, she uses Penguin&amp;#039;s gas-filled umbrella to put the millionaires to bed; as they slumber, The Penguin and his Finks snatch the charity money.\nGuest star: David Lewis (Warden Crichton), Byron Keith (Mayor Lindseed), Burgess Meredith (The Penguin) , Bill Williams (Multimillionaire), Frank Wilcox (Millionaire), Ann Reece (Beauty), Lisa Mitchell (Miss Natural Resources), Charles La Torre (Manager), Dal Jenkins (Shark), Julie Gregg (Finella), Louie Elias (Swordfish), Victor Lundin (Octopus) \n\nColor/XviD/560x416/23.97fps\nmp3/48kHz/107kbps/25min","torrent":{"xt":"urn:btih:869721d60e0502d5baa3b49e40f2f5b99d787bb6","amp;dn":"BATMAN+%281966%29+23-34+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"869721d60e0502d5baa3b49e40f2f5b99d787bb6","infoHashBuffer":{"type":"Buffer","data":[134,151,33,214,14,5,2,213,186,163,180,158,64,242,245,185,157,120,123,182]},"announce":[],"urlList":[]}}