{"title":"For the People - Howlett, Leiberman [PDF] [StormRG]","uid":9878494,"size":3167785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8699199c757570f556c409e3a33f4a616141c5bc&amp;dn=For+the+People+-+Howlett%2C+Leiberman+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":3,"time":1396506160,"description":"Author: Charles Howlett (Author), Robbie Lieberman (Author)\nPaperback: 376 pages\nPublisher: Information Age Publishing (October 12, 2009)\nLanguage: English\nISBN-10: 1607523051\nISBN-13: 978-1607523055\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\nFor the People is a historical docutext that examines the evolution of the struggle for peace and justice in America's past, from pre-colonial times to the present. Each chapter begins with a brief historical introduction followed by a series of primary source documents and questions to encourage student comprehension. Sample photographs illustrate the range of peace activists' concerns, while the list of references, focused on the most important works in the field of U.S. peace history, points students toward opportunities for further research. This is the only historical docutext specifically devoted to peace issues. The interpretive analysis of American peace history provided by the editors makes this more than just an anthology of collected documents. As such, the docutext is an extension and a complement to the editors' recently published popular scholarly survey, A History of the American Peace Movement from Colonial Times to the Present. A central idea in this work is that peace is more than just the absence of war. The documents, and the analysis that accompanies them, offer fresh perspectives on the ways in which the peace movement became transformed from one simply opposing war to one proclaiming the importance of social, political, and economic equality. The editors' premise is that the peace movement historically has been a collective attempt by numerous well-intentioned people to improve American society. The book illuminates the ways in which peace activists were often connected to larger reform movements in American history, including those that fought for the rights of working people, for women's equality, and for the abolition of slavery, to name just a few. With a focus on those who spoke out for peace, this docutext is designed to call to students' attention one of the least discussed classroom subjects in American education today. Students in secondary school Social Studies and American history classes as well as those taking college level courses in U.S. history, American Studies, or Peace Studies will find this work an excellent supplementary reader.","torrent":{"xt":"urn:btih:8699199c757570f556c409e3a33f4a616141c5bc","amp;dn":"For+the+People+-+Howlett%2C+Leiberman+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8699199c757570f556c409e3a33f4a616141c5bc","infoHashBuffer":{"type":"Buffer","data":[134,153,25,156,117,117,112,245,86,196,9,227,163,63,74,97,97,65,197,188]},"announce":[],"urlList":[]}}