{"title":"White Women, Race Matters: The Social Construction of Whiteness ","uid":8793080,"size":1471056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86d2ceaceb40faa70708181d72479a45c9402d6a&amp;dn=White+Women%2C+Race+Matters%3A+The+Social+Construction+of+Whiteness+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1376002822,"description":"Publication Date: January 24, 1994 | ISBN-10: 0415105102 | ISBN-13: 978-0415105101 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload. | filetype: pdf |\n\n\n\nTraditional debates concerning racially hierarchical societies have tended to focus on the experience of being black. White Women, Race Matters breaks with this tradition by focusing on the particular experiences of white women in a racially hierarchical society. By considering the ways in which their experience not only contributes to but challenges the reproduction of racism, the work offers a rigorous examination of existing methodologies, practices and assumptions concerning racism and gender relations. Supported by extracts from in-depth life history interviews, White Women, Race Matters provides valuable course material.\n\n\n\n\nFrom Publishers Weekly\nThrough documenting the life histories of 30 white women, Frankenberg compellingly outlines the interplay of perception and reality in shaping the structures of racism. Rather than understanding whiteness as neutral and void of race, Frankenberg straightforwardly argues that whiteness and its accompanying privilege is crucial in structuring race relations. She proposes that the women she interviewed struggled to understand and to situate themselves within, or outside of, existing race relations and racial consciousness. For example, several subjects reported that as children, they never thought about race, while others, though raised in segregated and racist environments, found ways to challenge the status quo. Frankenberg explores our experiences and perceptions of race, sex and intimacy; she considers, for example, how white girls are taught to fear black men. This book is a valuable contribution to the study of the relationship of whiteness to race, and is a must for anyone concerned with issues of feminism and racism. Frankenberg is assistant professor of American studies at the University of California at Davis.\n\n\n\n\nHardcover: 304 pages\nPublisher: Routledge (January 24, 1994)\nLanguage: English\nISBN-10: 0415105102\nISBN-13: 978-0415105101\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/White-Women-Race-Matters-Construction/dp/0415105102/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/White-Women-Race-Matters-Construction/dp/0415105102/&lt;/a&gt;\n\n\n\nTags: race, racism, right, wing, republican, race coding, racially coded, subtle, doublespeak, George W Bush, George H.W Bush, Nixon, John Locke, William F Buckley, barack, obama, barry, black, biracial, IR, multiracial, preseident, bush, war, afghanistan, 2008, change, yes, we, can, hope, biden, china, afghanistan, tea, party, republican, democrat, politics, nobel, prize, war, peace, diplomacy, command, military, race, relations, racism, chicago, senator, white, caucasian, white guilt, white anxiety, african, american, african american, black, racism, sociology, social mobiility, social climbing, mentor, race relations, race, militia, hate, nazi, white anxiety, oppression, tea party, fundamentalist, fundementalism, political science, hate group, ghettoization, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious,\n","torrent":{"xt":"urn:btih:86d2ceaceb40faa70708181d72479a45c9402d6a","amp;dn":"White+Women%2C+Race+Matters%3A+The+Social+Construction+of+Whiteness+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86d2ceaceb40faa70708181d72479a45c9402d6a","infoHashBuffer":{"type":"Buffer","data":[134,210,206,172,235,64,250,167,7,8,24,29,114,71,154,69,201,64,45,106]},"announce":[],"urlList":[]}}