{"title":"VA - All Trap Music (2013 [FLAC]","uid":9228000,"size":1203301705,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:86dfc6b8ea52efa38d57776fde9c8f0155199bca&amp;dn=VA+-+All+Trap+Music+%282013+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"djqazi","files":-1,"time":1385034932,"description":"Release Date March 26, 2103\n\nDuration01:03:46\n\nGenre:\nTrap\nElectronic\nPop/Rock\n\nStyles:\nEDM\nBass Music\nClub/Dance\n\n\n\nGetting hype and going dumb isn't easy when the music is whack, but All Trap Music has got the bleeping, booming, and stuttering sounds to get you moving, and maybe even shaking, that is, &quot;Harlem Shaking.&quot; It's a shame that pivotal track isn't included here, since it's trap music's biggest contribution to society, and a twitching and booming example of the limited genre's sound and strong points. Still, the artist who cut it, Brooklyn producer Baauer, is present with his earlier and almost equally awesome single, the short and sweet party robot called &quot;Dum Dum.&quot; Many other leading trap music names are here as well, with Chicago's Flosstradamus causing hip swaying and brain melting with their bottom-heavy &quot;Rollup&quot; (the bottom made even heavier by the included Baauer remix) while elsewhere, they're collaborating with Detroit rapper Danny Brown for the stoned-and-screwing anthem &quot;From the Back.&quot; Then there's the great &quot;Spooked,&quot; where Bro Safari and DJ Craze re-create the sound of a Three 6 Mafia CD skipping in the best way possible, and if you want the hood music-meets-techno style that trap music proudly declares itself to be, jump right to Gent &amp; Jawns' kinetic &quot;Turnup,&quot; where 808s rumble, thugs get rowdy, and roofs get raised. With Salva on the remix, R.L. Grimes' &quot;Grapes Alla Vodka&quot; takes the genre farther than expected, going cute and goofy rather than dumb, and bringing reminders of early rave music with its now tinker toy synths. Nice set, great representation, very infectious, party worthy, and wonderfully dumb.","torrent":{"xt":"urn:btih:86dfc6b8ea52efa38d57776fde9c8f0155199bca","amp;dn":"VA+-+All+Trap+Music+%282013+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86dfc6b8ea52efa38d57776fde9c8f0155199bca","infoHashBuffer":{"type":"Buffer","data":[134,223,198,184,234,82,239,163,141,87,119,111,222,156,143,1,85,25,155,202]},"announce":[],"urlList":[]}}