{"title":"Cocinar Con Una Pizca De Ciencia - JoaquÃƒÂ­n PÃƒÂ©rez Conesa","uid":5926882,"size":7679507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86e79d3a40bc87302fd0755116a5983dd6e76e62&amp;dn=Cocinar+Con+Una+Pizca+De+Ciencia+-+Joaqu%C3%83%C2%ADn+P%C3%83%C2%A9rez+Conesa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chusca","files":3,"time":1288630865,"description":"Este es un Libro sobre cocina, pero desde el enfoque cientÃƒÂ­fico, describe cada proceso como un proceso quÃƒÂ­mico o fÃƒÂ­sico. Pero lo mas importante, es que es ameno, tiene recetas, y desmiente algunos mitos en la cocina, totalmente recomendable.\n-Texto del editor:\nCon este libro JoaquÃƒÂ­n PÃƒÂ©rez Conesa introduce al lector en el fantÃƒÂ¡stico mundo de la cocina, de una cocina sistematizada de forma lÃƒÂ³gica por procesos culinarios. Con un lenguaje sencillo y apropiado va despejando poco a poco el empirismo de la cocina tradicional y explicando los cÃƒÂ³mos y por quÃƒÂ©s de hechos culinarios, al mismo tiempo que aporta soluciones. \nCÃƒÂ³mo desarrollar nuevos aromas y sabores. Por quÃƒÂ© se corta una salsa mahonesa. Por quÃƒÂ© unas albÃƒÂ³ndigas salen apelmazadas y otras se deshacen. Por quÃƒÂ© unos arroces en paella salen empastados y otros sueltos. Por quÃƒÂ© las cebollas, de sabor tan agresivo, se vuelven dulces con la cocciÃƒÂ³n. Por quÃƒÂ© la adiciÃƒÂ³n de la sal en la cocciÃƒÂ³n endurece las legumbres frescas. Por quÃƒÂ© el zumo de piÃƒÂ±a tropical (natural) ablanda las carnes duras. Etc.\nEn una primera parte de generalidades bÃƒÂ¡sicas, se explican de forma amena y con multitud de ejemplos prÃƒÂ¡cticos, las propiedades culianrias de os medios de cocciÃƒÂ³n y principales categorÃƒÂ­as de alimentos, prestando especial atenciÃƒÂ³n a la forma en que se desarrolan ciertos aromas y sabores por medio de la caramelizaciÃƒÂ³n y reacciones de Maillard.\nLa segunda parte es el corazÃƒÂ³n del libro. En ella se procede a la sistematizaciÃƒÂ³n de lo existente. Se profundiza en el proceso general de cocciÃƒÂ³n, explicando la influencia sobre los alimentos de los tiempos y medios de cocciÃƒÂ³n: acuoso, graso y gaseoso (cocer, freÃƒÂ­r y asar). Hay que resaltar que las recetas que se dan, tanto aquÃƒÂ­ como en la tercera parte, se presentan de una forma grÃƒÂ¡fica y original, desarrollada por el autor, par que el lector, de un golpe de vista, las conceptÃƒÂºe rÃƒÂ¡pidamente y no se pierda leyendo entre lÃƒÂ­neas. \nLa mayorÃƒÂ­a de las recetas de la tercera parte del libro se han recopilado del saber popular. Algunas desarrolladas por el propio autor. Las quince tablas y las cincuenta y cuatro figuras que contiene el libro facilitan enormemente su comprensiÃƒÂ³n. \nEn definitiva, un libro original y ÃƒÂºnico, que rompe los moldes clÃƒÂ¡sicos de los libros de cocina. Indispensable para la biblioteca de todo aquÃƒÂ©l que quiera iniciarse en los placeres de la cocina de una forma metÃƒÂ³dica, con garantÃƒÂ­a de ÃƒÂ©xito. TambiÃƒÂ©n para todos aquellos que ya cocinan pero que desean saber el cÃƒÂ³mo y el por quÃƒÂ© de lo que hacen.\n-Sobre el autor:\nJoaquÃƒÂ­n PÃƒÂ©rez Conesa, Doctor en Ciencias, murciano de Cartagena, como ÃƒÂ©l se difine. EstudiÃƒÂ³ en la Universidad de Murcia, donde pasÃƒÂ³ aÃƒÂ±os decisivos de su vida, a caballo entre la Facultad de Ciencias y el Colegio Mayor Cardenal Belluga. Durante dos cursos acadÃƒÂ©micos, ampliÃƒÂ³ sus estudios como becario del Gobierno espaÃƒÂ±ol en dos universidades europeas: L'Institut du Radium de La Sorbona y The School of Chemistry de la Universidad de Leeds.\nA lo largo de su vida ha ejercido, a veces de forma simultÃƒÂ¡nea, de quÃƒÂ­mico, profesor de quÃƒÂ­mica, ejecutivo, ÃƒÂ³ptico, articulista, conferenciante e investigador cientÃƒÂ­fico, y sobre todo viajero incansable. Autor de varias patentes y publicaciones cientÃƒÂ­ficas, polÃƒÂ­glota y esteta. Existen dos cosas que le apasionan: el mar y la cocina. Esa aficiÃƒÂ³n culinaria y su espÃƒÂ­ritu investigador le han llevado a escribir Cocinar con una pizca de ciencia, su primer libro. \n\n","torrent":{"xt":"urn:btih:86e79d3a40bc87302fd0755116a5983dd6e76e62","amp;dn":"Cocinar+Con+Una+Pizca+De+Ciencia+-+Joaqu%C3%83%C2%ADn+P%C3%83%C2%A9rez+Conesa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86e79d3a40bc87302fd0755116a5983dd6e76e62","infoHashBuffer":{"type":"Buffer","data":[134,231,157,58,64,188,135,48,47,208,117,81,22,165,152,61,214,231,110,98]},"announce":[],"urlList":[]}}