{"title":"Avatar (2009) - NEW DvDscr Xvid - Hard Greek Subs - Omifast","uid":5346033,"size":1490785626,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:876a5e713109477548b0067b8195e5221cbe2a1a&amp;dn=Avatar+%282009%29+-+NEW+DvDscr+Xvid+-+Hard+Greek+Subs+-+Omifast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OmifastGR","files":-1,"time":1265639356,"description":"English Language\n\nGREEK SUBTITLES ARE HARDCODED/EMBEDDED, YOU CAN NOT TURN THEM OFF.\n\nTo view the movie on TV, just burn the video on a dvd disk.\n\nSample and Fast Download Info.txt are included\n\n----------------------------------------------------------------------\n\nAvatar (2009) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0499549/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0499549/&lt;/a&gt;\n\nAVATAR takes us to a spectacular world beyond imagination, where a reluctant hero embarks on an epic adventure, ultimately fighting to save the alien world he has learned to call home. James Cameron, the Oscar-winning director of &quot;Titanic,&quot; first conceived the film 15 years ago, when the means to realize his vision did not exist yet. Now, after four years of production, AVATAR, a live action film with a new generation of special effects, delivers a fully immersive cinematic experience of a new kind, where the revolutionary technology invented to make the film disappears into the emotion of the characters and the sweep of the story.\n\nWe enter the alien world through the eyes of Jake Sully, a former Marine confined to a wheelchair. But despite his broken body, Jake is still a warrior at heart. He is recruited to travel light years to the human outpost on Pandora, where corporations are mining a rare mineral that is the key to solving Earth's energy crisis. Because the atmosphere of Pandora is toxic, they have created the Avatar Program, in which human &quot;drivers&quot; have their consciousness linked to an avatar, a remotely-controlled biological body that can survive in the lethal air. These avatars are genetically engineered hybrids of human DNA mixed with DNA from the natives of Pandora... the Na'vi.\n\nReborn in his avatar form, Jake can walk again. He is given a mission to infiltrate the Na'vi, who have become a major obstacle to mining the precious ore. But a beautiful Na'vi female, Neytiri, saves Jake's life, and this changes everything. Jake is taken in by her clan, and learns to become one of them, which involves many tests and adventures. As Jake's relationship with his reluctant teacher Neytiri deepens, he learns to respect the Na'vi way and finally takes his place among them. Soon he will face the ultimate test as he leads them in an epic battle that will decide nothing less than the fate of an entire world. \n\n\nSam Worthington, Zoe Saldana, Sigourney Weaver, Stephen Lang, Michelle Rodriguez\n\n--------------------------------------------------------------------------\n                             &lt;a href=&quot;\nhttp://thepiratebay.se/user/OmifastGR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/OmifastGR&lt;/a&gt;\n                &lt;a href=&quot;\nhttp://thepiratebay.se/user/OmiTheGreek&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/OmiTheGreek&lt;/a&gt;\n\n!\t","torrent":{"xt":"urn:btih:876a5e713109477548b0067b8195e5221cbe2a1a","amp;dn":"Avatar+%282009%29+-+NEW+DvDscr+Xvid+-+Hard+Greek+Subs+-+Omifast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"876a5e713109477548b0067b8195e5221cbe2a1a","infoHashBuffer":{"type":"Buffer","data":[135,106,94,113,49,9,71,117,72,176,6,123,129,149,229,34,28,190,42,26]},"announce":[],"urlList":[]}}