{"title":"Need For Speed - Most Wanted by relentlesstech (2005)","uid":9342171,"size":2267501815,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:877d0ddf562edc7da956fb9c4dd31c62cef246c4&amp;dn=Need+For+Speed+-+Most+Wanted+by+relentlesstech+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"relentlesstech","files":-1,"time":1386956021,"description":"Need for Speed: Most Wanted was developed by EA Canada, released on November 16, 2005, and was one of the first games released for the Xbox 360. It was released on the Nintendo GameCube, Xbox 360, PlayStation 2, Xbox, Game Boy Advance, Microsoft Windows and Nintendo DS. The PlayStation Portable port of Most Wanted is called Need for Speed: Most Wanted 5-1-0.\n\nPolice chases make a comeback and represent a significant body of the gameplay, and includes the free-roaming aspect of Underground 2, but with less extensive vehicle customization features than in the Underground series. The customization options are improved slightly in the later Need for Speed titles. The story mode is presented in a significantly different style from Underground, with CGI effects mixed with live action, which was used in later games, such as Need for Speed: Carbon. The mode also features the Blacklist, a crew consisting of 15 racers that the player must beat one-by-one to unlock parts, cars, tracks, and to complete career mode. The player has to meet certain requirements before he can take on the next Blacklist rival, such as races completed, bounty earned, etc.\n\nA special Black Edition of Most Wanted was also released,features additional races and challenges, and a few bonus cars, including a specially-tuned BMW E46 (M3) GTR, a 1967 Chevrolet Camaro, a red Chevrolet Corvette C6.R, a Porsche, and a few others, and also includes a Black Edition-only behind-the-scenes DVD. Both versions of Most Wanted are available for the PlayStation 2, Xbox, Nintendo DS, and Windows-based PCs. Only the standard edition of Most Wanted is available for GameCube and Xbox 360 (&quot;Black Edition&quot; was not produced for these platforms). Black Edition was made for the tenth anniversary of the Need for Speed series. Also the standard edition of Most wanted was re-released for the PS3 in 2012 as a digital download.\n\nMost Wanted had extremely positive reviews and received universal acclaim from reviewers in many gaming websites and magazines, praising the graphics, sound effects and general gameplay. A reboot of the game, also named Need for Speed: Most Wanted, was announced in 2012 with British developer Criterion Games responsible for the development.","torrent":{"xt":"urn:btih:877d0ddf562edc7da956fb9c4dd31c62cef246c4","amp;dn":"Need+For+Speed+-+Most+Wanted+by+relentlesstech+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"877d0ddf562edc7da956fb9c4dd31c62cef246c4","infoHashBuffer":{"type":"Buffer","data":[135,125,13,223,86,46,220,125,169,86,251,156,77,211,28,98,206,242,70,196]},"announce":[],"urlList":[]}}