{"title":"Sparks - Exotic Creatures Of The Deep [2008/MP3/V0 (VBR)]","uid":4206551,"size":96637901,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:87b707db410e79d28a583f386235db494ffffc64&amp;dn=Sparks+-+Exotic+Creatures+Of+The+Deep+%5B2008%2FMP3%2FV0+%28VBR%29%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"matchless_man","files":13,"time":1211833308,"description":"Track list:\n1. &quot;Intro&quot; - 1:02\n2. &quot;Good Morning&quot; - 3:53\n3. &quot;Strange Animal&quot; - 5:45\n4. &quot;I Can&amp;#039;t Believe That You Would Fall for All the Crap in This Song&quot; - 3:54\n5. &quot;Let the Monkey Drive&quot; - 4:09\n6. &quot;Intro Reprise&quot; - 0:24\n7. &quot;I&amp;#039;ve Never Been High&quot; - 4:31\n8. &quot;(She Got Me) Pregnant&quot; - 4:13\n9. &quot;Lighten Up, Morrissey&quot; - 4:14\n10. &quot;This is the Renaissance&quot; - 3:45\n11. &quot;The Director Never Yelled &amp;#039;Cut&amp;#039;&quot; - 3:54\n12. &quot;Photoshop&quot; - 4:01\n13. &quot;Likeable&quot; - 6:13\n\nReview\n\nby Chris Jones\n\nOne almost despairs at the thought of reviewing another great Sparks album. 21 albums into one of the most idiosyncratic careers in pop/rock and the Mael brothers remain firmly on the periphery; such is the place to reside when you consistently and annoyingly demonstrate original thinking. The impossibility of pigeonholing the pair makes most people run for the hills. But the brave amongst us know for a fact that next to no one is making such criminally underrated and startlingly original music, in any genre, these days.\n\nThe last two albums, Lil&amp;#039; Beethoven and Hello Young Lovers, were filled with cod-operatic, Reichian repetitive odes to fickle humanity, love and vanity. Exotic Creatures is filled with yet more biting commentary. The title is presumably a reference to the characters dredged up in the songs therein. There&amp;#039;s the guy whose girlfriend rejects him because he&amp;#039;s not as deep as Morrissey (Lighten Up Morrissey); the amnesiac party animal who can&amp;#039;t remember the identity of the girl next to him (Good Morning); the complete non-party animal (I Never Got High); or even the porn star at the center of The Director Never Yelled &amp;#039;Cut&amp;#039;. And then there&amp;#039;s the evisceration of modern manners. How about Photoshop - a tale of the ease with which we airbrush our past lives, or let The Monkey drive, which may or may not be about srvitude and decadence? There&amp;#039;s even a song about the Rennaisance, called simply This Is The Renaissance. Dumb pop, this is not.\n\nStylistically it&amp;#039;s slightly more varied than the previous two albums. The same staccato piano and electronica template with multi-tracked choirs of Russell holds sway, but there are also heavy guitars (courtesy of Dean Manta) and even a return to the barbershop and swing pastiches of the 70s glory years. Best of all there&amp;#039;s the glitter stomp of the brilliantly-titled I Can&amp;#039;t Believe You Would Fall For All The Crap In This Song. But in the end words fail to do justice to the odball greatness of this band. Undoubtedly the live performances of this album will be the usual multimedia extravaganza: Everyone is urged to attend. Such special, intelligent pop cannot bear indifference forever. ","torrent":{"xt":"urn:btih:87b707db410e79d28a583f386235db494ffffc64","amp;dn":"Sparks+-+Exotic+Creatures+Of+The+Deep+%5B2008%2FMP3%2FV0+%28VBR%29%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87b707db410e79d28a583f386235db494ffffc64","infoHashBuffer":{"type":"Buffer","data":[135,183,7,219,65,14,121,210,138,88,63,56,98,53,219,73,79,255,252,100]},"announce":[],"urlList":[]}}