{"title":"Freeze Frame (aka Mind Storm or Subliminal Seduction).mp4","uid":11703029,"size":1787477836,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:89b55fb4692d31e371f5d709a09888bb11dff01b&amp;dn=Freeze+Frame+%28aka+Mind+Storm+or+Subliminal+Seduction%29.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"MoofieMan","files":1,"time":1423996943,"description":"Darrin Danver is married to Deb. He is a videogames programmer and works for Z-Games when he receives an offer for a job from CTC. He accepts the offer and moves with his wife Deb near Las Vegas. There he discovers that he is paid a lot only to develop the videogame Radical Rat Trap, which is to follow Amazing Mouse Maze. But the great family of CTC uses Videogames Cd-Rom and subliminal messages to try to control minds, his and his wife's. (written by Baldinotto da Pistoia on IMDB)\n\nI ripped this classic 'B' movie from DVD, giving it quite solid bitrate on the video (2300kbps x264), and remastered the audio (compressed for voice, levelled then amplified to -1dB). I rendered the audio at 448 kbps (AC3) after the remaster to preserve the new characteristics of the audio (to render it at a low bitrate would wipe out the effect of the remaster). It's contained in MP4 format.\n\nI often find that movies are mixed so that the voices are hard to hear while I get blown out of my seat by the music and SFX, particularly in stereo soundtracks, where you don't have any flexibility in the mix. With 5.1 or 7.1, individual speakers can be increased or decreased in volume to achieve more audible voice, but stereo doesn't afford this luxury. I remaster soundtracks with a view to countering these problems.\n\nGetting back to the movie, it's a classic telemovie that deserves to be in everyone's 'B' movie collection. There are other versions around, but I've found them to be a bit shaky, blocky or spotty, with poor audio. This one's a pretty clean rip, rendered at full 752x572 (4:3) resolution and a remastered soundtrack.\n\nThanks to all who seed - you are the lifeblood of the system. I'm not a release group and am on limited bandwidth. I can't sustain uploading at higher speeds indefinitely, so all help is greatly appreciated.\n\nCheers,\nMoofieMan","torrent":{"xt":"urn:btih:89b55fb4692d31e371f5d709a09888bb11dff01b","amp;dn":"Freeze+Frame+%28aka+Mind+Storm+or+Subliminal+Seduction%29.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89b55fb4692d31e371f5d709a09888bb11dff01b","infoHashBuffer":{"type":"Buffer","data":[137,181,95,180,105,45,49,227,113,245,215,9,160,152,136,187,17,223,240,27]},"announce":[],"urlList":[]}}