{"title":"Symantec Backup Exec 2015 14.2.1180 FP1 Multilingual","uid":12204266,"size":2409074452,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:89eec5e46b5ce36565629aeafb08743ae8f43818&amp;dn=Symantec+Backup+Exec+2015+14.2.1180+FP1+Multilingual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"deepstatus","files":3,"time":1438891670,"description":"Symantec Backup Exec 2015 14.2.1180 FP1 Multilingual\n\n\n\n\n\nReliable application, virtual machine, and Windows Server backup software designed for your growing business. Backup and Recovery, an essential component of any data protection strategy, protects your organization's critical data and systems against data loss and disasters. Backing up your organization's critical data ensures that your business is always up and running, no matter what.\n\n\n\n\nBackup Exec\n\nSymantec Backup Exec delivers powerful, flexible, and easy-to-use backup and recovery to protect your entire infrastructure whether built upon virtual, physical, or a combination of both. Backup Exec is licensed per media server, agent and option or per TB (capacity).\n\n\nBackup Exec V-Ray Edition\n\nLicensed per socket, the Backup Exec V-Ray Edition is specifically engineered to protect your virtual environment. It dramatically reduces the time to recover from data loss or major disasters by protecting an unlimited number of guest machines per host including all of the applications and databases.\n\n\nBackup Exec Small Business Edition\n\nIn one simple yet comprehensive package proven in millions of installations worldwide, the Backup Exec Small Business Edition provides a total solution for data backup, system restoration and disaster recovery for up to three servers.\n\n\nSystem Recovery Server Edition\n\nSuperior image-based backup and disaster recovery for Windows and Linux servers. Through patented Restore Anywareâ„¢ technology, IT administrators can rapidly restore exactly what they need, when and where they need it - including entire physical and virtual machines to bare metal or dissimilar hardware as well as files, folders, and granular application objects.\n\n\nBackup Exec 3600 Appliance\n\nBackup Exec 3600 Appliance offers integrated software and hardware to provide an easy, complete, and cost-effective backup and recovery solution.\n\n\nDesktop and Laptop Option\n\nEasy to use solution which provides reliable automated file backup and recovery for desktops and laptops from the market leader in Data Protection. Whether desktops and laptops are connected to the network or offline, the Desktop and Laptop Option provides continuous data protection regardless of their connectivity.\n\nInstallation:\n\n\ninstall without launching, run .reg file and then reboot","torrent":{"xt":"urn:btih:89eec5e46b5ce36565629aeafb08743ae8f43818","amp;dn":"Symantec+Backup+Exec+2015+14.2.1180+FP1+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89eec5e46b5ce36565629aeafb08743ae8f43818","infoHashBuffer":{"type":"Buffer","data":[137,238,197,228,107,92,227,101,101,98,154,234,251,8,116,58,232,244,56,24]},"announce":[],"urlList":[]}}