{"title":"Orbis Antiquus Europa Universalis IV mod","uid":11030503,"size":11625633,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8a4e65b0393a5bda02ecd85c62b56d81407ca011&amp;dn=Orbis+Antiquus+Europa+Universalis+IV+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1410720320,"description":"Orbis Antiquus Europa Universalis IV mod\n\n\nExtract 7zip to your C:Users[user]Documents Paradox Interactive Europa Universalis IV mod folder\n\n\n\nDESCRIPTION\nThis is Orbis Antiquus, a mod extending the timeline back to 1AD.\n\n(note: it appears Steam is being a ****** at the moment, so the Steam version of the mod may claim to be 0MB. Just download from the direct download link lower down the description, then extract the files into your mods folder. If the mod size is larger than 0MB - you can see to the right of the pictures - then subscribing will work.)\n\nLastRomanEmperor-NoahAugustus has created a new link for this mod, since Steam won't let this one work. the link is\n\nImportant note: It has been brought to my attention that some pople think this mod is copied from other, similar mods (Extended Timeline). This is certainly not the case, as you can see Orbis Antiquus is clearly not as good as ET (sarcasm) and it doesn't take a genius to think of extending the base game back to 1AD (more sarcasm).\n\nThe main features:\nWorks for EUIV 1.5.1\nWorks in Multiplayer (Must be using same mod and have same checksum)\nExtended timeline (1-1500)\n1-1200AD Political borders finished 166 new countries in 1AD start and ~500 total Faction system for Rome: Legions, Senate, Plebs Seven new religions: Apostolic, Pantheonism, Tengriism, Zoroastrianism. Judaism, Old Believers and Mushrikeen Rulers have been added for Rome, Parthia, the Han Dynasty and several Germanic tribes New Barbarian technology group New Barbarian culture group with 15 Subcultures New Cappadocian subculture for the Byzantine culture group (This is specifically to replace thr Turks in Anatolia) Five new governments: Imperium Romanum, Barbarian Kingdom, Anglo-Saxon Kingdom, High Kingdom and Desert Kingdom Revamped loading screens (the extra loading screen added in Songs of Yuletide stays the same) A very important decision called Mapping. This is available right at the start of the game, and discovers the provinces you would normally have discovered in the Vanilla start, because there's some sort of province-discovery bug that doesn't like it if you start before 51AD. An event and decision to convert Rome to Christianity No PTI or wasteland, just very very large wasteland-like provinces that I'm getting rid of. Eventually. Several new provinces Rome, Parthia and the Anglo-Saxons now have their own National Ideas Almost no new flags ","torrent":{"xt":"urn:btih:8a4e65b0393a5bda02ecd85c62b56d81407ca011","amp;dn":"Orbis+Antiquus+Europa+Universalis+IV+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a4e65b0393a5bda02ecd85c62b56d81407ca011","infoHashBuffer":{"type":"Buffer","data":[138,78,101,176,57,58,91,218,2,236,216,92,98,181,109,129,64,124,160,17]},"announce":[],"urlList":[]}}