{"title":"Distant.Worlds-SKIDROW","uid":5470955,"size":717734303,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8a4eb9b0052f38a78d385876fb9e8d193f679ffa&amp;dn=Distant.Worlds-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thenoobish","files":49,"time":1269884034,"description":"Eboy\n\nS   K   i   D   R   O   W\n\n-  T H E   L E A D i N G   F O R C E   -\n\nproudly presents\nDistant Worlds / Matrix Games\n\nRELEASE DATE : 28-03-2010            PROTECTION : .Net Reactor + Serial\nGAME TYPE    : Strategy              DISKS      : 1 CD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWere a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We dont earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then dont hold back\non contacting us as soon as possible.\n\n\ntwice the fun   / double the trouble\n\n\nOn with the game release information:\n\nDistant Worlds is a vast, pausable real-time, 4X space\nstrategy game. Experience the full depth and detail of large\nturn-based strategy games, but with the simplicity and ease of\nreal-time, and on the scale of a massively-multiplayer online\ngame.\n\nVast galaxies are made to order: up to 1400 star systems, with\nup to 50,000 planets, moons and asteroids. Galaxies are so\ndeep, fun and immersive that you wont want to finish the\ngame. Build, expand and improve your empire endlessly. The\ngalaxy is packed with life and activity. Encounter other\nempires, independent alien colonies, traders, pirates and\nspace monsters. Explore star systems, asteroid fields, gas\nclouds, supernovae, galactic storms and black holes. Discover\nevidence of civilizations long since past, uncovering secrets\nabout the galaxys troubled history...\n\nBest of all, you can play the game your way: enjoy a quick,\nintense game in a crowded galaxy or take your time in an epic\ngame spread across a vast galaxy!\n\nTruly Epic-Scale Galaxies: play in galaxies with up to 1400\nstar systems and 50,000 planets, moons and asteroids. Vast\nnebula clouds spiral out from the galactic core, shaping the\ndistribution of star clusters in the galaxy\n\nPrivate Enterprise: the private citizens of your empire\nautomatically take care of mundane tasks like mining\nresources, transporting cargo, migration between colonies,\ntourism and much more. This frees you from micro-management\nand instead allows you to focus on a macro-scale\n\nIntelligent Automation: automate the various tasks in your\nempire, so that you can focus on the areas that you enjoy\nmost. Or have your advisors make suggestions in different\nareas like colonization, defense or diplomacy  helping you\nlearn the best tactics and strategies\n\nExplore: explore the vast galaxy, discovering valuable\nresources, potential colonies for your empire and making\ncontact with other empires. Uncover secrets that lift the veil\non the galaxys mysterious past...\n\nColonize: send out colony ships to found new worlds for your\nempire. Develop your new colonies by keeping them\nwell-supplied with a steady stream of valuable resources\n\nDefend: patrol the outlying areas of your empire to protect\nfrom raiding pirates or dangerous space monsters. Construct\ndefensive bases at your colonies. Build up your fleets to\ndefend against enemy empires. Recruit troops to invade enemy\ncolonies and conquer the galaxy!\n\nDiplomacy: interact with other empires, discussing treaties,\nmaking trade offers or just giving them a piece of your mind.\nTalk to pirate factions, tapping into their underground\ninformation, or paying them to do your dirty work for you...\n\nEspionage: covertly seek out information about other empires,\nor even disrupt their progress with acts of sabotage\n\nResearch: develop new technologies for use in building your\nown unique ships and star bases\n\nBuild: design and build the ships and star bases in your\nempire. Construct mighty military ships at your space ports,\nor build mining stations, research installations or secret\nmonitoring facilities at remote locations throughout the galaxy\n\nBuilt-in Game Editor: fine-tune your own galaxy, adding or\nremoving star systems, planets, asteroid fields, ships, star\nbases, space monsters or anything else. Modify the attributes\nof any empire in your game\n\nExtensive Help: exhaustive, built-in, context-sensitive help\nis always only a single key-press away. Press F1 at any time\nfor a detailed explanation of the current game screen, your\ncurrently selected item, etc\n\nTutorials: in-game tutorials familiarize you with all of the\ngame elements and tools\n\nBuilt-in Customization: modify all ship art, alien races, and\nmuch more. Switch between different customization sets with a\ncouple of mouse clicks from the main game menu\n\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install (type anything as serial or just press next)\n4. After intallation is complete, go to SKIDROW folder on the\nCD and run Setup.EXE to update game to v1.01 (type anything\nas serial or just press next)\n5. Copy the content from the SKIDROW/Crack folder on the CD to\nyour installation directory and overwrite\n6. Play the game\n\nSupport the companies, which software you actually enjoy!\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:8a4eb9b0052f38a78d385876fb9e8d193f679ffa","amp;dn":"Distant.Worlds-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a4eb9b0052f38a78d385876fb9e8d193f679ffa","infoHashBuffer":{"type":"Buffer","data":[138,78,185,176,5,47,56,167,141,56,88,118,251,158,141,25,63,103,159,250]},"announce":[],"urlList":[]}}