{"title":"[William_R._Sherman,_Alan_Craig]Understanding Virtual Reality In","uid":11053561,"size":34216297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a7fa2259097e737a10efc7dfdc7a192c58004e3&amp;dn=%5BWilliam_R._Sherman%2C_Alan_Craig%5DUnderstanding+Virtual+Reality+In&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1411058014,"description":"Understanding Virtual Reality arrives at a time when the technologies behind virtual reality have advanced to the point that it is possible to develop and deploy meaningful, productive virtual reality applications. The aim of this thorough, accessible exploration is to help you take advantage of this moment, equipping you with the understanding needed to identify and prepare for ways VR can be used in your field, whatever your field may be.\n\n\nBy approaching VR as a communications medium, the authors have created a resource that will remain relevant even as the underlying technologies evolve. You get a history of VR, along with a good look at systems currently in use. However, the focus remains squarely on the application of VR and the many issues that arise in the application design and implementation, including hardware requirements, system integration, interaction techniques, and usability. This book also counters both exaggerated claims for VR and the view that would reduce it to entertainment, citing dozens of real-world examples from many different fields and presenting (in a series of appendices) four in-depth application case studies.\n\n* Substantive, illuminating coverage designed for technical and business readers and well-suited to the classroom.\n* Examines VR's constituent technologies, drawn from visualization, representation, graphics, human-computer interaction, and other fields, and explains how they are being united in cohesive VR systems.\n* Via a companion Web site, provides additional case studies, tutorials, instructional materials, and a link to an open-source VR programming system.\n\nPublisher: Morgan Kaufmann; 1 edition (September 18, 2002)\nLanguage: English\nISBN-10: 1558603530\nISBN-13: 978-1558603530\n\nEditorial Reviews\nReview\n&quot;Understanding Virtual Reality is truly the most complete reference book to emerge from the VR field in the past ten years.&quot;\n-Tom DeFanti, Professor University of Illinois at Chicago, Co-Inventor of the CAVE (R)\n\n\n\n&quot;Understanding Virtual Reality is the introduction to the medium of VR that we have all been desiring for our beginning courses.&quot;\n-Michael Zyda, Director, The MOVES Institute\n\n&quot;A comprehensive overview of virtual reality technologies and techniques. Using real-world examples from diverse fields, the book makes a case for VR as an increasingly effective and applicable communications medium. With its broad scope, straightforward style and companion instructional Web site, this book would make an excellent introductory text for students exploring virtual reality applications.&quot; - Design Issues\nFrom the Back Cover\n&quot;Understanding Virtual Reality is truly the most complete reference book to emerge from the VR field in the past ten years.&quot;\nTom DeFanti, Professor University of Illinois at Chicago, Co-Inventor of the CAVE (R)\n\n&quot;Understanding Virtual Reality is the introduction to the medium of VR that we have all been desiring for our beginning courses.&quot;\nMichael Zyda, Director, The MOVES Institute\n\nUnderstanding Virtual Reality arrives at a time when the technologies behind virtual reality have advanced to the point that it is possible to develop and deploy meaningful, productive virtual reality applications. The aim of this thorough, accessible exploration is to help you take advantage of this moment, equipping you with the understanding needed to identify and prepare for ways virtual reality (VR) can be used in your field, whatever your field may be.\n\nBy approaching VR as a communications medium, the authors have created a resource that will remain relevant even as the underlying technologies evolve. You get a history of VR, along with a good look at systems currently in use. However, the focus remains squarely on the application of VR and the many issues that arise in the application design and implementation, including hardware requirements, system integration, interaction techniques, and usability. This book also counters both exaggerated claims for VR and the view that would reduce it to entertainment, citing dozens of real-world examples from many different fields and presenting (in a series of appendices) four in-depth application case studies.\n\nFeatures:\n\n*Substantive, illuminating coverage designed for technical and business readers and well-suited to the classroom\n\n*Examines VR's constituent technologies, drawn from visualization, representation, graphics, human-computer interaction, and other fields, and explains how they are being united in cohesive VR systems\n\n*A companion website that provides additional case studies, tutorials, instructional materials, and a link to an open-source VR programming system ","torrent":{"xt":"urn:btih:8a7fa2259097e737a10efc7dfdc7a192c58004e3","amp;dn":"%5BWilliam_R._Sherman%2C_Alan_Craig%5DUnderstanding+Virtual+Reality+In","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a7fa2259097e737a10efc7dfdc7a192c58004e3","infoHashBuffer":{"type":"Buffer","data":[138,127,162,37,144,151,231,55,161,14,252,125,253,199,161,146,197,128,4,227]},"announce":[],"urlList":[]}}