{"title":"WWE_WWF - Illuminati Programming PART 4 [xyz]","uid":9126870,"size":1449286121,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8a96f25f2b133c63d157fbbce6c7b6bb11721052&amp;dn=WWE_WWF+-+Illuminati+Programming+PART+4+%5Bxyz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"one_last_round","files":50,"time":1383241800,"description":"This is part 4 of 7 series.  The WWE serves as an Illuminati front for indoctrinating millions of people.  This collection will expose the WWE as evil and corrupt. Check the file list.  I will probably upload this series to the public trackers.  Right now, I have too much on my mind for a further description.  This series is worth your time even if you never have watched wrestling.    \n\nThis part is mostly about Chris Benoit.  He was a wrestler that was accused of killing his son and wife.  Then he killed himself.  Some say there was a conspiracy involved and he was innocent and a ex-wrestler killed Benoit.\n\nAnother conspiracy is Owen Hart was Killed on live TV on purpose.  The pay per view and all the wrestling matches kept on going.  The conspiracy goes that the Owner of the WWE: Vince McMahon was mad that Owen Hart injured Stone Cold Steve Austin's neck.  Stone Cold was possibly WWE's biggest money maker.  By Owen Hart damaging Steve Austin's neck, the WWE lost a lot of money.  Also, Owen Hart's brother Brett Hart beat up Vince McMahon.  So maybe Vince decided to kill Owen on live TV?\n ","torrent":{"xt":"urn:btih:8a96f25f2b133c63d157fbbce6c7b6bb11721052","amp;dn":"WWE_WWF+-+Illuminati+Programming+PART+4+%5Bxyz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a96f25f2b133c63d157fbbce6c7b6bb11721052","infoHashBuffer":{"type":"Buffer","data":[138,150,242,95,43,19,60,99,209,87,251,188,230,199,182,187,17,114,16,82]},"announce":[],"urlList":[]}}