{"title":"Hot Tuna - Steady As She Goes 2011","uid":7076592,"size":349728773,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8a9a91b3ab11f9efd588d4738427c749b836b340&amp;dn=Hot+Tuna+-+Steady+As+She+Goes+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1330866572,"description":"Hot Tuna is an American blues-rock band formed by bassist Jack Casady and guitarist Jorma Kaukonen as a spin-off of Jefferson Airplane. It plays acoustic and electric versions of original and traditional blues songs\n\n- - -\n\nSteady as She Goes is the first Hot Tuna studio album since 1990. After Jorma Kaukonen recorded his solo album in 2009 at Levon Helm's studio in NY, he asked his new record company Red House if they would be interested in a Tuna album. The band started recording new tracks in November 2010 with the same producer and studio that Kaukonen used for River of Time and features the latest lineup of the band that formed in 2009 when Skoota Warner joined on drums. On March 11, 2011 Red House released Angel of Darkness as a free single. The album was released on CD and on iTunes April 5, 2011 and on vinyl in May. The album first charted on the Tastemaker and Independent album lists compiled by Billboard for the week of April 23\n\n- - -\n\nAfter years of releasing live albums, Kaukonen felt it was time to record a new electric studio album with the band when his current label for his solo work, Red House Records, was interested. Kaukonen started by writing one song, but with deadlines set and being locked in to studio time with the band, he collaborated and ended up writing six songs for the album. The band used Levon Helm's studio which Kaukonen had recorded his previous solo album at, River of Time. For the new album, Kaukonen decided to take the approach he used with Jefferson Airplane, letting others work out the charts for the rhythm section and concentrating on the lead guitar lines. Also to reflect back to Jefferson Airplane's style, Teresa Williams recorded harmony vocals similar to Grace Slick's on several tracks. (wikipedia)\n\n- - -\n\nHot Tuna - Steady As She Goes 2011\n(St. Paul, Minn. Red House Records)\n\n 1. Angel of darkness \n 2. Children of Zion \n 3. Second chances \n 4. Goodbye to the blues \n 5. A little faster \n 6. Mourning interrupted \n 7. Easy now revisited \n 8. Smokerise journey \n 9. Things that might have been \n10. Mama let me lay it on you \n11. If this is love \n12. Vicksburg stomp\n","torrent":{"xt":"urn:btih:8a9a91b3ab11f9efd588d4738427c749b836b340","amp;dn":"Hot+Tuna+-+Steady+As+She+Goes+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a9a91b3ab11f9efd588d4738427c749b836b340","infoHashBuffer":{"type":"Buffer","data":[138,154,145,179,171,17,249,239,213,136,212,115,132,39,199,73,184,54,179,64]},"announce":[],"urlList":[]}}