{"title":"Preachin' the Blues: The Life and Times of Son House prabhu_","uid":11727859,"size":3522530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b1987c671313b0cc4200cdb1b92c4a61e40763f&amp;dn=Preachin%27+the+Blues%3A+The+Life+and+Times+of+Son+House+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"prabhu_","files":2,"time":1425148235,"description":"Preachin' the Blues: The Life and Times of Son House\n\nby Daniel E. Beaumont\n\nabout book :-\n &lt;a href=&quot;\nhttp://d.gr-assets.com/books/1379090606l/11505586.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://d.gr-assets.com/books/1379090606l/11505586.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://d.gr-assets.com/books/1379090606l/11505586.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://d.gr-assets.com/books/1379090606l/11505586.jpg&lt;/a&gt;\n\nIn June of 1964, three young, white blues fans set out from New York City in a Volkswagen, heading for the Mississippi Delta in search of a musical legend. So begins Preachin' the Blues, the biography of American blues signer and guitarist Eddie James &quot;Son&quot; House, Jr. (1902 - 1988). House pioneered an innovative style, incorporating strong repetitive rhythms with elements of southern gospel and spiritual vocals. A seminal figure in the history of the Delta blues, he was an important, direct influence on such figures as Muddy Waters and Robert Johnson.\nThe landscape of Son House's life and the vicissitudes he endured make for an absorbing narrative, threaded through with a tension between House's religious beliefs and his spells of commitment to a lifestyle that implicitly rejected it. Drinking, womanizing, and singing the blues caused this tension that is palpable in his music, and becomes explicit in one of his finest performances, &quot;Preachin' the Blues.&quot; Large parts of House's life are obscure, not least because his own accounts of them were inconsistent. Author Daniel Beaumont offers a chronology/topography of House's youth, taking into account evidence that conflicts sharply with the well-worn fable, and he illuminates the obscurity of House's two decades in Rochester, NY between his departure from Mississippi in the 1940s and his &quot;rediscovery&quot; by members of the Folk Revival Movement in 1964. Beaumont gives a detailed and perceptive account of House's primary musical legacy: his recordings for Paramount in 1930 and for the Library of Congress in 1941-42. In the course of his research Beaumont has unearthed not only connections among the many scattered facts and fictions but new information about a rumoured murder in Mississippi, and a charge of manslaughter on Long Island - incidents which bring tragic light upon House's lifelong struggles and self-imposed disappearance, and give trenchant meaning to the moving music of this early blues legend.\n &lt;a href=&quot;\nhttp://d.gr-assets.com/books/1379090606l/11505586.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://d.gr-assets.com/books/1379090606l/11505586.jpg&lt;/a&gt;\n\n\nabout author :-\n\nDaniel Beaumont teaches courses on Arabic language and literature and the blues at the University of Rochester. He is the author of Slave of Desire: Sex, Love and Death in The 1001 Nights (Associated University Presses 2002). He produced and directed &quot;So Much Truth&quot; a documentary about bluesman Joe Beard. He also worked as chief observer on a rain making project in Libya and he has been on the historic &quot;King Biscuit Time&quot; blues radio show.\n\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`","torrent":{"xt":"urn:btih:8b1987c671313b0cc4200cdb1b92c4a61e40763f","amp;dn":"Preachin%27+the+Blues%3A+The+Life+and+Times+of+Son+House+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b1987c671313b0cc4200cdb1b92c4a61e40763f","infoHashBuffer":{"type":"Buffer","data":[139,25,135,198,113,49,59,12,196,32,12,219,27,146,196,166,30,64,118,63]},"announce":[],"urlList":[]}}