{"title":"Tony Bennett - 2006 - Duets An American Classic FLAC","uid":8965605,"size":386033829,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8bbbd32ee2c29b0b99c34662f41cef1091b0be62&amp;dn=Tony+Bennett+-+2006+-+Duets+An+American+Classic+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1380214484,"description":"Tony Bennett - 2006 - Duets An American Classic\n\nTony Bennett has so many adoring celebrity fans it should come as no surprise that when a major duets album is planned, he's able to draw a roster of the biggest recording stars from the rock and vocal worlds, plus a pair of country music wildcards. (This despite the fact that he recorded an album with several duets in 2001, and a full-album collaboration one year later with k.d. lang.) One surprise is how well producer Phil Ramone paired Bennett with both duet partners and fitting standards -- among them Barbra Streisand on the optimist's anthem &quot;Smile,&quot; Dixie Chicks for the flapper standard &quot;Lullaby of Broadway,&quot; Bono on the wickedly spiteful &quot;I Wanna Be Around,&quot; Tim McGraw on &quot;Cold, Cold Heart&quot; (the Hank Williams song that was Bennett's biggest country crossover hit), Stevie Wonder on his own &quot;For Once in My Life,&quot; Juanes for &quot;The Shadow of Your Smile&quot; (which was a hit first for the Brazilian Astrud Gilberto), and Sting on the torch song &quot;Boulevard of Broken Dreams.&quot; (Even the title of &quot;How Do You Keep the Music Playing?&quot; seems fit for George Michael to sing.) Each performance was recorded with Bennett and his duet partner live in the studio -- it could be no different for such an old-school vocalist -- and the setup allows for maximum warmth and congeniality. Yet, aside from the novelty of the billings, Duets: An American Classic doesn't thrill like Bennett's solo recordings of the previous ten years. The arrangements of Jorge Calandrelli are heavy on serene strings that wrap the melodies in layers of soft gauze, and few concessions are made to the needs of the material; virtually every song is either a soft vocal pop number or a finger-snapping swinger. As befits an all-star affair, every edge is polished to a fine sheen and, more than a few times, the feelings his duet partners attempt to summon sound quite superficial. Of course, every vocal interpreter in the business sounds a little forced when compared to Tony Bennett. (AllMusic)\n\nTrack list:\n01 - Lullaby Of Broadway (with Dixie Chicks)\n02 - Smile (with Barbra Streisand)\n03 - Put On A Happy Face (with James Taylor)\n04 - The Very Thought Of You (with Paul McCartney)\n05 - The Shadow Of Your Smile (with Juanes)\n06 - Rags To Riches (with Elton John)\n07 - The Good Life (with Billy Joel)\n08 - Cold, Cold Heart (with Tim McGraw)\n09 - If I Ruled The World (with Celine Dion)\n10 - The Best Is Yet To Come (with Diana Krall)\n11 - For Once In My Life (with Stevie Wonder)\n12 - Are You Havin' Any Fun (with Elvis Costello)\n13 - Because Of You (with K.D. Lang)\n14 - Just In Time (with Michael Buble')\n15 - The Boulevard Of Broken Dreams (with Sting)\n16 - I Wanna Be Around (with Bono)\n17 - Sing, You Sinners (with John Legend)\n18 - I Left My My Heart In San Francisco\n19 - How Do You Keep The Music Playing (with George Michael)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:8bbbd32ee2c29b0b99c34662f41cef1091b0be62","amp;dn":"Tony+Bennett+-+2006+-+Duets+An+American+Classic+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bbbd32ee2c29b0b99c34662f41cef1091b0be62","infoHashBuffer":{"type":"Buffer","data":[139,187,211,46,226,194,155,11,153,195,70,98,244,28,239,16,145,176,190,98]},"announce":[],"urlList":[]}}