{"title":"No Enemy but Time by Michael Bishop","uid":9739998,"size":384533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c0af3d1b7550a0fa8b6dc47b82b288948a089f9&amp;dn=No+Enemy+but+Time+by+Michael+Bishop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1394496933,"description":"\nNo Enemy But Time is a 1982 science fiction novel by Michael Bishop. It won the 1982 Nebula Award for Best Novel.\n\nJoshua Kampa, the illegitimate son of a mute Spanish whore and a black serviceman, has always dreamed of Africa. But his dreams are of an Africa far in the past and are so vivid and in such hallucinatory detail that he is able to question the understanding of eminent palaeontologists. As a result, Joshua is invited to join a most unusual time travel project and is transported millions of years into the past of his dreams. \n\nIn early Pleistocene Africa, living among the prehuman species Homo habilis, experiencing the same hardships and the same intense pleasures, Joshua finds, for the first time in his troubled life, not only contentment but real love--a love that transcends almost everything. Intelligent, thoughtful and deeply moving, No Enemy But Time brilliantly evokes the remote past and, at the same time, presents a powerful and convincing portrayal of a relationship surmounting even the most daunting barriers. It is a challenging and highly original novel exploring the nature and origins of humankind.\n\nGenre: Science Fiction","torrent":{"xt":"urn:btih:8c0af3d1b7550a0fa8b6dc47b82b288948a089f9","amp;dn":"No+Enemy+but+Time+by+Michael+Bishop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0af3d1b7550a0fa8b6dc47b82b288948a089f9","infoHashBuffer":{"type":"Buffer","data":[140,10,243,209,183,85,10,15,168,182,220,71,184,43,40,137,72,160,137,249]},"announce":[],"urlList":[]}}