{"title":"Back To The Future: Hill Valley","uid":5051631,"size":944794659,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8c91f2db408e407d094bc2b57d35e0cf143976cf&amp;dn=Back+To+The+Future%3A+Hill+Valley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Keko201","files":-1,"time":1250195687,"description":"Back to the Future: Hill Valley is a full conversion mod for Grand Theft Auto: Vice City. Back to the Future: Hill Valley will be based on the Back to the Future Trilogy, allowing the player to re-enact all the great moments from the films. While some parts of the story are stretched to make it more enjoyable, we are determined not to stray too far from the original story-line. The people behind this mod want the community to relive the movies and have as much fun in the process as possible. With the outstanding game play of the Sandbox hit, Grand Theft Auto: Vice City, in combination with one of the best movies of all time, Back to the Future, this mod is sure to bring countless hours of fun to anybody who enjoyed the movies. \n\nSome of the Features that will be in Back to the Future: Hill Valley are:\n5 different eras of Hill Valley: 1885, 1955, 1985, Alternative 1985, and 2015.\nNew Vehicles to correspond to the different times\nNew Peds to correspond to the different times\nSpontaneous and Instant Time Travel\nNew effects and sounds to accompany the time travel sequences\nFlying Hover mode for the Cars and Trains of the future.\nCustom Radio Stations\nReenactments of scenes from the films.\nA Remote Controlled Delorean\nDoc's Time Train \n\nFully complete, just unzip and play!!! Includes a few other mods that make the game more enjoyable, and even a few mp3s (you can delete those or add more. I just forgot to take them out. lol)\n\nThis game keeps getting new addons, so when they release version 0.2f, or any other version (this is 0.2e) you can download and install it from here http://www.bttfhillvalley.co.uk/\n\nEnjoy!!","torrent":{"xt":"urn:btih:8c91f2db408e407d094bc2b57d35e0cf143976cf","amp;dn":"Back+To+The+Future%3A+Hill+Valley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c91f2db408e407d094bc2b57d35e0cf143976cf","infoHashBuffer":{"type":"Buffer","data":[140,145,242,219,64,142,64,125,9,75,194,181,125,53,224,207,20,57,118,207]},"announce":[],"urlList":[]}}