{"title":"Ray Donovan.S01E12.720p.HDTV.DD5.1.x264(NLsub)sharky-TBS","uid":9019350,"size":1894843213,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8cdb06273b18d4b38f63b73059b87051653fc85f&amp;dn=Ray+Donovan.S01E12.720p.HDTV.DD5.1.x264%28NLsub%29sharky-TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sharky57","files":-1,"time":1381263489,"description":"Ray Donovan.S01E12.720p.HDTV.DD5.1.x264(NLsub)sharky-TBS\n\n\n\n\n\n\n\nRay Donovan is een Amerikaanse dramaserie van de zender Showtime. De serie ging juni 2013 in premiere.\n\nRay Donovan is professionele fixer voor de rijke en bekende mensen in LA. \nHij kan er voor zorgen dat elk probleem verdwijnt behalve de problemen die worden veroorzaakt door zijn eigen familie. \nOok Jon Voight en Elliot Gould spelen hierin een rol.\nRay Donovan is een donker familiedrama dat draait rond een manusje.van.alles die voor de rijkelui uit L.A. hun problemen probeert op te lossen. \nDaarbij komt Ray vaak hun diepste geheimen te weten. Maar terwijl het hem professioneel voor de wind gaat, \nis hij thuis minder sterk om de problemen op te lossen. \nZijn vrouw Abby heeft moeite om zich aan te passen aan het drukke leventje van Hollywood. \nZijn oudste broer Terry is dan weer een voormalige bokser die lijdt aan de ziekte van Parkinson. \nToch weerhoudt dit Terry niet om nieuwe talenten te blijven trainen. \nRay's jongste broer Bunchy werd dan weer in zijn jonge jaren seksueel misbruikt, iets wat Bunchy nog steeds niet verwerkt heeft \nen met hulp van alcohol probeert te vergeten. \nDe gemoederen lopen hoog op in de familie wanneer pater familias Micky Donovan na een jarenlange gevangenisstraf terug contact wilt \nopnemen met zijn zonen.\n\n\nRay Donovan is een reeks van Southland.bedenkster Ann Biderman en Mark Gordon. Hoofdrollen in de reeks zijn er voor Liev Schreiber, \nPaula Malcomson, Jon Voight, Eddie Marsan, Sash Mihok en Peter Jacobson. \nDe regie van de pilootaflevering lag in handen van Allen Coulter, de man die e erder al regisseur was voor Damages, \nSons of Anarchy en Nurse Jackie.\n\n\n\nEpisode.12. Same Exactly(seizoen's finale)\n\n\nAvi en Ray sporen Eddie op,die wordt aangereden door een auto in de achtervolging en ze vinden een deel van het \nSully geld en hij verteld dat ze in Santa Monica zijn.\nFrank komt bij Ezra en dreigt Ray te arresteren. \nRay, wetende dat dit een loze dreiging is, vraagt om 12 uur om te werken aan het bewijs,sinds hij weet dat Ray Van niet gedood heeft. \nHij overhandigt hem een prop met contant geld en Frank neemt het aan.\n\nBunchy voelt zich beter,een beetje onmachtig na het overlijden van zijn vader Danny, wetende dat hij anderen niet kan kwetsen.\nHij gaat naar huis en schopt Mickey buiten zeggend dat hij wil dat die zich gaat gedragen als een volwassen man.\n\nAbby en de kinderen verblijfen in een chic hotel Malibu. Ze is depressief en wil niet opstaan.\n\nAvi en Lena schuimen de all you can eat tenten in Santa Monica af in een zoektocht naar Tiny.\n\n\n\n\nAvi and Ray chase down Eddie, who is hit by a car in the chase and they recover some of the Sully cash and he gives up that they're in Santa Monica.\n\nFrank arrives at Ezra's and threatens to arrest Ray. Ray, knowing this is an empty threat, asks for 12 hours to work on it since \nhe knows Ray didn't kill Van. He hands him a wad of cash and Frank takes it.\n\nBunchy is feeling better, empowered a bit by the death of Father Danny, knowing that he can't hurt others. \nHe goes home and kicks Mickey out saying he wants to start acting like a grown up.\n\nAbby and kids are staying at a swanky Malibu hotel. She is depressed and won't get up. \nThe displaced Mickey arrives and gets her up telling her to take care of her kids. \nShe thinks this is pretty rich coming from him since he didn't love or protect his own children. \nMickey tries to make excuses about the times they were living in but she isn't having it and calls him a wolf and tell \nhim to leave her family alone.\n\nAvi and Lena scour the all you can eat places in Santa Monica in a search for Tiny.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2249007/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2249007/&lt;/a&gt;\n\n\n\t\tinfo\n\n\tAudio\t\t: Engels DD 5.1\n\tBewerking\t: Dgpc\n\tSubs\t\t: NL\n\tVertaling\t: Kiry, TinusTussengas, S1l3nc0r &amp; wgm50\n\tControle &amp; Sync\t: TinusTussengas &amp; Quetsbeek\n\n\n\n\n\nmet dank aan savales\n\n\nVeel plezier gewenst met deze film \n\nHave fun with this movie \n\n\n\n\neen bedankje wordt altijd graag ontvangen!!\n\nuploaded by sharky\n\n","torrent":{"xt":"urn:btih:8cdb06273b18d4b38f63b73059b87051653fc85f","amp;dn":"Ray+Donovan.S01E12.720p.HDTV.DD5.1.x264%28NLsub%29sharky-TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cdb06273b18d4b38f63b73059b87051653fc85f","infoHashBuffer":{"type":"Buffer","data":[140,219,6,39,59,24,212,179,143,99,183,48,89,184,112,81,101,63,200,95]},"announce":[],"urlList":[]}}