{"title":"Coast to Coast AM March 03 2013","uid":8220900,"size":56146863,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8cdf2fd857999826c5b762d620e7685b674a9173&amp;dn=Coast+to+Coast+AM+March+03+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"runcdfirst","files":5,"time":1362476704,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-03-13\nHost: \tGeorge Noory\nGuests: \tFather Nicholas Gruner, Jonathan Maberry\n\nGeorge Noory was joined by Father Nicholas Gruner, one of the world's leading authorities on traditional Roman Catholic doctrine and practice, for a discussion on the series of apparitions at Fatima, Portugal from May to October 1917, in which a number of predictions, requests and warnings were allegedly conveyed by the Virgin Mary to three shepherd children. He theorized that these children, rather than the Pope, were chosen to receive the messages because they would be more receptive and not be &quot;confused by all sorts of theological ideas.&quot; However, Gruner also reflected on the tribulations that befell the children during the Fatima apparitions, including being arrested and threatened with being boiled in oil if they did not recant their visions.\n\nRegarding the infamous 'third secret' of Fatima which is believed to be a prophecy of dire future world events, Gruner recalled how Sister Lucia, the most famous of the three shepherd children, wrote down the first two secrets with ease but &quot;she couldn't bring herself&quot; to record the final part. After being given a formal order by the Church to write it, Lucia still agonized for three months trying to document it and, allegedly, only finished the job after she received another visit from the Virgin Mary, who told her that to do so was the 'will of God.' As to what the third secret foretells, Gruner noted that Lucia once claimed that it could be found in Chapters 8 to 12 of the Book of Revelations.\n\nAlthough the Vatican claims to have released the complete text of the third secret in the year 2000, Gruner adamantly disputed this contention, saying that &quot;the most important part, they left out.&quot; To that end, he put forward that there were two documents which comprised the complete third secret and that the Vatican only released the contents of the first part. He cited the testimony of Archibishop Capovilla, former secretary to Pope John XXIII, who &quot;said there was another attachment&quot; which was not a part of the official disclosure. On whether the events predicted in the third secret can be averted, Gruner suggested that if the Pope consecrated Russia, as prescribed in the second secret of Fatima, then perhaps it could prevent the troubling final events predicted.\nMonster Origins\n\nIn the first hour, author Jonathan Maberry talked about the historial roots of supernatural and paranormal creatures such as zombies, werewolves, and vampires. Having written about many of these entities for his books, Maberry observed that the werewolf is a &quot;very complex and interesting monster that has a very real connection to our modern world.&quot; He detailed how the &quot;werewolf trials,&quot; of which there were hundreds in the 14th, 15th and 16th centuries, contained no accounts of transformative powers but actually seemed &quot;the first glimpse of what we now call serial killers.&quot; He also talked about how films have caused the perception of monsters to change over time, such as how Night of the Living Dead inadvertently caused flesh-eating monsters, known as ghouls, to become synonymous with zombies due to the film's advertising in Europe.\n\nNews segment guests: Lauren Weinstein &amp; Peter Davenport\nWebsite(s):\n\n    fatima.org\n    jonathanmaberry.com\n\nBook(s):\n\n    Devil's Final Battle\n    World Enslavement or Peace\n\n","torrent":{"xt":"urn:btih:8cdf2fd857999826c5b762d620e7685b674a9173","amp;dn":"Coast+to+Coast+AM+March+03+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cdf2fd857999826c5b762d620e7685b674a9173","infoHashBuffer":{"type":"Buffer","data":[140,223,47,216,87,153,152,38,197,183,98,214,32,231,104,91,103,74,145,115]},"announce":[],"urlList":[]}}