{"title":"C++ In A Nutshell - 2010kaiser","uid":7795429,"size":8200167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ce5786a433e811f4785ed2cb26095c2606dd579&amp;dn=C%2B%2B+In+A+Nutshell+-+2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2010kaiser","files":3,"time":1352131136,"description":"                       C++ In A Nutshell - 2010kaiser\n\n\n\nTo-the-point, authoritative, no-nonsense solutions have always been a trademark of O Reilly books. The In a Nutshell books have earned a solid reputation in the field as the well-thumbed references that sit beside the knowledgeable developers keyboard. C++ in a Nutshell lives up to the In a Nutshell promise. C++ in a Nutshell is a lean, focused reference that offers practical examples for the most important, most often used, aspects of C++.\n\nC++ in a Nutshell packs an enormous amount of information on C++ (and the many libraries used with it) in an indispensable quick reference for those who live in a deadline-driven world and need the facts but not the frills.\n\nThe books language reference is organized first by topic, followed by an alphabetical reference to the languages keywords, complete with syntax summaries and pointers to the topic references.\nThe library reference is organized by header file, and each library chapter and class declaration presents the classes and types in alphabetical order, for easy lookup. Cross-references link related methods, classes, and other key features. This is an ideal resource for students as well as professional programmers.\n\nWhen youre programming, you need answers to questions about language syntax or parameters required by library routines quickly. What, for example, is the C++ syntax to define an alias for a namespace? Just how do you create and use an iterator to work with the contents of a standard library container? C++ in a Nutshell is a concise desktop reference that answers these questions, putting the full power of this flexible, adaptable (but somewhat difficult to master) language at every C++ programmers fingertips.\n\n\nFormat : PDF + EPUB\nLanguage: English\nISBN-10: 059600298X\nISBN-13: 9780596002985\n\n\nEnjoy And Seed!!!\n","torrent":{"xt":"urn:btih:8ce5786a433e811f4785ed2cb26095c2606dd579","amp;dn":"C%2B%2B+In+A+Nutshell+-+2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ce5786a433e811f4785ed2cb26095c2606dd579","infoHashBuffer":{"type":"Buffer","data":[140,229,120,106,67,62,129,31,71,133,237,44,178,96,149,194,96,109,213,121]},"announce":[],"urlList":[]}}