{"title":"The China Crisis: How China's Economic Collapse (2013) pdf","uid":10362863,"size":3828861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d8cc44c9f005f8107d15e0e36d78cf55f09fc04&amp;dn=The+China+Crisis%3A+How+China%27s+Economic+Collapse+%282013%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1402832306,"description":"The China Crisis: How China's Economic Collapse Will Lead to a Global Depression\n\nAll the experts agree: the 21st century belongs to China. Given America's looming insolvency and the possibility of the collapse of the U.S. dollar, who can doubt that China is poised to take over the role of economic superpower? Written by political economist and leading financial journalist James Gorrie, this book offers a highly controversial, contrarian view of contemporary China. Drawing upon a wealth of historical and up-to-the-minute data, Gorrie makes a strong case that China, itself, is on the verge of an economic crisis of epic proportions. He explains how, caught in a recurrent boom/bust cycle that has played itself out several times over the past sixty years, China is again approaching total economic and social collapse. But with one important difference this time: they may very well take the entire global economy down with them.\n\n Explores the Chinese communist party's unfortunate history of making costly and very bloody mistakes on an enormous scale\n One-by-one Gorrie analyzes those critical mistakes and explains how they may lead to economic collapse in China and global depression\n Describes Chinese &quot;cannibal capitalism,&quot; and where its massive abuse of the country's environment, people, and arable lands is leading that country and the world economy\n Chronicles China's history of recurring economic crisis and explains why all the evidence suggests that history is about to repeat itself ","torrent":{"xt":"urn:btih:8d8cc44c9f005f8107d15e0e36d78cf55f09fc04","amp;dn":"The+China+Crisis%3A+How+China%27s+Economic+Collapse+%282013%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d8cc44c9f005f8107d15e0e36d78cf55f09fc04","infoHashBuffer":{"type":"Buffer","data":[141,140,196,76,159,0,95,129,7,209,94,14,54,215,140,245,95,9,252,4]},"announce":[],"urlList":[]}}