{"title":"Little Caesar (5 cds)","uid":6064883,"size":454858129,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8fdf59ca807c40adc7e663a2706fb4765518ae45&amp;dn=Little+Caesar+%285+cds%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Crashsq","files":55,"time":1293306143,"description":"LITTLE CAESAR\nFormed 1987, U.S.A.\n\nAlbums:\n1989 Name Your Poison\n1990 Little Caesar\n1992 Influence\n1998 This Time It's Different...!!!\n2009 Redemption\n\nHistory:\nOne of the best hard rock bands ever. Nobody quite knew what to think of longhaired, tattooed bikers singing such soulful, yet ballsy, rock music. While their image may have been at odds with their music, it definitely suited the live show.\n  Formed in Los Angeles, California by Ron Young (the vocalist whose back is completely covered by a jungle scene tattoo), Apache (guitar), Louren Molinare (guitar), Fidel Paniagua (bass) and Tom Morris (drums). They first appeared on Metal Blade's Street Survivors compilation before releasing a four song EP called Name Your Poison. They opened for Jane's Addiction, headlined some of their own club shows, and even appeared on TV's Unsolved Mysteries which helped them get signed to Geffen whom released their cover of Aretha Franklin hit, &quot;Chain Of Fools&quot;, as the debut single. The thought of these guys playing such a soul classic forever confused the public, and led to lacklustre sales. The second full-length album would have Earl Slick (whom Young did some vocals for on his solo album) of Dirty White Boy, Ian Hunter, etc., replacing Apache on guitar.\n  Marc Danzeisen (ex-Riverdogs) became the new drummer for the Influence tour, which would end up being the bands swan song, as it became apparent that success would never come their way. Young would briefly take his soulful growl on the road with the Four Horsemen when Frank C. Starr was comatose before surfacing in the super group Manic Eden with former Quiet Riot and Whitesnake members. The original band reformed for some live shows in 2001, and then quietly released a new album called Redemption in 2009 with Joey Brasler replacing Apache on guitar. ","torrent":{"xt":"urn:btih:8fdf59ca807c40adc7e663a2706fb4765518ae45","amp;dn":"Little+Caesar+%285+cds%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fdf59ca807c40adc7e663a2706fb4765518ae45","infoHashBuffer":{"type":"Buffer","data":[143,223,89,202,128,124,64,173,199,230,99,162,112,111,180,118,85,24,174,69]},"announce":[],"urlList":[]}}