{"title":"Lolita.1997.DVDRip.XviD.AC3-YYddr","uid":4549600,"size":1470650525,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ff7f84d80bfb99bcb2fd95c6bd62fd56d2f29ec&amp;dn=Lolita.1997.DVDRip.XviD.AC3-YYddr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"circlensess","files":4,"time":1228252930,"description":" &lt;a href=&quot;http://91.196.126.51/posters/8ff7f84d80bfb99bcb2fd95c6bd62fd56d2f29eclolitaa.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://91.196.126.51/posters/8ff7f84d80bfb99bcb2fd95c6bd62fd56d2f29eclolitaa.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://imdb.com/title/tt0119558/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0119558/&lt;/a&gt;\n\nMPAA: Rated R for aberrant sexuality, a strong scene of violence, nudity and some language.\nyear: 1997 \nGenre: Drama, Romance. \nLength: 137 min \nVideo: XviD ~958 kbps 23976 fps \nResolution: 576 x 320 \nAudio: AC3 448 kbps 5 ch\n\n(Cast overview, first billed only)\n\tJeremy Irons\t... \tHumbert Humbert\n\tMelanie Griffith\t... \tCharlotte Haze\n\tFrank Langella\t... \tClare Quilty\n\tDominique Swain\t... \tDolores 'Lolita' Haze\n\tSuzanne Shepherd\t... \tMiss Pratt\n\tKeith Reddin\t... \tReverend Rigger\n\tErin J. Dean\t... \tMona\n\tJoan Glover\t... \tMiss LaBone\n\tPat Pierre Perkins\t... \tLouise (as Pat P. Perkins)\n\tEd Grady\t... \tDr. Melinik\n\tMichael Goodwin\t... \tMr. Beale\n\tAngela Paton\t... \tMrs. Holmes\n\tBen Silverstone\t... \tYoung Humbert Humbert\n\tEmma Griffiths Malin\t... \tAnnabel Lee (as Emma Griffiths-Malin)\n\tRonald Pickup\t... \tYoung Humbert's Father\n\n\nPlot:\nA man marries his landlady so he can take advantage of her daughter. \n\n\nHumbert the noble, or how to make a pedophile lovable.\n\nThis is an excellent adaptation of Vladimir Nabokov's brilliant book about the sordid relationship between a grown man and a teenage girl. Although still disconcerting, the subject of pedophilia is far less shocking today than when the book was published almost 50 years ago. Yet, despite the subject matter, the book was wildly popular because it was a literary work of art, beautifully written with some of the most splendid metaphors and descriptive narrative in American literature. This was all the more amazing when one considers that English was Nabokov's second language.\n\nDirector Adrian Lynn (Fatal Attraction, 9 Ã‚Â½ weeks, Indecent Proposal) is no stranger to stories with perverse sexual content. His presentation of the story does the book justice although certain interpretations may not have been what Nabokov had in mind. Lynn gives us a presentation that is very sympathetic to Humbert. Nabokov's Humbert was very complex, partly a victim of his fixation on young girls, partly a sexual predator and partly a hopeless romantic. Nabokov's Lolita was extremely innocent, just approaching the threshold of sexual curiosity and urges, more playful than consciously provocative. While Nabokov hints at a mutual seduction, he leans far more heavily towards Humbert as the cause of the events even though Humbert is clearly helpless in the face of his obsession. Lolita entered into the sexual relationship more as a result of longings burgeoning from her blossoming sexuality than a desire to seduce Humbert in particular, who was not even her first lover. \n\nLynn's presentation transforms Humbert from the seducer into the seduced, whose weakness for young girls is manipulated by a sexually precocious siren tempting him to dash himself on the shoals of pedophilia. Lynn portrays Lolita as the aggressor, an adolescent temptress who knows she is desired and simultaneously teases and entices him to do her lustful bidding, knowing he is powerless to resist. Lynn's Humbert is more of a hapless romantic than a fiend, ennobling him as a victim of love rather than the confounded sociopath he really is. In Lynn's version, Humbert becomes the fly to Lolita's spider.\n\nHowever, after the initial seduction when they take to the road, the film is very true to the book in chronicling the decay of the relationship, Humbert's further plunge into feelings of romantic desperation and Lolita's shrewish exploitation of him as she increasingly uses sex as a weapon. The book was very effective at portraying the relationship as a symbiosis of two deficient beings, each selfishly taking from the other what was needed. Lynn does an excellent job of portraying that here. As the relationship degenerates, Lynn is effectual at portraying the ugly side of both characters. The bitterness and rancor that results is compelling. To his credit, he understands that Nabokov's story was more of a character study than a sex story and Lynn avoids the temptation of becoming too lurid, focusing instead on solid character development of two very flawed beings.\n\nI must take a moment to give Lynn the highest praise for his period renderings. This is one of the finest portrayals of 1940's Americana I can remember. The costumes, hairstyles, cars, furniture, locations and sets create a 40's reality that is like being hurtled back in a time machine. The music is not just precise for the period, but it is perfectly integrated with the story. As the two travel, the music changes to reflect the region. Having Lolita dance and sing to period music on the radio is a nice touch because that is exactly what teenage girls of any era are apt to do.\n\nThe acting is first rate all around. When the film was made, Dominique Swain was 17, and although she looked young for her age, she could never pass for 12. So for the first part of the film before Charlotte's demise, she is simply too mature. However, for the road trip she is ideal. Though I don't agree with Lynn's early interpretation of Lolita as the teenage temptress, I can't imagine it being done any better than the performance Swain delivers. She is playful and provocative in a childlike manner, part pixie and part vamp. Once they get on the road, Swain hits stride with a performance that is almost a force of nature. She is powerful and intense, effortlessly moving back and forth between sweet innocence and the emotional torrent typified by the `murder me' scene. It is an outstanding performance with depth and breadth that is very unusual for an actor so young.\n\nJeremy Irons is wonderful as Humbert, giving him as amiable a personality as one could possibly imagine for a character with such vile intentions. Irons injects a good deal of wry humor into the part in addition to giving Humbert an almost quixotic romantic quality. Melanie Griffith is just the wrong actress to play Charlotte. She looks nothing like the portly and plain character described in Nabokov's book. Though her acting is fine and she is appropriately obsequious, she is far too attractive to be the repulsive troll Humbert despised. It takes away from Humbert's desperation because it hardly seems like a great sacrifice to have married Charlotte to be near Lolita.\n\nFrank Langella (Dracula) is more obnoxious than mysterious as Quilty, making the audience want to exhort Humbert to pull the trigger as he confronts Quilty with the revolver. Again, I think this is probably Lynn's doing since his vision is clearly that of a Humbert sympathizer.\n\nThis is a fine film with great production values, terrific performances and a classic story. I feel that it surpasses Kubrik's adaptation in its ability to capture many of the finer points of Nabokov's book, even though Nabokov collaborated on the Kubrik film. I rated it an 8/10. It is definitely worth digging out of the rental stacks.","torrent":{"xt":"urn:btih:8ff7f84d80bfb99bcb2fd95c6bd62fd56d2f29ec","amp;dn":"Lolita.1997.DVDRip.XviD.AC3-YYddr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ff7f84d80bfb99bcb2fd95c6bd62fd56d2f29ec","infoHashBuffer":{"type":"Buffer","data":[143,247,248,77,128,191,185,155,203,47,217,92,107,214,47,213,109,47,41,236]},"announce":[],"urlList":[]}}