{"title":"David Biale (ed.) - Cultures of the Jews: A New History (2002)","uid":8670699,"size":19051381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90034536edbd01eeea318318ff0ff327e5e73639&amp;dn=David+Biale+%28ed.%29+-+Cultures+of+the+Jews%3A+A+New+History+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1373490670,"description":"David Biale, ed. - Cultures of the Jews: A New History (Schocken Books, 2002).\n\nISBN: 9780307483461 | 1196 pages | EPUB\n\n\nWho are &quot;the Jews&quot;? Scattered over much of the world throughout most of their three-thousand-year-old history, are they one people or many? How do they resemble and how do they differ from Jews in other places and times? What have their relationships been to the cultures of their neighbors?\n\nTo address these and similar questions, twenty-three of the finest scholars of our day -- archaeologists, cultural historians, literary critics, art historians, folklorists, and historians of relation, all affiliated with major academic institutions in the United States, Israel, and France -- have contributed their insight to Cultures of the Jews. The premise of their endeavor is that although Jews have always had their own autonomous traditions, Jewish identity cannot be considered immutable, the fixed product of either ancient ethnic or religious origins. Rather, it has shifted and assumed new forms in response to the cultural environment in which the Jews have lived.\n\nBuilding their essays on specific cultural artifacts -- a poem, a letter, a traveler's account, a physical object of everyday or ritual use -- that were made in the period and locale they study, the contributors describe the cultural interactions among different Jews -- from rabbis and scholars to non-elite groups, including women -- as well as between Jews and the surrounding non-Jewish world.\n\nPart One, &quot;Mediterranean Origins,&quot; describes the concept of the &quot;People&quot; or &quot;Nation&quot; of Israel that emerges in the Hebrew Bible and the culture of the Israelites in relation to that of the Canaanite groups. It goes on to discuss Jewish cultures in the Greco-Roman world, Palestine during the Byzantine period, Babylonia, and Arabia during the formative years of Islam.\n\nPart Two, &quot;Diversities of Diaspora,&quot; illuminates Judeo-Arabic culture in the Golden Age of Islam, Sephardic culture as it bloomed first if the Iberian Peninsula and later in Amsterdam, the Jewish-Christian symbiosis in Ashkenazic Europe and in the Polish-Lithuanian Commonwealth, the culture of the Italian Jews of the Renaissance period, and the many strands of folklore, magic, and material culture that run through diaspora Jewish history.\n\nPart Three, &quot;Modern Encounters,&quot; examines communities, ways of life, and both high and fold culture in Western, Central, and Eastern Europe, the Ladino Diaspora, North Africa and the Middle East, Ethiopia, Zionist Palestine and the State of Israel, and, finally, the United States.\n\nCultures of the Jews is a landmark, representing the fruits of the present generation of scholars in Jewish studies and offering a new foundation upon which all future research into Jewish history will be based. Its unprecedented interdisciplinary approach will resonate widely among general readers and the scholarly community, both Jewish and non-Jewish, and it will change the terms of the never-ending debate over what constitutes Jewish identity.\n","torrent":{"xt":"urn:btih:90034536edbd01eeea318318ff0ff327e5e73639","amp;dn":"David+Biale+%28ed.%29+-+Cultures+of+the+Jews%3A+A+New+History+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90034536edbd01eeea318318ff0ff327e5e73639","infoHashBuffer":{"type":"Buffer","data":[144,3,69,54,237,189,1,238,234,49,131,24,255,15,243,39,229,231,54,57]},"announce":[],"urlList":[]}}