{"title":"Carole King - The Ode Collection CD 1 of 2 (1968-1976) [Rock Pop","uid":4990690,"size":160441381,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9010760f2e8ff16842935c4e79083acff5385566&amp;dn=Carole+King+-+The+Ode+Collection+CD+1+of+2+%281968-1976%29+%5BRock+Pop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":26,"time":1247018859,"description":"Carole King - The Ode Collection CD 1 of 2 \nOriginal Release Date: September 13, 1994 \nAudio CD: February 24, 1998 \nNumber of Discs: 2 \nFormat: Box set, Original recording reissued, Original recording remastered \nLabel: Sony \nBitrate: 320 kbps\n\nEditorial Reviews\nAmazon.com essential recording\nIt's astonishing how quickly Carole King slipped into relative obscurity. Tapestry has sold in excess of 22 million copies and was the biggest selling album of all time until Frampton Comes Alive surpassed it in 1977, yet while the latter remains at the very least an archetypal cultural kitsch, Tapestry has become a troublesome trivial question: &quot;What's the bestselling album by a woman?&quot; Part of the problem is that the singer-songwriter era she (and James Taylor and Carly Simon) came to represent hasn't aroused a whole lot of critical favor. Still, the restrained soul of King's best stuff (for instance, Tapestry, which is included here in its entirety) has it's own appeal, as do a few of the preblockbuster inclusions.  ~ Steve Stolder \n\nI love these 2 CDs. Not only is this a magical collection but it embodies everything wonderful about the potential of pop music to be uplifting, delightful, and meaningful.\nThe first CD has the full orginial Tapestry (minus the additional tracks on a recent re-relase) embeded in it around some very enjoyable extra tracks such as child of mine. Carole is a true poet. Yes the tracks are sentimental but they are also pure, honest, joyful, soulful, and sad. Unless you have gone completly over to the 'dark side' how could you not love that? And I truly feel sorry for people that confuse sentiment with shmultz. The lyrics are gorgeous without ever being over sentimental, just as the best of Rogers and Hammerstein's lyrics are. In fact, this collection shows why Carole is one of the premire songwriters of the 20th century.\n\nSure her voice is not perfect, but it is never annoying and I find it quite enjoyable to listen to. No way is she Bob Dylan, she has a fine, complex, enjoyable voice just not one of the best. Big deal, The Music as a whole, is still wondeful.\n\nThe second CD is every bit as enjoyable as the first CD. I was bouncing around my room with the first track, Sweet Seasons. Which I really needed to do as I was in the middle of writing a term paper. Corazin is funky. There are 2 live versions on the second CD, both with quite good audio. One is from a mid 1970s free concert in Central Park called 'Believe in Humanity'. It sums up Carole perfectly, 'maybe I am wrong but I want to believe in humanity'. Perhaps that is why the previous reviewer gave these CDs one star. If you have given up on humanity then don't buy these CDs. The joy and beauty of them will probably just annoy you. For the rest of you, buy them and prepare to enjoy some of the most honest and rewarding music recorded in the last 30 plus years. Go jazzman, go Carole! ~ Larry Diamond \n\nCarole King - The Ode Collection CD 1 of 2 Tracks:\n01  Hi-De-Ho\n02  Wasn't Born To Follow\n03  Up On The Roof\n04  Child Of Mine\n05  I Feel The Earth Move\n06  So Far Away\n07  It's Too Late\n08  Home Again\n09  Beautiful\n10  Way Over Yonder\n11  You've Got A Friend\n12  Where You Lead\n13  Will You Love Me Tomorrow-\n14  Smackwater Jack\n15  Tapestry\n16  (You Make Me Feel Like) A Natural Woman\n17  Music\n18  Brother, Brother\n\n","torrent":{"xt":"urn:btih:9010760f2e8ff16842935c4e79083acff5385566","amp;dn":"Carole+King+-+The+Ode+Collection+CD+1+of+2+%281968-1976%29+%5BRock+Pop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9010760f2e8ff16842935c4e79083acff5385566","infoHashBuffer":{"type":"Buffer","data":[144,16,118,15,46,143,241,104,66,147,92,78,121,8,58,207,245,56,85,102]},"announce":[],"urlList":[]}}