{"title":"Infected Mushroom - Vicious Delicious - Full Album (FLAC (1440kb","uid":3972857,"size":491963637,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90dae1f789baa4542053e74d6a12f0efd3a698ab&amp;dn=Infected+Mushroom+-+Vicious+Delicious+-+Full+Album+%28FLAC+%281440kb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rainz3d","files":8,"time":1200092278,"description":"Infected Mushroom - Vicious Delicious - Full Album\n\nThis 1440kbps perfect cd quality FLAC file can be listened to all at once, skipped to the tracks manually or \nautomatically by splitting into tracks with the foobar music player included.\nFor more info, see the text file.\n\n----\n\nThe new Studio Album by Infected Mushroom.\n\nTwo years since the release of the monstrous &amp;#039;IM The Supervisor&amp;#039; and a decade since they first infected the world, Infected Mushroom make a glorious return celebrating their highly anticipated 6th studio album - Vicious Delicious.\n\nInfected Mushroom Erez Aizen and Amit Duvdevani (aka Duvdev) have been the leading force within the global Psy-Trance scene for nearly a decade. Incorporating pumping bad-ass grooves, infectious melodies, live instruments and vocals into their songs, they&amp;#039;ve performed live in front of well over a million fans around the globe.\n\nThe band&amp;#039;s energetic live show has wowed crowds at some of the world&amp;#039;s largest and most important music festivals (including Omix Festival in Mexico, Miami&amp;#039;s Ultra Festival, Tribe in Sao Paulo), and they continue to regularly sell-out top clubs such as the Brixton Academy in London, Toronto&amp;#039;s Koolhaus at the Government, and Avalon in New York and Los Angeles. Their success on the global concert circuit has translated into record sales in excess of 300, 000 albums over the course of five acclaimed independent albums.\n\nAlways one step ahead of the scene, Infected Mushroom are constantly pushing themselves. Following upon fame and success in their homeland and the domination of the global electronic music community, in January 2005 Infected Mushroom relocated to Los Angeles, for the purpose of raising their music to the next level and fulfilling all musical aspirations.\n\nSince day one, the driving force has always been the fans. Infected Mushroom was proudly voted number 12 in DJ Magazine&amp;#039;s 2006 Top 100 DJ list, a 14 place jump from their 2005 debut, which was the highest entry ever in the history of the magazine.\n\nAnd once again, Vicious Delicious, contains a myriad of new musical explorations, from Flamenco guitar, to Hip Hop, to Thrash-Metal undertones. Some of the highlights in this ground breaking album include the sensational hit &amp;#039;Becoming Insane&amp;#039;, featuring Gil Cerezo, lead singer of the Mexican star band &amp;#039;Kinky&amp;#039;, &amp;#039;Artilery&amp;#039; that blends hip-hop beats a-la Infected style and &amp;#039;Suliman&amp;#039;, already considered a rave anthem being performed live by the band for nearly a year as part of their attendance breaking world-wide tour. &amp;#039;In Front Of Me&amp;#039; is a unique musical interpretation that only proves how skillful and diverse Infected Mushroom are. These are only few of the gems in this extraordinary album.\n\nStyle: Psytrance\n\n- Rainz3d\n- Sam","torrent":{"xt":"urn:btih:90dae1f789baa4542053e74d6a12f0efd3a698ab","amp;dn":"Infected+Mushroom+-+Vicious+Delicious+-+Full+Album+%28FLAC+%281440kb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90dae1f789baa4542053e74d6a12f0efd3a698ab","infoHashBuffer":{"type":"Buffer","data":[144,218,225,247,137,186,164,84,32,83,231,77,106,18,240,239,211,166,152,171]},"announce":[],"urlList":[]}}