{"title":"BigMouthfuls - Mulani Rivera","uid":5059041,"size":583166752,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:90dc83150300aaad88b487a9bd4e7b92d69fb37b&amp;dn=BigMouthfuls+-+Mulani+Rivera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pure_screens","files":4,"time":1250574885,"description":"Big Mouthfuls - Mulani Rivera\n\n\n\n\nscreens:\n &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/2941/mulani-rivera.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/2941/mulani-rivera.html&lt;/a&gt;\n\n\n\n\n\nShane and Paul head on over to the train station to catch a shuttle towards the beach since they were left without a ride, seems as if their car has been repossessed. Once they approach the station Shane notices a pair on sexy legs sticking out from behind the pillar, the closer Shane gets he realizes it's a fly sexy spanish mamacita sitting on the bench waiting for the shuttle as well, it's Mulani and shit she is hot as fuck, nice long legs, big tits with a pretty smile to go with that amazing body. She's waiting for the shuttle so she can head to her Salsa Dance class, it seems to be running late so Paul asks her to come back to their place and teach them how to dance Salsa, but before they roll out they want to see her boob, Mulani pulls out her left boob and damn she has nice brwon plump nipples, to make it fair she wants to see something from them so Shane makes sure no one else is in sight pulls out his cock, Mulani is surprised to see how long his cock is and without hesitation she gets down sticking his cock in her mouth for a little taste test. Now she's ready to go back to their place, seems she wants to get fucked, you can see it in her eyes and that they sure did, continuing what has started at the station. Shane fucked her really good it all positions but the way Mulani rode his cock was awesome, Mulani loved every minute of it speaking in spanish as he drove his cock in her tight pussy, if you ask me it sounded like she was speaking in tongues, lol. You have to see this shit, she really knows how to work a cock especially when she swallows once she had a BIGMOUTHFUL of cum. This will definitely have you glued to the tube. Enjoy!\n\n\n720x406 \nwmv\n00:49:52\n\n\n3,100+ torrents: \n(ALWAYS with honest screens &amp; detailed info)\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:90dc83150300aaad88b487a9bd4e7b92d69fb37b","amp;dn":"BigMouthfuls+-+Mulani+Rivera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90dc83150300aaad88b487a9bd4e7b92d69fb37b","infoHashBuffer":{"type":"Buffer","data":[144,220,131,21,3,0,170,173,136,180,135,169,189,78,123,146,214,159,179,123]},"announce":[],"urlList":[]}}