{"title":"The Defining Decade: Why Your Twenties Matter--And How to Make t","uid":8596713,"size":257235,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:910eca92dfa5af02f4e7826bdadd26523f36c1a0&amp;dn=The+Defining+Decade%3A+Why+Your+Twenties+Matter--And+How+to+Make+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"candymancan","files":1,"time":1371774020,"description":"Our &quot;thirty-is-the-new-twenty&quot; culture tells us the twentysomething years don't matter. Some say they are a second adolescence. Others call them an emerging adulthood. Dr. Meg Jay, a clinical psychologist, argues that twentysomethings have been caught in a swirl of hype and misinformation, much of which has trivialized what is actually the most defining decade of adulthood.\n\nDrawing from a decade of work with hundreds of twentysomething clients and students, THE DEFINING DECADE weaves the latest science of the twentysomething years with behind-closed-doors stories from twentysomethings themselves. The result is a provocative read that provides the tools necessary to make the most of your twenties, and shows us how work, relationships, personality, social networks, identity, and even the brain can change more during this decade than at any other time in adulthood-if we use the time wisely.\n\nTHE DEFINING DECADE is a smart, compassionate and constructive book about the years we cannot afford to miss.","torrent":{"xt":"urn:btih:910eca92dfa5af02f4e7826bdadd26523f36c1a0","amp;dn":"The+Defining+Decade%3A+Why+Your+Twenties+Matter--And+How+to+Make+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"910eca92dfa5af02f4e7826bdadd26523f36c1a0","infoHashBuffer":{"type":"Buffer","data":[145,14,202,146,223,165,175,2,244,231,130,107,218,221,38,82,63,54,193,160]},"announce":[],"urlList":[]}}