{"title":"Antitrust And Monopoly - Dominick Armentano","uid":11707895,"size":8331932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9117dc38783eabb5a7b7734ee46b433349b5cdbf&amp;dn=Antitrust+And+Monopoly+-+Dominick+Armentano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424211764,"description":"\nThe stated purpose of antitrust laws is to protect competition and the public interest. But do such laws actually restrict the competitive process, harming consumers and serving the special interests of a few politically-connected competitors?\n\nIs antitrust law a necessary defense against the predatory business practices of wealthy, entrenched corporations that dominate a market? Or does antitrust law actually work to restrain and restrict the competitive process, injuring the public it is supposed to protect? In this breakthrough study, Professor Armentano thoroughly researches the classic cases in antitrust law and demonstrates a surprising gap between the stated aims of antitrust law and what it actually accomplishes in the real world. Instead of protecting competition, Professor Armentano finds, antitrust law actually protects certain politically-favored competitors. This is an essential work for anyone wishing to understand the limitations and problems of contemporary antitrust actions.\n\nAbout the Author:\n Dominick T. Armentano is Professor Emeritus of Economics at the University of Hartford","torrent":{"xt":"urn:btih:9117dc38783eabb5a7b7734ee46b433349b5cdbf","amp;dn":"Antitrust+And+Monopoly+-+Dominick+Armentano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9117dc38783eabb5a7b7734ee46b433349b5cdbf","infoHashBuffer":{"type":"Buffer","data":[145,23,220,56,120,62,171,181,167,183,115,78,228,107,67,51,73,181,205,191]},"announce":[],"urlList":[]}}