{"title":"Temple of the Vampire (Complete Collection)","uid":11822315,"size":615362873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:915a0cb366a76e228a7d6fc4597267e512466059&amp;dn=Temple+of+the+Vampire+%28Complete+Collection%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":31,"time":1429309870,"description":"The Vampire is the next step in human evolution.\n\nIf you are ready, the Temple is here to empower you.\n\nWe believe the value of the individual is superior to that of any group or tribe or nation or species.\n\nIn everything we do, we believe in challenging the power of anything opposing individual freedom.\n\nThe way we do this is by empowering individuals to achieve independent control over their lives through wealth, health, personal power, and unlimited life extension.\n\nWe created a worldwide organization with proven methods for making this possible. For more than twenty five years we have been active doing so.\n\nThe Temple embraces only those aspects of the Vampire mythos that include a love and respect for all life, physical immortality, individual elegance, proven wisdom, civilized behavior, worldly success, and personal happiness.\n\nThe Temple rejects those aspects of the Vampire mythos that are negative including any that are anti-life, anti-social, deathist, crude, gory, self-defeating, or criminal.\n\nThe Temple is the only authentic international organization in the world that represents the true Vampire religion. We have a worldwide membership and a dedicated Priesthood.\n\nThe Temple of the Vampire has been in continuous existence since its creation in 1989 when we formed our organization within the United States. We did this to allow our membership to benefit from the legal protections afforded to religion under the First Amendment of the U.S. Constitution.\n\nMembership grew slowly but steadily for the first few years, but then with the explosion of electronic communications, membership has made rapid growth over the last decade. Most members have come to the Temple through word of mouth however it is increasingly common for new members to find the Temple through social networks on the internet.\n\nWe are elitist for good reason and do not recognize any others who would make claims upon our heritage and authority. And we continue to grow internationally, offering members live support and training","torrent":{"xt":"urn:btih:915a0cb366a76e228a7d6fc4597267e512466059","amp;dn":"Temple+of+the+Vampire+%28Complete+Collection%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915a0cb366a76e228a7d6fc4597267e512466059","infoHashBuffer":{"type":"Buffer","data":[145,90,12,179,102,167,110,34,138,125,111,196,89,114,103,229,18,70,96,89]},"announce":[],"urlList":[]}}