{"title":"FSX Alphasim Sea Sprite X by Jimstalk (SH-2)","uid":5610216,"size":121878670,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:91e90c5fb61b423b1b278d68778d7a76464a864d&amp;dn=FSX+Alphasim+Sea+Sprite+X+by+Jimstalk+%28SH-2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Jimstalk","files":-1,"time":1275783732,"description":"After a long search i found this amazing torrent.....I do not know if it already exists in TPB (i havent found it....),thatswhy i found it necessary to upload it\n\nOK this one is a high detailed helicopter wich was used during the cold war.Highly detailed vc's,exterior and cabin//nice sounds.......for further assistance or info please read the .txt file!!!!If you're experiencing problems please let me know and dont put bad comments\n\n\nOh i have a request too!!Please upload VRS superbugX \n\nTHANKS&amp;ENJOY!!!!!!\n\nJIM:)\n\n...................................................................................\n\n|---PRODUCT DESCRIPTION-------------------------------------------|\n\nThis rich package for FSX (with optional FS2004 version) features both versions of Kaman's utility helicopter (the F and G) and include 6 phenomenal texture sets by esteemed FS artist 'Pierre'. The models display amazing attention to detail and are enhanced further by FSX's bump-mapping and self-shadowing features. The life-like crew figures (which are togglable) wear colours appropriate to the aircraft, and even have realistic helicopter-type helmets with radio umbilicals. Models are compatible with the FSX shared-cockpit feature. Both the New Zealand and Australian models sport a superbly-detailed M60 gun, AGM-65 Mavericks, and a FLIR turret.\n\nThe virtual cockpit is a 3D-rendering tour-de-force - it exceeds even the amazing H-60's and Ka-50's cockpits in terms of realism and usability, with no less than 154 individual animations and AlphaSim's RealGauge tech used extensively. All common operating systems are represented in 3D switches, including realistically-animated windscreen wipers. There is an accurate basic simulation of both the TACNAV monitor and the central unit. The VC night-lighting is superbly realised; even the panel and console description texts are individually self-illuminated. Cockpit self-shadowing is also available to FSX DX10 users. The audio-set was supplied by TSS and sounds like the best helicopter package we've heard, perfectly rising and falling in pitch with user application of the collective, and including start-up and shut-down sounds. The flight model was carefully tuned and provides a realistically agile flight envelope for this sprightly machine. A 60-page, colour illustrated user manual in .PDF format covers all aspects of the package. Pint kit comes included too. We believe our new AlphaSim Seasprite sets a quality and features benchmark for other FSX helicopters to emulate.\n\nFIVE model variants, SIX texture sets included:\n\n   1. SH-2F, HSL-32 'Invaders', USN\n   2. SH-2F, HSL-30 'Neptune's Horsemen', USN\n   3. SH-2G, HSL-84 'Thunderbolts', USN\n   4. SH-2G, US Coast Guard (fictional)\n   5. SH-2G(A), No. 805 Sqn RAN, RANFAA\n   6. SH-2G(NZ), No.6 Sqn, RNZAF &lt;a href=&quot;\nhttp://alphasim.co.uk/as_showcase_seasprite.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://alphasim.co.uk/as_showcase_seasprite.html&lt;/a&gt;","torrent":{"xt":"urn:btih:91e90c5fb61b423b1b278d68778d7a76464a864d","amp;dn":"FSX+Alphasim+Sea+Sprite+X+by+Jimstalk+%28SH-2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e90c5fb61b423b1b278d68778d7a76464a864d","infoHashBuffer":{"type":"Buffer","data":[145,233,12,95,182,27,66,59,27,39,141,104,119,141,122,118,70,74,134,77]},"announce":[],"urlList":[]}}