{"title":"Sandakan No. 8","uid":4373464,"size":1550521063,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:921ee330ad429a71a70538fd631656bbcc310e7b&amp;dn=Sandakan+No.+8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lord_terabyte","files":3,"time":1220289793,"description":"Sandakan hachibanshokan bohkyo - Kei Kumai (1974) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0073654/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0073654/&lt;/a&gt;\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/affichekf7.jpg[/IMG]\n\nSandakan No. 8 is set in Borneo, East Malaysia in the 1970s, where a writer arrives in the hopes of doing research on the karayuki-san (juvenile prostitute) who thrive in the Japanese colonies in Southeast Asia in the early twentieth century. She finds her mark in aged Osaki, and like most documentarians, spend significant time trying to gain and win over trust using sincerity, and the audience have to bear with about a quarter of the movie dwelling on that building of the trust factor, before we can get transported back to the 1900s, following the life of Osaki as it gets recounted in a series of flashbacks.\n\nI suppose the nature of the subject of the Karayuki-san makes it both controversial and sensitive, and not something to be proud of. In fact, human trafficking to fuel the sex trade is nothing new (and being made into movies such as My Name is Justine, or Lilya 4ever are nothing new too), but perhaps a shameful blip on the Japanese history to have done that to their own. Based on a non-fiction book by author Yamazaki Tomoko and an interview with a former Karayuki-san, you cannot help but see some parallels between some aspects of the story here, and that in Memoirs of a Geisha, though of course this movie came first since it was done in the 70s, and that one happened overseas, while the latter chronicles the life of a fictional geisha in Japan itself.\n\nA common thread would be that they all stemmed from a very pathetic family decision for survival, to have the young daughters sold away first as child labourers, before the passage of time makes them suitable to be pimped in order to repay quickly a lifetime of debt in which their families only get a fraction of. You can't help but be moved by Osaki's inability to better her lot, and you'll find yourself hard pressed not to be sympathetic towards her when she has to resign to her fate, being caught faraway from home, and doing things which are against her wishes. Then of course comes the cursory romance of her &quot;true love&quot; which naturally comes to naught, especially after performing some national service to visiting compatriots of the military. You'll feel for Osaki especially when she disregards good advice, and heads home to Japan only to be faced with discrimination from her own kin, the same ones whom she was sold away to help.\n\nThe title referred to the brothel where Osaki was based in, with Sandakan being one of the towns in Borneo at the time, and the Japanese brothels were easily labelled from One to Ten. The film captures a snapshot of history of Borneo in the 70s, where the earlier Sandakan days seemed to have been recreated from man made sets. The movie might seem dated in its presentation and style, with little going on in the present day it is set with attempts to verify the facts that Osaki recounted, but the flashback scenes are nothing short of riveting even though the story might have already been told a couple of times in other forms. But in truth, the payload comes toward the end where the two lead characters finally connect at an emotional level, and at the very last scene, which was extremely poignant in its revelation. \n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/sa1.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/sa2.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/sa3.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/sa5.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/sa6.png[/IMG]\n\n-----my rip----\n\ncredit goes to the ADC team for subtitles\n\n","torrent":{"xt":"urn:btih:921ee330ad429a71a70538fd631656bbcc310e7b","amp;dn":"Sandakan+No.+8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921ee330ad429a71a70538fd631656bbcc310e7b","infoHashBuffer":{"type":"Buffer","data":[146,30,227,48,173,66,154,113,167,5,56,253,99,22,86,187,204,49,14,123]},"announce":[],"urlList":[]}}