{"title":"Jen Van Meter - Hopeless Savages","uid":8715505,"size":127976515,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9243cc7bb06dfabf527a1d97cbc91c1673382235&amp;dn=Jen+Van+Meter+-+Hopeless+Savages&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1374279362,"description":"'Hopeless Savages'\nOni Press, 2002, 132 pages\nWritten by Jen Van Meter\nIllustrated by Christine Norrie, Chynna Clugston-Major\n\nFamily ties are the earliest ties that bind, setting the tone for the paths we will take in our future. So what if your father is Dirk Hopeless and your mother Nikki Savage, a superstar couple from the days of punk rock? When you're born a rebel, what can you possibly do to make yourself stand apart? For Rat Hopeless-Savage, the answer is to leave home and become a normal citizen with a nine-to-five job!\n\n\n'Hopeless Savages - Ground Zero'\nOni Press, 2003, 123 pages\nWritten by Jen Van Meter\nIllustrated by Bryan Lee O'Malley, Christine Norrie, Chynna Clugston-Major\n\nWhen you're sixteen, the world is a different place. When you're Zero Hopeless-Savage, the youngest daughter of rock stars Dirk Hopeless and Nikki Savage, the world is practically unrecognizable. Imagine you're in the midst of high school, you have your first band, and whammo! Some boy comes along who doesn't think you're a total freak, and you think he's pretty swell, too. But before you can do anything about it, there's a TV crew outside your house that wants to chronicle the gossip and scandals of your parents' career, and a massive misunderstanding has gotten you grounded. How's a self-respecting young lady supposed to handle that? \n\n\n'Hopeless Savages - Too Much Hopeless Savages'\nOni Press, 2004, 123 pages\nWritten by Jen Van Meter\nIllustrated by Christine Norrie, Ross Campbell, Chynna Clugston-Major\n\nThis was supposed to be a leisurely vacation. Arsenal Hopeless-Savage has a rematch with an old high school rival in a kung-fu tournament in Hong Kong. She and her brother Twitch figured they could turn it into a nice jaunt with their boyfriends to meet their aging grandmother, a renowned Chinese fortune teller. Too bad Grandma Shi didn't phone ahead to tell them that it was going to be the trip from Hell! It begins at the airport when a shady character slips something into Arsenal's bag, putting the quartet on the radar of the local bad guys, the British secret service, and the Hong Kong police. It becomes even more complicated when the rest of the Hopeless-Savage clan decides to join the middle children in Asia, getting caught up in the international intrigue themselves. Arsenal is the only person that can get them all out of the jam they're in, and for her it's all too much!\n","torrent":{"xt":"urn:btih:9243cc7bb06dfabf527a1d97cbc91c1673382235","amp;dn":"Jen+Van+Meter+-+Hopeless+Savages","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9243cc7bb06dfabf527a1d97cbc91c1673382235","infoHashBuffer":{"type":"Buffer","data":[146,67,204,123,176,109,250,191,82,122,29,151,203,201,28,22,115,56,34,53]},"announce":[],"urlList":[]}}