{"title":"Accident: The Death of General Sikorski","uid":11807452,"size":844014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:924f6d0199fd284a2fbbc622425c636d3d8b4300&amp;dn=Accident%3A+The+Death+of+General+Sikorski&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1428642471,"description":"The Death of General Sikorski, the Polish Prime Minister and Commander-in-Chief, in an air crash at Gibraltar in 1943 was a tragedy and a mystery that provoked world-wide reverberations that have never died down. At that moment Poland was the focal point of a crisis within the Alliance; the Soviet Government had broken off relations with the Polish Government in London and the Poles knew that the future of their nation hinged on the negotiations then proceeding between Stalin, Churchill, Roosevelt and their own leader, Sikorski. Deliberate sabotage for the purpose of political assassination was widely suspected, and the Goebbels-controlled Nazi newspapers immediately accused Winston Churchill; in some Polish circles it was believed to be the handiwork of the Russians, others suspected the Germans. The accusations have continued down the years; Stalin accused Churchill and in post-war Poland their own former political and military leaders have been accused.\n\nStep by step, with the closest scrutiny of every piece of evidence, large and small, David Irving has reconstructed every phase of this overwhelming historical mystery. He has for instance interviewed all surviving witnesses who stood on the runway as the doomed Liberator took off (these included Anthony Quayle, then A.D.C. to the Governor); General Mason-Macfarlane, then Governor of Gibraltar (who had had the acute problem of entertaining the Soviet Ambassador under the same roof as the Polish leader) is now dead, but the author has carefully studied his private papers, in which there is a detailed account of the crash and its aftermath.\n\nDavid Irving's investigations in this book will have an interest equal to that of his &quot;Destruction of Dresden&quot; which revised a chapter of history in all the many countries of the world in which it appeared","torrent":{"xt":"urn:btih:924f6d0199fd284a2fbbc622425c636d3d8b4300","amp;dn":"Accident%3A+The+Death+of+General+Sikorski","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"924f6d0199fd284a2fbbc622425c636d3d8b4300","infoHashBuffer":{"type":"Buffer","data":[146,79,109,1,153,253,40,74,47,187,198,34,66,92,99,109,61,139,67,0]},"announce":[],"urlList":[]}}