{"title":"Engineering Infinity edited by Jonathan Strahan","uid":11625716,"size":170920776,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:92b3b4a2566bb0bbcf9c35cd5f806fc1013cdc45&amp;dn=Engineering+Infinity+edited+by+Jonathan+Strahan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":1,"time":1417617164,"description":"\t\n\nEngineering Infinity\nEdited by Jonathan Strahan\nRead by Peter Johnson\nTotal Play time: 11:10:25\n\nWhether it's coming up hard against the speed of light and, with it, the enormity of the universe, realising that terraforming a distant world is harder and more dangerous than you'd ever thought, or simply realizing that a hitchhiker on a starship consumes fuel and oxygen with tragic results, this exciting and innovative science-fiction anthology collects together stories by some of the biggest names in the field including Stephen Baxter, Charles Stross and Greg Bear.\n\nThe universe shifts and changes: suddenly you understand, you get it, and are filled with a sense of wonder. That moment of understanding drives the greatest science-fiction stories and lies at the heart of Engineering Infinity. Whether it's coming up hard against the speed of light and, with it, the enormity of the universe, realising that terraforming a distant world is harder and more dangerous than you'd ever thought, or simply realizing that a hitchhiker on a starship consumes fuel and oxygen with tragic results, it's hard science-fiction where sense of wonder is most often found and where science-fiction's true heart lies. The exciting and innovative science-fiction anthology collects together stories by some of the biggest names in the field including Stephen Baxter, Charles Stross, Kristine Kathryn Rusch and Gwyneth Jones.\n\n\nStories in this collection:\n\n01) Beyond the Gernsback Continuum... by Jonathan Strahan\n02) Malak by Peter Watts\n03) Watching the Music Dance by Kristine Kathryn Rusch\n04) Laika's Ghost by Karl Schroeder\n05) The Invasion of Venus by Stephen Baxter\n06) The Server and the Dragon by Hannu Rajaniemi\n07) Bit Rot by Charles Stross\n08) Creatures with Wings by Kathleen Ann Goonan\n09) Walls of Flesh, Bars of Bone by Damien Broderick &amp; Barbara Lamar\n10) Mantis by Robert Reed\n11) Judgement Eve by John C. Wright\n12) A Soldier of the City by David Moles\n13) Mercies by Gregory Benford\n14) The Ki-anna by Gwyneth Jones\n15) The Birds and the Bees and the Gasoline Trees by John Barnes","torrent":{"xt":"urn:btih:92b3b4a2566bb0bbcf9c35cd5f806fc1013cdc45","amp;dn":"Engineering+Infinity+edited+by+Jonathan+Strahan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b3b4a2566bb0bbcf9c35cd5f806fc1013cdc45","infoHashBuffer":{"type":"Buffer","data":[146,179,180,162,86,107,176,187,207,156,53,205,95,128,111,193,1,60,220,69]},"announce":[],"urlList":[]}}