{"title":"Starcrash (1978) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)","uid":9505502,"size":2518820092,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:936ef2679c89740ed927ff331288af5170eb37b4&amp;dn=Starcrash+%281978%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clownsec","files":-1,"time":1390265768,"description":"Starcrash (1978) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\nItalian schlock-master Luigi Cozzi (billed as Lewis Coates here) directed this low-budget Star Wars rip-off in 1978, right when the sci-fi craze was hitting audiences on a world-wide scale. The story begins familiarly enough, with a huge spaceship tracking through an extremely colorful space scene while under attack by some kind of unknown and deadly force resembling a lava lamp. Being no match for the '60s acid-flashback rays, they manage to jettison a few escape pods just before being blown to kingdom come. Fast forward now to the other end of the galaxy, where we find the best smugglers in town -- gorgeous Stella Star (Caroline Munro) and space-pimp Akton (Marjoe Gortner) -- outrunning a band of cops on their tail. Eventually, they're caught, taken into custody, and sentenced to intense Labor Camps, where Stella is forced to wear a skimpy Barbarella-like outfit by the extreme, merciless guards. A break-out ensues, and in the intense laser shoot-out, Stella manages to escape, only to be captured again by the semi-green-skinned Thor (Robert Tessier) and his annoying southern-drawled robot, Elle (voiced by genre veteran Hamilton Camp). Brought in front of the Emperor of the Galaxy (Christopher Plummer) and reunited with Akton, the sexy duo find themselves suddenly in charge of finding Prince Simon (David Hasselhoff). Thus begins the heroes' amazing adventure through space and time as they search for Hasselhoff and end up fighting Amazons, Cavemen, and the Evil Count Zarth Arn (Joe Spinell) along the way.\n\nBROUGHT TO YOU BY CLOWNSEC * HONK *","torrent":{"xt":"urn:btih:936ef2679c89740ed927ff331288af5170eb37b4","amp;dn":"Starcrash+%281978%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"936ef2679c89740ed927ff331288af5170eb37b4","infoHashBuffer":{"type":"Buffer","data":[147,110,242,103,156,137,116,14,217,39,255,51,18,136,175,81,112,235,55,180]},"announce":[],"urlList":[]}}