{"title":"F.E.A.R 3 (2011) [Xbox360][RegionFree][MULTi5]","uid":6484473,"size":7838695459,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:9397ed80c538133702677bc751ecc421fb63b547&amp;dn=F.E.A.R+3+%282011%29+%5BXbox360%5D%5BRegionFree%5D%5BMULTi5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"webchella","files":2,"time":1308614641,"description":"F.E.A.R 3 (2011) [Xbox360][RegionFree][MULTi5]\n &lt;a href=&quot;\nhttp://uk.xbox360.ign.com/objects/045/045906.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uk.xbox360.ign.com/objects/045/045906.html&lt;/a&gt; &lt;a href=&quot;\nhttp://www.3djuegos.com/7974/fear-3/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.3djuegos.com/7974/fear-3/&lt;/a&gt;\n\nEnglish:\n------------\nPlatform: Xbox 360 \nLanguages: English, Spanish, French, Italian, German \nRegion: Regionfree \nFormat: ISO \nGenre: Action, First Person Shooters (FPS) \nTheme: Terror \nPowered by Day 1 Studios \nDistributed by: Warner Bros \nAlso available on: PC PS3 \nReleased: June 24, 2011 \nRecommended price: 60.99 \nRecommended age (ESRB): 18 + \n\nDescription: \n-------------------- \nPrepare to combat terror without limits and frantic with FEAR 3, the best horror shooter in first person, including dramatic improvements now! Heavy fighting with 360 Ã‚Âº coverage, terror regenerative constant surprises, scary screenplay by John Carpenter and Steve Niles, fearsome new enemies, new multiplayer cooperative mode divergent offering different skills that players condition their play. Live the experience in single or cooperative as Pointman, a genetically engineered super soldier with supernatural reflexes and able to manipulate time. You can also play co-operatively as Paxton Fettel, a being whose incredible telekinetic powers paranormal has returned to life after death. \nAlma is here ... Never challenge FEAR alone! \nEight months ago, Point Man and his squad FEAR were commissioned to arrest the stranger who had led a battalion of super soldiers secretly controlled telepathically in Armacham research center in the city of Fairport, northwest of the USA. UU. During this mission, Point Man discovered that the man was not alone. In fact, he found that he had to destroy was his own brother, Paxton Fettel cannibal, and his tortured and powerful mother, Alma Wade, both endowed with telepathic powers and a product of the perverse Armacham paranormal experiments. Despite this discovery, Point Man continued to lead the remaining members of the FEAR team to stop these objectives, at whatever cost. In a last desperate attempt to stop the murderous slaughter of the couple, the FEAR team launched an explosive chain of events that seemed to meet its objective. Of course, at the expense of destroying the city, its inhabitants and almost all members of the squad Point Man \nMonths after the bombing, the events in Fairport have made clear that the psychic presence of Alma has survived? And what's worse, her psychic power is growing and coming into the world of reality. Now, his agony supernatural plagues the city repeatedly in an attempt to ensure the survival of their lineage and reuniting her family. The security forces remain focused on Armacham removing all evidence of what happened in the city, and the rest of the squad FEAR continues the mission to stop Alma. \nHaving broken the chain of command and Point Man in front of all, where land their loyalty? Will it be faithful to his brother Paxton Fettel, who has returned from the dead without a clear purpose and does not seem willing to move away from Point Man? Or is loyal to Alma, his pregnant mother, with their sickly but huge paranormal powers? Or stay by your squad mates FEAR, determined to save the world, but at the cost of destroying the only blood ties that Point Man has ever had?\n\n\nEspaÃƒÂ±ol:\n-------------\nPlataforma: Xbox 360\nIdiomas: Ingles, EspaÃƒÂ±ol, Frances, Italiano, Aleman\nRegion: RegionFree\nFormato: ISO\nGÃƒÂ©nero: AcciÃƒÂ³n, Primera persona (FPS)\nTemÃƒÂ¡tica: Terror\nDesarrollado por: Day 1 Studios\nDistribuido por: Warner Bros\nTambiÃƒÂ©n disponible en: PC  PS3 \nLanzamiento: 24 de junio de 2011 \nPrecio recomendado: 60.99 \nEdad recomendada (PEGI): 18+ \n\nDescripcion:\n--------------------\nPrepÃƒÂ¡rate para terror sin lÃƒÂ­mites y combates frenÃƒÂ©ticos con F.E.A.R. 3, el mejor shooter de horror en primera persona, incluyendo ahora increÃƒÂ­bles mejoras! Intensos combates con cobertura 360Ã‚Âº, terror regenerativo con sorpresas constantes, terrorÃƒÂ­fico guiÃƒÂ³n de John Carpenter y Steve Niles, nuevos y temibles enemigos, nuevo modo cooperativo divergente y multijugador que ofrece a los jugadores diferentes habilidades que condicionarÃƒÂ¡n su juego. Vive la experiencia en el modo individual o cooperativo como Pointman, un super soldado genÃƒÂ©ticamente modificado con reflejos sobrenaturales y capaz de manipular el tiempo. TambiÃƒÂ©n se puede jugar en modo cooperativo como Paxton Fettel, un ser paranormal cuyo increÃƒÂ­ble poder telekinÃƒÂ©tico le ha devuelto la vida despuÃƒÂ©s de la muerte.\nAlma ya estÃƒÂ¡ aquÃƒÂ­...Ã‚Â¡Nunca te enfrentes a F.E.A.R. solo!\nHace ocho meses, Point Man y su escuadrÃƒÂ³n F.E.A.R. recibieron el encargo de detener al desconocido que habÃƒÂ­a liderado un batallÃƒÂ³n secreto de supersoldados, controlados telepÃƒÂ¡ticamente, en el centro de investigaciÃƒÂ³n de Armacham, en la ciudad de Fairport, al noroeste de los EE. UU. Durante esta misiÃƒÂ³n, Point Man descubriÃƒÂ³ que aquel individuo no estaba solo. De hecho, averiguÃƒÂ³ que a quien debÃƒÂ­a destruir era su propio hermano, el canÃƒÂ­bal Paxton Fettel, y su torturada y poderosa madre, Alma Wade, ambos dotados de poderes telepÃƒÂ¡ticos y producto de los perversos experimentos paranormales de Armacham. A pesar de este descubrimiento, Point Man siguiÃƒÂ³ al frente de los miembros restantes del equipo F.E.A.R. con el fin de detener a estos objetivos, costase lo que costase. En un ÃƒÂºltimo y desesperado intento de detener la masacre homicida de la pareja, el equipo F.E.A.R. puso en marcha una explosiva cadena de acontecimientos que parecieron cumplir su objetivo. Eso sÃƒÂ­, a costa de destruir la ciudad, a sus habitantes y a casi todos los integrantes del escuadrÃƒÂ³n de Point Man.\nMeses despuÃƒÂ©s de la explosiÃƒÂ³n, los acontecimientos acaecidos en Fairport han dejado claro que la presencia psÃƒÂ­quica de Alma ha sobrevivido? Y lo que es peor, su poder paranormal estÃƒÂ¡ creciendo y llegando al mundo de lo real. Ahora, su agonÃƒÂ­a sobrenatural asola repetidamente la ciudad en un intento de asegurar la supervivencia de su linaje y volver a reunir a su familia. Las fuerzas de seguridad de Armacham siguen centradas en la eliminaciÃƒÂ³n de toda prueba de lo sucedido en la ciudad, y el resto del escuadrÃƒÂ³n F.E.A.R continÃƒÂºa con la misiÃƒÂ³n de detener a Alma.\nHabiÃƒÂ©ndose roto la cadena de mando y con Point Man al frente de todo, Ã‚Â¿dÃƒÂ³nde depositarÃƒÂ¡ su lealtad? Ã‚Â¿SerÃƒÂ¡ fiel a su hermano Paxton Fettel, que ha regresado de entre los muertos sin un claro propÃƒÂ³sito y que no parece dispuesto a alejarse de Point Man? Ã‚Â¿O serÃƒÂ¡ leal a Alma, su madre embarazada, con sus enfermizos pero descomunales poderes paranormales? Ã‚Â¿O bien permanecerÃƒÂ¡ al lado de sus compaÃƒÂ±eros del escuadrÃƒÂ³n F.E.A.R., decididos a salvar al mundo, pero a costa de destruir los ÃƒÂºnicos lazos de sangre que Point Man jamÃƒÂ¡s ha tenido?\n\n\n","torrent":{"xt":"urn:btih:9397ed80c538133702677bc751ecc421fb63b547","amp;dn":"F.E.A.R+3+%282011%29+%5BXbox360%5D%5BRegionFree%5D%5BMULTi5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9397ed80c538133702677bc751ecc421fb63b547","infoHashBuffer":{"type":"Buffer","data":[147,151,237,128,197,56,19,55,2,103,123,199,81,236,196,33,251,99,181,71]},"announce":[],"urlList":[]}}