{"title":"Encyclopedia of Population - (Malestrom)","uid":4791529,"size":13950286,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93feedbf23620bf149f1b8041dcdd8d64a5fec35&amp;dn=Encyclopedia+of+Population+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1237736742,"description":" &lt;a href=&quot;http://www.image-upload.net/images/u0boyn0uab0tx1rbl272.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/u0boyn0uab0tx1rbl272.jpg&lt;/a&gt;\n\nHardcover: 850 pages\nPublisher: MacMillan Reference Books; 2 Sub edition (May 2003)\nLanguage: English\nISBN-10: 0028656776\nISBN-13: 978-0028656779\n\nFrom Booklist\nPopulation means more than people, births, and deaths. Population studies measure how people live, the environment they live in, and the resources to support life. The 336 articles in the Encyclopedia of Population discuss topics as varied as Divorce, Immigration, Land use, and Prehistoric populations. A topical outline provides a thematic view of the encyclopedia's content, which ranges from population theory to the cultural and political aspects of population.\n\nEach entry is 500 to 1,000 words in length, contains a bibliography, and is signed by one of 278 authors--all published scholars from around the world. Among the longer entries are Climate change and population; Diseases, infectious; and Sexuality in humans. As is expected within the field of population, many charts, tables, and graphs accompany the text, including several in an appendix. Biographical entries on 60 individuals whose work was important in the development of population studies--for example, Thomas Malthus, Karl Marx, and Margaret Sanger--are included. Finding aids include an alphabetical list of articles, see and see also references, and an extensive index.\n\nThe Encyclopedia of Population is a successor to the International Encyclopedia of Population (Free Press, 1982). This earlier work focused on entries by country, whereas the later title focuses on themes and topics in population. Although the number of entry headings has doubled, the page numbers haven't, so expect concision and some dropped content. Appropriate for academic libraries, particularly those with programs in population studies, world economics, political science, and world development. RBB Copyright Ã‚Â© American Library Association. All rights reserved","torrent":{"xt":"urn:btih:93feedbf23620bf149f1b8041dcdd8d64a5fec35","amp;dn":"Encyclopedia+of+Population+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93feedbf23620bf149f1b8041dcdd8d64a5fec35","infoHashBuffer":{"type":"Buffer","data":[147,254,237,191,35,98,11,241,73,241,184,4,29,205,216,214,74,95,236,53]},"announce":[],"urlList":[]}}