{"title":"Primus - Animals Should Not Try to Act Like People DVD9","uid":6976220,"size":7911042539,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:943edb05b37b39b7b814b993e6ad31d98d7c2720&amp;dn=Primus+-+Animals+Should+Not+Try+to+Act+Like+People+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fekal","files":159,"time":1327262319,"description":"Animals Should Not Try to Act Like People\n\nFull DVD, Enjoy!\n\nAnimals Should Not Try to Act Like People is a career-spanning retrospective DVD plus bonus EP by Primus, released on October 7, 2003. The title was inspired by a crayon-made story book written by guitarist Larry LaLonde's son,[1] and the cover depicts a sculpture made by long-time Primus collaborator Lance &quot;Link&quot; Montoya. The DVD features all of the band's music videos to date, plus short films and live footage from as far back as 1986, whereas the bonus EP features five new songs written and recorded specifically for this release. When promoting the release, bassist Les Claypool remarked that &quot;It seems of late that bands are adding supplemental DVD material to their album releases to promote record sales. We've done the opposite. We've added a supplemental audio recording of brand new music to an extremely comprehensive DVD of classic visuals.&quot;\n\nAnimals Should Not Try to Act Like People shows the return of drummer Tim Alexander to the lineup, who had previously left the band in 1996. He joins Claypool and LaLonde in performing on the EP, as well as providing commentary for the DVD. Claypool has claimed that two of the five new songs on the EP were written within the first 45 minutes of the lineup working together again,[1] and &quot;Pilcher's Squad&quot; was said to have been written and recorded within a single afternoon.[2] This is also the only Primus release to feature one of the band's earliest drummers, Tim &quot;Curveball&quot; Wright, filmed performing &quot;Sgt. Baker&quot;.\n\n","torrent":{"xt":"urn:btih:943edb05b37b39b7b814b993e6ad31d98d7c2720","amp;dn":"Primus+-+Animals+Should+Not+Try+to+Act+Like+People+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"943edb05b37b39b7b814b993e6ad31d98d7c2720","infoHashBuffer":{"type":"Buffer","data":[148,62,219,5,179,123,57,183,184,20,185,147,230,173,49,217,141,124,39,32]},"announce":[],"urlList":[]}}