{"title":"Goldfrapp - Tales of Us (2013) [FLAC]","uid":9023735,"size":259364418,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:943efac93e00777bce54be38519fe98496d07087&amp;dn=Goldfrapp+-+Tales+of+Us+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1381324702,"description":"\n  Goldfrapp - Tales of Us (2013) [FLAC]\n\n  Genre: Electronic\n  Style: Dream Pop\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Jo \n  02 Annabel \n  03 Drew \n  04 Ulla\n  05 Alvar\n  06 Thea \n  07 Simone \n  08 Stranger\n  09 Laurel\n  10 Clay\n\n  Goldfrapp fans know to expect changes from album to album, but the switch in direction between Head First and Tales of Us is one of the duo's most drastic about-faces. Alison Goldfrapp and Will Gregory's sixth album trade the neon nostalgia of Head First's synth pop for a subtler, more complex sound that evokes Felt Mountain's lushness and Seventh Tree's acoustic confessions. Tales of Us could be seen as a cross between those two works -- and Goldfrapp have certainly covered enough territory that they could live out their days making hybrids of their earlier music -- but there's more to the album than that. There was a somber stillness to Felt Mountain's most haunting moments that made it uniquely compelling, and Goldfrapp returns to it here, delivering the set of unforgettable torch songs they always seemed destined to make. Above all, these songs are intimate: they bear the names of lovers as they unfurl several diaries' worth of memories and regrets. Tracks like &quot;Simone&quot; move between whispered sentiments and widescreen heartbreak as the duo blends orchestral and electronic elements into gorgeous arrangements and melodies that sound decades old and instantly familiar. \n\n  As lavish as Tales of Us is at times, Goldfrapp sounds more genuine and natural than they ever have. On &quot;Drew,&quot; strings sneak up on Alison's murmured remembrance of &quot;dreams of your skin on my tongue&quot; as the song gradually builds to heights that prove the duo really should record a James Bond theme. This filmic feel is no coincidence, since the works of David Lynch, Ingmar Bergman, and Michelangelo Antonioni served as inspiration. However, the album's cinematic nature goes deeper than its sound; Tales of Us also features some of Goldfrapp's strongest storytelling. &quot;Annabel&quot; explores a child's fluid gender identity, with Alison sighing &quot;why couldn't they let you be both?&quot; over a heartbreaking melody (on &quot;Stranger,&quot; she wonders if the one she's been missing is a &quot;boy or girl,&quot; emphasizing the all-encompassing sexuality of these songs). The duo also sets some of the album's most unsettling tales to its most beautiful music: &quot;Jo&quot; is a lullaby filled with gunshots and a blood red moon, while an almost sobbing melody gives &quot;Laurel&quot;'s sordid tale an added tragedy. While Tales of Us is Goldfrapp's most consistent album in terms of mood and sound, the duo still adds some variety. &quot;Thea&quot; brings film noir to the dancefloor with shivery synths and a beat that begins with footsteps, and &quot;Clay&quot; ends this collection of heartache on a (relatively) idealistic note. Even with these slight detours, Tales of Us isn't as immediate as, say, Supernature. Regardless, it's Goldfrapp's most sophisticated work to date, and one of their most consistently satisfying albums.","torrent":{"xt":"urn:btih:943efac93e00777bce54be38519fe98496d07087","amp;dn":"Goldfrapp+-+Tales+of+Us+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"943efac93e00777bce54be38519fe98496d07087","infoHashBuffer":{"type":"Buffer","data":[148,62,250,201,62,0,119,123,206,84,190,56,81,159,233,132,150,208,112,135]},"announce":[],"urlList":[]}}