{"title":"Into the Universe With Stephen Hawking S01 1080i HDTV DD5.1 MPEG","uid":5560823,"size":15916293192,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9456258508c2f4840978262386933b2d2ad2da11&amp;dn=Into+the+Universe+With+Stephen+Hawking+S01+1080i+HDTV+DD5.1+MPEG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CHD242522","files":-1,"time":1273832524,"description":"Into The Universe with Stephen Hawking is a 2010 science documentary TV series written by Stephen Hawking. The series was created for Discovery Channel by Darlow Smithson Productions and features awe-inspiring, ground breaking computer generated imagery of the universe, created by Red Vision. The series is already showing on Discovery USA and starts in the UK, titled Stephen Hawking's Universe on the 9th of April 2010 at 9pm on Discovery Channel. An original soundtrack was composed for the series by television &amp; film composer Sheridan Tongue, combining symphonic orchestral recordings with electronic and sampled elements. The score was recorded and mixed in 5.1 surround sound for HD broadcast and DVD &amp; Blu-ray release.\n\nEpisode 1- Aliens: In &quot;Are We Alone?&quot; Hawking considers one of the most important mysteries facing humankind - the possibility of alien, intelligent life. He leads us on a journey rendered in eye-popping detail, from the moons of Jupiter to a galaxy maybe not so far, far away. We will meet possible aliens and wonder at their form, we will delve into the very principles of what it is to call something alive, and we will calculate the likelihood of 'contact' being made.\n\nEpisode 2- Time Travel: &quot;Is Time Travel Possible?&quot; Hawking explores the world's favourite scientific 'what if?' He explores all the possibilities, warping the very fabric of time and space as he goes. From killing your grandfather to riding a black hole, we learn the pitfalls and the prospects for a technology that could quite literally, change everything.\n\nEpisode 3- The Story of Everything: The Story of Everything. In 2 eye-popping hours, Hawking reveals the wonders of the cosmos to a new generation. Delve into the mind of the world's most famous living scientist and reveal the splendor and majesty of the universe as never seen before. See how the universe began, how it creates stars, black holes and life -- and how everything will end.\n &lt;a href=&quot;\nhttp://www.tv.com/into-the-universe-with-stephen-hawking/show/78533/summary.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tv.com/into-the-universe-with-stephen-hawking/show/78533/summary.html&lt;/a&gt;","torrent":{"xt":"urn:btih:9456258508c2f4840978262386933b2d2ad2da11","amp;dn":"Into+the+Universe+With+Stephen+Hawking+S01+1080i+HDTV+DD5.1+MPEG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9456258508c2f4840978262386933b2d2ad2da11","infoHashBuffer":{"type":"Buffer","data":[148,86,37,133,8,194,244,132,9,120,38,35,134,147,59,45,42,210,218,17]},"announce":[],"urlList":[]}}