{"title":"Queens Of The Stone Age - No One Knows","uid":4732662,"size":152707076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:94ffac0394102ad3173af2c6b244f3e2a5f41e37&amp;dn=Queens+Of+The+Stone+Age+-+No+One+Knows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1235118088,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;No One Knows&quot; is a song by American hard rock band Queens of the Stone Age written by band members Josh Homme and Mark Lanegan. It was the first single and second track from their third album, Songs for the Deaf, and was released on November 26, 2002. &quot;No One Knows&quot; was a chart success, becoming the band's only single to top the US Modern Rock charts. The song was also critically acclaimed, receiving a nomination for Best Hard Rock Performance at the 2003 Grammy Awards.\n\nThe music video for &quot;No One Knows&quot; was directed by Dean Karr and Michel Gondry; Gondry filmed the first half on June 26 and 27, 2002, with Karr taking over on July 15. Josh Homme has said Gondry was chosen because he &quot;did all those videos for BjÃƒÂ¶rk and we're huge fans of BjÃƒÂ¶rk, so we're excited&quot;.\n\nThe video is split into two sections and switches between them throughout. The first sees band members Homme, Nick Oliveri and Mark Lanegan driving a truck at night, whereupon they hit a deer. When they get out to inspect, the deer proceeds to attack them before going on a rampage in their truck. The second section of the video is of Homme, Oliveri, Troy Van Leeuwen and Dave Grohl performing the song against a black background.\n\n&quot;No One Knows&quot; received heavy rotation on music video channels culminating in a nomination for the MTV2 Award at 2003 MTV Video Music Awards, where it lost out to AFI for &quot;Girl's Not Grey&quot;.\n\n&quot;No One Knows&quot; was released as a single on November 26, 2002 and became the most successful single from Songs for the Deaf. The song's peak placings of number one, number five and number 51 on the US Modern Rock, US Mainstream Rock (where it lasted for twenty weeks) and the Billboard Hot 100 charts respectively remain the highest of the band's career. &quot;No One Knows&quot; is also the band's highest charting single on the Dutch Singles Chart, number 39, the Irish Singles Chart, number 26, and the UK Singles Chart, number 15.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:94ffac0394102ad3173af2c6b244f3e2a5f41e37","amp;dn":"Queens+Of+The+Stone+Age+-+No+One+Knows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ffac0394102ad3173af2c6b244f3e2a5f41e37","infoHashBuffer":{"type":"Buffer","data":[148,255,172,3,148,16,42,211,23,58,242,198,178,68,243,226,165,244,30,55]},"announce":[],"urlList":[]}}