{"title":"Freddie Hubbard - Blue Spirits [1965] (Blue Note RVG Edition) [F","uid":6851572,"size":420447271,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9503e967491cca0b2f39417a4762a3fbb14f3ae0&amp;dn=Freddie+Hubbard+-+Blue+Spirits+%5B1965%5D+%28Blue+Note+RVG+Edition%29+%5BF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":19,"time":1322548764,"description":"eac secure cue log scans\n\n2004 - Blue Note / 7243 5 94318 2 6 / RVG Edition - Remastered + Bonus Tracks / CD\n\nThis excellent 1966 set features a diverse range of ensembles, all lead by trumpeter Freddie Hubbard. The first is an octet, featuring congas and a euphonium; the second, a seven-member group, including the great McCoy Tyner on piano; the third is a sextet that boasts drummer Elvin Jones and Herbie Hancock (who doubles on piano and celeste). James Spaulding lends his alto sax and flute to two of the groups, and Joe Henderson is in two as well (his melodic, yet adventurous, tenor sax playing is especially notable). Also featured are tenor player Hank Mobley, bassist Reggie Workman, pianist Harold Mabern, and drummer Pete La Roca.\n\nThe fare on BLUE SPIRITS is in keeping with the hard bop of the era. A heavy soul-jazz influence is heard on the opening &quot;Soul Surge&quot; and the Latin-tinged &quot;Cunga Black,&quot; but Hubbard's work is always challenging (the driving &quot;Jodo&quot;) and often impressionistic (the moody, spectral title track). The revolving cast of players keeps thing interesting (especially for jazz fans familiar with the respective styles of the musicians), and the tonal variation created by the different instrumentation intrigues. This reissue of the original LP includes two bonus tracks (from a session that took place the following year), increasing the stock of this fine bop outing.\n\nTracklist:\n01. Freddie Hubbard - Soul Surge (10:26)\n02. Freddie Hubbard - Cunga Black (05:16)\n03. Freddie Hubbard - Outer Forces (09:36)\n04. Freddie Hubbard - Blue Spirits (12:16)\n05. Freddie Hubbard - Jodo (07:08)\n06. Freddie Hubbard - The Melting Pot (Bonus)(07:38)\n07. Freddie Hubbard - True Colors (Bonus) (09:55)\n\nPersonnel:\nFreddie Hubbard (trumpet); Hosea Taylor (bassoon); Joe Henderson (tenor saxophone); Kiane Zawadi (euphonium); Larry Ridley, Reggie Workman (bass instrument); Big Black (congas); James Spaulding (flute, alto saxophone); Hank Mobley (tenor saxophone); Herbie Hancock (piano, celesta); Harold Mabern, McCoy Tyner (piano); Clifford Jarvis, Elvin Jones, Pete La Roca (drums).","torrent":{"xt":"urn:btih:9503e967491cca0b2f39417a4762a3fbb14f3ae0","amp;dn":"Freddie+Hubbard+-+Blue+Spirits+%5B1965%5D+%28Blue+Note+RVG+Edition%29+%5BF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9503e967491cca0b2f39417a4762a3fbb14f3ae0","infoHashBuffer":{"type":"Buffer","data":[149,3,233,103,73,28,202,11,47,57,65,122,71,98,163,251,177,79,58,224]},"announce":[],"urlList":[]}}