{"title":"Frank Zappa - In New York TQMP","uid":5113589,"size":729607644,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9525219d503e828ab97c5512abe93fbb501c939b&amp;dn=Frank+Zappa+-+In+New+York+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zootallure","files":35,"time":1254942421,"description":"Zappa in New York was recorded in December 1976 at the Palladium and originally intended for release in 1977. It was held up due to arguments between Frank Zappa and his then-record label, Warner Bros. When the two-LP set finally appeared in March 1978, Warner had deleted &quot;Punky's Whips,&quot; a song about drummer Terry Bozzio's attraction to Punky Meadows of Angel. When Zappa reacquired the album and released it as a double CD in 1991, he restored &quot;Punky's Whips&quot; and added four bonus tracks. The Zappa band, which includes bassist Patrick O'Hearn, percussionist Ruth Underwood, and keyboard player Eddie Jobson, along with a horn section including the two Brecker brothers, was one of the bandleader's most accomplished, which it had to be to play songs like &quot;Black Page,&quot; even in the &quot;easy&quot; version presented here. Zappa also was at the height of his comic stagecraft, notably on songs like &quot;Titties &amp; Beer,&quot; which essentially is a comedy routine between Zappa and Bozzio, and &quot;The Illinois Enema Bandit,&quot; which features TV announcer Don Pardo.\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:          &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t\t\t","torrent":{"xt":"urn:btih:9525219d503e828ab97c5512abe93fbb501c939b","amp;dn":"Frank+Zappa+-+In+New+York+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9525219d503e828ab97c5512abe93fbb501c939b","infoHashBuffer":{"type":"Buffer","data":[149,37,33,157,80,62,130,138,185,124,85,18,171,233,63,187,80,28,147,155]},"announce":[],"urlList":[]}}