{"title":"Letters from Sri Ramanasramam - Tiruvannamalai- India (2006) (75","uid":11600611,"size":1949989,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95db1296a26a24c63bc1a8a0174c7eec02b57f03&amp;dn=Letters+from+Sri+Ramanasramam+-+Tiruvannamalai-+India+%282006%29+%2875&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1417339175,"description":"Title: Letters from Sri Ramanasramam\nAuthor: Suri Nagamma \nHardcover: 744 pages\nPublisher: Sri Ramanasramam/Tiruvannamalai/India; 5th edition (August 25, 2006)\nLanguage: English\nISBN-10: 8188018104\nISBN-13: 978-8188018109\n\n\nBhagavan Sri Ramana Maharshi preached silence by observing it Himself and Ashramites, aspiring for spiritual advancement sat at the holy feet of Bhagavan, imbibing the lessons of that silence. Occasionally, Bhagavan spoke on spiritual matters. On such occasions,a few devotees recorded whatever He said: and amongst them Nagamma, compiler of these letters, was one. When Nagamma became an ashramite, she renounced everything and whilst sitting at the feet of the master she felt an irresistible urge to record the discussions devotees were having with Him and, as she began recording them, found that this work was a sort of sadhana for herself and so began writing them in the shape of letters to her brother in Madras. 273 letters were thus written-each one shown to Bhagavan for any corrections before being posted. The ashram published the first 75 letters during the life time of Bhagavan and they were read out in his presence. The remaining 198 letters were published subsequently in four different volumes. The depth of wisdom and knowledge contained in the cryptic sayings of Bhagavan, is a veritable mine of information, presented in a simple and easily understandable manner and is well worth careful study. This present volume contains the two books published previously under the same author -- Letters from Sri Ramansramam and Letters and Recollections from Sri Ramanasramam","torrent":{"xt":"urn:btih:95db1296a26a24c63bc1a8a0174c7eec02b57f03","amp;dn":"Letters+from+Sri+Ramanasramam+-+Tiruvannamalai-+India+%282006%29+%2875","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95db1296a26a24c63bc1a8a0174c7eec02b57f03","infoHashBuffer":{"type":"Buffer","data":[149,219,18,150,162,106,36,198,59,193,168,160,23,76,126,236,2,181,127,3]},"announce":[],"urlList":[]}}