{"title":"What the Bleep !? Quantum Physics Meets Kabbalah","uid":4706020,"size":922345396,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:95f1eb13e71e2ae9de7bbb69564f16c7ea76f7a0&amp;dn=What+the+Bleep+%21%3F+Quantum+Physics+Meets+Kabbalah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"hozer01","files":15,"time":1233861958,"description":"What the Bleep !? Quantum Physics Meets Kabbalah\n\nThree scientists from the feature film What The Bleep Do We Know!?, Fred Alan Wolf, PhD, William Tiller, PhD, and Jeffrey Satinover, MD, met with foremost Kabbalist Michael Laitman, PhD from Israel, in the panel discussion Quantum Physics Meets Kabbalah.\n\nFor the first time in history, modern day scientists met with an expert in the science of Kabbalah. The discussion focused on how contemporary science is gradually discovering that the answers to many hitherto unanswered questions about reality are awaiting to be revealed to the world through this ancient teaching.\n\nDr. Laitman commented on the event, &quot;These scientists are very honest people; they genuinely care about the truth. The truth is more important to them than any other calculation. It is very obvious that for the truth they are willing to fall over themselves, do everything, and embrace everyone.&quot;\n\nThe lively discussion was preceded and followed by private meetings that continued all through the day following the panel meeting. Participants agreed to collaborate further and discussed the possibility of a new movie, and lecture circuit for the entire panel, and joint research projects.\n\nAbout the Panel Members:\n\nFred Alan Wolf, PhD - Quantum Physics and Consciousness - author of The Yoga of Time Travel, Matter into Feeling: a new Alchemy Science and Spirit, and Mind into Matter.\n\nJeffery Satinover, M.D. - Author of seven books on Quantum Physics and Psychiatry including The Quantum Brain and Cracking the Bible Code.\n\nWilliam Tiller, PhD - Author of Conscious Acts of Creation, The Experience of a New Physics, and Science and Human Transformation: Subtle Energies, Intentionality and Consciousness.\n\nRav Michael Laitman, PhD - Author of over thirty books on Kabbalah including Awakening to Kabbalah, Introduction to the Book of Zohar, and The Science of Kabbalah.\n\n14 Videos (.wmv files)\n\nPlease seed","torrent":{"xt":"urn:btih:95f1eb13e71e2ae9de7bbb69564f16c7ea76f7a0","amp;dn":"What+the+Bleep+%21%3F+Quantum+Physics+Meets+Kabbalah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f1eb13e71e2ae9de7bbb69564f16c7ea76f7a0","infoHashBuffer":{"type":"Buffer","data":[149,241,235,19,231,30,42,233,222,123,187,105,86,79,22,199,234,118,247,160]},"announce":[],"urlList":[]}}