{"title":"Music Tech Magazine - August 2014 ","uid":10575597,"size":55992906,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95f32e1345254c4dc402580d2b7a56f2dab51b94&amp;dn=Music+Tech+Magazine+-+August+2014+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1405639770,"description":"Music Tech Magazine - August 2014 \n English | HQ PDF | 100 pages | 53.40 Mb\n\n\nLaunched on 20 March 2003, MusicTech Magazine is the first magazine from Anthem Publishing.\n\nThe magazine is targeted at engineers, producers and musicians and includes reviews of recording equipment and features articles on all aspects of music making. The magazine also features tutorials for the latest versions of popular recording applications, including Cubase, Live, Logic Pro, Pro Tools, Reason and FL Studio\n\nOne regular feature in the magazine is a two-page spread entitled Ten Minute Masters, which takes a detailed look at one small technical area of the music industry. These articles have proved very useful for beginners and advanced readers alike.[citation needed]\n\nIn the summer of 2005 the magazine launched a new updated website, which provides downloadable content from the magazine. All features and reviews from past issues are made available to download in .pdf format. Recent reviews (less than three months old) and features after Issue 18 are available for a small fee, while older articles are available free of charge.\n\nIn 2006 an online subscription to the magazine became available, providing readers with the opportunity to access each new issue online as it was published.\n\nIn 2013 Andy Jones took the editorship of the magazine and website MusicTech.net was launched. The website has become one of the fastest growing music technology websites online over the last year\n","torrent":{"xt":"urn:btih:95f32e1345254c4dc402580d2b7a56f2dab51b94","amp;dn":"Music+Tech+Magazine+-+August+2014+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f32e1345254c4dc402580d2b7a56f2dab51b94","infoHashBuffer":{"type":"Buffer","data":[149,243,46,19,69,37,76,77,196,2,88,13,43,122,86,242,218,181,27,148]},"announce":[],"urlList":[]}}