{"title":"Sexually Broken--Big breasted blonde Rain DeGrey","uid":9534185,"size":1226899445,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9620b63fd5089822e79c3e13d36afe5ccd9c9200&amp;dn=Sexually+Broken--Big+breasted+blonde+Rain+DeGrey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1390895955,"description":"\nBig breasted blonde Rain DeGrey brutally deep throated, takes on 10 inches of BBC, sucks and fucks! | Rain DeGrey | Matt Williams\n\nJanuary 27, 2014\n\n\nMP4 only.\n\n\nThey do not come much more eager a slut then Rain DeGrey. A lifestyler that got into porn so that she could get to live out all of her fantasies and desires, she is here today to get throat drilled and dicked down properly as only Sexuallybroken can. We are bringing not one but two dicks to the table, a tag team designed to overwhelm this slut until she can not even see straight.\n\nWe start off with having her apply her own blindfold, and then quickly tie her elbows behind her, effectively rendering her instantly helpless. Back and forth we toss this blonde bimbo, disorienting her while ripping her dress off. Once the dress is ripped off, her massive breasts are freed, and we bind them up so strictly they look fit to explode. Thrusting her down on her knees, blindfolded and bound, she is ready.\n\nWe walk right up and own her throat hole. That is what she is here for today, to have both ends used and trained. She sputters and gasps, choking on the challenge. One after another the dicks pound her face, pressing home all the way until her nose is on the belly. Balls deep is how we train cock whores around here. Some wooden nipple clamps affixed to those giant knockers give just enough pain to keep her in her place.\n\nCranking her up to her feet and tying up her bound arms off to a pulley, Rain is now perfectly positioned to have the other end trained as well. 10 inches of BBC slam home, using every inch of her tender hole. Rain moans and cums uncontrollably. Not satisfied with that, we add a vibrator, ripping out multiple orgasms. Rain has both a blessing and curse, once she starts cumming she just can not stop. The throat training, the bondage, the repeated orgasms, the deep dicking down all serve to blast Rain into subspace. She hangs limply, eyes gazed and drool sliding out of her well used mouth. She got everything she was hoping for today... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_27rdegrey7/SexuallyBroken-Rain-DeGrey-Matt-Williams-Big-breasted-blonde-Rain-DeGrey-brutally-deep-throated-takes-on-10-inches-of-BBC-sucks-and-fucks.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_27rdegrey7/SexuallyBroken-Rain-DeGrey-Matt-Williams-Big-breasted-blonde-Rain-DeGrey-brutally-deep-throated-takes-on-10-inches-of-BBC-sucks-and-fucks.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:9620b63fd5089822e79c3e13d36afe5ccd9c9200","amp;dn":"Sexually+Broken--Big+breasted+blonde+Rain+DeGrey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9620b63fd5089822e79c3e13d36afe5ccd9c9200","infoHashBuffer":{"type":"Buffer","data":[150,32,182,63,213,8,152,34,231,156,62,19,211,106,254,92,205,156,146,0]},"announce":[],"urlList":[]}}