{"title":"Sexually Broken--Sexy Yasmine De Leon mummified, caned, vibrated","uid":10339827,"size":1129034818,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:96654e0e22528c9e1c093605f29938898dd68ade&amp;dn=Sexually+Broken--Sexy+Yasmine+De+Leon+mummified%2C+caned%2C+vibrated&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1402526632,"description":"\nSexy Yasmine De Leon gets tightly mummified, caned, vibrated and throatboarded by big hard dick! | Yasmine De Leon | Matt Williams\n\nJune 11, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nToday is about taking a pretty porn star named Yasmine De Leon and reducing her down to a throat, nothing more, nothing less. We don't want her cunt, we don't want her ass, we don't want her tits, we just want her mouth hole as a sheath for our dick. We are going to throat train this slut until it is a perfect fit for our cock.\n\nCompletely bound and mummified in vet wrap from ankle to neck with a vibrator placed directed on her smooth shaved pussy, only Yasmine's feet and face stick out. Leather belts bind her even tighter onto the large wooden beam she is on. Yasmine is about to find out exactly what throatboarding is. She can not shift her head, she can not escape, all she can do is take every inch of cock we feel like dishing out down her face pussy.\n\nA little bastinado on those tender exposed soles of Yasmine is a warmup before we decide to test her multitasking skills. Can she suck cock while getting vibrated? Let's find out, shall we? We plug in the hitachi and Yasmine is immediately, powerfully, vibrated. She can not wiggle away from the sensation, all she can do is endure the overwhelming waves of pleasure that are washing over her bound body. While she is cumming, we take the opportunity to jam our cock as far down her wide open mouth as we can.\n\nRock hard dick, completely immobilizing bondage and multiple orgasms are the key to blast anyone into subspace. Yasmine moans around the dick as deep throat lube covers her face. She can not stop cumming as we reshape her throat meat. She is like a messy bondage butterfly waiting to be be reborn as a cock slut. And reborn she is. As her eyes glaze and she slides off into sexual subspace, we give her throat a few more thrusts, just to seal the deal. You are welcome Yasmine.  \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_11yleon2/SexuallyBroken-Yasmine-De-Leon-Matt-Williams-Sexy-Yasmine-De-Leon-gets-tightly-mummified-caned-vibrated-and-throatboarded-by-big-hard-dick.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_11yleon2/SexuallyBroken-Yasmine-De-Leon-Matt-Williams-Sexy-Yasmine-De-Leon-gets-tightly-mummified-caned-vibrated-and-throatboarded-by-big-hard-dick.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:96654e0e22528c9e1c093605f29938898dd68ade","amp;dn":"Sexually+Broken--Sexy+Yasmine+De+Leon+mummified%2C+caned%2C+vibrated","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96654e0e22528c9e1c093605f29938898dd68ade","infoHashBuffer":{"type":"Buffer","data":[150,101,78,14,34,82,140,158,28,9,54,5,242,153,56,137,141,214,138,222]},"announce":[],"urlList":[]}}