{"title":"Guns N' Roses - Discography 1987-2008 [FLAC]","uid":9335545,"size":4590711444,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:96948c5e9293c5869e6d4f08184b75fd1dac3727&amp;dn=Guns+N%27+Roses+-+Discography+1987-2008+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rudown78","files":284,"time":1386846234,"description":"Guns N' Roses - Discography 1987-2008 [FLAC]\n\n\nAt a time when pop was dominated by dance music and pop-metal, Guns N' Roses brought raw, ugly rock &amp; roll crashing back into the charts. They were not nice boys; nice boys don't play rock &amp; roll. They were ugly, misogynistic, and violent; they were also funny, vulnerable, and occasionally sensitive, as their breakthrough hit, &quot;Sweet Child O' Mine,&quot; showed. While Slash and Izzy Stradlin ferociously spit out dueling guitar riffs worthy of Aerosmith or the Stones, Axl Rose screeched out his tales of sex, drugs, and apathy in the big city. Meanwhile, bassist Duff McKagan and drummer Steven Adler were a limber rhythm section who kept the music loose and powerful. Guns N' Roses' music was basic and gritty, with a solid hard, bluesy base; they were dark, sleazy, dirty, and honest -- everything that good hard rock and heavy metal should be. There was something refreshing about a band that could provoke everything from devotion to hatred, especially since both sides were equally right. There hadn't been a hard rock band this raw or talented in years, and they were given added weight by Rose's primal rage, the sound of confused, frustrated white trash vying for his piece of the pie. As the '80s became the '90s, there simply wasn't a more interesting band around, but owing to intra-band friction and the emergence of alternative rock, Rose's supporting cast gradually disintegrated, as he spent years in seclusion.\n\nGuns N' Roses released their first EP in 1986, which led to a contract with Geffen; the following year, the band released its debut album, Appetite for Destruction. They started to build a following with their numerous live shows, but the album didn't start selling until almost a year later, when MTV started playing &quot;Sweet Child O' Mine.&quot; Soon, both the album and single shot to number one, and Guns N' Roses became one of the biggest bands in the world. Their debut single, &quot;Welcome to the Jungle,&quot; was re-released and shot into the Top Ten, and &quot;Paradise City&quot; followed in its footsteps. By the end of 1988, they released G N' R Lies, which paired four new, acoustic-based songs (including the Top Five hit &quot;Patience&quot;) with their first EP. G N' R Lies' inflammatory closer, &quot;One in a Million,&quot; sparked intense controversy, as Rose slipped into misogyny, bigotry, and pure violence; essentially, he somehow managed to distill every form of prejudice and hatred into one five-minute tune.\n\nGuns N' Roses began work on the long-awaited follow-up to Appetite for Destruction at the end of 1990. In October of that year, the band fired Adler, claiming that his drug dependency caused him to play poorly; he was replaced by Matt Sorum from the Cult. During recording, the band added Dizzy Reed on keyboards. By the time the sessions were finished, the new album had become two new albums. After being delayed for nearly a year, the albums Use Your Illusion I and Use Your Illusion II were released in September 1991. Messy but fascinating, the albums showcased a more ambitious band; while there were still a fair number of full-throttle guitar rockers, there were stabs at Elton John-style balladry, acoustic blues, horn sections, female backup singers, ten-minute art rock epics with several different sections, and a good number of introspective, soul-searching lyrics. In short, they were now making art; amazingly, they were successful at it. The albums sold very well initially, but while they had seemed destined to set the pace for the decade to come, that turned out not to be the case at all.\n\nNirvana's Nevermind hit number one in early 1992, suddenly making Guns N' Roses -- with all of their pretensions, impressionistic videos, models, and rock star excesses -- seem very uncool. Rose handled the change by becoming a dictator, or at least a petty tyrant; his in-concert temper tantrums became legendary, even going so far as to incite a riot in Montreal. Stradlin left by the end of 1991, and with his departure the band lost its best songwriter; he was replaced by ex-Kills for Thrills guitarist Gilby Clarke. GNR didn't fully grasp the shift in hard rock until 1993, when they released an album of punk covers, The Spaghetti Incident?; it received some good reviews, but the band failed to capture the reckless spirit of not only the original versions, but its own Appetite for Destruction. By the middle of 1994, there were rumors flying that GNR were about to break up, since Rose wanted to pursue a new, more industrial direction and Slash wanted to stick with their blues-inflected hard rock. The band remained in limbo for several more years, and Slash resurfaced in 1995 with the side project Slash's Snakepit and an LP, It's Five O'Clock Somewhere.\n\nRose remained out of the spotlight, becoming a virtual recluse and doing nothing but tinkering in the studio; he also recruited various musicians -- including Dave Navarro, Tommy Stinson, and ex-Nine Inch Nails guitarist Robin Finck -- for informal jam sessions. Remaining members were infuriated by Rose's inclusion of childhood friend Paul Huge in the new sessions when both Stradlin and Clarke were excluded from rejoining the band. And a remake of the Rolling Stones' &quot;Sympathy for the Devil&quot; was essentially the straw that broke the camel's back, as Rose cut out some of the other members' contributions and pasted Huge over the song without consulting anyone else. By 1996, Slash was officially out of Guns N' Roses, leaving Rose the lone remaining survivor from the group's heyday; rumors continued to swirl, and still no new material was forthcoming, though Rose did re-record Appetite for Destruction with a new lineup for rehearsal purposes. The first new original GNR song in eight years, the industrial metal sludge of &quot;Oh My God&quot; finally appeared on the soundtrack to the 1999 Arnold Schwarzenegger film End of Days. Soon after, Geffen issued the two-disc Live Era: '87-'93.\n\nThe year 2000 brought the addition of guitarists Robin Finck (of Nine Inch Nails) and Buckethead, and 2001 was greeted with Guns N' Roses' first live dates in nearly seven years, as the band (which consisted of Rose plus guitarists Finck and Buckethead, bassist Stinson, former Primus drummer Brian &quot;Brain&quot; Mantia, childhood friend and guitarist Paul Huge, and longtime GNR keyboardist Dizzy Reed) played a show on New Year's Eve 2000 in Las Vegas, playing as well at the mammoth Rock in Rio festival the following month. On New Year's Eve 2001, the band played almost the exact same set as the year before.\n\nAn appearance at MTV's 2002 Video Music Awards helped garner interest in the new lineup, but a rusty performance from Rose and an interview where he said his new album wasn't coming out anytime soon didn't do much to further their cause. That summer, GNR started on their first tour in almost eight years, and they managed to fulfill all of their commitments in Europe and Asia. Sadly, they caused a violent and destructive riot in Vancouver when Rose failed to show up for the first date of their North American tour. While he was up to his old shenanigans with the retooled lineup, former Stone Temple Pilots vocalist Scott Weiland, Slash, Sorum, and McKagan formed the successful Velvet Revolver in spring 2002.\n\nAnd so years passed and still no new GNR album, to the point where it became one joke too many. The album was long billed as Chinese Democracy, and occasionally session recordings would leak and make their way onto Internet file-sharing networks. A fascinating article written by Jeff Leeds for The New York Times, published in March 2005, revealed how tangled and costly the making of the album had become. According to the article, titled &quot;The Most Expensive Album Never Released,&quot; Rose began work on the album in 1994 and racked up production costs of at least $13 million dollars. Producers involved with the album at one time or another included Mike Clink, Youth, Sean Beavan, and even Roy Thomas Baker. (Curiously, Moby claimed to have been offered the job as well.) Marco Beltrami and Paul Buckmaster were allegedly brought in for orchestral arrangements, and there was a revolving door of guitarists. In 2006, the album seemed closer to release, as Rose began surfacing in public and even took his band on the road for some shows. The music industry's biggest boondoggle finally bore fruit in 2008 when Axl unveiled a record that was well over a decade in the making. While Chinese Democracy received many rave reviews, and the critical response was positive overall, the record underperformed (its almost impossible) expectations, debuting at number three on the Billboard 200 when it came out in November. A worldwide tour followed. \n\n\n1987 - Appetite for Destruction [1997 MFSL Remaster]\n1987 - Guns N' Roses [EP] (also known as 'Live from the Jungle')\n1988 - G N' R Lies\n1991 - Use Your Illusion I\n1991 - Use Your Illusion II\n1993 - &quot;The Spaghetti Incident?&quot;\n1999 - Live Era '87-'93 [Japan Edition]\n2004 - Greatest Hits\n2008 - Chinese Democracy\n\n\nFull album artwork and rip logs are also included. Enjoy!!!!!!!!!!!!!!!!!!!\n","torrent":{"xt":"urn:btih:96948c5e9293c5869e6d4f08184b75fd1dac3727","amp;dn":"Guns+N%27+Roses+-+Discography+1987-2008+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96948c5e9293c5869e6d4f08184b75fd1dac3727","infoHashBuffer":{"type":"Buffer","data":[150,148,140,94,146,147,197,134,158,109,79,8,24,75,117,253,29,172,55,39]},"announce":[],"urlList":[]}}