{"title":"Callers - Reviver [2012][EAC,log,cue. FLAC]","uid":8697304,"size":253373262,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:96a60e5605487ac810c1ec1f78a75a6079a4a367&amp;dn=Callers+-+Reviver+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":12,"time":1373991653,"description":"Artist:Callers\nRelease:Reviver\nReleased: 2012\nLabel: Partisan Records\nCatalog#: PTSN040CD\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Rock\n\n01 Good Years\n02 Heroes\n03 Your Finest\n04 Crush Times\n05 Long Control\n06 Reviver\n07 Turning\n08 It's A Ringer\n09 Antenna\n10 Howard 2 Hands\n\n&quot;New York band Callers have found their sound with their latest album, Reviver. As the third studio album from the band, Reviver shows the true growth that has occurred since their debut album, Fortune.\n\nReviver is a potent reminder of just how far Callers have come since their eloquently simple debut Fortune, and of how much the band have refined and expanded their intriguing fusion of jazz, soul, folk, and indie rock. Their second album, Life of Love, was inspired by and built around their radical reinterpretation of Wire's &quot;Heartbeat&quot;; while that initially seemed like a strange cover choice for the band, in retrospect it feels like the blueprint for everything that came after it. The intellectual streak that lurked in &quot;Heartbeat&quot; and the rest of Life of Love comes to the fore on Reviver, and Callers take it in even wider-ranging and often more thrilling directions. Where the arrangements on the band's previous albums were subtly complex, Reviver is bold, allowing Callers' core duo of Sara Lucas and Ryan Seaton to really strut their stuff. They waste no time doing so on the Grizzly Bear-esque duet &quot;Good Years,&quot; which boasts more vocal interplay between the two, as well as a fuller, even more intricate sound that marks this album as the group's most sonically polished work yet (the engineers who helped Callers make this album joined the band shortly after longtime drummer Don Godwin departed amicably). This ends up emphasizing Callers' technical beauty: few bands have either a vocalist as skilled as Lucas or a guitarist as inventive as Seaton, never mind both. In particular, Lucas' vocals sound prettier and more versatile than ever, with some of the guttural grit gone from her lower register and an extra sparkle to her upper register. Along with the usual comparisons to Sandy Denny and Joni Mitchell -- which songs like the lush sweep of &quot;Crush Times&quot; only strengthen -- St. Vincent's Annie Clark is now a more contemporary touchstone for Lucas' work, especially on &quot;Heroes,&quot; where her pure tone emphasizes the song's push-pull between intellect and emotion. At times, Callers' brains almost overtake their hearts -- though they do this purposely on &quot;Long Control,&quot; where gorgeously harmonized multiples of Lucas sing about being &quot;ill-equipped for emotion&quot; -- and the raw atmospheres and pure emotive power the band displayed on Fortune are sometimes missed. However, Reviver's finest moments are also its most passionate. The title track is a revelation, blending Lucas' sensual vocals with dynamic post-punk beats and flinty guitars that throw off sparks. Their version of rock is addictive, and they provide another fix at the album's close with &quot;Howard 2 Hands,&quot; where complex polyrhythms and bright, vaguely Afro-influenced guitar lines carry the song from tender to majestic. Occasionally, Callers' sheer prowess on these songs is almost overwhelming; but though Life of Love's relative restraint made it a more accessible on first listen, Reviver unlocks even more possibilities for the band.","torrent":{"xt":"urn:btih:96a60e5605487ac810c1ec1f78a75a6079a4a367","amp;dn":"Callers+-+Reviver+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96a60e5605487ac810c1ec1f78a75a6079a4a367","infoHashBuffer":{"type":"Buffer","data":[150,166,14,86,5,72,122,200,16,193,236,31,120,167,90,96,121,164,163,103]},"announce":[],"urlList":[]}}