{"title":"Noon Wine - peckinpah","uid":8066796,"size":523336944,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96e7c4f4a48a7e5bede3c9e7477bd352b7680d06&amp;dn=Noon+Wine+-+peckinpah+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cassavius","files":-1,"time":1359197308,"description":"Rare Sam Peckinpah western for TV with an impressive cast to say the least\n\n\nCast\n\nJason Robards  ... Royal Earle Thompson\nOlivia de Havilland  ...  Ellie Thompson\nTheodore Bikel ... Homer T. Hatch\nPer Oscarsson ... Olaf Helton\nRobert Emhardt ... Burleigh\nSteve Sanders ... Arthur\nBen Johnson ... Sheriff Barbee\n\n\nIMDB user review\nAuthor: Bill Slocum (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;83e1eaefefadf0efece0f6eec3e4eee2eaefade0ecee&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) from Norwalk, CT United States\n\nThe missing link in many a collection of Sam Peckinpah movies, &quot;Noon Wine&quot; presents a rare television adaptation from the director that carves out new thematic territory for a man who made his mark with action-oriented westerns. Too short a piece to be compelling on its own, &quot;Noon Wine&quot; nevertheless engages you and gives you food for thought.\n\nThe film opens on the dairy farm of Royal Earle Thompson (Jason Robards), lazy but amiable. Out of the blue appears a man named Helton (Per Oscarsson), looking for work. Helton doesn't say much more than &quot;that's alright,&quot; and seems to have a temper where his precious harmonicas are concerned, but he's a hard worker. Thompson and his family come to like the guy. Inevitably, however, Helton's mysterious past comes back to haunt them all.\n\n&quot;Noon Wine&quot; is a short film of two leisurely-developed halves, broken up by a ten-minute interlude of violence and suspense. The first 20 minutes present a comedic take on Thompson, who explains his laziness as a matter of conviction. &quot;I don't change the diapers on my kids so why should I try to wean a calf?&quot; he asks reasonably.\n\nPeckinpah sets up well the drama of Helton settling in as Thompson's nervous but sincere wife Ellie (Olivia de Havilland) looks on and helps out where she can. Helton's so close-mouthed he provokes a viewer's suspicions, but you root for him anyway because of the way both Oscarsson and director-writer Peckinpah set up the situation.\n\nThe film's second half comes off as sudden and rushed, mostly because it was made to fill 50 minutes of television time but also because the original story, by Katherine Anne Porter, is designed to suck you in only to break your heart. Porter liked misery more than I do, and perhaps that's why &quot;Noon Wine&quot; leaves me a bit cold, but I also think if you are going to make a sad film you need more time than this for it to play out right.\n\nStill, this is a solid dramatic piece highlighting powerful feelings of alienation and isolation, with a texture and feeling all its own. Peckinpah was a great director but even better editor and &quot;Noon Wine&quot; makes this point well. He doesn't have room here for long, drawn-out scenes, so instead he finds ways to economize, both with brief but effective montage sequences and with short dialogue exchanges that take place just on the heels of bigger scenes we never see.\n\nThough tinged with the same note of sadness as Peckinpah classics like &quot;The Wild Bunch&quot; and &quot;Ride The High Country,&quot; &quot;Noon Wine&quot; doesn't play like typical Peckinpah. Its violence is more emotional than physical. The relationship between Royal and his wife suggests some of the issues Peckinpah had with women on and off-screen, her very rightness being something of a turn-off; but there's a playfulness between the couple, too, like when Royal complains about Ellie's mouthy grandmother:\n\n&quot;She'd just say the first thing that popped into her head and call it God's wisdom,&quot; he teases. &quot;Suppose you'd be in church, thinking about a hen and a rooster?&quot;\n\nThe best thing to be said about &quot;Noon Wine&quot; is you wish it took longer to develop, even if you know it's only going to run you up short at the end. As it is, it marks a unique if minor signpost in the development of a great artist. \n\n\n\n*****************************FREAKYFLICKS*****************************\n \nFreakyFlicks is a free and open community dedicated to preserving and\n sharing cinematic art in the digital era. Our goal is to disseminate\n such works of art to the widest audience possible through the channels\n provided by P2P technology.\n \nThe FreakyFlicks collection is limited to those films that have played\n an exceptional role in the history of cinema and its progression in\n becoming a great art. Films that are usually described as classic,\n cult, arthouse and avant-garde.\n \nIf you have films that fit this description feel free to share them\n and participate in our community. All you need do is include this tag\n in your upload and join us at the forum to announce your release.\n \n &lt;a href=&quot; https://board.freakyflicks.es&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.es&lt;/a&gt;\n \n\n*****************************FREAKYFLICKS*****************************","torrent":{"xt":"urn:btih:96e7c4f4a48a7e5bede3c9e7477bd352b7680d06","amp;dn":"Noon+Wine+-+peckinpah+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96e7c4f4a48a7e5bede3c9e7477bd352b7680d06","infoHashBuffer":{"type":"Buffer","data":[150,231,196,244,164,138,126,91,237,227,201,231,71,123,211,82,183,104,13,6]},"announce":[],"urlList":[]}}