{"title":"Deathlands Almost Complete Series","uid":8782057,"size":44981392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96e889b58b2823ae78938feece5d3f20c4e3420f&amp;dn=Deathlands+Almost+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"runningfeather","files":301,"time":1375735876,"description":"Missing 67-78 and 44\n\nOn the morning of January 20, 2001 the climax of the Cold War set the post-apocalyptic stage for the series. The end game began with a pre-emptive strike on Washington. Underground nuclear bombs were detonated from within the basement of the Soviet embassy, by an elite group of Spetsnaz operatives, destroying the central command structure and political system of the United States. For an indefinite period of time a nuclear exchange between the United States and the Soviet Union devastated both countries and subsequently the entire planet (but little details are known outside both countries). All manner of genetic contagions were released infecting the survivors of the firestorm with horrible illnesses. The remaining survivors lived harshly during a time of prolonged nuclear winter known as 'Sky Dark'. The geography, climate, and ecosystems of the world had changed dramatically. What was left of the United States came to be known as the Deathlands.\n\n100 years later civilization begins again: brutal, short lived, morally confused and crazed from mutation. Between the many hot spots are small plague pits ruled by power hungry individuals who have no limits in order to establish their rule and expand their influence. These individuals are known as the Barons. \n\n","torrent":{"xt":"urn:btih:96e889b58b2823ae78938feece5d3f20c4e3420f","amp;dn":"Deathlands+Almost+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96e889b58b2823ae78938feece5d3f20c4e3420f","infoHashBuffer":{"type":"Buffer","data":[150,232,137,181,139,40,35,174,120,147,143,238,206,93,63,32,196,227,66,15]},"announce":[],"urlList":[]}}