{"title":"Clinton, Inc. - Daniel Halper - Chapterized Audiobook MP3","uid":10613211,"size":317584587,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:977c2f0780ab74b81ce7e799d2f164aa366a7d36&amp;dn=Clinton%2C+Inc.+-+Daniel+Halper+-+Chapterized+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1406064329,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\n\nClinton, Inc.: The Audacious Rebuilding of a Political Machine\n\nWritten by: Daniel Halper\nNarrated by: Harvey Betancourt\nLength: 10 hrs and 58 mins\nFormat: Unabridged\nRelease Date:07-22-14\n\nWeekly Standard editor Daniel Halper provides a meticulously researched account of the brilliant calculations, secret deals, and occasionally treacherous maneuverings that led to the Clintons' return to political prominence.\n\nIn the 12 years since the Clintons left the White House, they have gone from being virtually penniless to multi-millionaires, and are arguably the most popular politicians in America - respected and feared by Republicans and Democrats alike. But behind that rise is a never-before-told story of strategic cleverness, reckless gambles, and an unquenchable thirst for political power.\n\nInvestigative reporter Daniel Halper uses a wealth of research, exclusive documents, and detailed interviews with close friends, allies, and enemies of the Clintons to reveal the strategy they used and the deals they made to turn their political fortunes around. Clinton, Inc. exposes the relationship between President Obama, the Bush family, and the Clintons - and what it means for the future; how Bill and Hillary are laying the groundwork for the upcoming presidential campaign; how Vice President Biden and other Democrats are trying to maneuver around her; Chelsea's political future; the Clintons' skillful media management; the Clintons' marriage and why it has survived; and an inside look at the Clinton's financial backers and hidden corporate enterprises.\n\nClinton, Inc. is the key to understanding America's most powerful political couple. ","torrent":{"xt":"urn:btih:977c2f0780ab74b81ce7e799d2f164aa366a7d36","amp;dn":"Clinton%2C+Inc.+-+Daniel+Halper+-+Chapterized+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"977c2f0780ab74b81ce7e799d2f164aa366a7d36","infoHashBuffer":{"type":"Buffer","data":[151,124,47,7,128,171,116,184,28,231,231,153,210,241,100,170,54,106,125,54]},"announce":[],"urlList":[]}}