{"title":"Jon Hopkins - Asleep Versions EP (2014) FLAC","uid":11397101,"size":125332135,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:978829d935fd6c76670a351289e3d02b9298fe28&amp;dn=Jon+Hopkins+-+Asleep+Versions+EP+%282014%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shambu69","files":-1,"time":1415378142,"description":"Ambient / Modern Classical\n\n\nSource: WEB\nCountry-manufacturer disc: UK\nYear of publication: 2014\nPublisher (label): Domino\nCatalog Number: RUG 622T\n\n\nTracklist:\n01. Immunity (with King Creosote) (6:23)\n02. Form By Firelight (with Raphaelle Standell) (4:14)\n03. Breathe This Air (Asleep version) (3:14)\n04. Open Eye Signal (Asleep version) (11:02)\n\nTotal Time: 00:24:53\n\nAbout:\nJon Hopkins has announced a new EP. It's called Asleep Versions, and it's out November 11 in the U.S. and November 10 everywhere else via Domino. It contains four &quot;decelerated, dreamlike re-imaginings&quot; of songs from his great 2013 album Immunity, including a new version of &quot;Form by Firelight&quot; featuring Raphaelle Standell of Braids/Blue Hawaii and a new version of &quot;Immunity&quot; featuring King Creosote.\nUpdate: The new &quot;Form by Firelight&quot; was played on Lauren Laverne's BBC Radio 6 Music show this morning. Listen to it here at the 1 hour 41 minute mark.\n\nDomino will also release a limited 2xCD package featuring the new EP and his great 2013 album Immunity. Watch a trailer for the EP below, designed and directed by artist Robert Hunter, incorporating images from his comic The New Ghost.\n\nHopkins has also announced a world tour, which includes a stop at this year's Pitchfork Music Festival Paris.\n\nBiography\nJon Hopkins is an electronic producer who meticulously constructs lush arrangements, blending digital beats and soothing ambience. His unique, hypnotic style made him a sought-after producer in the pop world, and earned him credits on albums by Coldplay, Massive Attack, Brian Eno, and Herbie Hancock in the late 2000s. Starting out as a gifted child pianist, in his teen years he became interested in synthesized sounds and started making acid house and drum'n'bass on a four-track recorder using computer software. He signed to Just Music at the ripe age of 19 in 2001, and recorded his debut album, Opalescent, while working part-time as a studio session musician in Wembley. His next album, 2004's Contact Note, was slightly more cinematic in nature and gained the respect of Brian Eno, who recruited Hopkins to play keys on his 2005 comeback album, Another Day on Earth. Through Eno, Hopkins began working on Coldplay's Viva la Vida as a co-producer before he returned to his solo career to complete his 2009 album, Insides. In 2011, he collaborated with Scotland's King Creosote on the largely acoustic Diamond Mine, a set of songs that influenced Hopkins' second album, Immunity, which split the difference between energetic dance music and more reflective songs.\n &lt;a href=&quot;\nhttps://itunes.apple.com/us/album/asleep-versions-ep/id915038998&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://itunes.apple.com/us/album/asleep-versions-ep/id915038998&lt;/a&gt;","torrent":{"xt":"urn:btih:978829d935fd6c76670a351289e3d02b9298fe28","amp;dn":"Jon+Hopkins+-+Asleep+Versions+EP+%282014%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"978829d935fd6c76670a351289e3d02b9298fe28","infoHashBuffer":{"type":"Buffer","data":[151,136,41,217,53,253,108,118,103,10,53,18,137,227,208,43,146,152,254,40]},"announce":[],"urlList":[]}}