{"title":"Sean Paul - I'm Still In Love With You  (2nafish)","uid":5243886,"size":169123844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:97c1ee053d5bf2350bad0ea2e4c2dc6421a774c4&amp;dn=Sean+Paul+-+I%5C%27m+Still+In+Love+With+You++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1261911090,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I'm Still in Love with You&quot; is song by Jamaican dancehall artist Sean Paul from his second album Dutty Rock. It features Sasha. It reached #6 in the UK, #13 on the U.S. R&amp;B chart, and #14 on the Billboard Hot 100. It became a top ten hit in Italy, Ireland and Switzerland.\n\nThe song is an interpolation of &quot;I'm Still in Love with You&quot; by Alton Ellis.\n\nSean Paul and Sasha (the female counterpart) are discussing a stalled and seemingly unfulfilled relationship. Paul's character is trying to persuade her to keep the relationship going; the girl seems willing to but clearly wants more, though she wants Paul to know she still loves him.\n\nDutty Rock is the second album by reggae/dancehall toaster Sean Paul. It was released on November 26, 2002. It features two U.S. #1 singles, &quot;Get Busy&quot; and &quot;Baby Boy&quot; with Beyonce. It also features singles &quot;Gimme The Light&quot;, &quot;Like Glue&quot; and &quot;I'm Still in Love with You&quot;, which all charted in the top 6 on the UK Singles Chart. The album itself reached #2 on the UK Albums Chart, and #9 on the U.S. Billboard 200 Albums Chart. It is also his first and only album so far to have a Parental Advisory sticker. The album sold 65,000 in its first week and went on to become an international phenomenon, selling over 6 million worldwide.\n\nIn 2003 the following year, Sean Paul released an edited version of the album intended for international markets. The re-release took off all skits and the single &quot;It's On&quot;, also featuring the now accessible hit single &quot;Baby Boy&quot;. The single is a duet by BeyoncÃƒÂ© and Sean Paul. It became one of the biggest hits in 2003 spending nine weeks at number one. The album sold over 2 million copies in the U.S. and helped him become a Grammy Award winning artist.\n\n\nMy Videos:\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:97c1ee053d5bf2350bad0ea2e4c2dc6421a774c4","amp;dn":"Sean+Paul+-+I%5C%27m+Still+In+Love+With+You++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c1ee053d5bf2350bad0ea2e4c2dc6421a774c4","infoHashBuffer":{"type":"Buffer","data":[151,193,238,5,61,91,242,53,11,173,14,162,228,194,220,100,33,167,116,196]},"announce":[],"urlList":[]}}