{"title":"Head Cases - Julia Kristeva on Philosophy and Art in Depressed T","uid":9894644,"size":16973919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97d52a4f71aa92f1e0f529f1244a05a2889e201c&amp;dn=Head+Cases+-+Julia+Kristeva+on+Philosophy+and+Art+in+Depressed+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1396686089,"description":"Elaine P. Miller, &quot;Head Cases: Julia Kristeva on Philosophy and Art in Depressed Times&quot; \nEnglish | ISBN: 0231166826 | 2014 | EPUB | 264 pages | 16 MB\n\nWhile philosophy and psychoanalysis privilege language and conceptual distinctions and mistrust the image, the philosopher and psychoanalyst Julia Kristeva recognizes the power of art and the imagination to unblock important sources of meaning. She also appreciates the process through which creative acts counteract and transform feelings of violence and depression.\n\nReviewing Kristeva's corpus, Elaine P. Miller considers the intellectual's &quot;aesthetic idea&quot; and &quot;thought specular&quot; in their capacity to reshape depressive thought on both the individual and cultural level. She revisits Kristeva's reading of Walter Benjamin with reference to melancholic art and the imagination's allegorical structure; her analysis of Byzantine iconoclasm in relation to Freud's psychoanalytic theory of negation and Hegel's dialectical negativity; her understanding of Proust as an exemplary practitioner of sublimation; her rereading of Kant and Arendt in terms of art as an intentional lingering with foreignness; and her argument that forgiveness is both a philosophical and psychoanalytic method of transcending a &quot;stuck&quot; existence. Focusing on specific artworks that illustrate Kristeva's ideas, from ancient Greek tragedy to early photography, contemporary installation art, and film, Miller positions creative acts as a form of &quot;spiritual inoculation&quot; against the violence of our society and its discouragement of thought and reflection.","torrent":{"xt":"urn:btih:97d52a4f71aa92f1e0f529f1244a05a2889e201c","amp;dn":"Head+Cases+-+Julia+Kristeva+on+Philosophy+and+Art+in+Depressed+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97d52a4f71aa92f1e0f529f1244a05a2889e201c","infoHashBuffer":{"type":"Buffer","data":[151,213,42,79,113,170,146,241,224,245,41,241,36,74,5,162,136,158,32,28]},"announce":[],"urlList":[]}}