{"title":"Inspired: How To Create Products Customers Love (epub - no DRM)","uid":9613025,"size":477038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:989930249401820ea26fa25624435f8ac7c935fb&amp;dn=Inspired%3A+How+To+Create+Products+Customers+Love+%28epub+-+no+DRM%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hizibizibiz","files":1,"time":1392359748,"description":"Inspired: How To Create Products Customers Love by Marty Cagan\n\nWhy do some products make the leap to greatness while others do not?\nCreating inspiring products begins with discovering a product that is valuable, usable, and feasible. If you can not do this, then it s not worth building anything.\n\n- How do you decide which product opportunities to pursue?\n\n- How do you get evidence that the product you are going to ask your engineering team to build will be successful?\n\n- How do you identify the minimal possible product that will be successful?\n\n- How do you manage the often conflicting demands of company execs, customers, sales, marketing, engineering, design, and more?\n\n- How can you adapt Agile methods for commercial product environments?\n\nProduct management expert Marty Cagan answers these questions and hundreds more as he shares lessons learned, techniques, and best practices from working for and with some of the most successful companies in the high-tech industry. You will find that there s a very big difference between how the very best companies create products and all the rest. \n","torrent":{"xt":"urn:btih:989930249401820ea26fa25624435f8ac7c935fb","amp;dn":"Inspired%3A+How+To+Create+Products+Customers+Love+%28epub+-+no+DRM%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"989930249401820ea26fa25624435f8ac7c935fb","infoHashBuffer":{"type":"Buffer","data":[152,153,48,36,148,1,130,14,162,111,162,86,36,67,95,138,199,201,53,251]},"announce":[],"urlList":[]}}