{"title":"Poison - Hollyweird (2002) 320 vtwin88cube","uid":6605294,"size":103766913,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:990c58b376e66c1c1180f86a3cf2677ac310e649&amp;dn=Poison+-+Hollyweird+%282002%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1313376043,"description":"Poison\nHollyweird (2002)\n\n\n\n\nIn a decade fueled by party anthems and power ballads, Poison enjoyed a great amount of popularity, with only Bon Jovi and Def Leppard outselling them. While the group had a long string of pop-metal hits, they soon became just as renowned for their stage show, and continued to be a major attraction long after the '80s came to a close (bringing the commercial downfall of pop-metal with it). Meanwhile, frontman Bret Michaels reinvented himself as a reality TV star in 2007, and his involvement in several TV shows -- particularly Rock of Love, Celebrity Apprentice, and Life as I Know It -- helped maintain the band's popularity in concert.\n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nIt was inevitable that the original lineup of Poison would make a comeback effort in 2002 -- they had spent so long on the VH1 airwaves, they had set the stage for a storming return. Like many bands of their era, they were smart enough to make the comeback on a small indie label, which meant they had little pressure to conform to the shifting tastes of their time, and instead could offer a new record in their old style. And that's exactly what Hollyweird (wonderful title, eh?) is -- a return to the sound of Open Up and Say Ahh, but by an older, wiser, more ambitious band. &quot;Ambitious&quot; shouldn't be read as if the group has gone prog, although at times they can have the pomp and circumstance of Meat Loaf (&quot;Wishful Thinkin'&quot; has a chorus straight out of Jim Steinman). Instead, they're sprinkling serious subjects among the party anthems, in an attempt to draw a portrait of their hometown. Their (largely) serious intentions are given weight by their leanest, hardest production yet, the first to really showcase the band as a rock band, not a pop-metal outfit. The thing is, it all works, and the result is one of Poison's best records, if not their best; it says a lot that by far the worst moment is not an original, but an awful cover of a Pete Townshend song (granted, it's &quot;Squeeze Box,&quot; the worst song he ever wrote). It may not really appeal to anybody but the converted -- despite their wide exposure on VH1, only the diehards are likely to buy a Poison album in 2002 -- but the weird thing is, this would be the album to convince doubters that the band is actually pretty good after all. \n\n\n\n\nAudio-Info:\n\n\n01. Hollyweird\n02. Squeeze Box\n03. Shooting Star\n04. Wishful Thinkin'\n05. Get 'Ya Some\n06. Emperor's New Clothes\n07. Devil Woman\n08. Wasteland\n09. Livin' In The Now\n10. Stupid, Stoned And Dumb\n11. Home (Bret's Story)\n12. Home (C.C.'s Story)\n13. Rockstar\n\n\n\n\n\n              ****Support the artists &amp; buy it if you like it.****\n\n\n                  ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n\n","torrent":{"xt":"urn:btih:990c58b376e66c1c1180f86a3cf2677ac310e649","amp;dn":"Poison+-+Hollyweird+%282002%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"990c58b376e66c1c1180f86a3cf2677ac310e649","infoHashBuffer":{"type":"Buffer","data":[153,12,88,179,118,230,108,28,17,128,248,106,60,242,103,122,195,16,230,73]},"announce":[],"urlList":[]}}