{"title":"PlayerPro Music v.2.85","uid":9410519,"size":17981102,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:9910101c529503e84c68038bc306f6ba8bf125e5&amp;dn=PlayerPro+Music+v.2.85&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pichulman","files":15,"time":1388275659,"description":"I Get f*****ing tired to wait for sameone to uppload a working app of PlayerPro..\nbecause the 2.8 doesn't work with KitKat..\nBut Now i found this one and working perfect with android 4.4.2..\nso you are welcome...this one is complete..even with skins and everything..\n\nPlayerPro Music Player - a great, powerful, beautiful and very comfortable for your audio player robofonov. With all the courage we can say that the product - a great alternative to such monsters really like PowerAMP and Neutron Music Player, especially given the fact that the latter specifically increased the protection of their programs from breaking).\n\nDescription from Google Play:\nKey features:\n- View and play music by album, artist, genre, song, playlists, folders, and album artists;\n- Viewing and video playback;\n- Automatically download missing album artwork, artist pictures and genre illustrations;\n- Manual selection of relevant album artwork, artist pictures, genre illustrations from the Internet, the Gallery app, ID3-tags, or album folder;\n- Change the user interface of the player, set one of the 14 available skins, all free of charge;\n- Set the layout view between Grid or List;\n- Reading the reviews of the album and artist;\n- Download, search and save LYRICS to your music files using standard ID3-tags;\n- Single and group TAG EDITING: title, album, artist, track, year, genre, comment. Supported formats: mp3, ogg, flac, wma, wav, m4a, mp4;\n- Miscellaneous audio effects for Android devices&gt; 2, 3, 5-band graphic equalizer with default / customizable presets (edit, rename, delete), STEREO EXTENSION effect (virtualizer), REVERB effects (large hall, medium hall, plate, small room, medium room, large room), BASS BOOST effect, volume control;\n- Free add DSP PLUGIN for Android = 2.3 devices: 10 band graphic equalizer with 15 default / customizable presets, PRE-AMP control, bass boost, volume control. Go to Settings&gt; Audio and select &quot;Download DSP pack&quot; to install the free plugin;\n- Sound Effects Dolby and SRS for HTC devices equipped with improved sound HTC (HTC Desire HD, etc.).\n- SMART statistics and music playlists: ratings, number of plays / passes Losing last, last added;\n- Import and export music history and ratings from your favorite desktop music player: Songbird, Winamp, Wmp, MediaMonkey, music files;\n- Selection of music folders;\n- Choice of 2 LOCK SCREEN widgets with many customization options: unlock slider, sound switch, skip tracks using volume buttons, gestures;\n- Choice of 5 different home screen widgets (4x1, 2x2, 3x3, 4x4, 4x2);\n- Scrobbling support: Simple Last.fm, Scrobble Droid, official app Last.fm;\n- Sleep timer with a gradual decay;\n- Sending text notifications, album covers / artist in your favorite social networks: Twitter, Facebook, Gmail, Picassa, etc.;\n- Headset support. Customize long press and actions double / triple clicking;\n- Search for a library. Voice search;\n- Gestures (player: swipe album art to skip songs, view: swipe left to play next, swipe right to play last);\n- SHAKE feature: Shake your phone to play next / previous song (eg: shake top to bottom or bottom to top to play next / previous song);\n- Create shortcuts to playlists;\n- Support APP2SD.\n","torrent":{"xt":"urn:btih:9910101c529503e84c68038bc306f6ba8bf125e5","amp;dn":"PlayerPro+Music+v.2.85","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9910101c529503e84c68038bc306f6ba8bf125e5","infoHashBuffer":{"type":"Buffer","data":[153,16,16,28,82,149,3,232,76,104,3,139,195,6,246,186,139,241,37,229]},"announce":[],"urlList":[]}}