{"title":"History Channel - Sex in the Ancient World [Complete] XviD ZiLLa","uid":8088300,"size":760992434,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:99b5c10642d8c00896408799e9e4271a12e59f1e&amp;dn=History+Channel+-+Sex+in+the+Ancient+World+%5BComplete%5D+XviD+ZiLLa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Masterzilla","files":-1,"time":1359658531,"description":"** Sex in the Ancient World: Pompeii (2010) **\n\nThe oldest known brothel in the world is discovered in Pompeii. A startling system is revealed that includes widespread prostitution and sexual slavery. Experts piece together the elaborate system and show how the sex trade helped reinforce class and power in Ancient Rome.\n\n\n** Sex in the Ancient World: Egypt (2009) **\n\nFor centuries, the sex lives of the Ancient Egyptians have been hidden away from history. Even today, some sexual images from Ancient Egypt are still censored by the authorities and concealed deep in the vaults of museum collections.\n\nIn this candid and evocative program, take a fascinating journey back in time to discover the true story behind sex in Ancient Egypt. Join the experts as they reveal the meaning of sexually explicit graffiti, thousands of years old, found on the walls of an ancient limestone tomb near the Valley of the Kings. Next, witness the dramatic and high-tech computer re-creation of what is possibly the world's oldest form of erotica - the Turin Erotic Papyrus. Long shrouded in mystery, explore the many questions surrounding this controversial artifact: Does it portray the sex lives of the Gods and provide a coded message to the afterlife? Is it part of an elaborate and mystical ritual of conception? Or is it simply a relic of sexually explicit material from the ancient world?\n\nFeaturing breathtaking imagery and contributions from leading experts, HISTORY presents a thrilling look at what really went on between the sheets in Ancient Egypt.\n\n*********************************************************************************\n\nCodec ID.....: XVID\nWidth........: 640 pixels\nHeight.......: 360 pixels\nAudio........: MP3\nBit rate.....: 128 Kbps\n\n*********************************************************************************\n\nStandard XviD rez copy of MVGs release. Visit MVG Forum and Torrent Tracker\n\n\nN-joy\n\nZiLLa Rips","torrent":{"xt":"urn:btih:99b5c10642d8c00896408799e9e4271a12e59f1e","amp;dn":"History+Channel+-+Sex+in+the+Ancient+World+%5BComplete%5D+XviD+ZiLLa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99b5c10642d8c00896408799e9e4271a12e59f1e","infoHashBuffer":{"type":"Buffer","data":[153,181,193,6,66,216,192,8,150,64,135,153,233,228,39,26,18,229,159,30]},"announce":[],"urlList":[]}}