{"title":"[PSP].Tenchu.Shinobi.Taizen.[JAP].-..-.By.KoRs","uid":3363292,"size":276989608,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:9b6d0d08dc714df6ceedcd60737aa35b05a28236&amp;dn=%5BPSP%5D.Tenchu.Shinobi.Taizen.%5BJAP%5D.-..-.By.KoRs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thedios","files":1,"time":1122770656,"description":"April 26, 2005 - The PSP version of Tenchu was first announced back in September of last year, but Japanese developer/publisher From Software has been silent on the title since then. That's all about to change as the game sees proper unveiling through the upcoming issue of Japan's Famitsu magazine.\n\n\nProperly titled Tenchu: Shinobi Taizen, this original PSP entry serves as the 8th installment in the long-running series that started back with the original PlayStation Tenchu game. You take control of two characters, Ayane and Rikumaru, both of whom should be recognizable to fans of the series. The storyline of Shinobi Taizen takes place immediately following the events of Tenchu: Fatal Shadows (aka Tenchu Kurenai), the most recent Tenchu console title.\nExpect a title similar to previous Tenchu games, but made for the go. The game is split into missions that take place on maps set in mansions, bamboo fields and all the other locals you've come to expect of a Tenchu game. Stealth is of prime importance as you sneak up on enemies, sometimes by swimming, and use a variety of weapons to take them out.\n\nFrom Software is including a big bonus feature for this title. The mission creation mode from Tenchu II is being resurrected for the series' PSP debut, allowing you to create your own maps, complete with enemies. These can be saved to Memory Stick for exchange with friends.\n\nAlso being planned for the title is multiplayer play, both through wireless LAN and USB cable. The game will offer cooperative and competitive play, complete with multiple selectable characters.\n\nDevelopment is at 80% on Tenchu: Shinobi Taizen, with a Japanese release set for July 28. No North American plans have been announced yet, and the Tenchu franchise has bounced around a few publishers recently, but there is still a good chance for a stateside release to follow quickly.\n","torrent":{"xt":"urn:btih:9b6d0d08dc714df6ceedcd60737aa35b05a28236","amp;dn":"%5BPSP%5D.Tenchu.Shinobi.Taizen.%5BJAP%5D.-..-.By.KoRs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b6d0d08dc714df6ceedcd60737aa35b05a28236","infoHashBuffer":{"type":"Buffer","data":[155,109,13,8,220,113,77,246,206,237,205,96,115,122,163,91,5,162,130,54]},"announce":[],"urlList":[]}}