{"title":"The Specials - The Specials (2002) flac vtwin88cube","uid":6070005,"size":300432715,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9b7a39abcbd56c90323b63b1eb07ad7d396adccf&amp;dn=The+Specials+-+The+Specials+%282002%29+flac+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":16,"time":1293571493,"description":"The Specials\nThe Specials (2002)\nRemastered\n\nTrue innovators of the punk era, the Specials began the British ska revival craze, combining the highly danceable ska and rocksteady beat with punk's energy and attitude, and taking on a more focused and informed political and social stance than their predecessors and peers. \n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t1,411 kbps (CD)\n\nAudio Quality:\t\tPerfect (Lossless)\nRipper:\t\t\tWave Pad Sound Editor\nEncoder:\t\tWave Pad Sound Editor\nEncoder Settings:\tCompression Level 8 (Highest)\nContains:\t\tAlbum Art, CRC, ID Tag, [Vorbis Comments]\nSource:\t\t\tRetail CD\nRip Date:\t\tDec. 28, 2010\n\nFormat:\t\t\tFlac\nGenre:\t\t\tPunk/Reggae\nOriginal Relaease Date:\t1979\t\t\nM3U Playlist:\t\tYes\n\nThe band was originally formed in Coventry, in 1977, as the Coventry Automatics and later the Special A.K.A. by songwriter/keyboardist Jerry Dammers, with Terry Hall (vocals), Lynval Golding (guitar, vocals), Neville Staples (vocals, percussion), Roddy Radiation (guitar), Sir Horace Gentleman (bass), and John Bradbury (drums). An opening slot for the Clash stirred up interest with the major labels, but Dammers instead opted to start his own 2-Tone label, named for its multiracial agenda and after the two-tone tonic suits favored by the like-minded mods of the '60s. The Dammers-designed logos, based in '60s pop art with black and white checks, gave the label an instantly identifiable look. Dammers' eye for detail and authenticity also led to the band adopting '60s-period rude-boy outfits (porkpie hats, tonic and mohair suits, and loafers). The band released the &quot;Gangsters&quot; single, which reached the U.K. Top Ten. Soon after, hordes of bands and fans followed in the same tradition, and the movement was in full swing. Over the next several months, 2-Tone enjoyed hits by similar-sounding bands, such as Madness, the (English) Beat, and the Selecter. Late in 1979, the band released its landmark self-titled debut album, produced by Elvis Costello. They followed with several 2-Tone package tours and a live EP, Too Much Too Young (confusingly credited to Special A.K.A.). The title track, a pro-contraception song, was banned by the BBC but reached the number one spot in the U.K. At this time, the band switched musical directions, releasing album number two, More Specials, with a new neo-lounge persona. Signs indicated that the movement was fading and 2-Tone began to experience financial troubles. Nevertheless, a film documenting the 2-Tone package tours, Dance Craze, as well as its companion album, saw considerable success. The Specials released the timely &quot;Ghost Town&quot; single in 1981 amid race-related unemployment riots in Brixton and Liverpool. The single jumped to number one, but the band was falling apart. Hall, Staples, and Golding left to form Fun Boy Three, leaving the band without its trademark voice. Dammers held on, reverting back to the old name, Special A.K.A., and enlisted a new vocalist, Stan Campbell. After several years, they returned with In the Studio in 1984. They managed a few hits with &quot;Racist Friend&quot; and &quot;Free Nelson Mandella,&quot; but the album stiffed. The band's final single, &quot;What I Like Most About You Is Your Girlfriend,&quot; failed to break the British Top 40. Dammers dissolved the unit, pursuing political causes such as Artists Against Apartheid. \n\n01.A Message To You Rudy\n02.Do The Dog\n03.It's Up To You\n04.Nite Klub\n05.Doesn't Make It Alright\n06.Concrete Jungle\n07.Too Hot\n08.Monkey Man\n09.(Dawning Of A ) New Era\n10.Blank Expression\n11.Stupid Marriage\n12.Too Much Too Young\n13.Little Bitch\n14.You're Wondering Now\n\nCheers!","torrent":{"xt":"urn:btih:9b7a39abcbd56c90323b63b1eb07ad7d396adccf","amp;dn":"The+Specials+-+The+Specials+%282002%29+flac+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7a39abcbd56c90323b63b1eb07ad7d396adccf","infoHashBuffer":{"type":"Buffer","data":[155,122,57,171,203,213,108,144,50,59,99,177,235,7,173,125,57,106,220,207]},"announce":[],"urlList":[]}}