{"title":"Electrochemical Reduction of Carbon Dioxide - Jinli Qiao et al.","uid":15444192,"size":5835599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9be435600806787efb3d982a4e8f1f16d26fcf16&amp;dn=Electrochemical+Reduction+of+Carbon+Dioxide+-+Jinli+Qiao+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1469854548,"description":"Electrochemical Reduction of Carbon Dioxide - Jinli Qiao et al. (CRC, 2016).pdf\r\n\r\n\r\n\r\nFor Researchers, Students, Industrial Professionals, and Manufacturers\r\n\r\n\r\n\r\nElectrochemical Reduction of Carbon Dioxide: Fundamentals and Technologies is your guide to improved catalytic performance in the electrochemical reduction of carbon dioxide (CO2). Written by electrochemical energy scientists actively involved in environmental research and development, this book addresses the biggest challenge to CO2 electrochemical reduction—low performance of the electrocatalysts—and outlines practical applications for the effective use of CO2. The authors discuss the development of electrochemical energy devices and consider environmental protection on a macroscopic and microscopic scale. Presenting a systematic overview of CO2 electroreduction, they explain the fundamental principles, describe recent advances, and outline applications for future use.\r\n\r\n\r\nIn addition, the authors describe:\r\n\r\nThe main metal electrodes used for CO2 electroreduction\r\n\r\nCurrent efficiencies for CO2 reduction products on different metal electrodes\r\n\r\nThe electrochemical conversion of carbon dioxide to produce important chemicals\r\n\r\nThree categories of reaction conditions: heterogeneous catalysis, low-temperatures electrolysis, and high-temperature electrolysis\r\n\r\nDevelopments in CO2 hydrogenation reactions\r\n\r\nVarious analysis methods\r\n\r\nProgresses in the theoretical electrochemical reduction of CO2\r\n\r\n\r\nElectrochemical Reduction of Carbon Dioxide: Fundamentals and Technologies covers a variety of topics relevant to the successful use of CO2 electrochemical reduction and utilizes expert contributors at the top of their field. The book functions as a resource for students and professionals involved in materials science, electrochemistry, chemical, energy, electrical, and mechanical engineering","torrent":{"xt":"urn:btih:9be435600806787efb3d982a4e8f1f16d26fcf16","amp;dn":"Electrochemical+Reduction+of+Carbon+Dioxide+-+Jinli+Qiao+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9be435600806787efb3d982a4e8f1f16d26fcf16","infoHashBuffer":{"type":"Buffer","data":[155,228,53,96,8,6,120,126,251,61,152,42,78,143,31,22,210,111,207,22]},"announce":[],"urlList":[]}}