{"title":"One Amazing Thing - Chitra Banerjee Divakaruni.epub","uid":8889077,"size":475008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c442bdd5f25ba7efc1b568ea724d1f83c598bc2&amp;dn=One+Amazing+Thing+-+Chitra+Banerjee+Divakaruni.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1378538748,"description":"&quot;Divakaruni is a brilliant storyteller; she illuminates the world with her artistry; and shakes the reader with her love.&quot;\n--Junot Diaz Late afternoon sun sneaks through the windows of a passport and visa office in an unnamed American city. Most customers and even most office workers have come and gone, but nine people remain. A punky teenager with an unexpected gift. An upper-class Caucasian couple whose relationship is disintegrating. A young Muslim-American man struggling with the fallout of 9/11. A graduate student haunted by a question about love. An African-American ex-soldier searching for redemption. A Chinese grandmother with a secret past. And two visa office workers on the verge of an adulterous affair.\n\nWhen an earthquake rips through the afternoon lull, trapping these nine characters together, their focus first jolts to their collective struggle to survive. There's little food. The office begins to flood. Then, at a moment when the psychological and emotional stress seems nearly too much for them to bear, the young graduate student suggests that each tell a personal tale, &quot;one amazing thing&quot; from their lives, which they have never told anyone before. And as their surprising stories of romance, marriage, family, political upheaval, and self-discovery unfold against the urgency of their life-or-death circumstances, the novel proves the transcendent power of stories and the meaningfulness of human expression itself. From Chitra Divakaruni, author of such finely wrought, bestselling novels as Sister of My Heart, The Palace of Illusions, and The Mistress of Spices, comes her most compelling and transporting story to date. One Amazing Thing is a passionate creation about survival--and about the reasons to survive.","torrent":{"xt":"urn:btih:9c442bdd5f25ba7efc1b568ea724d1f83c598bc2","amp;dn":"One+Amazing+Thing+-+Chitra+Banerjee+Divakaruni.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c442bdd5f25ba7efc1b568ea724d1f83c598bc2","infoHashBuffer":{"type":"Buffer","data":[156,68,43,221,95,37,186,126,252,27,86,142,167,36,209,248,60,89,139,194]},"announce":[],"urlList":[]}}