{"title":"Opie and Anthony 2010-06-17-O&amp;A-CF64K","uid":5633777,"size":113917871,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9c4b6ca507e63d88df8c8c6daab1920f7c2fd753&amp;dn=Opie+and+Anthony+2010-06-17-O%26A-CF64K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shuazien","files":-1,"time":1276798001,"description":"Opie and Anthony 2010-06-17-O&amp;A-CF64K\nSirius XM Satellite Radio show \nEnglish, MP3\nSpread the Virus!!\n\nThings on today's show:\n\nFrank the Frowner must be lonely\nCop punches girl, Old photographs, The new iPhone pre-orders, Reverend Al says silly things, (Fat) Bawby Kelly in for the vacationing James Norton, Bigfoot guy update\n\nThank you Inflammo.\nAll I did was copy/paste.\nInflammo did most of the work, he/she deserves most of the thanks.\nI did almost no work, I deserve almost no thanks.\nMost of the work, most of the thanks.... almost no work, almost no thanks...\n( I was going for a Brian Regan half game/whole snow cone thing...car crash)\n\nThanks to Opie, Anthony, Jim Norton, Tippy Tom, Sam Roberts, Danny, &quot;Uncle&quot; Paul Hauguss, &quot;Fat&quot; Bob Kelly, Loius CK, Travis, Club Soda Kenny, Awesome &quot;Stinky&quot; Garret, E-Rock, Francine, Lyle &quot;Chip&quot; Chiperson, Steven S, Jim Jeffries, Theodoor Scheckler, Bill Burr, Bob Levy, Jim Florentine, Jay Moyre, Ian &quot;Google it!!&quot; Halperin, Mike Tyson, Turk February, Steve C, Otto, George, Pat from Moonaki, Frenchie, Brother Wease, Andrew Dice Clay, Bill the WOW sticker guy, Mothergoose56, kurt, helium045, Inflammo, Lemmata, beerpressure, jonnychadootz, Leeham, frrrrruuunkis, VastLite, Supertank66, shocxxx, willgates, noonehere1, buzzard8, apemeat, a1958wil, adhdkid91, monobrowj, Joozeppy, junkygood, Metal_Is_4_Eva, tnvkenyon, ratnut12, blackirishlad, djskittles, moneys2, in2fitness, corduroy32, AceChev, go_yukuri, Luminol18, nester024 , TokenWGuy, wiretapstudios, SeeSirInn, kalinmlin , Ted_Sheckler, celticfc735, Sticky79, DEDWINHEDON, Ob5oLeTe, Nomoriko, uprock537, loveyafez, CJ, Unkelerb, parabolix, asok75, SissyCuckboy, grey151, wozardking, polyonymous, theolin, MajorLeeStoned, PsychicStoner, all the stoners, TrAnCeRx, djsickgravity, djnigelharkness, bigthom77769, jakepwright, willie838, minder125, phrosen, bloodyNP, nullified, unclevictim, illeffeqt, ShinSolidus, PatrickB, MIKED860, Mmmmike!!, jmorland1, GutesChicken, lou, bjornkeizers, cpnthrfan, boshine9, Morter, lambpit, xloosefusion, eminem04082, tsniper11, Sticky79, bosoxfan226, redrum. DEDWINHEDON, capnmorg1, MoeSzyslak, VoodoBlade, kost0130, OandApartyrocks22, atheos101, dommafia, Hobo_jim, intotheknife, clauge, MaXFail, bloodyjimbonne, schwoogie, Fred, George, Bill, S****E*** , Schwigger, Me, RAAAAAAMOOOONE!!!, ect.\n\nDon't forget the high quality Rips that Mothergoose56 does later in the day. That's the good stuff, man.\n\nOther places to get today's show:\n\n-http://thepiratebay.se/user/shuazien/\n-http://www.kickasstorrents.com/user/shuazien/\n-h t t p : / / w w w . d e m o n o i d . c o m / f i l e s / ? u i d = 3 1 9 4 9 7 2 &amp; s e e d e d = 2\n(Remove the spaces.)","torrent":{"xt":"urn:btih:9c4b6ca507e63d88df8c8c6daab1920f7c2fd753","amp;dn":"Opie+and+Anthony+2010-06-17-O%26A-CF64K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c4b6ca507e63d88df8c8c6daab1920f7c2fd753","infoHashBuffer":{"type":"Buffer","data":[156,75,108,165,7,230,61,136,223,140,140,109,170,177,146,15,124,47,215,83]},"announce":[],"urlList":[]}}