{"title":"ImTOO Blu-ray Creator 2.0.4.20131129+Crack (by susan1973)","uid":10343132,"size":33302796,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d4b54448263a84364e8d6cad042f347eca87286&amp;dn=ImTOO+Blu-ray+Creator+2.0.4.20131129%2BCrack+%28by+susan1973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"susan1973","files":4,"time":1402571863,"description":"ImTOO Blu-ray Creator 2 is a Blu-ray creator and DVD creator that can convert and burn Blu-ray discs and AVCHD DVDs from camcorders videos and popular common videos including M2TS, MTS, TS, AVI, MP4, MKV, DV, MPEG, MOV, QT, RM, RMVB, WMV, ASF, DAT, FLV, VOB, DivX, H.264/AVC, XviD, 3GP. The Blu-ray creator fully supports the latest Blu-ray discs: BD-R, BD-RE, BD-25, BD-50, and DVDs: DVD-5, DVD-9, DVD-R, DVD+R, DVD-RW, DVD+RW, DVD+R DL, DVD-R DL.With the Blu-ray creator, you can perfect your Blu-ray movie by trimming, cropping, adding subtitle/audio/watermark, creating splendid DVD menu, adding several titles into one disc and adjusting image settings.\n\n1.Provide numerous DVD menu templates in different styles for impressive DVD menu creation.\n2.Engineered with NVIDIA CUDA technology for pursue the highest creating speed.\n3.Power management options for portable computer are offered.\n4.Trim needed video clip by setting its start and end point.\n5.Add subtitle and audio track for your Blu-ray movies and no-subtitle/audio videos.\n6.Crop video playing region to fit your HD screen; add text and picture watermark; adjust video image effects: saturation, contrast, brightness.\n7.Write your videos to various common DVDs like DVD-R, DVD+R, DVD-RW, DVD+RW, DVD+R DL, DVD-R DL.\n8.Support high-definition BDMV and AVCHD output with resolutions: 1280x720p, 1440x1080p, 1440x1080i, 1920x1080i and 1920x1080p.\n9.Preview the original video alone or preview the original and the effect-added video in two windows in real time to get the best results.\n10.Support multi-core CPU to provide the highest speed to convert videos to HD Blu-ray movies.\n11.Take snapshots during preview and save favorite movie images as JPG, PNG or BMP format.\n12.Specify writing speed, zoom mode and the copy of burning; automatically check for updates regularly.\n13.Preset an action to automatically perform after burning process is completed.","torrent":{"xt":"urn:btih:9d4b54448263a84364e8d6cad042f347eca87286","amp;dn":"ImTOO+Blu-ray+Creator+2.0.4.20131129%2BCrack+%28by+susan1973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d4b54448263a84364e8d6cad042f347eca87286","infoHashBuffer":{"type":"Buffer","data":[157,75,84,68,130,99,168,67,100,232,214,202,208,66,243,71,236,168,114,134]},"announce":[],"urlList":[]}}