{"title":"Ike Quebec - 1961 - Blue &amp; Sentimental (vinyl 24 96) FLAC","uid":9125368,"size":802869640,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9d83cd1ad2794f9c6fcfa45db6bede76502282fd&amp;dn=Ike+Quebec+-+1961+-+Blue+%26amp%3B+Sentimental+%28vinyl+24+96%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1383214889,"description":"Ike Quebec - 1961 - Blue &amp; Sentimental\nVinyl 24 bits, 96 KHz\n\nIke Quebec's 1961-1962 comeback albums for Blue Note were all pretty rewarding, but Blue and Sentimental is his signature statement of the bunch, a superbly sensuous blend of lusty blues swagger and achingly romantic ballads. True, there's no shortage of that on Quebec's other Blue Note dates, but Blue and Sentimental is the most exquisitely perfected. Quebec was a master of mood and atmosphere, and the well-paced program here sustains his smoky, late-night magic with the greatest consistency of tone. Part of the reason is that Quebec's caressing tenor sound is given a sparer backing than usual, with no pianist among the quartet of guitarist Grant Green, bassist Paul Chambers, and drummer Philly Joe Jones. It's no surprise that Green solos with tremendous taste and elegance (the two also teamed up on Green's similarly excellent Born to Be Blue), and there are plenty of open spaces in the ensemble for Quebec to shine through. His rendition of the Count Basie-associated title cut is a classic, and the other standard on the original LP, &quot;Don't Take Your Love from Me,&quot; is in a similarly melancholy vein. Green contributes a classic-style blues in &quot;Blues for Charlie,&quot; and Quebec's two originals, &quot;Minor Impulse&quot; and &quot;Like,&quot; have more complex chord changes but swing low and easy. Through it all, Quebec remains the quintessential seducer, striking just the right balance between sophistication and earthiness, confidence and vulnerability, joy and longing. It's enough to make Blue and Sentimental a quiet, sorely underrated masterpiece. [Some reissues add three bonus cuts, all standards, which fit the program very nicely indeed.] (AllMusic)\n\nTrack list:\nA1 Blue And Sentimental\nB1 Minor Impulse\nB2 Don't Take Your Love From Me\nC1 Blues For Charlie\nD1 Like\nD2 Count Every Star\n\nPersonnel:\nIke Quebec - tenor saxophone\nGrant Green - guitar\nPaul Chambers (tracks 1-7), Sam Jones (#8) - bass\nLouis Hayes (#8), Philly Joe Jones (#1-7) - drums\nSonny Clark - piano (#8)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:9d83cd1ad2794f9c6fcfa45db6bede76502282fd","amp;dn":"Ike+Quebec+-+1961+-+Blue+%26amp%3B+Sentimental+%28vinyl+24+96%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d83cd1ad2794f9c6fcfa45db6bede76502282fd","infoHashBuffer":{"type":"Buffer","data":[157,131,205,26,210,121,79,156,111,207,164,93,182,190,222,118,80,34,130,253]},"announce":[],"urlList":[]}}