{"title":"Leela - the path of the playful -- Sadhguru Jaggi Vasudev","uid":4216564,"size":914538003,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9dc4c23c3c861d3f3cc24ac96ff575783708a4b3&amp;dn=Leela+-+the+path+of+the+playful+--+Sadhguru+Jaggi+Vasudev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deepakgod","files":2,"time":1212370750,"description":"In a legendary, one-of-a-kind program that took place at Isha Yoga Center in September 2005,  Sadhguru led a group of Isha meditators on an enigmatic, enthralling journey to explore the multifarious dimensions of Krishna through Leela ? the path of the playful. Designed  by Sadhguru with an increadible love for every little detail, the week-long program unfolded amongst ever-changing , astonishing settings, transforming the whole premises into mystical landscapes.\nA breathtaking firework of artistic and cultural performance ? dance, music, play ?infused life into this wonderland, unsurpassed in beauty and serenity. This sensual exuberance was but a playful way of setting the mood to experience the consciousness that we refer to as Krishna through unparalleled, powerful meditation processes, conducted by Sadhguru.\nThis DVD presents an excellent compilation of highlights of an unforgettable program.\n\n?Leela means it is the path of the playful. When I say playfulness we are not here just to play: we are here to explore the most profound and the most serious aspects of life; but playfully.? --- Sadhguru\n\nDOWNLOAD OTHER TORRENTS OF SADHGURU&amp;#039;S VIDEOS THAT DO NOT APPEAR HERE ON PIRATE BAY:\nwww.torrentbox.com\n","torrent":{"xt":"urn:btih:9dc4c23c3c861d3f3cc24ac96ff575783708a4b3","amp;dn":"Leela+-+the+path+of+the+playful+--+Sadhguru+Jaggi+Vasudev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dc4c23c3c861d3f3cc24ac96ff575783708a4b3","infoHashBuffer":{"type":"Buffer","data":[157,196,194,60,60,134,29,63,60,194,74,201,111,245,117,120,55,8,164,179]},"announce":[],"urlList":[]}}