{"title":"Jennifer Lopez - J.Lo (2001) [CD Rip] 320 vtwin88cube","uid":6207193,"size":164167590,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9de0a5807229211449ff1591ac6bf67e179560b1&amp;dn=Jennifer+Lopez+-+J.Lo+%282001%29+%5BCD+Rip%5D+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1298849493,"description":"Jennifer Lopez\nJ.Lo (2001)\n\n\n\nActress/singer Jennifer Lopez was born in the Bronx, NY, on July 24, 1969; after starting out in musical theater as a child, at age 16 she made her film debut in the little-seen My Little Girl, but her career then stalled until she was tapped to become one of the dancing &quot;Fly Girls&quot; on the television sketch comedy series In Living Color. A recurring role on the TV drama Second Chances followed before Lopez was thrust into the limelight co-starring with Wesley Snipes and Woody Harrelson in the 1995 feature film Money Train; smaller roles in pictures including My Family/Mi Familia, Jack, and Blood and Wine followed before she landed the title role in 1997's Selena, portraying the slain tejano singer. Co-starring opposite George Clooney in 1998's acclaimed Out of Sight, Lopez (part of a Puerto Rican family) became the highest-paid Latina actress in Hollywood history; the following summer, she returned to her musical roots with her debut pop album, On the 6, scoring a major hit with the infectious single &quot;If You Had My Love.&quot; Lopez didn't waste time perfecting a sophomore effort, the appropriately titled J.Lo, which was issued in early 2001. The following year Lopez released J to tha L-O!: The Remixes and This Is Me...Then, which spawned another hit single, &quot;Jenny from the Block.&quot; Although her high-profile romance with Ben Affleck created more headlines than her recording career, her follow-up, 2005's Rebirth -- released just after she married singer Marc Anthony -- was anticipated enough to debut at number two on the Billboard 200 album chart. The Spanish-language album Como Ama una Mujer followed in 2007, peaking at number ten on the Billboard 200 chart while remaining at the top of the Latin chart for seven consecutive weeks. In October of that same year, Lopez put out a more &quot;traditional&quot; pop album, Brave, followed by an accompanying tour. \n\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tR&amp;B\nSource:\t\t\tRetail CD\n\n\n01.Love Don't Cost A Thing\n02.I'm Real\n03.Play\n04.Walking On Sunshine\n05.Ain't It Funny\n06.CariÃƒÂ±o\n07.Come Over\n08.We Gotta Talk\n09.That's Not Me\n10.Dance With Me\n11.Secretly\n12.I'm Gonna Be Alright\n13.That's The Way\n14.Dame (Touch Me) (Duet With Chayanne)\n15.Si Ya Se AcabÃƒÂ³\n16.I'm Real (Murder Remix Feat. Ja Rule)\n\n\n\n\nEnjoy &amp; seed!","torrent":{"xt":"urn:btih:9de0a5807229211449ff1591ac6bf67e179560b1","amp;dn":"Jennifer+Lopez+-+J.Lo+%282001%29+%5BCD+Rip%5D+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9de0a5807229211449ff1591ac6bf67e179560b1","infoHashBuffer":{"type":"Buffer","data":[157,224,165,128,114,41,33,20,73,255,21,145,172,107,246,126,23,149,96,177]},"announce":[],"urlList":[]}}