{"title":"flac-Morphosis-What_Have_We_Learned","uid":7069409,"size":360033694,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9e2dcad3af89c34a57e446ee890dd220e9ce5c4e&amp;dn=flac-Morphosis-What_Have_We_Learned&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":12,"time":1330608233,"description":"Boomkat product review for:\nMorphosis - What Have We Learned\n'What Have We Learned' is one of the most anticipated LPs from the deep Techno quadrant this year. Rabih Beani's debut album arrives five years after those first head-turning releases on his Venice-based Morphine Records as Morphosis (also, later as Ra.H), and although he's only released about 1 or 2 records per year since, he's become a standard bearer for the esoteric and rarified tradition of analogue cosmic techno. His music is suffused with a sophisticated mediterranean melancholy, likely coming from his Lebanese heritage and current Italian locale, and connecting with an experimental electronic and Afro-futuristic continuum reaching from Marinetti and the original Italian futurists to Danielle Baldelli, or across the cosmos to Sun Ra and Hieroglyphic Being. With impeccably classic yet up-to-date production values the album travels between the tentatively jazzy House abstraction of 'Silent Screamer' to the Horror soundtrack jack of 'Too Far' featuring unheimlich female vocals, and the instinctively moody wanderings of 'Androids among Us'. Further out, 'Gate Of Night' feels like a half-remembered cut from his amazing 'Time' 12&quot; as Ra.H, all possessed Afro-rhythms and heavy-lidded, yawning space synths. In the closing stages the dramatic 'Dirty Matter' (previously remixed by NWAQ) carries us like some ancient tribalist ritual to the dazzling, KFW-like modular chaos of 'Ascension' and the spine-tingling, instinctive calculations of 'Europa' and its breathtaking conclusion. Ultimately, there's an sci-fi sense of narrative and an unavoidably evocative spirit to this album which should engage the very deepest House and Techno fiends. Massively recommended.\n","torrent":{"xt":"urn:btih:9e2dcad3af89c34a57e446ee890dd220e9ce5c4e","amp;dn":"flac-Morphosis-What_Have_We_Learned","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2dcad3af89c34a57e446ee890dd220e9ce5c4e","infoHashBuffer":{"type":"Buffer","data":[158,45,202,211,175,137,195,74,87,228,70,238,137,13,210,32,233,206,92,78]},"announce":[],"urlList":[]}}