{"title":"John Darnielle-Wolf in White Van","uid":13037525,"size":154964973,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9e3d4137871fc239284729ecc78c1bd68ed52898&amp;dn=John+Darnielle-Wolf+in+White+Van&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"twocows","files":8,"time":1450494147,"description":"John Darnielle-Wolf in White Van\r\n\r\nLiterature\r\n\r\nWelcome to Trace Italian, a game of strategy and survival! You may now make your first move. Isolated by a disfiguring injury since the age of seventeen, Sean Phillips crafts imaginary worlds for strangers to play in. From his small apartment in southern California, he orchestrates fantastic adventures where possibilities, both dark and bright, open in the boundaries between the real and the imagined. As the creator of Trace Italian—a text-based, role-playing game played through the mail—Sean guides players from around the world through his intricately imagined terrain, which they navigate and explore, turn by turn, seeking sanctuary in a ravaged, savage future America. Lance and Carrie are high school students from Florida, explorers of the Trace. But when they take their play into the real world, disaster strikes, and Sean is called to account for it. In the process, he is pulled back through time, tunneling toward the moment of his own self-inflicted departure from the world in which most people live. Brilliantly constructed, Wolf in White Van unfolds in reverse until we arrive at both the beginning and the climax: the event that has shaped so much of Sean's life. Beautifully written and unexpectedly moving, John Darnielle's audacious and gripping debut novel is a marvel of storytelling brio and genuine literary delicacy. \r\n \nhttp://d.gr-assets.com/books/1393646533l/20575425.jpg","torrent":{"xt":"urn:btih:9e3d4137871fc239284729ecc78c1bd68ed52898","amp;dn":"John+Darnielle-Wolf+in+White+Van","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e3d4137871fc239284729ecc78c1bd68ed52898","infoHashBuffer":{"type":"Buffer","data":[158,61,65,55,135,31,194,57,40,71,41,236,199,140,27,214,142,213,40,152]},"announce":[],"urlList":[]}}