{"title":"Fashion&amp;Glamour.Lighting.Techniques.Revisited_Thorsten.Ott.rar","uid":4408802,"size":759530116,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e71e194e670a221d740ded838cf25ff53017c65&amp;dn=Fashion%26Glamour.Lighting.Techniques.Revisited_Thorsten.Ott.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"wantilles","files":1,"time":1222109786,"description":"Fashion &amp; Glamour Lighting Techniques Revisited\n-------------------------------------------------------------------------------\nby Thorsten Ott\n\nhxxp://www.zeroplusplus.com/content/view/20/39/\n\n******\nThis file is only there to preview the movie, if you do like it,\nbuy it to pay your respects to this photographer and the time\nhe took to record and compress his knowledge in just 1:30 hours\n******\n\nDuration: 1:31:12\nVideo Codec: DX50\nResolution: 720x404\nFramerate: 30fps\nAudio Codec: mpga\nRate: 44,1 kHz\n112 kb/s\n\nSize: 736MB\n\nThe video will play the best on your computer with VLC Media Player\nor Divx Player. I suggest the free VLC Media Player from &lt;a href=&quot;\nhttp://www.videolan.org/vlc/as&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.videolan.org/vlc/as&lt;/a&gt; it works great on any operating system platform. \nDivx Player is also free at http://www.divx.com/divx/\n\nThis first video examines fashion and glamour lighting using just 1 or 2 light sources.\nWe will examine each of the 12 lighting modifiers and how or when we might use them. \nWe will discuss the 18 lighting diagrams and the 19 images created. \nFollow me as I comment on the lighting diagrams and watch a behind-the-scenes\nvideo of the 4 models photographed. This video spans what I have learned over the \nlast 20 years of shooting and modifying the light quality of my studio flash units \nto a give a 3-dimensional and cinematic light quality.\n\n\nI use both traditional light modifiers and also several custom built modifiers. \nIt is important to understand that lighting modifiers do not necessarily \nhave to be expensive, they just have to work consistently under varying environments. \nI do not push brand names or endorse any specific company. In fact, I use a very \ninexpensive brand of mono-head flash units to create the images both in the video \nand for my commercial portfolio.\n\n\nThe specific light modifiers discussed include the 22in Beauty Dish w/Grid, \nModified 4in Octabox w/Grid, Strobe Head w/7in Grid, Strobe Head Bare-bulb, \nStrobe Head w/Reflector, 4 different versions of the V-Bank, and several \nflat panel variants. Each image in the video uses a different combination \nof the modifiers to demonstrate the degree of flexibility they can offer the photographer\n \n\nAs a commercial photographer, I prefer to have visual explanations, \nand that is the format for all the tutorials. Rather than focusing on technical \naspects related to digital photography, this video is about LIGHTING. \nThe inspiration for this video was to teach LIGHTING, not Photoshop or how to fix it later. \nShow me the lights, the modifiers, and toss in a few tips on when to use these lights. \nThe images in the video are not retouched for lighting, just RAW conversions and \nthe basic 30-second levels adjustments and simple skin cleaning.\n \n\nI felt it was necessary to touch on a few digital tech details, \nwe all come from different skill levels. Monitor Calibration, White Balance, \nColor Spaces, and Light Meters may be new areas for some of us. This chapter is more \nabout bringing us up to speed than a in depth discussion. Never the less, this a very \nimportant yet frequently over looked area.\n\n \n\nTopics include:\n\n1) The Lighting Modifiers used and how to build your own inexpensively\n2) White Balance - Using a gray card\n3) Color Spaces - sRGB vs. Prophoto and 16 Bit\n4) Monitor Calibration\n5) What is a good exposure\n6) How to use a light meter\n7) My lens suggestions\n8) Alien Skin Filters and Plugins used for the images\n\n \n\nProduction Planning\n\n1) Planning the Day for Success - your crew and team\n2) Utilizing Assistants\n3) Directing Models","torrent":{"xt":"urn:btih:9e71e194e670a221d740ded838cf25ff53017c65","amp;dn":"Fashion%26Glamour.Lighting.Techniques.Revisited_Thorsten.Ott.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e71e194e670a221d740ded838cf25ff53017c65","infoHashBuffer":{"type":"Buffer","data":[158,113,225,148,230,112,162,33,215,64,222,216,56,207,37,255,83,1,124,101]},"announce":[],"urlList":[]}}