{"title":"Handel - Giulio Cesare - Larmore, Schlick, Jacobs","uid":4749806,"size":1058847274,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9e9732d9a25183e93fd7a1b0d5b1c3f4d1d59e23&amp;dn=Handel+-+Giulio+Cesare+-+Larmore%2C+Schlick%2C+Jacobs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sheila6","files":33,"time":1236114601,"description":"Handel: Giulio Cesare / Jacobs, Concerto KÃƒÂ¶ln\n\nRelease Date: 12/11/1992\n\nLabel: Harmonia Mundi\nCatalog No: 901385\nSpars Code: DDD\n\nComposer: George Frideric Handel\n\nPerformers: Furio Zanasi, Jennifer Larmore, Bernarda Fink, Marianne Rorholm, Barbara Schlick, Dominique Visse, Derek Lee Ragin, Olivier Lallouette\n\nConductor: RenÃƒÂ© Jacobs\n\nOrchestra/Ensemble: Cologne Concerto Orchestra\n\n\n\nWhen this set appeared it pushed all the other recorded versions of Giulio Cesare aside, and now, examining it again and even finding some things to argue with, it maintains that supreme position.\n\nThe opera is given complete and all the roles are sung in their original octaves (no bass-baritone Caesar, for instance). RenÃƒÂ© Jacobs' tempos are ideal for each dramatic situation, and if the recitatives have a formality that slows them down somewhat, well, we are dealing with Caesar, Cleopatra, and very grand historic deeds. Both orchestra and singers embellish their written lines, and from this vantage point, those embellishments seem very tame - but they're still welcome, highly musical, and apt.\n\nTo this day, most of the cast could not be bettered. Cornelia's opening aria is so beautifully, heartbreakingly sung, that in a better world mezzo Bernarda Fink would have become an overnight sensation on the level of a Pavarotti. Marianne RÃƒÂ¸rholm's Sesto is energetic and has the correct combination of impetuousness and dignity, but her voice strikes me as slightly too light, even for this youngish man. Similarly, Barbara Schlick is a delightful Cleopatra and she sings with absolute assuredness, but if you compare her with, say, Beverly Sills (on RCA), you don't get a complete picture of this complicated woman. Handel gives Cleopatra eight arias, covering joy, flirtatiousness, tragedy, deception, straightforwardness, etc.; the role is as rich as Isolde. With Sills, even despite her sometimes wild over-embellishments, you get every facet; Schlick misses the sheer depth of Cleopatra's complexity. It's a minor complaint given how glorious Schlick's singing is, but it must be addressed.\n\nNo such criticisms are possible about Jennifer Larmore's Cesare. The voice is as solid as a rock, her coloratura is staggering in its accuracy, and the dark, masculine sound she effects for the role is uncannily right. She can be aggressive, she can be love-smitten. In the accompanied recitative when she contemplates Pompey's ashes, her depth of feeling is palpable, her soul troubled. It's a great performance. The smaller roles are equally well-taken, with Derek Lee Ragin's effete-yet-dangerous Ptolomy particularly striking. In short, while Beverly Sills' Cleopatra is an unequalled treasure, Jacobs' cast and interpretive outlook turn the opera into the drama it should be, and no one who cares about Baroque opera should do without this set.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:9e9732d9a25183e93fd7a1b0d5b1c3f4d1d59e23","amp;dn":"Handel+-+Giulio+Cesare+-+Larmore%2C+Schlick%2C+Jacobs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e9732d9a25183e93fd7a1b0d5b1c3f4d1d59e23","infoHashBuffer":{"type":"Buffer","data":[158,151,50,217,162,81,131,233,63,215,161,176,213,177,195,244,209,213,158,35]},"announce":[],"urlList":[]}}