{"title":"The Pirate Hunter - The True Story of Captain Kidd","uid":4318688,"size":707972285,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9fbb205f61b3a7f28f669d294c683aa1f56d1703&amp;dn=The+Pirate+Hunter+-+The+True+Story+of+Captain+Kidd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"deandominic","files":20,"time":1217265068,"description":"General Information\n===================\n Title............: The Pirate Hunter: The True Story of Captain Kidd\n Author...........: Richard Zacks           \n Read By..........: Michael Prichard           \n Genre............: History              \n Publisher........: Tantor Media, Inc.; Unabridged edition (July 2003)\n\nOriginal Media Information\n==========================\n Media............: 16 CDs  \n Condition........: Very Good\n \nFile Information\n================\n Number of MP3s...: 16\n Total Duration...: 18 hours 47 minutes\n Total MP3 Size...: 674 MB\n Ripped by........: deandominic             \n Ripper...........: Exact Audio Copy                                 \n Encoder..........: LAME 3.98b8          \n Encoder Settings.: ABR 80 kbit/s 44100 Hz Mono          \n ID3 Tags.........: v1.1, v2.3 (includes embedded album art)\n\nBook Description\n================\n\nFrom Publishers Weekly\nEntertaining, richly detailed and authoritatively narrated, Zacks&amp;#039;s account of the life of legendary seaman William Kidd delivers a first-rate story. Though Kidd, better known as Captain Kidd, was inextricably bound with piracy and has popularly gone down as a marauding buccaneer himself, Zacks (An Underground Education) argues that he was actually a mercenary backed by the English government and several New World investors to track down pirates and reclaim their stolen wares. The book is cogent and replete with supporting evidence without the heavy-handed feel of some scholarly work. What really sets the book apart is Zacks&amp;#039;s gift as researcher and storyteller. He highlights the role of an undeniable pirate, Robert Culliford, in Kidd&amp;#039;s tale and pits the two men against each other from the outset, constructing his book as an intriguing duel. Aside from the tightly constructed plot, Zacks also wonderfully evokes the social and political life of the 17th century at land and at sea, and he takes turns at debunking and validating pirate folklore: while it appears the dead giveaway of a skull and crossbones made it a rare flag choice, Zacks contends that pirates did often wear extravagant clothing and were as drunk, cursing, hungry, horny... and violent as myth would have them. Augmented by such details and driven by a conflict between Kidd and Culliford that keeps the pages flying, Zacks&amp;#039;s book is a treasure, indeed.\n\n\nFrom The New Yorker\nWilliam Kidd is remembered as one of history&amp;#039;s greatest pirates, and thousands of people have searched in vain for the treasure he supposedly left buried on a desert island. In this fascinating work of historical revisionism, Zacks argues that in fact Kidd was a privateer, commissioned by the British Crown to hunt down pirates. But his mutinous crew was dissatisfied with the slim pickings of buccaneer-hunting, and Kidd himself inadvertently fell afoul of the powerful East India Company, which tarred him as a criminal. Instead of being acclaimed a national hero, he died on the gallows, in 1701. Zacks&amp;#039;s detective work here is thoroughly convincing. In addition, he sets the suspenseful tale of Kidd&amp;#039;s downfall within its larger historical context, in a manner reminiscent, at times, of Defoe, vividly illustrating the brutalities of life on a seagoing vessel and the chaos of urban society at the end of the seventeenth century.","torrent":{"xt":"urn:btih:9fbb205f61b3a7f28f669d294c683aa1f56d1703","amp;dn":"The+Pirate+Hunter+-+The+True+Story+of+Captain+Kidd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fbb205f61b3a7f28f669d294c683aa1f56d1703","infoHashBuffer":{"type":"Buffer","data":[159,187,32,95,97,179,167,242,143,102,157,41,76,104,58,161,245,109,23,3]},"announce":[],"urlList":[]}}