{"title":"Fright Night (1985) / Fright Night Part 2 (1988) / Fright Night ","uid":7223283,"size":2211455398,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a05c08bd00a7cf4a289e89b19431af1c2301f91f&amp;dn=Fright+Night+%281985%29+%2F+Fright+Night+Part+2+%281988%29+%2F+Fright+Night+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"jmanwf","files":-1,"time":1335593758,"description":"Fright Night (1985)\n\n\nAspect Ratio: Widescreen 2.35.1\n\n\nStoryline\n\nFor young Charlie Brewster, nothing could be better than an old horror movie late at night. Two men move in next door, and for Charlie with his horror movie experience, there can be no doubt that their strange behavior is explained by the fact that they are a vampire and his undead day guardian. The only one who can help him hunt them down is a washed-up actor, Peter Vincent, who hosts Charlie's favorite TV show, Fright Night. Vincent doesn't really believe that vampires exist, but does it for the money\n\n\nFright Night Part 2 (1988)\n\n\nAspect Ratio: 4:3\n\n\nStoryline\n\nThree years after killing the vampire in the original, Charlie has started to believe it was all his imagination and starts to forget that vampires truly exist - until four strangers lead by Regina, a noted actress, arrives at Peter Vincent's house and starts to have an unhealthy interest in Charlie, Peter and Charlie's new girlfriend Alex. It becomes clear that Regina is Jerry's (the vampire in the original film) sister and she is determined to get revenge on the friends and plans to turn Charlie into a vampire - so that he can face his punishment for all eternity\n\nFright Night (2011)\n\nAspect Ratio: Widescreen 1.85.1\n\nStoryline\n\nA remake of the 1985 original, teenager Charley Brewster (Yelchin) guesses that his new neighbor Jerry Dandrige (Farrell) is a vampire responsible for a string of recent deaths. When no one he knows believes him, he enlists Peter Vincent (Tennant), a self proclaimed vampire killer and Las Vegas magician, to help him take down Jerry.","torrent":{"xt":"urn:btih:a05c08bd00a7cf4a289e89b19431af1c2301f91f","amp;dn":"Fright+Night+%281985%29+%2F+Fright+Night+Part+2+%281988%29+%2F+Fright+Night+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05c08bd00a7cf4a289e89b19431af1c2301f91f","infoHashBuffer":{"type":"Buffer","data":[160,92,8,189,0,167,207,74,40,158,137,177,148,49,175,28,35,1,249,31]},"announce":[],"urlList":[]}}