{"title":"Aiseesoft Total Video Converter Platinum 7.1.20.20881+Crack","uid":9379561,"size":35022205,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a0851fbf721818b16e5176c7a281c285b068d0c4&amp;dn=Aiseesoft+Total+Video+Converter+Platinum+7.1.20.20881%2BCrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"or1gins","files":3,"time":1387687832,"description":"Description:\nAiseesoft Total Media Converter Platinum is an application designed to help you convert your multimedia files different formats supported by your devices.\nWith this tool you can convert videos to MPG, FLV, MP4, MPEG-1, MPEG-2, MPEG-4, H.264, H.264/MPEG-4 AVC, WMV, AVI, MKV, MOV, DivX, XviD, M4V, 3GP, 3G2, MTV, SWF, ASF, AMV, DPG, TS, VOB, WebM, DV and HD video formats.\nOne of the most powerful features of the application is its ability to convert movies to 3D using various Anaglyph modes.\nYou can also extract audio and encode it as MP3. WAV. AAC, AC3, AIFF, FLAC, M4A, MKA, OGG, WMA, MP2, AMR and  AU.\n\nKey Functions\n- Convert any video to all popular video and audio formats\nAiseesoft Total Video Converter software could easily convert any video to MP4, H.264, AVI, MP3, WMV, WMA, FLV, MKV, MPEG-1, MPEG-2, 3GP, 3GPP, VOB, DivX, Mov, RM, RMVB, M4A, AAC, WAV, etc with high speed and excellent image/sound qualith.\n- Easy and powerful video and audio editing (Merge, Trim, Crop)\nAiseesoft Total Video Converter software offers powerful video and audio editing functions such as video trimming, movie cropping to cater to the customerÎ“Ã‡Ã–s need.\n- Support almost all popular portable players\nAiseesoft Total Video Converter software can convert video to PSP, iPod Classic, iPod Touch, iPod Nano, iPhone (3G), iPhone, Zune, Zune 2, Blackberry, Nokia, Creative Zen, Sony Walkman, iRiver PMP, Archos, PS3, Apple TV, Xbox, iPAQ, Pocket PC, Mobile Phone, etc.\n- Easy to use\nOnly a few clicks to complete the conversion with supervising the whole process on real time.","torrent":{"xt":"urn:btih:a0851fbf721818b16e5176c7a281c285b068d0c4","amp;dn":"Aiseesoft+Total+Video+Converter+Platinum+7.1.20.20881%2BCrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0851fbf721818b16e5176c7a281c285b068d0c4","infoHashBuffer":{"type":"Buffer","data":[160,133,31,191,114,24,24,177,110,81,118,199,162,129,194,133,176,104,208,196]},"announce":[],"urlList":[]}}