{"title":"Kiss-I Was Made For Lovin' You(Live)-Wushan.avi","uid":4790746,"size":123461666,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a1fa1f30a6b1a5a6a364de0aaad79cca9d0286a2&amp;dn=Kiss-I+Was+Made+For+Lovin%5C%27+You%28Live%29-Wushan.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"wushan","files":1,"time":1237710278,"description":"                         I Was Made for Lovin' You(1979)\n\n                 &quot;I Was Made for Lovin' You&quot; is a song by the American hard rock band Kiss, originally released on their 1979 album Dynasty (see 1979 in music). It was released as the A-side of their first single from the album. It was the band's second Gold single, selling over 1 million copies. The single was certified Gold In the US on 1979-08-16[1] and in Canada on August 1, 1979.[2] The B-side of the single is the album track &quot;Hard Times&quot;, which was written by Ace Frehley. The single reached #11 on the US Billboard singles chart. The song also became a top ten hit in Australia reaching #6 on the ARIA charts in 1979. The song fared the best in Western Europe (Where it became a top 20 hit in Sweden, a top 10 hit in Norway, made it to the number 2 position in France, Germany, Switzerland, and Austria, and in Holland it became a #1 smash.)\n\nThe song was one of the band's few singles to chart in the UK in the 1970s, though only peaking at No. 51, where a 7 min 54 sec version was released on 12&quot; single in addition to the shorter 7&quot;.\n \nThe song draws heavily from the disco style that was popular in the United States in the late 1970s. Kiss guitarist and vocalist Paul Stanley, who co-wrote the song with Desmond Child and Vini Poncia, has stated that &quot;I Was Made For Lovin' You&quot; was a conscious effort on his part to prove how easy it was to write and record a hit disco song.\n\nAlthough Peter Criss appeared in the video and on the album cover, he did not actually play on the track. As with most of the Dynasty album, session drummer Anton Fig took the place of Peter Criss, who had been deemed unfit to play by producer Vini Poncia. Also, in the video the dates reads 1997, when it should read 1979.\n\n      The Version Film Editing From &quot;Kiss-Rock The Nation Live 2005&quot;\n\n\n                     ***I Was Made For Lovin' You.(Live)***\n\n                                  Enjoy!!!","torrent":{"xt":"urn:btih:a1fa1f30a6b1a5a6a364de0aaad79cca9d0286a2","amp;dn":"Kiss-I+Was+Made+For+Lovin%5C%27+You%28Live%29-Wushan.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1fa1f30a6b1a5a6a364de0aaad79cca9d0286a2","infoHashBuffer":{"type":"Buffer","data":[161,250,31,48,166,177,165,166,163,100,222,10,170,215,156,202,157,2,134,162]},"announce":[],"urlList":[]}}