{"title":"[Clara_Grace_Walker]Gratification(Desire Never Dies)(azw, epub, ","uid":11070960,"size":3272973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a20fdc880bf3577198a62fac9a5904665cc5166b&amp;dn=%5BClara_Grace_Walker%5DGratification%28Desire+Never+Dies%29%28azw%2C+epub%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":5,"time":1411265763,"description":"Book Description\nPublication Date: August 31, 2013\nSex, drugs and money. Preston Tyler's fight to save his company from a hostile takeover is not your average business deal. Worse than the lying, scheming and back-stabbing he must deal with, however, is having to go to his company's largest shareholder for help; the woman who jilted him at the altar, Maggie McKenzie. If Preston plays his cards right, maybe he can not only save his company, but win back Maggie's heart as well.\n\n\nCreateSpace Independent Publishing Platform | English | July 20, 2014 | ISBN: 1500310573 | 358 pages | azw, epub, lrf, mobi | 3,1 mb\n\nMore About the Author\n\nClara Grace Walker is a novelist of Mainstream Romantic Suspense, who finds this whole business of writing her bio rather vexing. What she really likes to do is hang out poolside on a lounge chair making things up. Or, as she calls it, spending time at her &quot;summer office.&quot; Recognizing that a bio is probably expected, however, she is willing to divulge the following information.\n\nShe was born in Texas and raised in Michigan, where she still lives, with her wonderful family and two very spoiled cats. She writes to stay sane, and because she has no idea how to not write. Having her debut novel, Gratification, hit Amazon's best-seller list was a great thrill and dream come true. She quickly followed that book up with two more, Gossip and Redemption. Together, these three books make up the Desire Never Dies trilogy.\n\nShe enjoys mixing together sex, romance, scheming and murder, and tells her tales in soap-opera-like fashion. Clara loves taking her readers on a ride filled with sensuality, intrigue and strong characters, only some of whom possess a moral compass. Buckle up. The ride's a bit bumpy!\n\nCurrently, Clara is working on a new 4-book series, Sex and Secrets. She hopes to bring many happy days of reading to her fans in the future.\n\n","torrent":{"xt":"urn:btih:a20fdc880bf3577198a62fac9a5904665cc5166b","amp;dn":"%5BClara_Grace_Walker%5DGratification%28Desire+Never+Dies%29%28azw%2C+epub%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20fdc880bf3577198a62fac9a5904665cc5166b","infoHashBuffer":{"type":"Buffer","data":[162,15,220,136,11,243,87,113,152,166,47,172,154,89,4,102,92,197,22,107]},"announce":[],"urlList":[]}}