{"title":"Kavafis 1996 GR","uid":5960684,"size":520706761,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a21e3d1b53cdd76fb00e98b7c1d9b5e8a7736ded&amp;dn=Kavafis+1996+GR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"johnefp","files":-1,"time":1289942660,"description":"This movie about the greatest modern Greek poet was met with criticism from Greek audiences on two grounds. It focuses almost exclusively on Cavafy's homosexuality (a topic the average Greek high school teacher still prefers to bypass) and it presents the peculiar innovation of having Cavafy not speak a single word throughout the entire movie. Many Greek viewers considered the latter device completely antithetical to the poet's eloquent verse. The only voice of the poet in the movie are his poems which are recited in the background over many scenes. I think both criticisms were unfair exactly because Cavafy's homosexuality is still quite taboo in the Greek educational system and the trick of having him speak only through his verses in a movie that deals primarily with same-sex desire works well. The movie does not cover all of Cavafy's life in detail but sketches the main episodes and definitely recreates the atmosphere of his poetry. The breathtaking cinematography is light years ahead of most films made in Greece. This is probably one of the best Greek films ever made and I hope it will be more appreciated as Cavafy's name becomes more and more known internationally. Everyone interested in the poet's work should watch it, but better read a short biographical note on him first because the movie itself is too poetic to follow a rigid narrative structure. Even if more films are made in the future about Cavafy, they may address some of the audience's criticisms by featuring a more conventional biographic narration, but I doubt they will be able to compete with Smaragdis' rendering of the Hellenistic homosexual fantasy world so vibrantly present in Cavafy's poetry.  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0115849/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0115849/&lt;/a&gt;\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:15:53\nMovie complete : Yes\n\n[Video]\nResolution : 720x400\nCodec : DivX (4 / 5 / 6)\nFPS : 25,00\nBitRate : 787 Kbps\nQuality Factor : 0,11 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n\nPlease seed at least as much as you D/L.\n\nDon't hit and run.\n=======================================\nThanks \n\nJohn\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/johnefp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/johnefp&lt;/a&gt;\n\n\nno subs available","torrent":{"xt":"urn:btih:a21e3d1b53cdd76fb00e98b7c1d9b5e8a7736ded","amp;dn":"Kavafis+1996+GR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a21e3d1b53cdd76fb00e98b7c1d9b5e8a7736ded","infoHashBuffer":{"type":"Buffer","data":[162,30,61,27,83,205,215,111,176,14,152,183,193,217,181,232,167,115,109,237]},"announce":[],"urlList":[]}}