{"title":"The Way Forward: Renewing the American Idea- Paul Ryan Audiobook","uid":10818040,"size":273496127,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a29ccad048ebb269394a649434bc55777523568f&amp;dn=The+Way+Forward%3A+Renewing+the+American+Idea-+Paul+Ryan+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1408486467,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Way Forward: Renewing the American Idea\n\nWritten by: Paul Ryan\nNarrated by: Jonathan Davis\nLength: 9 hrs and 28 mins\nFormat: Unabridged\nRelease Date:08-19-14\n\nThe Way Forward challenges conventional thinking, outlines his political vision for 2014 and beyond, and shows how essential conservatism is for the future of our nation.\n\nBeginning with a careful analysis of the 2012 election - including a look at the challenge the GOP had in reaching a majority of voters and the prevalence of identity politics - Ryan examines the state of the Republican party and dissects its challenges the country to certain ruin.\n\nCulminating in a plan for the future, The Way Forward argues that the Republican Party is and must remain a conservative party, emphasizing going forward.\n\nThe Way Forward also offers a detailed critique of not only President Obama but of the progressive movement as a whole - its genesis, its underlying beliefs and philosophies, and how its policies are steering conservatism in a way that demonstrates how it can modernize and appeal to both our deepest concerns and highest ideals. ","torrent":{"xt":"urn:btih:a29ccad048ebb269394a649434bc55777523568f","amp;dn":"The+Way+Forward%3A+Renewing+the+American+Idea-+Paul+Ryan+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a29ccad048ebb269394a649434bc55777523568f","infoHashBuffer":{"type":"Buffer","data":[162,156,202,208,72,235,178,105,57,74,100,148,52,188,85,119,117,35,86,143]},"announce":[],"urlList":[]}}