{"title":"Andrew C. McCarthy - The Grand Jihad (mobi, epub)","uid":6955243,"size":1121120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2dd1c05d994989e80d55ed998f26639818e8028&amp;dn=Andrew+C.+McCarthy+-+The+Grand+Jihad+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1326554845,"description":"The Grand Jihad: How Islam and the Left Sabotage America\n\nThe real threat to the United States is not terrorism. The real threat is Islamism, whose sophisticated forces have collaborated with the American Left not only to undermine U.S. national security but also to shred the fabric of American constitutional democracy--freedom and individual liberty. In The Grand Jihad: How Islam and the Left Sabotage America, bestselling author Andrew C. McCarthy offers a harrowing account of how the global Islamist movement's jihad involves far more than terrorist attacks, and how it has found the ideal partner in President Barack Obama, whose Islamist sympathies run deep. \n\nFor years, McCarthy warned of America's blindness to the Islamist threat, but in The Grand Jihad McCarthy exposes a new, more insidious peril: the government's active appeasement of the Islamist ideology. With the help of witting and unwitting accomplices in and out of government, Islamism doesn't merely fuel terrorism but spawns America-hating Islamic enclaves in our very midst, gradually foisting Islam's repressive law, sharia, on American life. The revolutionary doctrine has made common cause with an ascendant Left that also seeks radical transformation of our constitutional order. The prognosis for liberty could not be more dire.\n\nAuthor: Andrew C McCarthy\nPublisher: Encounter Books\nPublication Date: January 17, 2012\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a2dd1c05d994989e80d55ed998f26639818e8028","amp;dn":"Andrew+C.+McCarthy+-+The+Grand+Jihad+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2dd1c05d994989e80d55ed998f26639818e8028","infoHashBuffer":{"type":"Buffer","data":[162,221,28,5,217,148,152,158,128,213,94,217,152,242,102,57,129,142,128,40]},"announce":[],"urlList":[]}}