{"title":"Martina Topley-Bird","uid":4238318,"size":212407538,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a33a7ba6f73879113d1c82eb31d0a0b2e255c535&amp;dn=Martina+Topley-Bird&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pas.sie.f.","files":38,"time":1213403509,"description":"NOW DON'T LEECH! Seed at LEAST 1.5. When yr client STOPPED seeding because of reached SEED-LIMIT, change the limit and let it run for a FEW MINUTES, just to check the torrent-status. DON'T LEAVE PEOPLE STUCK!!\n\n\n\nIM GONNA DELETE THE FILES FROM MY LAPTOP, NEED THE SPACE, so...\nPLEEEEEEEAAAAAAAAZZ, SEEEEEEED SEEEEED SEEEEEEEEEED!!!!!! :-)\n\n\n\n*Quitoxic (variable) (edit: Oops! Made a lil mistake. Track 13 Stevie's (Day's of a    gun).mp3 in the The Blue God Folder belongs in the Quixotic folder! Sorry\n\n*The Blue God (192)\n\n*Collaborations/Other (variable)\n\nQuixotic was re-released for the USA with a slight different track-listening. Here is the original track-listening, the other songs u can find as bonus, together with various collaborations.\nSorry for the various bitrates, couldn't find better on the net (or i didnt searched good enough) but the best i could find. (Damn, too many times when I wanted to buy a album of her I come back with others :-P )\n\nEnjoy &amp; Seed :-)\n\nps. this is only my 2nd torrent ever, feel free to comment on my seeds.\n\n\nMartina Topley-Bird\nFrom Wikipedia, the free encyclopedia\n\n\nMartina Topley-Bird is a British vocalist who first gained fame as the featured female vocalist on trip hop pioneer Tricky's debut album Maxinquaye (a printing error credited her as &quot;Martine&quot;). She continued her collaboration with Tricky on his follow-up albums Nearly God, Pre-Millennium Tension and Angels with Dirty Faces.\n\nFollowing a falling-out of their professional and personal relationship in 1998, she began pursuing a solo career. It was not until 2003 that she released her debut album Quixotic on Independiente Records. Upon its release, it received rave reviews from critics and was a finalist for the 2003 Mercury Music Prize. The song &quot;Sandpaper Kisses&quot; from the album was featured in the video game Fahrenheit (released in North America as Indigo Prophecy).\n\nThe album finally saw a release, of sorts, in the United States in July 2004 when the Palm Pictures label released a &quot;re-designed and re-sequenced&quot; version with a new title (Anything), a trimmed-down tracklisting and all-new cover art.\n\nHer second solo album, The Blue God, was released in May 2008. The track &quot;Carnies&quot; was released as the first single on 3 March 2008[1]and reached No.20 on the UK Indie Charts. &quot;Poison&quot; was released as the second single and reached No.9 on the Indie Charts.\n\n\nContents\n\n    * 1 Discography\n          o 1.1 Albums\n          o 1.2 Singles\n          o 1.3 Collaborations\n    * 2 External links\n    * 3 References\n\nDiscography\n\nAlbums\n\n    * Quixotic (2003, Independiente)\n    * Anything (2004, Palm Pictures)\n    * The Blue God (2008, Independiente)\n\nSingles\n\n    * 2003 &quot;Need One&quot;\n    * 2003 &quot;Anything&quot;\n    * 2003 &quot;I Still Feel&quot;\n    * 2004 &quot;Soul Food&quot;\n    * 2008 &quot;Carnies&quot;\n    * 2008 &quot;Poison&quot;\n\nCollaborations\n\n    * Topley-Bird is credited as a vocalist on &quot;Conversing Among Misfits&quot;, a song from 1998 debut (self-titled) album by Earthlings?. Her performance is hard to hear in the final mix however.\n    * In 1999 she contributed vocals to tracks 9 and 13 (&quot;Dirty Drowning Man&quot; and &quot;Coattails of a Dead Man&quot;) on Primus' album Antipop.\n    * In 2000, Topley-Bird appeared on David Holmes' album Bow Down to the Exit Sign.\n    * In 2004, Topley-Bird appeared on &quot;Into the Sun&quot;, a track from Diplo's album Florida.\n    * In 2005 she made a guest appearance (alongside Roots Manuva) on the Gorillaz track &quot;All Alone&quot;, on the album Demon Days.\n    * In 2006, Topley-Bird appeared on the song &quot;Devil Take My Soul&quot; on the Son of Dave record 02.\n    * Topley-Bird appears on the song &quot;Marterry&quot; on Leila Arab's MySpace page.\n    * She contributes vocals on the Saturnalia album by The Gutter Twins (&quot;The Body&quot;) (2008)\n    * In 2008 on her single &quot;Poison&quot;, she collaborates again with Roots Manuva and Gorillaz on the B-side track &quot;Soldier Boy&quot;.\n    * In 2007 her song &quot;Dada&quot; was used in the film Virgin Territory.","torrent":{"xt":"urn:btih:a33a7ba6f73879113d1c82eb31d0a0b2e255c535","amp;dn":"Martina+Topley-Bird","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33a7ba6f73879113d1c82eb31d0a0b2e255c535","infoHashBuffer":{"type":"Buffer","data":[163,58,123,166,247,56,121,17,61,28,130,235,49,208,160,178,226,85,197,53]},"announce":[],"urlList":[]}}