{"title":"William Shakespeare: The Biography  -  Peter Ackroyd  (epub)","uid":6795766,"size":2545753,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a33ca02835870d7bdb2698b0cd1718bb4fa9abdc&amp;dn=William+Shakespeare%3A+The+Biography++-++Peter+Ackroyd++%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"neil1966hardy","files":2,"time":1320444361,"description":"At their best, Shakespearean biographers are like great jazz musicians, able to take a few notes of an old standard and spin them into dizzying riffs of conjecture. At their worst they reshuffle old wives' tales, piling supposition upon conjecture into a rickety house of cards. Peter Ackroyd can riff with the best, and he brings to the task of making the old facts fresh some themes and variations of his own that deserve a hearing. He is particularly good, in fact, on the question of sound: the way the language Shakespeare wrote, his players spoke and his audiences heard differed from the Shakespeare we hear and read today. Demonstrating the courage of his convictions, he does something daring for a book aimed at a general reader: he renders all of his citations from Shakespeare &quot;in the original.&quot; Thus a phrase from Timon of Athens is printed: &quot;Our Poesie is as a Goume which ouses&quot; (rather than &quot;gum which oozes&quot;), an effect that can defamiliarize, often in an illuminating way.An accomplished literary biographer, Ackroyd doesn't offer a new explanation of how the glover's son of provincial Stratford became the sophisticated poetic genius of London. Instead he gives us intelligent, often elegant, variations on the old ones. Like many of his fellow biographers he warns us that a particular &quot;tradition&quot; has no corroboration and then plays it out anyway. So with such recent, hotly debated questions as whether Shakespeare spent time in his youth in the household of subversive secret Catholics, Ackroyd spins it out for all it's worth.But the great strength of Ackroyd's book is the depth of his immersion in the culture of Shakespeare's age and the sense he gives of Shakespeare as a product of that extraordinary moment in time. His feeling for the role of the theater in Elizabethan London, &quot;a city where dramatic spectacles became the primary means of understanding reality,&quot; seems to come from an impressively wide reading of Shakespeare's dramatic and poetic contemporaries. His judgments about the work itself are sometimes ingenious, occasionally eccentric, as when he tells us, &quot;All the evidence suggests, too, that the speech, 'To be or not to be' is an interpolation,&quot; an unnecessary addition to Hamlet, possibly &quot;from another play altogether.&quot; While location of &quot;To be or not to be&quot; is different in an early quarto of Hamlet, to say &quot;All the evidence suggests&quot; interpolation is an overstatement. Still, immersion in Ackroyd's biography cumulatively gives one a feeling that one has lived for a brief time in Shakespeare's world. Ackroyd constructs a an intricate mosaic of Elizabethan context, which brings us closer to the shadowy figure, whose most renowned character, Hamlet, tells us: &quot;I have that within which passes show.&quot;\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a33ca02835870d7bdb2698b0cd1718bb4fa9abdc","amp;dn":"William+Shakespeare%3A+The+Biography++-++Peter+Ackroyd++%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33ca02835870d7bdb2698b0cd1718bb4fa9abdc","infoHashBuffer":{"type":"Buffer","data":[163,60,160,40,53,135,13,123,219,38,152,176,205,23,24,187,79,169,171,220]},"announce":[],"urlList":[]}}