{"title":"Limbo (MAC)","uid":9984496,"size":126685773,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:a3a85b047d39514f8bb38c1b81a4ea839cb001c7&amp;dn=Limbo+%28MAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"funkeyh","files":20,"time":1397772427,"description":"The primary character in Limbo is a nameless boy, lovingly called Puchomona, who awakens in the middle of a forest on the &quot;edge of hell&quot; (the game's title is taken from the Latin limbus, meaning &quot;edge&quot;). While seeking his missing sister, he encounters only a few human characters, who either attack him, run away, or are dead. At one point during his journey, he encounters a female character, who abruptly vanishes before he can reach her. The forest eventually gives way to a crumbling city environment. On completion of the final puzzle, the boy is thrown through a pane of glass and back into the forest. He walks a short distance until he again encounters a girl, who, upon his approach, stands up, startled. At this point, the game abruptly ends.\n\n\nThe player controls the boy throughout the game. As is typical of most two-dimensional platform games, the boy can run left or right, jump, climb onto short ledges or up and down ladders and ropes, and push or pull objects. Limbo is presented through dark, greyscale graphics and with minimalist ambient sounds, creating an eerie, haunting environment. The dark visuals also hide numerous environmental and physical hazards, such as deadly bear traps on the forest floor, or lethal monsters hiding in the shadows, such as a giant spider. Among the hazards are glowing worms, which attach themselves to the boy's head and force him to travel in only one direction unless bright light comes in contact with it, which changes the direction of the player until it is removed by static NPCs.\n\nThe game's second half features mechanical puzzles and traps using machinery, electromagnets, and gravity. Many of these traps are not apparent until triggered, often with deadly consequences. The player is able to restart at the last encountered checkpoint, with no limits placed on how many times this can occur. Some traps can be avoided and used later in the game; one bear trap is used to clamp onto an animal's carcass, hung from the end of a rope, tearing the carcass off the rope and allowing the branch and rope to retract upwards and allow the boy to climb onto a ledge otherwise out of reach. As the player will likely encounter numerous deaths before they solve each puzzle and complete the game, the developers call Limbo a &quot;trial and death&quot; game. Some deaths are animated with images of the boy's dismemberment or beheading, although an optional gore filter blacks out the screen instead of showing these deaths. Game achievements (optional in-game goals) include finding hidden insect eggs and completing the game with five or fewer deaths.","torrent":{"xt":"urn:btih:a3a85b047d39514f8bb38c1b81a4ea839cb001c7","amp;dn":"Limbo+%28MAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3a85b047d39514f8bb38c1b81a4ea839cb001c7","infoHashBuffer":{"type":"Buffer","data":[163,168,91,4,125,57,81,79,139,179,140,27,129,164,234,131,156,176,1,199]},"announce":[],"urlList":[]}}