{"title":"Sony Ericsson PC Suite 2.10.46.exe","uid":6781422,"size":45984520,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a49a428726c715bc5eeb9c5c94e80d67eae00e9e&amp;dn=Sony+Ericsson+PC+Suite+2.10.46.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Clemo56","files":1,"time":1319916804,"description":"This is the last version of the Sony Ericsson PC Suite that was compatible with their older phones, the ones that their website claim cannot use the PC suite. Compatible with windows Xp vista and 7 x86 (32bit) and windows Xp x64 but not vista or 7 x64.\n\n\n\nThe Sony Ericsson PC Suite consists of the following components:\n\n * Sony Ericsson File Manager\n Allows you to browse the contents of the mobile device file system and exchange multimedia files between the mobile device and the PC\n * Sony Ericsson Sync Station\n Program for synchronising your Microsoft Outlook calendar and contacts with the calendar and the phone book in your Sony Ericsson mobile phone\n * Sony Ericsson Mobile Networking Wizard\n Connect to the internet using your phone\n\n\nInstallation instructions\n\n * Download the file to a temporary folder on your PC.\n * It is recommended to uninstall any previously installed version of Sony Ericsson PC Suite\n * Execute the downloaded file.\n * If updating to a newer version of the Sony Ericsson PC Suite, a restart of the PC may be required after the new installation is completed.\n\n\n\nRequirements\n\n * Choose any of the following connections that are applicable for your phone: Cable, Infrared or Bluetooth connection.\n * Windows XP SP1/SP2 (Professional and Home), Vista (Business, Enterprise, Home basic, Home premium, Ultimate)\n\nThe general system reguirements are as required by the PC operating system or as a minimum:\n\n * PC with 500 megahertz or higher processor clock speed recommended\n * 256 megabytes (MB) of RAM or higher recommended\n * 1.5 gigabytes (GB) of available free disc hard space\n * Super VGA (800 x 600) or higher-resolution video adapter and monitor\n * keybord and Microsoft Mouse or compatible pointing device","torrent":{"xt":"urn:btih:a49a428726c715bc5eeb9c5c94e80d67eae00e9e","amp;dn":"Sony+Ericsson+PC+Suite+2.10.46.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a49a428726c715bc5eeb9c5c94e80d67eae00e9e","infoHashBuffer":{"type":"Buffer","data":[164,154,66,135,38,199,21,188,94,235,156,92,148,232,13,103,234,224,14,158]},"announce":[],"urlList":[]}}