{"title":"Beethoven Quartets Artemis","uid":10545382,"size":2435302050,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4a0d8056657827a45665a909d4a81a6d7ad57a0&amp;dn=Beethoven+Quartets+Artemis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"magneez","files":103,"time":1405279888,"description":"FLAC+CUE +scans\n\nrandom review:\n\n THE Beethoven Quartets for the next 100 years!, July 9, 2012\nBy Mr H Bolet\nThis review is from: Beethoven: Complete String Quartets (Audio CD)\nWhat an incredible, astounding achievement from The Artemis Quartet!\n\nThese virtuoso musicians (in technique AND feeling) have managed to make the whole bunch of these miraculous works by Beethoven sound like they were written today! From the earliest Opus 18 works to the final utterance - this set is in its entirety not only faultless, but revelatory to the highest degree. Beethoven has never sounded so witty, so soulful and so intelligent.\n\nI don't know much about these musicians but I'm willing to bet there must be a leader who lays down the law when making performance decisions - I could very well be wrong, but a consensus or committee seldom come up with such consistently brilliant results.\n\nPerfectly recorded - perfectly executed! The wit, drama, spirituality and passion all perfectly voiced.\nThe part-writing is also crystal clear - The playing of these great musicians has helped me discover inner voices in these great works that I've never noticed before - and I own and regularly listen to many complete sets of these works! The fast finales are as thrilling as roller-coaster rides - yet nothing is blurred - every note can be heard.\n\nBeethoven's not even my favorite composer - Haydn, Bach and Mozart outrank him to my ears - but The Artemis Quartet have reminded me how great 4th place can be and make a strong case for Beethoven's promotion.\n\nMy highest recommendation and my heartfelt thanks to these great artists for all the work they must have put in - and for all the sensitivity, experience and wisdom they obviously possess and for their empathy in channeling Beethoven's soul! To have recorded such a stupendous cycle of these works at a time when the classical music recording industry is in dire straits is a tribute not only to the musicians themselves, but to Beethoven, Art, their teachers, the sound-engineers, *Virgin, and even us, the humble listeners. THANK YOU! THANK YOU! THANK YOU ARTEMIS and BUY! BUY! BUY! Classical Music Lovers! (*Although I agree with the other reviewer - but one star!? What the....??)","torrent":{"xt":"urn:btih:a4a0d8056657827a45665a909d4a81a6d7ad57a0","amp;dn":"Beethoven+Quartets+Artemis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a0d8056657827a45665a909d4a81a6d7ad57a0","infoHashBuffer":{"type":"Buffer","data":[164,160,216,5,102,87,130,122,69,102,90,144,157,74,129,166,215,173,87,160]},"announce":[],"urlList":[]}}