{"title":"Tarquin Hall -- Vish Puri 4 -- Case of the Love Commandos","uid":9205731,"size":4655327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a536a35196bfc1fc702b6bf26c3a566f2122fff6&amp;dn=Tarquin+Hall+--+Vish+Puri+4+--+Case+of+the+Love+Commandos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"floader01","files":3,"time":1384648368,"description":"India's answer to Sherlock Holmes, Hercule Poirot and the Pink Panther, Delhi detective Vish Puri takes on missing lovers, the Indian caste system and sundry crimes in his fourth outing -- The Case of the Love Commandos.\n\nMany thanks to the original uploader.\n\nFrom amazon\n\nThe wonderful fourth outing for Delhi detective Vish Puri ('the Indian Hercule Poirot' Financial Times).\n\n'These books are little gems. They are beautifully written, amusing, and intensely readable.' - Alexander McCall Smith\n\nWhen Ram and Tulsi fall in love, the young woman's parents are dead set against the union. She's from a high-caste family; he's an Untouchable, from the lowest strata of Indian society. Young Tulsi's father locks her up and promises to hunt down the &quot;loverboy dog.&quot; Fortunately, India's Love Commandos, a group of volunteers dedicated to helping mixed-caste couples, come to the rescue. But just after they liberate Tulsi, Ram is mysteriously snatched from his hiding place.\n\nThe task of finding him falls to India's &quot;Most Private Investigator&quot;. Unfortunately, Vish Puri is not having a good month. He's failed to recover a cache of stolen jewels. His wallet has been stolen and he's having to rely on his infuriating Mummy-ji to get it back. And to top it all, his archrival, suave investigator Hari Kumar, is also trying to locate Ram. To reunite the star-crossed lovers, Puri and his team of operatives must infiltrate Ram's village and navigate the caste politics shaped by millennia-old prejudices.","torrent":{"xt":"urn:btih:a536a35196bfc1fc702b6bf26c3a566f2122fff6","amp;dn":"Tarquin+Hall+--+Vish+Puri+4+--+Case+of+the+Love+Commandos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a536a35196bfc1fc702b6bf26c3a566f2122fff6","infoHashBuffer":{"type":"Buffer","data":[165,54,163,81,150,191,193,252,112,43,107,242,108,58,86,111,33,34,255,246]},"announce":[],"urlList":[]}}