{"title":"Pelican - Australasia","uid":4865757,"size":87677817,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a58934af161ede303785ea9de89574e79cdb40fb&amp;dn=Pelican+-+Australasia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xxmonkeys","files":6,"time":1240506556,"description":"Although they already released a self-titled EP that was longer than many bands' regular albums, Australasia is the first official full-length by Chicago art-metal instrumentalists Pelican. It's maybe too easy to draw comparisons to Isis, especially since that band's Aaron Turner signed them and released this album on his label, but there are similarities: the layered guitars, the sense of dynamics, and the expansive, slowly unfolding songwriting approach. One major difference is that while Isis uses vocals, sparingly at least, Pelican don't use any vocals. Another difference is that their songs actually veer into major keys for extended periods. Still, there is plenty of darker minor-key riffing as well, the band splitting the difference between Sabbath-Melvins-Neurosis-style heaviness and more post-rock epic tendencies. This CD has six tracks, clocking in at around eight or nine minutes apiece, and apart from one acoustic guitar/piano interlude, there's not a huge deal of variety over the course of the album. They do basically one thing, but they do it well. Australasia will likely please most aficionados of Hydra Head's growing roster of &quot;instru-metal&quot; talents, as well as that subset of indie/post-rock listeners who are interested in metal/hardcore music but tend to dislike the vocals.\n(review from allmusic.com by William York)\n\n\n01 - Nightendday.mp3\n02 - Drought.mp3\n03 - Angel Tears.mp3\n04 - GW.mp3\n05 - [untitled].mp3\n06 - Australasia.mp3\n\n\nMP3 info: LAME 3.98, -V 2 --vbr-new\nRipped with EAC","torrent":{"xt":"urn:btih:a58934af161ede303785ea9de89574e79cdb40fb","amp;dn":"Pelican+-+Australasia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a58934af161ede303785ea9de89574e79cdb40fb","infoHashBuffer":{"type":"Buffer","data":[165,137,52,175,22,30,222,48,55,133,234,157,232,149,116,231,156,219,64,251]},"announce":[],"urlList":[]}}