{"title":"Saturday Night Fever (1977) 720p DivX HD (moviesbyrizzo)","uid":6562776,"size":4141292428,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a60e79e29c4895c68ae9ffd3b3f4fd0c2526a3b2&amp;dn=Saturday+Night+Fever+%281977%29+720p+DivX+HD+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1311557616,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0076666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0076666/&lt;/a&gt;\n\n1280 X 720p video at high 4000k bitrate, \nnice 256k dual audio tracks - select English (Primary) or German (Secondary)\n\nPlease check for available subtitles for the 1hr 59min version\n(same subtitles as for original source file - cinefile 720p version)\n\nIncluded with this posting are srt files (Utf8 format) for:\nBulgarian,Croatian,Danish,Dutch,French,Greek,Portuguese,Romanian,Russian,\nSerbian,Slovenian,Spanish, and Swedish. The included English template SRT file\ncould be potentially made use of to provide an instantly translated subtitles \nversion for any other language using the free google translate facility on the\nnet (at the time of this writing) or what you.\n\nSaturday Night Fever came out while I was in high school and it was\nquite a lot of great fun to be involved in disco weekends for those of our\nage group and the movie Grease came out around the same time generally - and\ndid wonders for the available music palette equally.\n\nI do not really like some of the language used in this movie, or the\nlevel of articulation or scripting sophistication in general.\n\nWhat I do like however, is the atmosphere that surrounded the disco era \nin some respect in that the music sounded more humanly vibrant and exciting and \nin fact inspirational for the spirit of enjoyment in a much more tasteful\nway than is the trash and garbage we have had from hollywood geeks and the music \nindustry since that is caught up with rap, sci-fi and punk music instead - as\nthat level degenenerates our communities into a what is abusively devastating to\nany idea that we still care for anything worthwhile at all - let alone the best\nof our spirits that still hover around having survived the onslaught of \nmulticulturalism and affirmative action as it were.\n\nI hope we could bring back disco - including a nicer dress code\nand regulation of language so that profanity isnt what they call \nso darned gratiutous anymore.\n\nNice music selections in a folder or two are included too in order\nto make this a souvenir offering keepsake.\n\nThe music from this movie is truly great in memories that come back\nfrom this time period.\n\n\nThe German audio second track takes up very little room in the file\nsize - its only 256k while the video is 4000k so it shouldn't distract\nyou if it isn't to you own interest or liking - its there for the folks\nwho would appreciate its inclusion as it was found in the source file\nand therefore made available here too in what is I submit, a reasonably \nenough measured way for all to enjoy that wish to equally.\n\nThe Italians and Germans/French.Dutch are particularly adept at being\nconcerned with true romantic appeal and so a better appreciaton for the\ndisco era comes naturally to both of these great families of peoples, I submit!\nWhy not re-spawn a disco industry everwhere such interested people are!\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\n\n  \n \n","torrent":{"xt":"urn:btih:a60e79e29c4895c68ae9ffd3b3f4fd0c2526a3b2","amp;dn":"Saturday+Night+Fever+%281977%29+720p+DivX+HD+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a60e79e29c4895c68ae9ffd3b3f4fd0c2526a3b2","infoHashBuffer":{"type":"Buffer","data":[166,14,121,226,156,72,149,198,138,233,255,211,179,244,253,12,37,38,163,178]},"announce":[],"urlList":[]}}