{"title":"GTA_IV_NODDVD_1.0.4.0_PATCH_SAVEGAMEBUGFIX_WIN7_VISTA","uid":5322227,"size":91656364,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a6394f7475c4f10366adb5798d6d0f6c76ad3da3&amp;dn=GTA_IV_NODDVD_1.0.4.0_PATCH_SAVEGAMEBUGFIX_WIN7_VISTA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JPntdl","files":1,"time":1264899182,"description":"PLEASE READ EVERYTHING BEFORE STARTING THIS PROCESS\n\nincludes- nodvd for patch 1.0.4.0/ no xlive sign in/ save game and method for &quot;clean getaway&quot; (bug)\n\n\neverything you need to know about installing, patching, cracking launcher, sacuROM, &amp; xlive.dll, save game bug fix for mission &quot;CLEAN GETAWAY&quot;, vista and window7 32-64 bit (apparently works on xp but the description for game file locations is not included  \n\nif you are starting from a fresh install and are about to play or dont mind playing the game again, dont install the patch and play through &quot;Clean Getaway&quot; mission, then install the patch &amp; crack BUT, you can use every thing in folder *3rd* EXCEPT FOR xlive.dll for nodvd crack. this will change your save game location. which just means you would have to follow all steps rather then just installing the cracks. you may also use this same method if you have already played paste &quot;clean getaway&quot; and installed patch 1.0.4.0 and need the nodvd crack\n\n\nthis is a complilation of others cracks and none of my own including razor911. GET READY TO BE VERY FU@%ING ANNOYED, THIS PROCESS SUCKS!!! It took me several hours to figure this out. the biggest problem is trying to get GTA to recognize the new savegame for clean getaway (bug) after patching with latest patches. not just 1.0.4.0\n\nive played most of the missions through without any problems after using the save game bug fix and the methods described below\n\n\n\ni decided to include the original file content from xliveless-0.99b1,rar which is located in a file in *3rd*. but there is no need to use it unless you need it and you know what your doing! \n\n\n\n- after installing GTA 4... andor are stuck at &quot;clean getaway&quot; mission\n\n- in file *1st* install xlive (unless you already have it, but you may need to update it with the one from GTA site...{included in file}), \n\n- in file *2nd* install GTA IV patch 1.0.4.0 (works great with vista and windows 7 32-64bit, i dont know about xp?\n\n- restart computer\n\n\nIF YOU HAVE ALREADY STARTED PLAYING AND ARE STUCK AT &quot;CLEAN GETAWAY&quot; CONTINUE TO NEXT STEP .... now,from a fresh install, i dont know if you need to start the game and make a save file to create it on your computer before you do the next step? if so, delete xlive.dll or just dont include it when you cut and paste. you must set up an account for xlive, so set up an offline one. this direction should have been included in any torrent download.\n\n\nif you have already started playing back up your savegame files (vista &amp; windows 7) in c:/users/*username*/appdata/local/rockstargames/GTAIVsavegames/*bunch of numbers*/  (you must enable hidden folders to view appdata... so google it)\n\n\nby placing the xlive.dll (in the next step) you will change the patch of your save games to documents/rockstargames/GTA IV/savegames, as you will be using your savegames offline from xlive... so yeah no social club!..i think. and no GTAIV or xlive splash screen\n\n\n- in flie *3rd* copy and paste everything into file path c:programs(x86)/rockstargames/grand theft auto IV/. you should now be able to start GTAIV but it is not needed at this time\n\n\nnow, the big problem is mission &quot;CLEAN GETAWAY&quot; {INCLUDED} . you never get a call from Roman to go clean your car. Luckily this is very early in the game but you must use a alternative save game to get you past this. it includes the weapons and money but not your cars or outfit.\n\n\n- cut and paste from file *4th* into your new save game location. documents/rockstargames/GTA IV/savegames ------ you can get any save game from here if you have problems in the future.  &lt;a href=&quot; http://www.gtaforums.com/index.php?showtopic=390264&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.gtaforums.com/index.php?showtopic=390264&lt;/a&gt;\n\n\n\nstart the game from your desktop shortcut and load file &quot;clean getaway&quot;. this will start you out with about the same money and weapons ready for mission &quot;Ivan the not so terrible&quot; i believe if you want to use any savegames you must relocate the save game file path which you just did\n\nthere are alot of steps here so if i have missed something let me know.\n\nGOOD LUCK, \n\nJPntdl\n","torrent":{"xt":"urn:btih:a6394f7475c4f10366adb5798d6d0f6c76ad3da3","amp;dn":"GTA_IV_NODDVD_1.0.4.0_PATCH_SAVEGAMEBUGFIX_WIN7_VISTA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6394f7475c4f10366adb5798d6d0f6c76ad3da3","infoHashBuffer":{"type":"Buffer","data":[166,57,79,116,117,196,241,3,102,173,181,121,141,109,15,108,118,173,61,163]},"announce":[],"urlList":[]}}