{"title":"The Shadows - The EP Collection (1988)","uid":8643541,"size":323706069,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a64a70d67269cba587937895525bb4b1e6602437&amp;dn=The+Shadows+-+The+EP+Collection+%281988%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":30,"time":1372932002,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nThe Shadows - The EP Collection (1988)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51DlVTF4kIL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51DlVTF4kIL.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nHas cover art only.\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Bruce Eder):\n\nThe Shadows are usually thought of as the quintessential British instrumental group and, along with the American band the Ventures and the Swedish group the Spotnicks, one of the most popular instrumental groups in the world. But that barely tells the story of their true significance in the history of British rock &amp; roll -- including the fact that they were the first home-grown British rock &amp; roll band to dominate the U.K. charts; or that they weren't originally an instrumental group, either. The band's roots go back to Chesthunt, Hertfordshire, in early 1958, when a young Indian-born singer/guitarist named Harry Webb joined with drummer Terry Smart and guitarist Norman Mitham to form a group that they ended up calling the Drifters -- at the time, none of the records by the American R&amp;B group of the same name, founded by Clyde McPhatter, had been released in England, so they had no inkling of the name's already being used.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/the-shadows-p5399/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/the-shadows-p5399/biography&lt;/a&gt;\n\nAll Music Album Review (by Dave Thompson):\n\nIn common with all the other giants of the early- to mid-'60s British hit parade, the Shadows complemented their regular LP and 45 release schedules with a string of EPs, many boasting material unavailable in other forms, at the same time as highlighting some of the group's most legendary exploits. Their appearance in the Thunderbirds Are Go movie, for example, spun off one of the most collectible of all band releases; soundtrack and theater appearances, too, were often immortalized on four-song 7&quot; records. The EP Collection, Volume One is, of course, the first of a series of CDs compiling the best of these releases -- a total of three eventually appeared. With one eye on the collectors market, it serves up all three tracks contributed to the Thunderbirds Are Go EP (Cliff Richard supplied the fourth), together with the Shadows #1 and Los Shadows EPs in their entirety. But it also takes one track apiece from Out of the Shadows, Dance on With the Shadows, Wonderful Land of the Shadows, Those Talented Shadows, On Stage and Screen, Themes From Aladdin &amp; His Wonderful Lamp, and The Shadows #3 EPs, two cuts from Dance With the Shadows #2 and two more from Cliff Richard's first EP -- live versions of &quot;Jet Black&quot; and &quot;Driftin'.&quot; Almost without exception, the material is strong, whether the band is twanging its trademark originals, or Shadow-ifying the broad range of covers to which they were prone. Familiar themes, of course, include the movie hits &quot;Shane&quot; and &quot;Giant&quot;; Leonard Bernstein's &quot;Tonight&quot;; and their own &quot;Finders Keepers,&quot; but everything here will strike some kind of chord. Indeed, if there is any single criticism to be leveled, it is that tracks appear with little or no regard to their original release. A chronological record would have been preferable, so, perhaps, would an opportunity to pick up only the songs which were exclusive to EPs, as opposed to mixing in those which did appear on other releases. The Shadows, after all, released more hit EPs than any other group -- 13 made the Top 10, four made number one, and one, Shadows to the Fore, topped the EP chart for a staggering 28 weeks. But these are minor points when compared to the riches in store, not only across this disc, but over the subsequent volumes as well.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/the-ep-collection-vol-1-r65761/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-ep-collection-vol-1-r65761/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B00000119H&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B00000119H&lt;/a&gt;\n\nTrack List:\n\n01. Perfidia\n02. 36-24-36\n03. All Day\n04. Grandfather's Clock\n05. Lady Penelope\n06. Zero 'X' Theme\n07. Thunderbirds Theme\n08. Finders Keepers - My Way - Fiesta - Paella\n09. Mustang\n10. Shane\n11. Giant\n12. Shotgun\n13. Las Tres Carabelas (Three Galleons)\n14. Adios Muchachos (Pablo The Dreamer)\n15. Valencia\n16. Granada\n17. Tonight\n18. Fandango\n19. Little Princess\n20. Gonzales\n21. Jet Black (Live)\n22. Driftin' (Live)\n","torrent":{"xt":"urn:btih:a64a70d67269cba587937895525bb4b1e6602437","amp;dn":"The+Shadows+-+The+EP+Collection+%281988%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a64a70d67269cba587937895525bb4b1e6602437","infoHashBuffer":{"type":"Buffer","data":[166,74,112,214,114,105,203,165,135,147,120,149,82,91,180,177,230,96,36,55]},"announce":[],"urlList":[]}}