{"title":"The Small Faces-album","uid":5388525,"size":2146209555,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a65877ed2e30350e1406326bcb2c09f168847b59&amp;dn=The+Small+Faces-album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"flitigalisa","files":518,"time":1266963202,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nSmall Faces were an English rock and roll band from East London, heavily influenced by American rhythm and blues. The group was founded in 1965 by members Steve Marriott, Ronnie Lane, Kenney Jones, and Jimmy Winston, although by 1966 Winston was replaced by Ian McLagan as the band's keyboardist.\nThe band is remembered as one of the most acclaimed and influential mod groups of the 1960s, With memorable hit songs such as &quot;Itchycoo Park&quot;, &quot;Lazy Sunday&quot;, &quot;All or Nothing&quot;, &quot;Tin Soldier&quot;, and their concept album Ogdens' Nut Gone Flake, they later evolved into one of the UK's most successful psychedelic acts before disbanding in 1969. After the Small Faces disbanded, three of the members were joined by Ronnie Wood as guitarist, and Rod Stewart as their lead vocalist, both from The Jeff Beck Group, and the new line-up was renamed the Faces.\nThey are also acknowledged as being one of the biggest original influences on the Britpop movement of the 1990s. \nDespite the fact they were together just four years in their original incarnation, the Small Faces' music output from the mid to late sixties remains among the most acclaimed British mod and psychedelic music of that era. (A revived version of the band also existed from 1975 to 1978.)\nIn 1996, Small Faces were belatedly awarded the Ivor Novello Outstanding Contribution to British Music &quot;Lifetime Achievement&quot; award. \n","torrent":{"xt":"urn:btih:a65877ed2e30350e1406326bcb2c09f168847b59","amp;dn":"The+Small+Faces-album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65877ed2e30350e1406326bcb2c09f168847b59","infoHashBuffer":{"type":"Buffer","data":[166,88,119,237,46,48,53,14,20,6,50,107,203,44,9,241,104,132,123,89]},"announce":[],"urlList":[]}}