{"title":"Bob Marley And The Wailers - Confrontation (1983) WMA320","uid":6166518,"size":118450797,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a6a414a7ca38e375be4b4ad1dab5db5fc3336d6f&amp;dn=Bob+Marley+And+The+Wailers+-+Confrontation+%281983%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297407636,"description":"Before his untimely death from Cancer in 1981, Bob Marley &amp; the Wailers had been working on their 11th album for Island Records, &quot;Confrontation&quot;. Unfortunately, Marley could not oversee much of this album's progress and the album would not be released until 1983, nearly two yeears after Marley's death. It contains a slew of stellar unreleased material from 1978-1981 and was intended to be his last in a trilogy of specifically African-themed albums, having been preceeded by 1979's &quot;Survival,&quot; and 1980's &quot;Uprising&quot;. \n\nEach song is a classic from the hopeful tunes like &quot;Chant Down Babylon,&quot; my personal favorite, &quot;Jump Niyabinghi,&quot; the joyous &quot;Blackman Redemption,&quot; and the heart-warming and bold &quot;Rastaman Live Up!,&quot; each carrying the message of the revival of Africa and the call for the righteous people of all cultures to keep their heads high. Equally spellbinding are the smooth, meditative tunes like the disco-impacted &quot;I Know,&quot; &quot;Give Thanks and Praises,&quot; &quot;Mix Up, Mix Up,&quot; &quot;Trench Town,&quot; and &quot;Stiff-Necked Fools&quot; (originally called &quot;Wisdom,&quot; and made with the Lee Perry years with the original Wailers, Bunny Wailer and Peter Tosh). Each song, with these ones in particular, show Marley in a calm, happy state, almost ready to depart the world as if his work has been completed. It's as if he tells his fans and those who so adore him not to worry in each song. The album, while perhaps not the most chart-topping, is the group's most utterly spiritual and in many ways, their most profound. \n\nThe album's track which stands above all the others, however, is the amazing, danceable, yet profound and protestful &quot;Buffalo Soldier,&quot; a true story about the mistreatment of Blacks by the Western World and their being forced to join the Union Army for the purpose of killing Native Americans. \n\nIn closing, &quot;Confrontation&quot; is simply amazing; so heartfelt and spellbinding. Each song is a smile from Marley in words saying &quot;Do not worry&quot;. Each song touches the heart and intrigues the mind. &quot;Confrontation&quot; will stay with you forever. This is truly the most profound, spiritual, and joyous reggae album ever made. \n\nby Spencer Pennington\n\nTRACKLIST:\n\n01 - Chant Down Babylon.wma                            \n02 - Buffalo Soldier.wma                               \n03 - Jump Nyabinghi.wma                                \n04 - Mix Up, Mix Up.wma                                \n05 - Give Thanks And Praises.wma                       \n06 - Blackman Redemption.wma                           \n07 - Trench Town.wma                                   \n08 - Stiff Necked Fools.wma                            \n09 - I Know.wma                                        \n10 - Rastaman Live Up!.wma                             \n11 - Buffalo Soldier (12' Mix).wma \n\nWMA 320Kbps 44100Hz STEREO\n\nMARCELODRGZ\t\t\n","torrent":{"xt":"urn:btih:a6a414a7ca38e375be4b4ad1dab5db5fc3336d6f","amp;dn":"Bob+Marley+And+The+Wailers+-+Confrontation+%281983%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6a414a7ca38e375be4b4ad1dab5db5fc3336d6f","infoHashBuffer":{"type":"Buffer","data":[166,164,20,167,202,56,227,117,190,75,74,209,218,181,219,95,195,51,109,111]},"announce":[],"urlList":[]}}