{"title":"Religion and Power: Divine Kingship in the Ancient...","uid":9693405,"size":5363992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a6fbd9324dd3ff4f6226c9df8150642cc21fc72f&amp;dn=Religion+and+Power%3A+Divine+Kingship+in+the+Ancient...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1393899793,"description":"\n...World and Beyond by Nicole Brisch (Editor)\n\nThis volume represents a collection of contributions presented during the Third Annual University of Chicago Oriental Institute Seminar Religion and Power: Divine Kingship in the Ancient World and Beyond, held at the Oriental Institute, February 23-24, 2007. The purpose of this conference was to examine more closely concepts of kingship in various regions of the world and in different time periods. The study of kingship goes back to the roots of fields such as anthropology and religious studies, as well as Assyriology and Near Eastern archaeology. More recently, several conferences have been held on kingship, drawing on cross-cultural comparisons.\n\nYet the question of the divinity of the king as god has never before been examined within the framework of a cross-cultural and multi-disciplinary conference. Some of the recent anthropological literature on kingship relegates this question of kings who deified themselves to the background or voices serious misgivings about the usefulness of the distinction between divine and sacred kings. \n\nSeveral contributors to this volume have pointed out the Western, Judeo-Christian background of our categories of the human and the divine. However, rather than abandoning the term divine kingship because of its loaded history it is more productive to examine the concept of divine kingship more closely from a new perspective in order to modify our understanding of this term and the phenomena associated with it.\n\nGenre: Non-Fiction, History","torrent":{"xt":"urn:btih:a6fbd9324dd3ff4f6226c9df8150642cc21fc72f","amp;dn":"Religion+and+Power%3A+Divine+Kingship+in+the+Ancient...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6fbd9324dd3ff4f6226c9df8150642cc21fc72f","infoHashBuffer":{"type":"Buffer","data":[166,251,217,50,77,211,255,79,98,38,201,223,129,80,100,44,194,31,199,47]},"announce":[],"urlList":[]}}