{"title":"Jethro Tull: Thick As A Brick","uid":4869340,"size":245144189,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a75a9a2566e1fabc7c29916c2ec2dea2a82e53aa&amp;dn=Jethro+Tull%3A+Thick+As+A+Brick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kxbx","files":1,"time":1240706248,"description":"Album Information:\n------------------\n\n&quot;Thick as a Brick (1972) is a concept album and song by the British rock band Jethro Tull. This was their first album featuring new drummer Barriemore Barlow. Its lyrics are built around a poem written by a fictitious boy, &quot;Gerald Bostock&quot; a.k.a. &quot;Little Milton&quot; (Ian Anderson himself). The album featured only one song, lasting over 43 minutes. To accommodate the album on LP vinyl and cassette, the seamless track was split on both sides of the record. It reached number one on the (U.S.) Billboard Pop Albums chart.\n\n\nThe epic is notable for its numerous time signature and tempo changes (not uncommon to the newly emerging progressive rock subgenre of rock), as well as a large number of themes throughout the piece, resembling a typical classical symphony in this regard, rather than a typical rock song. Released in 1972, Thick As A Brick was Tull's first true prog rock offering, four years after the release of their first album. Not only was the musical structure complex, but many instruments uncommon in rock music were added. Whereas in prior numbers the band were content with guitars, drums, piano, Hammond organ, and Ian Anderson's signature flute, Thick As A Brick additionally included harpsichord, xylophone, violin, lute, trumpet, and a string section.&quot;\n\n\n\nTrack Listing:\n--------------\n\n1. Thick As A Brick (43:50)\n\n[Ripped in FLAC as one track instead of the usual two parts found on the album.]\n\n\n\nBrought to you by KxBx. Enjoy (^_^)","torrent":{"xt":"urn:btih:a75a9a2566e1fabc7c29916c2ec2dea2a82e53aa","amp;dn":"Jethro+Tull%3A+Thick+As+A+Brick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a75a9a2566e1fabc7c29916c2ec2dea2a82e53aa","infoHashBuffer":{"type":"Buffer","data":[167,90,154,37,102,225,250,188,124,41,145,108,46,194,222,162,168,46,83,170]},"announce":[],"urlList":[]}}