{"title":"Putumayo Presents-Asian Groove By Ulysses56","uid":3511003,"size":68351108,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a7c6d93155a3c7c09ec36b37eec9daae008f7586&amp;dn=Putumayo+Presents-Asian+Groove+By+Ulysses56&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ulysses56","files":13,"time":1155205659,"description":"Putumayo Records Presents:\nAsian Groove 2002\nAsian traditions meet contemporary funk, electronica and soul for a musical masala that will spice up any celebration.  \nRip 192kbs\nCovers Included\n\nPutumayo continues its exploration of new directions in world music with Asian Groove, a collection of contemporary songs that owe as much to Bollywood (Indian) film music as they do classic funk, reggae, hip-hop, and electronica. Asian Groove features the latest flavors in bhangra, Indian pop, and cross-cultural fusions that blend East and West. The latest installment in Putumayo&amp;#039;s Groove Series follows in the footsteps of the critically acclaimed, best-selling Putumayo albums Arabic Groove and Latin Groove. \nAsian Groove features many of the leading figures in the new Asian styles, as well as number of recent discoveries and future stars. It focuses on music with roots in the traditions of India and Pakistan, which has been the inspiration for much of the cutting edge sounds heard in nightclubs and radio stations from London to Lahore. \nThe past few years have been one of the most exciting and fruitful periods in the development of popular music with Asian, especially South Asian influences. One of the epicenters of this revolution in Asian music is not Bombay, but Birmingham, a working-class city in western England that is home to a large South Asian population. Much like rural blues served as the foundation for Rock and Roll, the percussive party music of Punjabi harvest festivals were the underpinnings of a vibrant music movement called bhangra. Asian Groove features both established bhangra singer A.S. Kang, as well as innovative youngbloods Kam Dhillon and Bally Jagpal. \nMeanwhile, young innovators began mining the musical riches of Bollywood, the prolific Indian film industry, dropping hip- hop, techno, drum and bass and other contemporary beats under classic film melodies to create a new sound that connected the past with the present. In the case of artists like Bally Sagoo, whose reimaginations of Indian film songs made him a superstar, Bollywood supplied the inspiration and Birmingham provided the funk. \nWhile bhangra and Bollywood are mainstream pop genres, a number of more adventurous experimentalists also began to push the edges with cross- cultural fusions. London-based Nitin Sawhney is one of the leading figures of London&amp;#039;s so-called Asian Underground, a creative sub- culture of DJs, producers, and musicians who borrow freely from multitudes of sources. On Asian Groove, he joins forces with Mungal, a sitarist of Indian heritage from Trinidad. Singer Susheela Raman and her creative partner Sam Mills have been exploring new approaches that blend Western and Eastern styles while maintaining the integrity of each. Flautist Deepak Ram is keeping the Indo-jazz fusion tradition alive by finding the common ground between the improvisatory nature of both Indian classical music and jazz. Singer Yulduz Usmanova has successfully blended the traditional music of the Central Asian country of Uzbekistan with modern pop flavors. Meanwhile, non-Asian artists like Mo&amp;#039; Horizons and Karmix are using Asian instrumentation and melodies as spices in their own musical stews. \n\nTracklist:\nBally Japgal - Pheli War \nKarmix - Sabhyata \nMo&amp;#039; Horizons - Remember Tomorrow \nA.S. Kang - Terian Gulabi Buliyan \nBadar Ali Khan - Black Night \nMungal with Nitin Sahwney - Awake \nYulduz Usmanova - Kunglim Guli \nDeepak Ram - A Night in Lenasia \nSusheela Raman - Mamavatu \nBally Sagoo - Noorie \nKam Dhillon - Aankh Naal \n\n\nThis is one of the many PutumayoÂ´s records I have in mind to upload, so please help keep seeding after you downloaded.\nEnjoy It!\nUlysses56\n\n\nFor more info: http://www.putumayo.com/","torrent":{"xt":"urn:btih:a7c6d93155a3c7c09ec36b37eec9daae008f7586","amp;dn":"Putumayo+Presents-Asian+Groove+By+Ulysses56","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7c6d93155a3c7c09ec36b37eec9daae008f7586","infoHashBuffer":{"type":"Buffer","data":[167,198,217,49,85,163,199,192,158,195,107,55,238,201,218,174,0,143,117,134]},"announce":[],"urlList":[]}}