{"title":"The American Indians - Cycles of life (History Ebook).pdf","uid":11161334,"size":28236669,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7fb95a3375c100569cb68a68491924af0ba7408&amp;dn=The+American+Indians+-+Cycles+of+life+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STBGD","files":-1,"time":1412548632,"description":"Pdf / English / 1994 Time Life / 176 pages / 26.9 MB\n\nThis latest entry in the series is the best so far. Concentrating on growing up, rites of passage (especially puberty ceremonies and courtship and marriage), and spiritual beliefs and religion, the editors have created a kaleidoscopic yet focused tour through Indian America both past and present. Although the emphasis leans towards the peoples west of the Mississippi, examples from eastern tribes are provided as well. Tribes featured include the Apache, Blackfeet, Hopi, Inuit, Tlingit, Navajo, Sioux, Cheyenne, several Pueblos, and the Cherokee. The photographs, both in black and white and in color, are superb. Well chosen to enhance the text, they are fairly evenly divided between the old and the contemporary and go far toward conveying the continuity and vitality of traditional ways. The detailed captions provide additional information. There are also photo essays scattered throughout. Broadly based without being simplistic or misleading, the text offers examples from various nations to illustrate general points made by the editors, making this a better than average overview of Native American cultures. A fine bibliography is included, as well as a thorough index.-Lisa Mitten, University of Pittsburgh, PA","torrent":{"xt":"urn:btih:a7fb95a3375c100569cb68a68491924af0ba7408","amp;dn":"The+American+Indians+-+Cycles+of+life+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7fb95a3375c100569cb68a68491924af0ba7408","infoHashBuffer":{"type":"Buffer","data":[167,251,149,163,55,92,16,5,105,203,104,166,132,145,146,74,240,186,116,8]},"announce":[],"urlList":[]}}