{"title":"XIAOPAN 0.4.7.2.ISO","uid":9498872,"size":72491008,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:a98ff72759f783d3e57ae2fbb7c517b3cd054801&amp;dn=XIAOPAN+0.4.7.2.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"EnGuardian","files":1,"time":1390169903,"description":"Xiaopan OS is an easy to use security and penetration testing with a collection of wireless security and forensics tools. It includes a number of advanced tools for network administrators, security professionals and home users to test the strength of their wireless networks and eliminate any vulnerabilities.\n\n\nAbout\n\nXiaopan OS is an easy to use software package for beginners and experts that includes a number of advanced tools to penetrate wireless networks. Based on the Tiny Core Linux (TCL) operating system (OS), it has a slick graphical user interface (GUI) requiring no need for typing Linux commands. Xiaopan OS is Windows, Mac and Linux compatible and users can simply install and boot this ~70mb OS through a USB pen drive or in a virtual machine (VM) environment.\n\n\nIntroduction\n\nXiaopan OS was created by Djyuzi from anywlan.com in late 2011 in the absence of another popular TCL build called Beini. Djyuzi realised that Beini was currently outdated and no longer being developed and decided to fill the gap. Our aim is further develop Xiaopan and provide excellent support to users worldwide, particularly to those who use the English language.\n\n\nAlternatives\n\nThere are a number of professional operating systems that have been developed specifically for pentesting and security auditing which all are based on Linux. These include Kali, BackTrack and WiFiway. What sets Xiaopan OS apart from its competitors is that it Xiaopan OS is simple to use and just works, depending on a number of variables and providing you have all the right hardware of course.\n\n\nTools\n\nXiaopan OS includes a number of tools to hack WiFi Protected Setup (WPS), WiFI Protected Access (WPA) and Wireless Equivalent Privacy (WEP) encrypted networks:\n\n-Reaver: newly developed application with the ability to brute force crack WPS (WPA / WPA2) pins.\n-Inflator: this is the GUI version of command line reaver.\n-Aircrack-ng: the major backbone of many other Xiaopan tools including FeedingBottle (FB) and Minidwep with the ability to attack WPA networks through a dictionary attack and WEP networks through collecting and injecting packets.\n-FeedingBottle: so easy a baby could use it! FB is essentially the Aircrack-ng GUI and was created by Beini.\n-Minidwep: is similar to FB but has a better and similar GUI that is even easier to use than FB. The added advantage of Minidwep is that you can also run Reaver and Inflator from here as well.\n-Xfe: this is a simple file manager similar to say windows explorer.\n\n &lt;a href=&quot;\nhttp://s23.postimg.org/qfhbnkx6j/image.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s23.postimg.org/qfhbnkx6j/image.png&lt;/a&gt; &lt;a href=&quot;\nhttp://s23.postimg.org/bv08sr27v/image.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s23.postimg.org/bv08sr27v/image.png&lt;/a&gt; &lt;a href=&quot;\nhttp://s10.postimg.org/ac7yytn7t/image.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s10.postimg.org/ac7yytn7t/image.png&lt;/a&gt; &lt;a href=&quot;\nhttp://s27.postimg.org/vezibia8z/image.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s27.postimg.org/vezibia8z/image.png&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a98ff72759f783d3e57ae2fbb7c517b3cd054801","amp;dn":"XIAOPAN+0.4.7.2.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a98ff72759f783d3e57ae2fbb7c517b3cd054801","infoHashBuffer":{"type":"Buffer","data":[169,143,247,39,89,247,131,211,229,122,226,251,183,197,23,179,205,5,72,1]},"announce":[],"urlList":[]}}