{"title":"Battiato - Sulle corde di Aries [Lossy Mp3 320kbps] [Tntvillage]","uid":5239261,"size":80178768,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a99ba445155ae58298a9e0d5198371dc27c64874&amp;dn=Battiato+-+Sulle+corde+di+Aries+%5BLossy+Mp3+320kbps%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"darayava","files":4,"time":1261676949,"description":"Battiato - Sulle corde di Aries [Lossy Mp3 320kbps] [Tntvillage]\n\nFRANCO BATTIATO\n\nSULLE CORDE DI ARIES\n\n\nContinuando le sperimentazioni dei due dischi precedenti, Battiato pubblica quello che forse ÃƒÂ¨ il disco piÃƒÂ¹ riuscito di questo periodo, e da cui ha recuperato ben due canzoni (Sequenze e frequenze e Aria di rivoluzione) nel suo album dal vivo Giubbe rosse.\nIl titolo dell'album fa riferimento esplicito al segno zodiacale dell'Ariete, sotto cui ÃƒÂ¨ nato il cantautore siciliano.\nLa canzone iniziale, Sequenze e frequenze, ÃƒÂ¨ un lungo brano che occupa tutto il lato uno, e nel testo si possono rilevare i richiami nostalgici al passato e all'adolescenza che ritorneranno spesso nel Battiato del decennio successivo (basti pensare a canzoni come Stranizza d'amuri o Zone depresse), in versi come La maestra in estate ci dava ripetizioni nel suo cortile, / io stavo sempre seduto sopra un muretto a guardare il mare, / e ogni tanto passava una nave.\nAria di rivoluzione ÃƒÂ¨ stata reinterpretata dai CSI nell'album dal vivo unplugged In quiete (ma non incluso nel cd).\nTra i musicisti che suonano nell'album oltre ad alcuni giÃƒÂ  presenti nei dischi precedenti, possiamo ricordare il soprano Rosella Conz (nella copertina il nome ÃƒÂ¨ riportato erroneamente come Rossella), che ÃƒÂ¨ stata anche musicista ed autrice di testi per Al Bano (suo ÃƒÂ¨ il testo della celebre Pensieri P 33, lato B di Nel sole), la cantante degli Analogy, Jutta Nienhaus e la violoncellista Marti Jane Robertson (nella copertina ÃƒÂ¨ perÃƒÂ² citata come Jane Robertson), componente della Organic Music di Don Cherry.\nL'album fu registrato negli studi Regson di Milano; i tecnici del suono sono Luciano Marioni e Gianluigi Pezzera, mentre le fotografie all'interno della copertina sono di Ghigo Agosti: in una di esse Battiato ÃƒÂ¨ insieme a Stomu Yamastha, con cui fece un tour dopo l'uscita del disco Pollution.\nNel 1992 il disco ÃƒÂ¨ stato ristampato in formato CD con etichetta Artis e mantenimento della grafica originale del vinile; una successiva ristampa del 1998 ad opera della BMG ha invece mantenuto solo la copertina esterna ma non l'interno.\n\n\nAnno: 1998\nGenere: Pop\nEtichetta: BMG Ricordi\n\nFranco Battiato: voce solista, chitarra, VCS3, piano preparato\nGianni Mocchetti: chitarra, mandola, voce\nGianfranco D'Adda: percussioni\nGianni Bedori: sax tenore in Aries\nMarti Jane Robertson: violoncello in Aria di rivoluzione\nDaniele Cavallanti: clarino, sax soprano in Aria di rivoluzione\nGaetano Galli: oboe in Da oriente a occidente\nRosella Conz: soprano in Sequenze e frequenze\nJutta Nienhaus: soprano in Sequenze e frequenze e Da oriente a occidente; voce recitante in tedesco in Aria di rivoluzione\nOrchestra di fiati del Conservatorio di Milano\n\n\n1. Sequenze e frequenze - 16:22\n2. Aries - 5:27\n3. Aria di rivoluzione - 5:02\n4. Da oriente ad occidente - 6:33\n\n\nAVI File Details\n========================================\nName..........: 01 Sequenze e frequenze.mp3\nFilesize......: 37Mb\n\nName..........: 02 Aries.mp3\nFilesize......: 12.4Mb\n\nName..........: 03 Aria di rivoluzione.mp3\nFilesize......: 11.5Mb\n\nName..........: 04 Da oriente ad occidente.mp3\nFilesize......: 14.1Mb\n\nAudio Bitrate.: 320Kbps\nAudio Freq....: 44KHz\nAudio Channels: Stereo \n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:a99ba445155ae58298a9e0d5198371dc27c64874","amp;dn":"Battiato+-+Sulle+corde+di+Aries+%5BLossy+Mp3+320kbps%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a99ba445155ae58298a9e0d5198371dc27c64874","infoHashBuffer":{"type":"Buffer","data":[169,155,164,69,21,90,229,130,152,169,224,213,25,131,113,220,39,198,72,116]},"announce":[],"urlList":[]}}