{"title":"Lewis Black - I'm Dreaming Of A Black Christmas [96] Unabridged","uid":7794167,"size":144078800,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a9b5f87a992c1d8ed3899ff8fe483f9c7ea72f6f&amp;dn=Lewis+Black+-+I%27m+Dreaming+Of+A+Black+Christmas+%5B96%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1352098858,"description":"Lewis Black - I'm Dreaming of a Black Christmas\n\nOverview\nFrom Lewis Black, the uproarious and perpetually apoplectic New York Times-bestselling author and Daily Show regular, comes a ferociously funny book about his least favorite holiday, Christmas.\n\nFor most people, Christmas is a time of peace and goodwill. But most people are not Lewis Black. Like Dickens's most famous curmudgeon, Black says Humbug! to carols, holiday dinners, Christmas trees, decked halls, and boughs of holly. In I'm Dreaming of a Black Christmas, he dares to celebrate the holiday season the only way he knows how: by letting loose on all things Yule.\n\nFrom Thanksgiving, when the holiday really begins, through Christmas Eve, when Black takes a moment to determine who in his life has been naughty (nearly everyone), to the saga of his annual visits to friends and their families every Christmas Day, the comedian reveals his most harrowing and hilarious holiday moments, not only inspiring laughter but also bringing into focus the true reason we gather together at this time of year.\n\nAll new, and sure to delight fans both new and old, I'm Dreaming of a Black Christmas is an instant holiday classic: funny, razor- sharp, the insightful, and quintessential Lewis Black.\n\nPublishers Weekly\nVituperative standup comedian Black (Me of Little Faith) delivers a caustic Christmas diatribe. Warning readers to ignore the book if they have a deep attachment to Christmastime, he notes, &quot;This book contains, like the celebration of Christmas, only 2 percent religion. Think of it as the yuletide equivalent of low-fat milk.&quot; After recalling how he argued with the editor who urged him to write a Christmas book, Black delivers a full-scale Scrooge-styled screed. With chapters such as &quot;Meditations of a Jewish Santa,&quot; &quot;The Hooker at Rockefeller Center,&quot; and &quot;The Carol from Hell,&quot; he rips into such seasonal traditions as Christmas cards, dinners, toys, advertising (&quot;a primal scream of sales&quot;), shopping (&quot;Why don't you folks wait until the 26th of December when things are the cheapest?&quot;), trees (&quot;something magical about a Christmas tree all dazzled up in lights... almost as breathtaking as a hooker gone wild in spangles&quot;), carols (&quot;A shower is a place for singing, and on Christmas, it's where you should be caroling&quot;), and gifts: &quot;At Chanukah we get nothing. We don't even get stockings.&quot; With digressions on the human comedy and his personal life, Black spews forth much invective, but successfully exposes societal truths with riotous ripostes. ","torrent":{"xt":"urn:btih:a9b5f87a992c1d8ed3899ff8fe483f9c7ea72f6f","amp;dn":"Lewis+Black+-+I%27m+Dreaming+Of+A+Black+Christmas+%5B96%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9b5f87a992c1d8ed3899ff8fe483f9c7ea72f6f","infoHashBuffer":{"type":"Buffer","data":[169,181,248,122,153,44,29,142,211,137,159,248,254,72,63,156,126,167,47,111]},"announce":[],"urlList":[]}}