{"title":"Walking Through History With Tony Robinson  (2013 - Complete)","uid":8621049,"size":1655875670,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aa04c7d5d1dd2ecaffc69518eab13c65eaf86794&amp;dn=Walking+Through+History+With+Tony+Robinson++%282013+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Robin1966","files":11,"time":1372372636,"description":"HISTORY DOCUMENTARY: Walking Through History\nOn: Channel 4    \n\nThe Birth of Industry. Episode 1\nAppealing to history buffs and ramblers alike, in this new four-part series Tony Robinson embarks on spectacular walks through some of Britain's most historic landscapes in search of the richest stories from Britain's past. In each programme, Tony follows a bespoke route that allows him to explore on foot both the history of a particularly colourful historical period or event, and the spectacular landscape in which those events unfolded. The walks are proper expeditions, with each one taking Tony a week.\n\nFrontline Dorset. Episode 2.\nTony Robinson takes a series of walks through some of Britain's most historic and spectacular landscapes. Tony's walk in this episode takes him back to 1940 when - extraordinarily - the sleepy county of Dorset became the frontline in the war against Hitler. His five-day, 60-mile walk along the Jurassic coast reveals the county's hidden World War II story. Starting by the defences on Chesil Beach, Tony's journey encompasses stunning scenery and amazing acts of ingenuity and bravery as he heads east to finish in Swanage and Studland Bay. He uncovers the strange part a world-famous swannery played in developing a secret weapon. He hears of the bravery of the man who won the Victoria Cross serving in Portland Harbour when it became one of the first places in Britain to be bombed by the Germans. He reveals the role Dorset had to play in protecting Britain from invasion, and in an emotional climax he meets one of the veterans who survived after landing on Omaha Beach on D Day.\n\n\nThe Tudor Way. Episode 3.\nIn this episode, Tony Robinson sets off on a 45-mile hike through the beautiful countryside of the Weald in Kent and the Downs of east Sussex to discover the area's rich and surprising Tudor heritage. At the impressively preserved Penshurst Place, author Philippa Gregory helps Tony relish the fate of the Grand Duke of Buckingham at the hands of the young Henry VIII.\n\n\nBattle in the Glens. Episode 4.\nTony Robinson embarks on spectacular walks through some of Britain's most historic landscapes in search of the richest stories from the country's past. In the final episode of the series Tony takes on a tough four-day trek through the Kintail region of the west Scottish Highlands to discover the story of the Jacobite uprisings of the early 1700s. On three occasions, Highland armies, assisted by the French and the Spanish, attempted to overthrow the King and put a Stuart back on the throne. What made the Highlands such a breeding ground for revolution and how did the unique character of this landscape shape the character of the Highlanders?\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:aa04c7d5d1dd2ecaffc69518eab13c65eaf86794","amp;dn":"Walking+Through+History+With+Tony+Robinson++%282013+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa04c7d5d1dd2ecaffc69518eab13c65eaf86794","infoHashBuffer":{"type":"Buffer","data":[170,4,199,213,209,221,46,202,255,198,149,24,234,177,60,101,234,248,103,148]},"announce":[],"urlList":[]}}