{"title":"Red Ace Squadron Pro PC GAME","uid":4495607,"size":16853722,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aa64941bdb2a2e6e8371b8ce3f405dc83f800cd7&amp;dn=Red+Ace+Squadron+Pro+PC+GAME&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hound1234","files":2,"time":1226180316,"description":"Description\nFly a World War I bi-plane, and experience aerial combat in its purest form. No jets, no computers, no heat-seeking missiles - just the wind in your struts and blazing machine-guns! \n\nRed Ace Squadron is the follow-up to the best-selling Master Of The Skies: The Red Ace. You won&amp;#039;t need to learn complex key commands or read a huge manual to play - your plane is controlled solely by the mouse and a few other keys. \n\nPlay for either the Allied or Central Powers forces across 14 new single-player missions, or take on human opponents in the all-new Multiplayer mode. Whether you choose to play online or alone, Red Ace Squadron is the ultimate propellor-driven dogfighting experience. \n\n\nFull version features\nPlay two new single-player campaigns, or multiplayer via LAN or Internet\nMultiplayer allows up to 8 pilots to compete simultaneously\nFollow Allied or Central Powers campaigns in single player, with 14 new missions\nNew power-up stations allow players to re-arm and repair\nPilot two new twin-engined bombers - the Handley Page and the Gotha G IV\nComplete campaigns to access special super-hard Master Mode, and a secret mission!------------------------SHARE TORRENT AND POST COMMENT IF YOU ENJOY THIS RELEASE","torrent":{"xt":"urn:btih:aa64941bdb2a2e6e8371b8ce3f405dc83f800cd7","amp;dn":"Red+Ace+Squadron+Pro+PC+GAME","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa64941bdb2a2e6e8371b8ce3f405dc83f800cd7","infoHashBuffer":{"type":"Buffer","data":[170,100,148,27,219,42,46,110,131,113,184,206,63,64,93,200,63,128,12,215]},"announce":[],"urlList":[]}}