{"title":"Holy Bible NASB - New American Standard Bible (Unabridged)","uid":7229685,"size":1086338469,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:aa6c23ffef8241e99b45afe1c493f6fa8a255189&amp;dn=Holy+Bible+NASB+-+New+American+Standard+Bible+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"WentloogWhix","files":1247,"time":1335794783,"description":"The New American Standard Bible is widely regarded as the most literally translated of 20th-century English Bible translations.According to the NASB's preface, the translators had a &quot;Fourfold Aim&quot; in this work: \n\n1. These publications shall be true to the original Hebrew,Aramaic, and Greek. \n\n2. They shall be grammatically correct. \n\n3. They shall be understandable. \n\n4. They shall give the Lord Jesus Christ His proper place, the place which the Word gives Him; therefore, no work will ever be personalized.\n\nThe NASB is a revision of the American Standard Version of 1901. This translation was an alternative to the Revised Standard Version (19461952/1971), itself a revision of the ASV, but considered by many to be theologically liberal.\n\nThe Hebrew text used for this translation was the third edition of Rudolf Kittel's Biblia Hebraica, as well as the Dead Sea Scrolls. The Biblia Hebraica Stuttgartensia was consulted for the 1995 revision. For Greek, Eberhard Nestle's Novum Testamentum Graece was used; the 23rd edition in the 1971 original, and the 26th in the 1995 revision. \n\nSeeing the need for a literal, modern translation of the English Bible, the translators sought to produce a contemporary English Bible while maintaining a word-for-word translation style. In cases where word-for-word literalness was determined to be unacceptable for modern readers, changes were made in the direction of more current idioms. In such instances, the more literal renderings were indicated in footnotes. \n\nThe greatest perceived strength of the NASB is its reliability and fidelity to the original languages, which, along with other literal translations, also allows for ambiguities in the text's meaning. Its corresponding weakness is that its readability and literary style sometimes prove confusing to the average reader. \n\n\nThis audio version is read by Stephen Johnson. Unabridged 32kbps MP3 files, each chapter in a separate file, each book in a separate folder. ","torrent":{"xt":"urn:btih:aa6c23ffef8241e99b45afe1c493f6fa8a255189","amp;dn":"Holy+Bible+NASB+-+New+American+Standard+Bible+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa6c23ffef8241e99b45afe1c493f6fa8a255189","infoHashBuffer":{"type":"Buffer","data":[170,108,35,255,239,130,65,233,155,69,175,225,196,147,246,250,138,37,81,137]},"announce":[],"urlList":[]}}