{"title":"WINDOWS  XP PROFESSIONAL sp1 BY xBETAS on ISO","uid":4373718,"size":718256128,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aa6f163d3ce943f2635823aa4d8ad3f85a2ca7bc&amp;dn=WINDOWS++XP+PROFESSIONAL+sp1+BY+xBETAS+on+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fuwad84","files":1,"time":1220298255,"description":"[IMPORTANT UPDATE]\n\nDONT EVEN BOTHER WITH MY VERSION. I HAVE NOW FOUND SOMETHING MUCH BETTER AND IS NOW THE MAIN VERSION OF WINDOWS THAT I USE.\n\nI USE EXPERIENCE'S TINY XP REV 09 - ITS SP3 SLIPPED, PASSES WGA AND CAN FUCKING DO EVERYTHING THAT YOU COULD EVER WANT WINDOWS TO DO - IN MY OPINION ITS THE BEST VERSION ALL HANDS DOWN!\n\nTHE DISK GIVES YOU MANY DIFFERENT VERSION OF WINDOWS, ONLY INSTALL 1 or 2 NOTHING ELSE! &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4206516/TinyXP_Rev09_-_eXPerience&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4206516/TinyXP_Rev09_-_eXPerience&lt;/a&gt;\n\n\n[TRY HIS FIRST]\n\n\n\n\nScroll down to DESCRIPTION to read about this keyless version of WINDOWS XP PRO\n\n[UPDATE 9/25/08]\nOnce installed open Notepad and copy and paste the following text\n\n\nWindows Registry Editor Version 5.00\n\n[HKEY_LOCAL_MACHINESOFTWAREMicrosoftWindows NTCurrentVersionWPAEvents]\n&quot;OOBETimer&quot;=hex:ff,d5,71,d6,8b,6a,8d,6f,d5,33,93,fd\n&quot;LastWPAEventLogged&quot;=hex:d5,07,05,00,06,00,07,00,0f,00,38,00,24,00,fd,02\n\n[HKEY_LOCAL_MACHINESOFTWAREMicrosoftWindows NTCurrentVersion]\n&quot;CurrentBuild&quot;=&quot;1.511.1 () (Obsolete data - do not use)&quot;\n&quot;InstallDate&quot;=dword:427cdd95\n&quot;ProductId&quot;=&quot;69831-640-1780577-45389&quot;\n&quot;DigitalProductId&quot;=hex:a4,00,00,00,03,00,00,00,36,39,38,33,31,2d,36,34,30,2d,\n31,37,38,30,35,37,37,2d,34,35,33,38,39,00,5a,00,00,00,41,32,32,2d,30,30,30,\n30,31,00,00,00,00,00,00,00,00,0d,04,89,b2,15,1b,c4,ee,62,4f,e6,64,6f,01,00,\n00,00,00,00,27,ed,85,43,a2,20,01,00,00,00,00,00,00,00,00,00,00,00,00,00,00,\n00,00,00,00,00,00,00,00,00,00,00,31,34,35,30,34,00,00,00,00,00,00,00,ce,0e,\n00,00,12,42,15,a0,00,08,00,00,87,01,00,00,00,00,00,00,00,00,00,00,00,00,00,\n00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,00,94,a2,b3,ac\n&quot;LicenseInfo&quot;=hex:9e,bf,09,d0,3a,76,a5,27,bb,f2,da,88,58,ce,58,e9,05,6b,0b,82,\nc3,74,ab,42,0d,fb,ee,c3,ea,57,d0,9d,67,a5,3d,6e,42,0d,60,c0,1a,70,24,46,16,\n0a,0a,ce,0d,b8,27,4a,46,53,f3,17\n\n\nand save t yis as regkey.reg close it than double click on it select merge and ur done :)your version of Windows WILL NOW PASS WGA!\n\n\nThank you  D3LinQuENT  for this update!\n\n[UPDATE 9/7/08]\nBecause I realize that a very few of you(about 3 or 4 outta 200+) are having trouble burning this file to an ISO ive uploaded NERO6 Which Ive found has very few issues with burning bootable ISO's where as some others might. Just download, install and than before opening click the reg - THATS IT!\n[end of update 9/7/08]\n\n[IF YOU DOWNLOAD THE WHOLE THING AND LIKE IT THAN PLEASE SEED, LEAVING YOUR P2P PROGRAM OPEN IS NOT ROCKET SCIENCE IT'S JUST THE COURTEOUS THING TO DO.]\n\n\n===============================DESCRIPTION========================================\n\n\nWINDOWS XP PROFESSIONAL sp 1 by xBETAS\n\nBootable ISO, just BURN, INSERT, INSTALL\n\nNo Key Needed, installs automatically\n\nIncludes Norton 2003, Nero 6 and Winrar 3.something er other\n\nSame version I've personally used over and over again on dozens of computers. \n\nI LOVE IT! and cannot recommend it enough -which is why I'm sharing it with everyone\n\n\nGO to softwarepatch.com to upgrade this version all the way to the most recent service pack along with security updates - the site its self is specifically meant for people who have a version of Windows that they may not have actually bought.\n\n[update: 9/4/08]\nOR BETTER YET IF YOU WANT TO MAKE IT LEGIT AND AUTOMATICALLY DOWNLOAD UPDATES STRAIGHT FROM MICROSOFT - \n\nDownload Roofies torrent LINK:***http://thepiratebay.se/torrent/4043899*** \nRelax its also on PIRATE BAY DOWNLOAD THE FILE AND JUST DO WHAT THE INSTRUCTIONS TELL YOU TO! THANK YOU VERY MUCH ROOFIE - THERE NOT JUST FOR DATES ANYMORE!\nThe program itself requires that you have .NET Framework 2.0+ AND SERVICE PACK 3 INSTALLED BEFORE USING THIS.  fear not here's a link directly from softwarepatch.com to both\n.NET 3.5 FRAME WORK\n LINK:***http://www.softwarepatch.com/windows/netframework.html***\n\nSERVICE PACK 3\nLINK***http://www.softwarepatch.com/windows/windows-xp-service-pack-3.html***\n\nYOU MUST INSTALL BOTH SP3 AND .NET BEFORE USING THIS CRACK\n\n[end of update:9/4/08]\n\nIf your just looking for an incredibly stable version that will install all by itself - here ya go! \n\nIt should work with all desk and lap tops - please seed, share and comment. \n\n\nmagnet:?xt=urn:btih:VJXRMPJ45FB7EY2YEOVE3CWT7BNCZJ54\n\nSince this seed is very new, please bare with me if it takes a little time to download, I swear to The Flying Spaghetti Monster(Praise and Sauce be Upon Him) that the wait is well worth it\n\nAnd again for fasted download I encourage all those who get this to please seed, all you have to do is keep your P2P file share software open after downloading this. \n\nI've used this CD over and over again since it was first given to me by a good friend back in June of 2003 - it's an excellent install and an incredibly stable keyless Windows XP OS\n\nAlso yes it IS the PROFESSIONAL version - I forgot to mention that - I still honestly can't tell the difference besides one inflates my ego a little more.\n\n[AGAIN THERE SHOULDN'T BE ONLY 16 SEEDS THE NEXT DAY WHEN THERE'S 60+ PEERS THAT HAVE 99.8% OF THE PROGRAM ALREADY DOWNLOADED - YOU KNOW WHO YOU ARE. I WAS NICE ENOUGH TO SHARE THIS WITH THE WORLD PLEASE DO THE SAME IF YOUR ENJOYING THIS SOFTWARE AS MUCH AS I AM, THANK YOU.]  \n\nAnd Thank you so much to those of you who are actually sharing this program. If it's not to much trouble it would really mean so much to me if you could comment and share your thoughts with everyone on this version of Windows XP Pro.\n\nUPDATE!!!!?!!!!\n\nI would also like to include some recommended BUT NOT REQUIRED programs that you might want to, BUT DON'T HAVE TO, get.\n\nMicrosoft Office 2003 Lite(Word, Excel, Powerpoint, Outlook) Pretty much the office programs that you ACTUALLY use without the ones that you don't - very simple and small installer - great for the college student who needs his/her/it's shit up and running right away \nLINK: ***http://thepiratebay.se/torrent/3771346/***\n\nCCleaner - is a freeware system optimization, privacy and cleaning tool. It removes unused files from your system - allowing Windows to run faster and freeing up valuable hard disk space. LINK: ***ccleaner.com***\n\nESET - Super non intrusive automatic All in one Firewall/Antispyware/Antispam/AntiAdware/AntiMalware/AntiVirus. Its what I use. Need I say more? LINK: ***http://thepiratebay.se/torrent/4257661/**\n\nWinRAR Corporate - Damn near the same thing thats already included with this version of windows cept that this one opens 7zip and all sorts of fuct up file formats ive never even heard of. It's tiny as hell and installs super easy - go for it! LINK: ***http://thepiratebay.se/torrent/4013597***\n\nRemoveWGA Download - Did you accidentally download and install the windows WGA bullshit? Thats ok, use this program to remove all traces of that horrible little virus YEAH IT IS A FUCKING VIRUS GET RID OF IT! ANYTHING THAT YOU INSTALL BY BEING DECEIVED AND THAN POPS UP SHIT ALL THE TIME AND YOU CANT REMOVE IT NO MATTER WHAT YOU DO - Well if thats not a virus than I dont know what is LINK:***http://www.softpedia.com/get/Tweak/Uninstallers/RemoveWGA.shtml***  And no its not a trogen...or is it!?!? Its really not relax \n\n\n*******HOLY SHIT!!! HERES THE MOTHER OF ALL HACKS*********\n\nMAKE YOUR PIRATED VERSION OF WINDOWS LEGIT!!!!\nLINK:***http://thepiratebay.se/torrent/4043899/\nI ADDED OPTIONAL UPDATES FROM THE MICROSOFT UPDATE SITE FOR THE FIRST TIME IN 6 YEARS!!!!!!!! I JUST USED THIS AS OF SEPT 4th 2008 at 3am GET IT NOW!\n\nI'm sure there's a few other things, But honestly 90% of the shit you'll ever use(unless your an engineer or designer) should already come with this OS.\n\n\n","torrent":{"xt":"urn:btih:aa6f163d3ce943f2635823aa4d8ad3f85a2ca7bc","amp;dn":"WINDOWS++XP+PROFESSIONAL+sp1+BY+xBETAS+on+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa6f163d3ce943f2635823aa4d8ad3f85a2ca7bc","infoHashBuffer":{"type":"Buffer","data":[170,111,22,61,60,233,67,242,99,88,35,170,77,138,211,248,90,44,167,188]},"announce":[],"urlList":[]}}