{"title":"Retratos.Brasileiros.Mussum.2010.TVRip.Canal.Brasil.XviD.avi","uid":5973728,"size":255661056,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aaeb488acea0612f75eed09cc3516e9cb99fe39a&amp;dn=Retratos.Brasileiros.Mussum.2010.TVRip.Canal.Brasil.XviD.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"justleo","files":1,"time":1290383662,"description":"Motivos para justificar a saudade dos amigos e dos fÃƒÂ£s o carioca Antonio Carlos Bernardes Gomes (1941-1994) deixou vÃƒÂ¡rios. O maior deles foi o sorriso do personagem que o eternizou: o trapalhÃƒÂ£o Mussum - seu nome oficial para o resto da vida. Para homenageÃƒÂ¡-lo, o Canal Brasil exibe no programa Retratos brasileiros, um documentÃƒÂ¡rio que resgata as memÃƒÂ³rias do comediante, que morreu hÃƒÂ¡ dez anos, vÃƒÂ­tima de uma infecÃƒÂ§ÃƒÂ£o generalizada, apÃƒÂ³s ter o coraÃƒÂ§ÃƒÂ£o transplantado.\n\nDirigido por SÃƒÂ©rgio Rossini, o especial traÃƒÂ§a a biografia de Mussum, desde sua passagem pela mÃƒÂºsica, cantando e tocando reco-reco no grupo Os Originais do Samba, no inÃƒÂ­cio da dÃƒÂ©cada de 60, atÃƒÂ© o sucesso ao lado dos trapalhÃƒÂµes Renato AragÃƒÂ£o, o Didi, Manfried Santana, o DedÃƒÂ©, e Mauro GonÃƒÂ§alves, o Zacarias. No filme, ÃƒÂ© DedÃƒÂ© quem conta as histÃƒÂ³rias mais emotivas.\n\n- Tenho visto todo mundo relembrar os dez anos da morte do Ayrton Senna, que se foi em 1994, mas vi poucos falarem do Mussum, que tambÃƒÂ©m foi um campeÃƒÂ£o. Um campeÃƒÂ£o do riso. Ele foi o meu grande amigo. Quando vejo alguma reprise dos nossos filmes, atÃƒÂ© saio de perto, emocionado - diz DedÃƒÂ©, que hoje mora em Blumenau, Santa Catarina.\n\nDedÃƒÂ© lembra que Mussum chamou sua atenÃƒÂ§ÃƒÂ£o como potencial comediante apÃƒÂ³s tÃƒÂª-lo visto numa ponta ao lado de Chico Anysio, na Escolinha do professor Raimundo. Depois, foi conferir sua performance de palco, nos Originais. - Ãƒâ‚¬s vezes, no meio do show, ele parava de tocar, se dirigia ÃƒÂ  platÃƒÂ©ia e comeÃƒÂ§ava a contar umas histÃƒÂ³rias engraÃƒÂ§adas. Botava todo mundo para rir. Lembro de ter dito para o Renato: &quot;Qualquer programa americano em que se coloca um ator negro dÃƒÂ¡ certo. Vamos apostar nesse cara&quot;. Deu certo porque o Mussum nasceu cÃƒÂ´mico - elogia DedÃƒÂ©.\n\n- Mussum era uma alegria. Foi muito difÃƒÂ­cil ver os caras de que eu gostava partirem, como o Zacarias e tambÃƒÂ©m o TiÃƒÂ£o MacalÃƒÂ©, um trapalhÃƒÂ£o adotivo, diz Renato AragÃƒÂ£o.\n\nHÃƒÂ¡ quem diga que o charme de Mussum era sua espontaneidade. O diretor Wilton Franco, que chegou a comandar Os TrapalhÃƒÂµes na Globo, observa que ele era na vida o palhaÃƒÂ§o que encarnava no ar: - Mussum nÃƒÂ£o era versÃƒÂ¡til como ator, mas nem precisava ser. Ele nÃƒÂ£o fazia tipo. Ele era engraÃƒÂ§ado 24 horas por dia, naturalmente. O pesquisador musical HermÃƒÂ­nio Bello de Carvalho nunca esqueceu o entusiasmo de Mussum, ao lado dos Originais, durante a apresentaÃƒÂ§ÃƒÂ£o do samba Sei lÃƒÂ¡, Mangueira, que compÃƒÂ´s com Paulinho da Viola para o Festival de MÃƒÂºsica da Record de 1968: - Quando acabou a apresentaÃƒÂ§ÃƒÂ£o, com a Elza Soares cantando, o pessoal dos Originais do Samba, que tocou com ela, ficou muito excitado. AÃƒÂ­ o Mussum disse: &quot;PÃƒÂ´, HermÃƒÂ­nio, vocÃƒÂªs vÃƒÂ£o dividir o prÃƒÂªmio com a gente, nÃƒÂ©?&quot;. Ele achava que era certo ganharmos. No fim a mÃƒÂºsica nem foi a vencedora, e a Elza ganhou apenas como melhor intÃƒÂ©rprete, como consolaÃƒÂ§ÃƒÂ£o.\n\nMussum tinha a EstaÃƒÂ§ÃƒÂ£o Primeira de Mangueira no coraÃƒÂ§ÃƒÂ£o. E a escola nÃƒÂ£o se esqueceu dele, como comprova seu diretor-financeiro, Nilton de Oliveira, que serviu com o trapalhÃƒÂ£o na AeronÃƒÂ¡utica: - Mussum nÃƒÂ£o era um filho da Mangueira, mas sempre teve uma identificaÃƒÂ§ÃƒÂ£o forte com a escola. ChamÃƒÂ¡vamos ele de palhaÃƒÂ§o antes mesmo do sucesso na TV.\n\nNilton relembra um divertido caso do compadre. Na verdade, tragicÃƒÂ´mico: - Quando jovens, tÃƒÂ­nhamos a mania de rodar o morro atrÃƒÂ¡s de festa. Um dia, vimos lÃƒÂ¡ em cima uma ÃƒÂºnica luz acesa. Ao chegarmos, vimos que era um velÃƒÂ³rio. Acabamos ajudando a carregar o corpo para fora. Mas como o defunto era pesado, sem querer o deixamos cair do caixÃƒÂ£o...\n\nUm dos destaques desta ediÃƒÂ§ÃƒÂ£o do Retratos brasileiros ÃƒÂ© um resumo das melhores cenas de Mussum no cinema, incluindo sua participaÃƒÂ§ÃƒÂ£o no documentÃƒÂ¡rio No mundo dos TrapalhÃƒÂµes (1981), de SÃƒÂ­lvio Tendler, que, um tanto acima do peso na ÃƒÂ©poca, era alvo das brincadeiras do humorista. O cineasta relembra: - O grupo era mais engraÃƒÂ§ado fora do que dentro da tela. E o Mussum, o mais gozador. Ele me chamava de &quot;rolha de poÃƒÂ§o&quot; sempre que me via.\n","torrent":{"xt":"urn:btih:aaeb488acea0612f75eed09cc3516e9cb99fe39a","amp;dn":"Retratos.Brasileiros.Mussum.2010.TVRip.Canal.Brasil.XviD.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaeb488acea0612f75eed09cc3516e9cb99fe39a","infoHashBuffer":{"type":"Buffer","data":[170,235,72,138,206,160,97,47,117,238,208,156,195,81,110,156,185,159,227,154]},"announce":[],"urlList":[]}}