{"title":"Weeknight Wonders (gnv64)","uid":9776608,"size":18002627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab8b0b6b21dcec59d65b32ed8e47f3451d349d2f&amp;dn=Weeknight+Wonders+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gnv65","files":-1,"time":1395044671,"description":"Weeknight Wonders: Delicious, Healthy Dinners in 30 Minutes or Less \nby Ellie Krieger \nHoughton Mifflin Harcourt | December 2013 | ISBN-10: 1118409493 | ePUB | 154 pages | 17.1 mb\n\nBeloved Food Network and Cooking Channel star Ellie Krieger knows the secret to healthy eating: it has to be delicious. You won't eat right if you feel deprived. WEEKNIGHT WONDERS offers 150 recipes for your favorite foods, as delicious as ever, yet magically reworked without all the fat and  cholesterol. Each recipe can be prepared with minimal fuss and simple ingredients, even after a long day at work, in 30 minutes or less. From Parmesan Chicken Breasts and Goat Cheese Frittata (plus no-guilt desserts), you can stay focused on eating well any day of the week\n\nAbout the Author\nEllie Krieger, a born food lover and registered dietitian believes that the words &quot;delicious&quot; and &quot;healthy&quot; can (and should!) be used in the same sentence. She is the host of Food Network's popular Healthy Appetite, now on Cooking Channel, and author of the New York Times bestselling So Easy: Luscious Healthy Recipes for Every Meal of the Week and IACP and James Beard award-winning The Food You Crave. She has a master's degree in nutrition from Columbia University and completed her undergraduate work at Cornell University. Ellie was an adjunct professor at New York University in the Department of Nutrition, Food Studies, and Public Health. She speaks regularly at events around the country and has appeared as a guest expert on dozens of programs, including Today, Good Morning America, CNN, The Early Show,. She is a regular columnist for Fine Cooking, Food Network and Women's Health magazines and lives in New York City.\n\nCONTENTS\t\t\t\nacknowledgments\nintroduction\nsalads\nsoups and sandwiches\nmeat dishes\npoultry dishes\nseafood dishes\nvegetarian dishes\nsides\ndesserts\nindex","torrent":{"xt":"urn:btih:ab8b0b6b21dcec59d65b32ed8e47f3451d349d2f","amp;dn":"Weeknight+Wonders+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab8b0b6b21dcec59d65b32ed8e47f3451d349d2f","infoHashBuffer":{"type":"Buffer","data":[171,139,11,107,33,220,236,89,214,91,50,237,142,71,243,69,29,52,157,47]},"announce":[],"urlList":[]}}