{"title":"Armin_Van_Buuren_-_Imagine_(Remixes)-2CD-2009-TRANCEZONE","uid":4686821,"size":323207521,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac23e9ef4aa94637f4c277a8dc192197b8a41a81&amp;dn=Armin_Van_Buuren_-_Imagine_%28Remixes%29-2CD-2009-TRANCEZONE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"enigma2k8","files":20,"time":1233262105,"description":"Artist ............ : Armin van Buuren\nTitle ............. : Imagine (Remixes)\nGenre ............. : Trance\nLabel ............. : Armada Music\nSource ............ : WEB\nQuality ........... : 320kbps\nPlaytime .......... : 02:14:29  (308.MB)\nRelease Date ...... : 2009-01-29\n\n\n\n[Track List]\n\n1. Armin van Buuren - Face To Face (Martin Roth Remix)\n2. Armin van Buuren - Unforgivable ft.Jaren (First State Smooth Remix)\n3. Armin van Buuren - In And Out of Love ft.Sharon Den Adel(The Blizzard Remix)\n4. Armin van Buuren - Never Say Never Ft.Jacqueline Govaert (Myon &amp; Shane 54 Remix)\n5. Armin van Buuren - Rain Ft.Cathy Burton (W&amp;W Remix)\n6. Armin van Buuren - Fine Without You Ft. Jennifer Rene (Sied van Riel Remix)\n7. Armin van Buuren - What If Ft.Vera Ostrova (Ohmna Remix)\n8. Armin van Buuren - Hold On To Me Ft. Audrey Gallagher (John O'Callaghan Remix)\n9. Armin van Buuren - Imagine (Paul Miller remix)\n10.Armin van Buuren - Going Wrong With Dj Shah &amp; Chris Jones (Alex Morph B2B Woody van Eyden Remix)\n11.Armin van Buuren - Never Say Never Ft.Jacqueline Govaert (Omnia Remix)\n12.Armin van Buuren - What if Ft.Vera Ostrova (Arnej Remix)\n13.Armin van Buuren - Intricacy (Thomas Bronzwaer Remix)\n14.Armin van Buuren - Rain Ft.Cathy Burton (Cosmic Gate Remix)\n15.Armin van Buuren - Unforgivable ft.Jaren (Stoneface &amp; Terminal Vocal Remix)\n16.Armin van Buuren - Going Wrong With Dj Shah &amp; Chris Jones (Sean Tyas Remix)\n17.Armin van Buuren - In And Out of Love Ft.Sharon den Adel (Richard Durand Remix)\n\n[Release Notes]\n\nThe success of Armin van Buuren?s third artist album ?Imagine? rose to record breaking heights, as his sounds reached out to millions of fans all around the world. The album made a great start. Right after entering the Dutch album chart with a number one position, therewith being the first ever dance artist to have achieved so in Dutch music history, first single ?Going Wrong?, Armin?s team up with Roger Shah and singer Chris Jones, topped the global charts. Second single and collaboration with Sharon den Adel ?In &amp; Out of Love? gained another top 10 position on the Dutch charts and it?s needless to say that the next single, ?Unforgivable? will probably rock the crowds just as hard. But a new album is there. One on which the beloved ?Imagine? tracks have all received a new approach. Armin personally asked some of the best and upcoming producers to sprinkle their sound onto the already stunning tracks. Hungarian talents Myon &amp; Shane 54 turned ?Never Say Never? into a deep, warm vocal track, while John O?Callaghan peak timed ?Hold On To Me?. First State added a playful, emotional flavour to ?Unforgivable? and Martin Roth smashed around with ?Face 2 Face? and gave it all in his trancy, banging remix. Other remixes were done by Paul Miller, The Blizzard, Thomas Bronzwaer, Sied van Riel, Ohmna and Cosmic Gate. Some of the biggest names have remixed beyond imagination. Another special thing about this remix-album are the cover and pictures in the booklet. They?re made by number one fashion photographer Carli Hermes, with ?only? a LG Renoir mobile phone camera. Carli accompanied Armin for 24 hours in Jakarta and made pictures during his gig, while making his radioshow ?A State of Trance? and on the way to the hotel. The results are a great example of enhanced technology and thereby forms a perfect link to this remix album. ?Imagine - The Remixes? dares you to take a listen, to see it all from a different point of view and listen to ?Imagine? in a totally different angle: remixed","torrent":{"xt":"urn:btih:ac23e9ef4aa94637f4c277a8dc192197b8a41a81","amp;dn":"Armin_Van_Buuren_-_Imagine_%28Remixes%29-2CD-2009-TRANCEZONE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac23e9ef4aa94637f4c277a8dc192197b8a41a81","infoHashBuffer":{"type":"Buffer","data":[172,35,233,239,74,169,70,55,244,194,119,168,220,25,33,151,184,164,26,129]},"announce":[],"urlList":[]}}