{"title":"Can dialectics break bricks?","uid":3469033,"size":732377088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad46d3d06c468708957510ae1bd5056cd49d795a&amp;dn=Can+dialectics+break+bricks%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BrutusO","files":1,"time":1144674470,"description":"This is a situationist film. This is not a situationist film,&quot; begin Keith Sanborn&amp;#039;s notes to Rene Vienet&amp;#039;s Can Dialectics Break Bricks?--a French film in color being shown at Chicago Filmmakers this Saturday in a subtitled, black-and-white, letterboxed video version. I think Sanborn, an experimental filmmaker, is referring to the fact that Vienet&amp;#039;s film was made in 1973, the year after the Situationist International disbanded and two years after Vienet--who joined the situationists in 1963--resigned from their ranks.\n\nI don&amp;#039;t know much about the situationists, but according to critic Peter Wollen they formed out of a split within an earlier radical artistic and political group, the lettrists, who sort of took over the mantle of the French avant-garde from the surrealists after World War II under the leadership of Isidore Isou. The &quot;dissident Revolutionary Lettrists,&quot; as Wollen called them, were led by two young filmmakers, Guy Debord and Gil Wolman, who went on to become situationists. The only Debord film I&amp;#039;ve seen, The Society of the Spectacle (which was made the same year as Can Dialectics Break Bricks? and can be seen as its theoretical prequel), turned up on video at Chicago Filmmakers last October, also bearing English subtitles by Sanborn and accompanied by Sanborn&amp;#039;s notes. (I associate Sanborn mainly with the 1989 The Deadman, a brilliant narrative short he wrote and directed with Peggy Ahwesh, adapting a Georges Bataille story.) The Society of the Spectacle, adapted from Debord&amp;#039;s 1967 book of the same title, is more slapped together than composed, juxtaposing clips from all sorts of movies with large chunks of recited or printed post-Marxist theoretical text about media and spectacle. Can Dialectics Break Bricks?, which looks only slightly less slapped together, redubs (and probably recuts) a Chinese martial arts movie, The Crush, with more French post-Marxist theory, jokes, and occasional references to what it&amp;#039;s doing technically; roughly speaking, it&amp;#039;s a situationist variation on What&amp;#039;s Up, Tiger Lily?, Woody Allen&amp;#039;s 1966 redubbing of a Japanese James Bond spin-off. (I think it&amp;#039;s still his funniest feature, though whether it qualifies as an Allen movie is an open question. If memory serves, it used to be listed as one in the press books for Allen&amp;#039;s later movies, but a few years back it started being described as a movie written by Allen. The same ambiguity surrounds the credits of Can Dialectics Break Bricks?)\n\nAccording to Sanborn, the French-dubbed version of Can Dialectics Break Bricks? (La dialectique peut-elle casser des briques?) was preceded by a Chinese-language version with French subtitles that no longer exists. Presumably this was a situationist version, with the Chinese dialogue mistranslated in the sub-titles, though it&amp;#039;s possible that Vienet--who reportedly taught Chine&gt;se at the University of Paris, settled in Mainland China, taught at a university in Taiwan, and today works as a stockbroker in Hong Kong or Taiwan--supervised a Chinese redubbing of the original as well.\n\nA key concept and technique for the situationists was detournement, which they defined as &quot;the reemployment in a new entity of preexisting artistic elements&quot;--that is, ripping off someone else&amp;#039;s work. The reappropriating and recontextualizing of a work that already exists is the aspect of Can Dialectics Break Bricks? that makes it most interesting and relevant today, aesthetically as well as politically, because it raises the thorny issue of to whom cinema, film criticism, and film history belong. Realistically, they belong to anyone with a VCR, though some would say they belong to the state--and the state today, speaking emblematically rather than literally, is Disney. It is Disney and its client states that set our cultural agendas and rewrite our official film histories and critiques via the mass media. (The claim that &quot;the public&quot; dictates these agendas is merely a multicorporate rationalization for a process that takes place with and without the public&amp;#039;s consent.)\n\nI don&amp;#039;t want to restrict detournement to individual artists creating works out of previous works. The Rocky Horror Picture Show cult, which miraculously has survived for 20 years, is one of the purest examples of an audience appropriating a movie for its own purposes. Every time a movie buff copies a videotape for a friend something related is happening--a kind of cultural activity that&amp;#039;s outside the regulations of such institutions as studios, video-rental stores, national film archives, universities, and the print and broadcast forms of film criticism. This is something that has revolutionary implications, for the moment people start to assume responsibility for creating, disseminating, and possessing their own culture, the usual force-feeding is challenged. And the issue isn&amp;#039;t merely control and ownership of movies, but control and ownership of their meanings, functions, and purposes.\n\nAt the Pesaro film festival during the 60s French critic and filmmaker Luc Moullet challenged semiologist Roland Barthes by saying, &quot;Language, monsieur, is theft.&quot; A variation on the anarcho-Marxist adage &quot;property is theft,&quot; Moullet&amp;#039;s aphorism implies that &quot;language&quot; in the public realm of cinema is a matter of expensive equipment--35-millimeter cameras and stock, sound-mixing and recording and editing machines, and so on--and therefore property. So to &quot;have something to say&quot; in that language you have to be rich or have wealthy patrons. And to &quot;listen&quot; you need to buy a film ticket or (not an option in the 60s) own a VCR--more property. In these broad Marxist terms the triumph of the proletariat becomes inextricably tied to control of production.\n\nBy writing his own agenda on someone else&amp;#039;s film almost a quarter of a century ago, Vienet was anticipating the kind of detournement that has been happening with increasing frequency on video, though now the means are much more readily available and relatively inexpensive. I&amp;#039;m thinking of critical videos or films made up chiefly of found footage that have had varying degrees of exposure without permission from the original copyright holders. The most impressive work of this kind is Jean-Luc Godard&amp;#039;s nearly four-hour, eight-part magnum opus Histoire(s) du cinema--a work in progress since 1988 that&amp;#039;s slated to premiere in its final form at Cannes this May. Other distinguished recent examples include Mark Rappaport&amp;#039;s Rock Hudson&amp;#039;s Home Movies and From the Journals of Jean Seberg, and Thom Andersen and Noel Burch&amp;#039;s Red Hollywood. The first two episodes in Godard&amp;#039;s series, each of which lasts 50 minutes, have been shown on five separate state-funded European TV channels without any permission from the copyright holders--which sets an important precedent. As Godard told me last fall, &quot;For me there&amp;#039;s a difference between an extract and a quotation. If it&amp;#039;s an extract, you have to pay, because you&amp;#039;re taking advantage of something you have not done and you are more or less making business out of it. If it&amp;#039;s a quotation--and it&amp;#039;s more evident in my work that it&amp;#039;s a quotation--then you don&amp;#039;t have to pay.&quot;\n\nSo much for the business argument, which could be applied to the other recent videos cited above--though not to Can Dialectics Break Bricks?, since appropriating almost an entire feature qualifies as neither quoting nor extracting. Yet all these works have at most a marginal relation to the film business--at least as multicorporate capitalism has redefined that realm in recent years--and consequently it could be argued that it isn&amp;#039;t worth the time or energy of any of the conglomerates to sue lowly independents for appropriating works that can&amp;#039;t be taking much business away from them. However, Red Hollywood and both Rappaport features bring value to many works that these companies regard as essentially valueless--thereby increasing rather than decreasing future video rentals. But that doesn&amp;#039;t mean that bureaucrats at these companies wouldn&amp;#039;t charge ungodly sums if they were asked for the rights--it&amp;#039;s a simple reflex.\n\n***\n\nTo be perfectly honest, Can Dialectics Break Bricks? doesn&amp;#039;t exactly enthrall me, either as a martial arts movie or as a detournement of a martial arts movie. As a martial arts movie it&amp;#039;s fairly routine; as a situationist detournement, it doesn&amp;#039;t sustain itself. Sometimes it&amp;#039;s funny, as when the female narrator, during an extended fight sequence, gives you bibliographic references to a situationist text you should consult (&quot;in the Gallimard edition, pages 207 and 236&quot;;). Sometimes it&amp;#039;s weirdly self-referential, as when the narrator notes, &quot;Young proletarian seen through bamboo in the foreground,&quot; or when a little boy explains a pile of corpses by saying, &quot;They&amp;#039;re sick of dubbing dialogue tracks, so they&amp;#039;re pretending to be dead. It&amp;#039;s hard work, and doesn&amp;#039;t even pay cab fare.&quot;\n\nSometimes the dialogue or narration is simply daffy: &quot;Dialectical reason thunders in its crater.&quot; &quot;These bastards--suppose we burnt off the hair under their arms?&quot; In reference to a sword: &quot;Go put away your phallic symbol.&quot; &quot;You understand nothing, you dickbite Leninist. We&amp;#039;re gonna fuck you up. Bamboo up the ass with red ants. And we&amp;#039;ll burn it all up on the New Red Square.&quot; &quot;They can&amp;#039;t make butter from donkey piss.&quot; And sometimes it&amp;#039;s simply dated and parochial, as in references to Themroc (a French movie of the era) and &quot;Reich&amp;#039;s Function of the Orgasm in a nonmasperised version&quot; (which I take to be a swipe at Maspero, a radical Marxist publisher and bookseller of the period)--which raises the issue of how relevant this all is to us.\n\nIn other words, both the kung fu and the post-Marxist jive become tiresome after a while. But for me, the issues of detournement and appropriation keep this video perpetually fascinating. There&amp;#039;s even the question of how much Sanborn&amp;#039;s version--as unauthorized as Vienet&amp;#039;s swiping of The Crush--comprises a detournement of a detournement, or how much my description of Sanborn&amp;#039;s version comprises a detournement of a detournement of a detournement. Sanborn claims in his notes that his version was done &quot;not to parade a corpse embalmed among the sainted heroic dead or some cinematic or political pantheon, but in order to add to historical understanding and to release what remains of its revolutionary analysis and praxis--in short, its orgone energy.&quot; &quot;Orgone energy&quot; (a kind of omnipresent sexual current) is a key term of the Freudian dissident and sexual theorist Wilhelm Reich, one of Vienet&amp;#039;s reference points, and Sanborn notes that Vienet made a series of detournement porn movies with titles such as The Eggplant Is Stuffed and The Cassock Has No Fly. But Sanborn reducing (or elevating) the remnants of this movie&amp;#039;s &quot;revolutionary analysis and praxis&quot; to &quot;orgone energy&quot; is really, I suspect, his own form of appropriation, just as my focus on the anarchistic repossession of the multicorporate cinema is mine. What if, like me, you&amp;#039;re not especially interested in a &quot;historical understanding&quot; of the situationists, but are very much concerned with contemporary cultural ownership? Or what if your interest is neither mine nor Sanborn&amp;#039;s but something entirely different? The point of detournement is to make the work in question your own. And since I&amp;#039;m the penultimate link in an extended chain of benign anticapitalist rip-offs, I can only say, be my guest.\n* *  Worth Seeing\nJonathan Rosenbaum, Chicago Reader\n\nYes, this one has hard english (and french) subs, and yes, it&amp;#039;s as hilarious in english.\n\nso vienet was a &amp;#039;situationist&amp;#039; until he got the boot in 1970 or 1971, and influenced by that whole experience, he eventually went on to make these great &amp;#039;detournement&amp;#039; movies.  unlike debord&amp;#039;s, his were were more direct detournements - he&amp;#039;d dub over asian films with political and philosophical stories.  it really works here, and if you haven&amp;#039;t seen this, i really encourage it.","torrent":{"xt":"urn:btih:ad46d3d06c468708957510ae1bd5056cd49d795a","amp;dn":"Can+dialectics+break+bricks%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad46d3d06c468708957510ae1bd5056cd49d795a","infoHashBuffer":{"type":"Buffer","data":[173,70,211,208,108,70,135,8,149,117,16,174,27,213,5,108,212,157,121,90]},"announce":[],"urlList":[]}}