{"title":"THE FIFTH BEATLE - THE BRIAN EPSTEIN STORY (2013) (digital-Empir","uid":9313244,"size":94577416,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ad8c38592b7d654a4e436b8a95a19443e3fe39e0&amp;dn=THE+FIFTH+BEATLE+-+THE+BRIAN+EPSTEIN+STORY+%282013%29+%28digital-Empir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1386434256,"description":"The Fifth Beatle: The Brian Epstein Story\n\nThe Fifth Beatle is the untold true story of Brian Epstein, the visionary manager who discovered and guided the Beatles -- from their gigs in a tiny cellar in Liverpool to unprecedented international stardom. Yet more than merely the story of &quot;The Man Who Made The Beatles,&quot; The Fifth Beatle is an uplifting, tragic, and ultimately inspirational human story about the struggle to overcome seemingly insurmountable odds. Brian Epstein was homosexual when it was a felony to be so in the United Kingdom, Jewish at a time of anti-Semitism, and from Liverpool when it was considered just a dingy port town. He helped spread the Beatles' message of love to the entire world, yet died painfully lonely at the young age of thirty-two, consumed by staggering ambition and the endless struggles that came with it.\n\nBoth heartbreaking and uplifting, The Fifth Beatle not only reveals an important, unsung chapter in the history of the Beatles -- but it will inspire anyone who's ever dared to believe in a dream. For more information and to view the trailer for the graphic novel, visit FifthBeatle.com.\n\nWriter: Vivek J. Tiwary\nPencillers: Andrew C. Robinson, Kyle Baker\nInkers: Andrew C. Robinson, Kyle Baker\nLetterer: Steve Dutro\nColorists: Andrew C. Robinson, Kyle Baker\nCover Artist: Andrew C. Robinson\n\nGenres: Non-Fiction\n\nPublication Date: November 19, 2013\nFull Color, 144 pages\n$19.99\n\n------\n\nFrom The New York Times:\n\nDecember 5, 2013, 11:33 am\t\nDIRECTOR SET FOR BRIAN EPSTEIN BIOPIC\nBy Allan Kozinn\n\nThe producers of &quot;The Fifth Beatle,&quot; one of two films in the works about Brian Epstein, the Beatles' manager, announced on Wednesday that they have signed up Peyton Reed (&quot;Bring It On,&quot; &quot;The Breakup&quot;) to direct. The film is based on the graphic novel by Vivek J. Tiwary, an author who is best known as a theatrical producer (&quot;Raisin in the Sun,&quot; &quot;American Idiot,&quot; &quot;The Addams Family&quot;).\n\nMr. Tiwary, who is writing the screenplay and co-producing the film with Bruce Cohen, focuses on the six years that Epstein managed the group -- from the end of 1961 until his death from an accidental drug overdose in 1967 -- and on his personal battles as a gay man when homosexuality was illegal in Britain.\n\nMr. Tiwary has also secured the rights to use Beatles' recordings in his film. Casting has not yet been announced.\n","torrent":{"xt":"urn:btih:ad8c38592b7d654a4e436b8a95a19443e3fe39e0","amp;dn":"THE+FIFTH+BEATLE+-+THE+BRIAN+EPSTEIN+STORY+%282013%29+%28digital-Empir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad8c38592b7d654a4e436b8a95a19443e3fe39e0","infoHashBuffer":{"type":"Buffer","data":[173,140,56,89,43,125,101,74,78,67,107,138,149,161,148,67,227,254,57,224]},"announce":[],"urlList":[]}}