{"title":"MIT OCW- 8.01- Fall '99- Physics I: Classical Mechanics","uid":6134749,"size":7310123152,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:adbee73963200c547a2ee37db87c63adcf012509&amp;dn=MIT+OCW-+8.01-+Fall+%5C%2799-+Physics+I%3A+Classical+Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"k4n4bu5","files":131,"time":1296256329,"description":"Uploader's Note: In this download is included all video lectures, video transcripts, lecture handouts, assignments\nand exams for the MIT OCW Course 8.01 Physics I: Classical Mechanics. All of these files can be\nfound and downloaded from the MIT OCW Site: http://ocw.mit.edu/index.htm\n\n\nI did not have anything to do with this course, the recording or publishing of it or its materials. I have only\ntaken what MIT OCW was kind enough to give to the world and have compiled it into one large file. Hopefully making it available for those who can't stream the videos from their site.\n\nPlease remember to go to the website: http://ocw.mit.edu/index.htm and donate if at all possible to keep this\nwonderful initiative going.\n\nThe videos are .mp4 and ranging in quality as they are downloaded from the MIT OCW site.\nIf this is fairly popular I will be doing more, so if you go to the website and see any courses you would like done in this style feel free to hit me up.\n\n\nCourse Highlights:\n\nThe 35 video lectures by Professor Lewin, were recorded on the MIT campus during the Fall of 1999. Prof. Lewin is well known at MIT and beyond for his dynamic and engaging lecture style.\n\nCourse Description:\n\n8.01 is a first-semester freshman physics class in Newtonian Mechanics, Fluid Mechanics, and Kinetic Gas Theory. In addition to the basic concepts of Newtonian Mechanics, Fluid Mechanics, and Kinetic Gas Theory, a variety of interesting topics are covered in this course: Binary Stars, Neutron Stars, Black Holes, Resonance Phenomena, Musical Instruments, Stellar Collapse, Supernovae, Astronomical observations from very high flying balloons (lecture 35), and you will be allowed a peek into the intriguing Quantum World.\n\nWhen this course was taught in 1999, we used:\n\nOhanian, Hans C. Physics. Vol. 1. 2nd ed., expanded. New York, NY: Norton, 1989. ISBN: 9780393957501.\n\nThis book has recently been replaced with a new edition:\n\nOhanian, Hans C., and John T. Markert. Physics for Engineers and Scientists. Vol. 1. 3rd ed. New York, NY: Norton, 2007. ISBN: 9780393930030.\n\nMIT OpenCourseWare (OCW)\n\nUnlocking Knowledge,Empowering Minds.\nFree lecture notes, exams, and videos from MIT. No registration required.\n\nMIT OpenCourseWare (OCW) is a web-based publication of virtually all MIT course content.\nOCW is open and available to the world and is a permanent MIT activity.\n\n\nWhat is MIT OpenCourseWare?\n\nMIT OpenCourseWare is a free publication of MIT course materials that reflects almost all the\nundergraduate and graduate subjects taught at MIT.\n\n* OCW is not an MIT education.\n* OCW does not grant degrees or certificates.\n* OCW does not provide access to MIT faculty.\n* Materials may not reflect entire content of the course.\n\nWhat it takes to support this work:\n\nEach course we publish requires an investment of $10,000 to $15,000 to compile course materials from faculty,\nensure proper licensing for open sharing, and format materials for global distribution.\nCourses with video content cost about twice as much, but your feedback about the significant value of these\nvideo materials helps to justify the cost. (From the MIT OCW Website: http://ocw.mit.edu/about/ )\n\nMIT OCW Homepage: http://ocw.mit.edu/index.htm\n\nMIT OCW Creative Commons License: http://ocw.mit.edu/terms/index.htm#cc\n\n\n*Citation: Lewin, Walter. 8.01 Physics I: Classical Mechanics, Fall 1999. (Massachusetts Institute of Technology: MIT OpenCourseWare), http://ocw.mit.edu (Accessed 26 Jan, 2011). License: Creative Commons BY-NC-SA\n\nPlease Remember to Seed!","torrent":{"xt":"urn:btih:adbee73963200c547a2ee37db87c63adcf012509","amp;dn":"MIT+OCW-+8.01-+Fall+%5C%2799-+Physics+I%3A+Classical+Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adbee73963200c547a2ee37db87c63adcf012509","infoHashBuffer":{"type":"Buffer","data":[173,190,231,57,99,32,12,84,122,46,227,125,184,124,99,173,207,1,37,9]},"announce":[],"urlList":[]}}