{"title":"Rutles Related Rarities","uid":10337243,"size":4378813612,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aefbf08c52a541528280eb74504a9bac4a95c536&amp;dn=Rutles+Related+Rarities&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":31,"time":1402447603,"description":" In 1978, on NBC, Monty Python's Eric Idle and Neil Innes (of the Bonzo Dog Doo Dah Band) created a musical legend that will last a lunchtime. &quot;The Rutles In All You Need is Cash&quot; was Idle and Innes' affectionate parody of The Beatles, in particular the unreleased documentary film &quot;The Long and Winding Road.&quot; Eric Idle's comedic narration took us through the rise and fall of the greatest rock group of the 60s with hilarious accuracy, while Neil Innes' songs captured the essence of The Beatles in a way that left viewers shocked and stunned. Very stunned. The film was spun off from Saturday Night Live and Idle and Innes' BBC2 sketch comedy series Rutland Weekend Television.\n\n This is not that film, or Eric Idle's 2002 &quot;sequel,&quot; which used alternate takes and new celebrity interviews to fill out 84 minutes.\n\n  This is a collection of Rutle rarities.\n\n  In 1996, Neil Innes, Rikki Fataar and John Halsey released a new album, The Rutles Archaeology, bringing us sixteen more wonderfully Beatle-esque tunes. You'll see a bit of that here.\n\n  Eric Idle was not involved, and publicly insulted the project. He and Innes would make up and be friendly for awhile around 2002-2003, when Eric was assembling his sequel. You'll see a bit of that here too.\n\n  Here's what you'll get on this DVD:\n\n* 2003, Los Angeles: Neil Innes, Eric Idle, and Ken Thornton perform &quot;The Bruces' Philosophers Drinking Song,&quot; &quot;Let's Be Natural,&quot; &quot;Shangri-La,&quot; and &quot;Back In 64.&quot; A very rare opportunity to see Eric Idle performing Rutles songs and being friendly with Neil Innes. Newly-restored home video footage.\n\n* &quot;Shangri-La&quot; music video, 1996. 3rd-gen VHS.\n\n* CNN report on The Rutles Archaeology, 1996. 3rd-gen VHS.\n\n* Rooftop concert, 1996. &quot;Major Happy/Shangri-La.&quot; VHS copy.\n\n* Lorne Michaels introduces the Rutles on Saturday Night Live, 1976, in a clip originally from Rutland Weekend Television. &quot;I Must Be In Love.&quot; DVD quality.\n\n* Ron Nasty performs &quot;Cheese and Onions&quot; on Saturday Night Live, 1977. DVD quality.\n\n* Neil Innes performs &quot;Shangri-La&quot; on Saturday Night Live, 1977. Eric Idle and Dan Aykroyd perform the &quot;Gibberish&quot; sketch from Rutland Weekend Television. DVD quality.\n\n* Panel dicussion. The Rutles reunion at The Directors Guild, Los Angeles, 2000. Gary Weis, Eric Idle, Neil Innes, Rikki Fataar. Analog camcorder footage.\n\n* Beatlefest 1997. Panel dicussion. Neil Innes, Rikki Fataar, John Halsey. 3rd-gen VHS.","torrent":{"xt":"urn:btih:aefbf08c52a541528280eb74504a9bac4a95c536","amp;dn":"Rutles+Related+Rarities","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aefbf08c52a541528280eb74504a9bac4a95c536","infoHashBuffer":{"type":"Buffer","data":[174,251,240,140,82,165,65,82,130,128,235,116,80,74,155,172,74,149,197,54]},"announce":[],"urlList":[]}}