{"title":"Understanding Drupal - Lullabot","uid":4310257,"size":1040843786,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:afae7aef05c132ef8edf9126619f4a506cab96c7&amp;dn=+Understanding+Drupal+-+Lullabot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drulover","files":2,"time":1216775499,"description":"\nUnderstanding Drupal\nUnderstanding Drupal\n\nIn Understanding Drupal, the first in The Lullabot Learning Series, the Lullabot team provides an overview of Drupal as a content management system, as a PHP web application framework, and as a developer community. Its documentary-style exploration covers all the terminology and fundamental concepts for both site administrators and developers. If you?ve ever been confused by Drupal or are still trying to wrap your head around the community and platform, then this video is a roadmap to accelerate your journey up the Drupal learning curve.\nTopics include:\n\n    * How content is entered and managed\n    * How users and user permissions are handled\n    * What blocks are and what they can do\n    * The concepts and capabilities of Drupal?s powerful module system\n    * How Drupal handles navigation and its menu system\n    * How themes alter the site layout, design, and presentation\n    * Site configuration and administrative messages and settings\n\nThis video uses Drupal 6 for examples, however it is more focused on general Drupal concepts rather than version-specific how-tos.\n\nLullabot has guided such companies as MTV, Sony BMG Records, Lifetime Television, IBM, and Fast Company in building and growing their Drupal websites. Recognized as some of the most influential and well-respected developers, consultants, and educators in the Drupal community, the team is responsible for best-selling Drupal books and Drupal workshops and seminars worldwide.\n\nAddison Berry, Angela Byron, Jeff Eaton, Nathan Haug, Jeff Robbins, James Walker, and Matt Westgate sit down to tell us all about Drupal in this video directed and edited by Kent Bye.\n\nPreview trailer:\n\nRun time: 65 minutes\n\nDVD is region-free, standard DVD and will play worldwide on any player.\n\nDownload version is a high-resolution (720P) QuickTime file. It is a 977MB download.\n\nMore questions? Check out our Frequently Asked Questions.","torrent":{"xt":"urn:btih:afae7aef05c132ef8edf9126619f4a506cab96c7","amp;dn":"+Understanding+Drupal+-+Lullabot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afae7aef05c132ef8edf9126619f4a506cab96c7","infoHashBuffer":{"type":"Buffer","data":[175,174,122,239,5,193,50,239,142,223,145,38,97,159,74,80,108,171,150,199]},"announce":[],"urlList":[]}}