{"title":"Classical Opera Traditional Voices 4CD 320k (musicfromrizzo)","uid":6761440,"size":808419652,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b0f54f7ddae5dbd966647365c548f6731a7e699b&amp;dn=Classical+Opera+Traditional+Voices+4CD+320k+%28musicfromrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"musicfromrizzo","files":-1,"time":1319221686,"description":"CDC - Voices In Harmony 4CD set plus bonus selections 320k (musicfromrizzo)\n\nThis was obtained on the net as a 4CD set published as from the Compact\nDisc Club offerings.\n\nMuch of it is from Classical or operatic productions however there is some\nbeautiful traditional stuff such as the Kalinka and other similar stuff - \nwhat sheer beauty of the spirit! There's also great songs that are often done\nby Jose Carreras and Sarah Brightman (the latter included as a bonus equally \nI say!)\n\nSome song titles had French versions such as &quot;The Red Army Chorus&quot; \nartist notation etc - so we fixed it for everyone's benefit in this\nparticular case. Many titles don't indicate artist in fact\nbut rather the Opera or Classical production the song is from.\n\nEnjoy! I note this is posted on a torrent however we obtained it elsewhere\nas we subscribe to sources that provide us content for torrent postings for\neveryone's benefit in our style and with added bonus additions that make the\noffering even more meaningful in the first place\n\nEnjoy!\n\n\nMichael Rizzo chessman\nmusicfromrizzo\n\n\n\n\nApatulia - Sadness Part I\nBarbara Bonney - Ave Maria\nBarbara Hendricks  Jose Carreras - La Boheme - O Soave Fanciulla\nBodil Arnesen - Peer Gynt - Solveig's Song\nBoxSet Image\nCarmina Burana (Songs from Beuern) - O Fortuna\nCecilia - Amazing Grace\nCecilia Bartoli - Cosi Fan Tutte - Soave Sia Il Vento\nCecilia Bartoli - Le Nozze Di Figaro - Voi, Che Sapete Che Cosa E Amor\nCeltic Fayre - Harry's Game\nChoir &amp; Orchestra Of Sofia - Madama Butterfly - Humming Chorus\nDie Entfuhrung Aus Dem Serail - Overture\nEuphoric Logic - Ameno\nEva Urbanova - Rusalka - Song To The Moon\nF. Furlanetto  J. Rodgers - Don Giovanni - La Ci Darem La Mano\nFraom Carmen - Prelude\nFrom Carmen - Entracte\nFrom Die Walkure - The Ride Of The Valkyries\nFrom Faust - Gloire A Nos Aieux\nGloria All' Egitto -  (from Aida)\nHallelujah - (from Handel's Messiah)\nJanet Bake - Orfeo Ed Euridice - Che Faro Senza Euridice\nJennifer Larmore - Belezza Vocale - Lakm\nJenny Drivala - La Rondine - La Canzone Di Doretta\nJoanne Wilson Smith - Songs From The Auvergne - Bailero\nJohn Tomlinson - Le Nozze Di Figaro - Non Piu Andrai Farfallone Amoroso\nJose Carreras - Amore Perduto\nJose Carreras - En Aranjuez Con Tu Amor\nJose Cura  Eteri Gvaz Ava - La Traviata - Un Di Felice\nJose Cura - Fedora - Amor Ti Vieta\nJose Cura - Manon Lescaut - Donna Non Vidi Mai\nJose Cura - Tosca - E Lucevan Le Stelle\nJose Cura - Turandot - Nessun Dorma\nJulia Migenes - Carmen - L'amour Est Un Oiseau Rebelle\nJulia Migenes - Carmen - Les Tringles Des Sistres Tintaient\nKiri Te Kanawa - Gianni Schicchi - O Mio Babbino Caro\nKiri Te Kanawa - Madama Butterfly - Un Bel Di, Vedremo\nLa Traviata - Noi Siamo Zingarelle\nLa Traviata - Preludio\nLe Fosche - Il Trovatore - Vedi!\nLohengrin - Treulich Gefuhrt Ziehet Dahin\nLuca Canonici - L' Elisire D' Amore - Una Furtiva Lagrima\nManuella Salucci - Le Nozze Di Figaro - L'ho Perduta Me Meschina\nMaria Tardy - Casta Diva\nMaria Tardy - Pace Pace\nMarilyn Horne - Serse - Ombra Mai Fu\nMiriam Gauci - La Wally - Ebben N'andro Lontana\nMonks Of The Jesus Maria Clementis Monastery - Virgo Dei Genetrix\nNathalie Dessay - Les Contes D' Hoffman - Les Oiseaux Dans La Charmille\nNe'lieti Calici - La Traviata - Brindis\nNina Lotsari - Hijo De La Luna\nNina Lotsari - Spente Le Stelle\nNoa Dori - Love Song For A Vampire\nNoa Dori - The Sound Of Silence\nO Heimat - Tannhauser - Begluckt Darf Nun Dich\nPlacido Domingo - La Gioconda - Cielo E Mar\nRoberto Servile - Il Barbiere Di Siviglia - Largo Al Factotum\nRuggero Raimondi - Carmen - Votre Toast Je Peux Vous Le Rendre\nSang Froid - Sunsets\nSinfonia - Le Nozze Di Figaro\nThe Russian Red Army Chorus - Kalinka\nThe Russian Red Army Chorus - Les Yeux Noirs\nThe Russian Red Army Chorus - National Anthem Of the USSR (L'hymne Sovietique)\nThomas Hampson - Don Giovanni - Deh Vieni Alla Finestra\nThomas Hampson - Don Giovanni - Fin Ch' Han Dal Vino\nVa Pensiero - (From Verdi's Nabucco)\nVienna Vocalists  Vienna Boys Choir  Ensemble Vienna Sound - Ave Verum\nVienna Vocalists - Gregorian Introduction\nVienna Vocalists - Radetzky Marsch\nYordy Ramiro - Rigoletto - La Donna E Mobile\n \nBonus - added tracks\nBarry O'Dowd &amp; The Shamrock Singers - Loch Lomond\nBarry O'Dowd &amp; The Shamrock Singers - We'll Meet Again\nHelene Fischer - Russian - Russiches Medley\nHelene Fischer-Russisches Medley (Kalinka)-(musicfromrizzo).mp4\nJohn McCormack - Moonlight and Roses\nJose Carreras - All The Way\nJose Carreras - Manha  de Carnaval\nRosemary Clooney - Corazon De Melon (Watermelon Heart) (Remastered)\nSandi Patty - How Great Thou Art\nSandi Patty - It is Well with my Soul\nSarah Brightman - Duet with Placido Domingo - Amigos Para Siempre\nSarah Brightman - En Aranjuez Con Tu Amor\nThe Ten Tenors - Amigos para siempre\nThe Ten Tenors - Besame Mucho\nThe Ten Tenors - En Aranjuez Con tu amor\nThe Ten Tenors - Torna a Surriento\n \n","torrent":{"xt":"urn:btih:b0f54f7ddae5dbd966647365c548f6731a7e699b","amp;dn":"Classical+Opera+Traditional+Voices+4CD+320k+%28musicfromrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0f54f7ddae5dbd966647365c548f6731a7e699b","infoHashBuffer":{"type":"Buffer","data":[176,245,79,125,218,229,219,217,102,100,115,101,197,72,246,115,26,126,105,155]},"announce":[],"urlList":[]}}