{"title":"(Blues) Johnny Shines - Standing At The Crossroads","uid":6131935,"size":132993542,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b1113f5f65f817425a52b118d8a11f5f901cf5ed&amp;dn=%28Blues%29+Johnny+Shines+-+Standing+At+The+Crossroads&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1296158886,"description":"mp3   320kbps\n\n\nStyles: Delta Blues, Country Blues\nReleased: 1970/1995\nLabel: Testament\n\n\n1. Standing at the Crossroads - 2:53\n2. Milk Cow's Troubles - 2:54\n3. Death Hearse Blues - 3:26\n4. Drunken Man's Prayer - 3:24\n5. Hoo-Doo Snake Doctor Blues - 3:07\n6. It's A Lowdown Dirty Shame - 4:30\n7. How Long - 2:56 *\n8. Crying Black Angel - 4:00 *\n9. Down in Spirit - 3:34 *\n10. Your Troubles Can't Be Like Mind - 4:19\n11. Kind-Hearted Woman - 3:08\n12. Baby Sister Blues - 3:18\n13. My Rat - 2:54\n14. Don't Take A Country Woman - 3:05\n15. Kind-Hearted Woman (Alt.) - 3:25 *\n16. Death Hearse Blues (Alt.) - 3:20 *\n* 1995 Cd bonus tracks\n\n\n\nPersonnel:\nJohnny Shines - Vocal, Guitar\n\nNotes: This is one of several albums this artist made in the early '70s that stand as a masterpiece of the acoustic country blues genre. Johnny Shines had begun recording in the mid-'60s, the albums done with electric guitar and full-combo backup, one of them reportedly cut after he hadn't picked up an instrument in years. It was as if he reinvented himself in the following decade, playing pristine and flawless acoustic slide guitar pieces complete with shuffling, stuttering, and stimulatingly complicated tempos. The message was that he had been a young sidekick to Robert Johnson and had absorbed everything, although no deal had been made with the Devil. Shines was a steady, dependable, religious, and forthright chap who lived in Tuscaloosa, AL, and held down a steady job as a construction foreman. Mild-mannered and extremely intellectual, he let loose the reserve of emotion when doing a Delta blues number. The magic and heart were in his fingertips as well as in his voice, which sounds stupendous here. The emergence of the Johnson song canon into his repertoire, done with almost Baroque detail, was also something of a revelation. Some of Shines' earlier albums had featured songs that almost seemed made up on the spot. He was good at that, and was rumored to have played whole sets that were completely improvised when working the country juke joints of his home state, but on this album he showed what he could do when sinking his teeth into a bona fide blues classic. &quot;Kind Hearted Woman&quot; is the musical equivalent of an absolutely perfect chopped-barbecue sandwich with sauce the way they do it in Tuscaloosa, and obviously of much less offense to vegetarians when taken in this form. There were 11 perfect songs chosen by Pete Welding from his set of recording sessions for this project. Once again this great producer has come up with a blues release that is basically a required item for any good collection of this genre.\nrec. Nov. 11 &amp; 17, 1970 in Altadena, Ca.\n\n\nenjoy daba_1...lol\n\n\n","torrent":{"xt":"urn:btih:b1113f5f65f817425a52b118d8a11f5f901cf5ed","amp;dn":"%28Blues%29+Johnny+Shines+-+Standing+At+The+Crossroads","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1113f5f65f817425a52b118d8a11f5f901cf5ed","infoHashBuffer":{"type":"Buffer","data":[177,17,63,95,101,248,23,66,90,82,177,24,216,161,31,95,144,28,245,237]},"announce":[],"urlList":[]}}