{"title":"AnvSoft.Photo.Flash.Maker.Platinum.v5.31  LASTEST","uid":6229223,"size":26549706,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b143e1e0426b1c352e6e50b191b231760b4f8172&amp;dn=AnvSoft.Photo.Flash.Maker.Platinum.v5.31++LASTEST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BLACKTROY","files":1,"time":1299641590,"description":"Photo Flash Maker Platinum enables you to create flash slideshow with photos and videos. This amazing slideshow software provides numerous transition effects and templates to display your photos along with FLV videos. \n\nMaking such a wonderful video-photo-combined slideshow with Photo Flash Maker Platinum is so easy that it takes you only 3 steps to finish the job.\n\n\nIncludes all the power of Professional Version, plus more features\nPhoto Flash Maker Platinum is an enhanced version of Professional version, which includes all the features of Professional version. It also supports creating video slideshow to publish online.\n 2. Support adding FLV videos to make video slideshow\nAs opposed to Professional version, Photo Flash Maker Platinum supports adding FLV videos to make video or photo-video-mixed slideshow, which could be easily embedded onto any websites.\n 3. Flash templates are added available for adding FLV videos\nThe flash templates that supports adding FLV videos are added to Photo Flash Maker Platinum. Along with the upgrade, more and more flash templates for making videos slideshow will be added.\n4. Flash templates are classified into five six category\nThe interface of Photo Flash Maker Platinum under &quot;Theme&quot; tab is recontructured. All the flash templates are falling into five categories, including &quot;Basic&quot;, &quot;Professional&quot;, &quot;Web Album&quot;, &quot;3D&quot;, &quot;Video&quot; and &quot;Premium&quot;.\n","torrent":{"xt":"urn:btih:b143e1e0426b1c352e6e50b191b231760b4f8172","amp;dn":"AnvSoft.Photo.Flash.Maker.Platinum.v5.31++LASTEST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b143e1e0426b1c352e6e50b191b231760b4f8172","infoHashBuffer":{"type":"Buffer","data":[177,67,225,224,66,107,28,53,46,110,80,177,145,178,49,118,11,79,129,114]},"announce":[],"urlList":[]}}