{"title":"Surgery for Low Back Pain","uid":6837734,"size":32275372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b18bcffb208db4ea91e3c226e8be87fb7ad09c4b&amp;dn=Surgery+for+Low+Back+Pain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chami1988","files":-1,"time":1322063932,"description":"Marek Szpalski, Robert Gunzburg, Bjorn L. Rydevik, Jean-Charles Le Huec, H. Michael Mayer, &quot;Surgery for Low Back Pain&quot;\nPublisher: Springer | ISBN: 3642045464 | edition 2010 | PDF | 285 pages \n\nLow back pain is a very common problem that is increasingly being treated surgically. This book aims to evaluate carefully the possible surgical approaches to low back pain, with detailed appraisal of the factors leading to their success or failure. It begins by explaining the scientific basis for surgery and considering the different diagnostic techniques that may be employed, thereby elucidating the surgical rationale, indications, and contraindications. The value of conservative options is also assessed to help the reader weigh the need for surgery. The various surgical modalities, including the most recent, are then fully described and evaluated with the aid of numerous illustrations. The book concludes with a chapter devoted to evidence-based analysis of the outcome of surgery in patients with low back pain. This book will be invaluable to orthopaedic and neurosurgeons, rheumatologists, neurologists, and all who are concerned with the effective treatment of this often debilitating condition.","torrent":{"xt":"urn:btih:b18bcffb208db4ea91e3c226e8be87fb7ad09c4b","amp;dn":"Surgery+for+Low+Back+Pain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b18bcffb208db4ea91e3c226e8be87fb7ad09c4b","infoHashBuffer":{"type":"Buffer","data":[177,139,207,251,32,141,180,234,145,227,194,38,232,190,135,251,122,208,156,75]},"announce":[],"urlList":[]}}