{"title":"Sutton-Federal Reserve Conspiracy(bankers that stole America)(19","uid":4993767,"size":2782812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b192e5fba18c7a8f43d783bedfce2163429a6d9d&amp;dn=Sutton-Federal+Reserve+Conspiracy%28bankers+that+stole+America%29%2819&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1247176274,"description":"This is Antony C. Sutton's mindblowing book The Federal Reserve Conspiracy (1995) which is the first book that details hour by hour the events that led up to passage of the Federal Reserve Act of 1913 and the many decades of work and secret planning that private bankers had invested to obtain their money monopoly in USA. Since 1913 politicians and media have treated the Federal Reserve Bank as a kind of untouchable off limits semi-God... no one except 'certified crackpots and kooks' criticizes the Fed. Conventional wisdom dictates that anyone who attacks the Federal Reserve System is doomed and Congressional investigation of the Fed would result in economic chaos and a disastrous plunge of the stock market. There is a vast misconception about the Fed. The President and the Congress have very little, if any, influence on policy. The Congress handed over all monetary powers to the Fed in 1913. The Fed is a private bank, owned by banks, and pays dividends on its shares owned only by banks. The Fed is a private Bankers' Bank. The Congress has never investigated the Fed and is highly unlikely to do so. No one sees Fed accounts; they are not audited. No balance sheets are issued. No one, but no one, ever criticizes the Fed and survives. Why all the secrecy and caution? Simply because the Fed has a 'legal' monopoly of money granted by Congress in 1913 proceedings that were unconstitutional and fraudulent. Most of Congress has no idea of the contents of the Federal Reserve Bill signed by President Woodrow Wilson who was in debt to Wall Street. The Federal Reserve has the power to create money. This money is fiction, created out of nothing. This can be money in the form of created credit through the discount window at which other banks borrow at the discount rate of interest or it can be notes printed by the Treasury and sold to the Fed and paid for by Fed-created funds. This private group of bankers has a money machine monopoly which is uncontrolled by anyone and is guaranteed profit. Further, the monopoly doesn't have to answer questions or produce books or file annual statements. It is an unrestrictive money monopoly. The Federal Reserve Conspiracy is a short history of money and finance in America which carefully documents the secret plans of a small group of wealthy bankers to gain control of the financial and political power of the United States using government documentation to validate his charges. With surgical precision, Sutton has concisely made his case against the Federal Reserve establishment. This book will not intimidate you nor bore you with financial details, but will instead enlighten you about financial matters. Despite its title, this book is not about conspiracies but about facts. The passing of the Federal Reserve Act was the beginning of the biggest sell out in our history at the hand of our politicians. It was a watershed event that led to the privatization of financial and political establishments and to the loss of America's financial sovereignty forever. Antony C. Sutton has put together a very accessible and easy to read book for anyone who wishes to understand the history of the Federal reserve. The author will take you on a brief, but still detailed look at many events, which lead to the conception and birth of the Federal Reserve. From the actions of Alexander Hamilton, to the communist manifesto of Karl Marx, and to the Federal Reserve act of 1913 passed by Woodrow Wilson, Sutton explains to the reader exactly what has occured in history that brought the unconstitutional institution commonly called &quot;The Fed&quot; into being. 115 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:b192e5fba18c7a8f43d783bedfce2163429a6d9d","amp;dn":"Sutton-Federal+Reserve+Conspiracy%28bankers+that+stole+America%29%2819","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b192e5fba18c7a8f43d783bedfce2163429a6d9d","infoHashBuffer":{"type":"Buffer","data":[177,146,229,251,161,140,122,143,67,215,131,190,223,206,33,99,66,154,109,157]},"announce":[],"urlList":[]}}