{"title":"Dan Carpenter_A Psychonaut's Guide to the Invisible Landscape (","uid":4303856,"size":7543444,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1bbc21a487ea59740cec586f0551c39970e8b7a&amp;dn=Dan+Carpenter_A+Psychonaut%5C%27s+Guide+to+the+Invisible+Landscape+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bitterpee","files":1,"time":1216448655,"description":"Journeying into the invisible world revealed by his use of the dissociative psychedelic DXM (dextromethorphan), Dan Carpenter found that what he experienced was not simply subjective sensations and psychological states but an objective world of familiar, if inordinately odd, landmarks and characters. The running diary he kept of these voyages recounts impressions of a landscape charted by other travelers into this Inner Space and includes descriptions of many of the same phenomena recorded by such mind travelers as Terence and Dennis McKenna, Alexander and Ann Shulgin, and others who have experienced the hive mind--the pool of all consciousness. Into this territory where expression is like chaos theory, where oddly symmetrical order manifests out of the seemingly anarchic swirl of images and events, the author ventures with the mind-set of a naturalist, accepting whatever might be rather than what he hopes he might find. What emerges is not a location crafted by subjective experience, but a landscape that embodies the Other and that represents a conscious state in which the barriers between the self and the not-self dissolve.\n\n\nappologies for a lack of open ports as i do not have the access required to fix that.   please share this as far as it will reach.  (-:","torrent":{"xt":"urn:btih:b1bbc21a487ea59740cec586f0551c39970e8b7a","amp;dn":"Dan+Carpenter_A+Psychonaut%5C%27s+Guide+to+the+Invisible+Landscape+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1bbc21a487ea59740cec586f0551c39970e8b7a","infoHashBuffer":{"type":"Buffer","data":[177,187,194,26,72,126,165,151,64,206,197,134,240,85,28,57,151,14,139,122]},"announce":[],"urlList":[]}}