{"title":"Hilliard Ensemble - English And Italian Renaissance Madrigals","uid":4604632,"size":182643749,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b1e6c40e70ebc58dab08bfcb6f546f9cdca8b142&amp;dn=Hilliard+Ensemble+-+English+And+Italian+Renaissance+Madrigals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":51,"time":1230415111,"description":"There are few vocal ensembles in the world today that please so much as the Hilliard Ensemble. Combining superb musicianship, splendid voices, and a peerless sense of ensemble, they have established themselves as master interpreters of vocal music from the medieval and renaissance eras. \n\nAll of their many talents are on full display in this exquisite and extensive collection of madrigals. So suited are they to this repertory that the delight of hearing them sing John Wilbye's &quot;Draw on sweet night&quot; is not unlike that of hearing Dietrich Fischer-Dieskau sing German song or Peter Pears sing the music of Benjamin Britten. \n\nBritish though they are, this ensemble shines all the more in the Italian madrigals of this period, for it is with these madrigals, which represent the pinnacle of madrigal art, that they are able to pull out all of their interpretative stops. Indeed, their dramatic performance of Luca Marenzio's absorbing &quot;Se la mia vita&quot; testifies to how the expressive avenues opened up by the madrigal paved the way for the musical Baroque.\n\nThose who delight in the background music to such period dramas as The Tudors will enjoy this wonderful music, much of which comes from this period.\n","torrent":{"xt":"urn:btih:b1e6c40e70ebc58dab08bfcb6f546f9cdca8b142","amp;dn":"Hilliard+Ensemble+-+English+And+Italian+Renaissance+Madrigals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1e6c40e70ebc58dab08bfcb6f546f9cdca8b142","infoHashBuffer":{"type":"Buffer","data":[177,230,196,14,112,235,197,141,171,8,191,203,111,84,111,156,220,168,177,66]},"announce":[],"urlList":[]}}