{"title":"Structural Chemistry of Inorganic Actinide Compounds","uid":15375073,"size":30461181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3410d295d4cda58b5ea70f61bd937f2e95ec578&amp;dn=Structural+Chemistry+of+Inorganic+Actinide+Compounds&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469183576,"description":"Structural Chemistry of Inorganic Actinide Compounds - Sergey V. Krivovichev et al. (Elsevier, 2007).pdf\r\n\r\nStructural Chemistry of Inorganic Actinide Compounds is a collection of 13 reviews on structural and coordination chemistry of actinide compounds. Within the last decade, these compounds have attracted considerable attention because of their importance for radioactive waste management, catalysis, ion-exchange and absorption applications, etc. Synthetic and natural actinide compounds are also of great environmental concern as they form as a result of alteration of spent nuclear fuel and radioactive waste under Earth surface conditions, during burn-up of nuclear fuel in reactors, represent oxidation products of uranium miles and mine tailings, etc. The actinide compounds are also of considerable interest to material scientists due to the unique electronic properties of actinides that give rise to interesting physical properties controlled by the structural architecture of respective compounds. \r\nThe book provides both general overview and review of recent developments in the field, including such emergent topics as nanomaterials and nanoparticles and their relevance to the transfer of actinides under environmental conditions.\r\n\r\n* Covers over 2,000 actinide compounds including materials, minerals and coordination polymers\r\n* Summarizes recent achievements in the field\r\n* Some chapters reveal (secret) advances made by the Soviet Union during the 'Cold war'","torrent":{"xt":"urn:btih:b3410d295d4cda58b5ea70f61bd937f2e95ec578","amp;dn":"Structural+Chemistry+of+Inorganic+Actinide+Compounds","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3410d295d4cda58b5ea70f61bd937f2e95ec578","infoHashBuffer":{"type":"Buffer","data":[179,65,13,41,93,76,218,88,181,234,112,246,27,217,55,242,233,94,197,120]},"announce":[],"urlList":[]}}