{"title":"Ernest Tubb - The Yellow Rose Of Texas [1954-1960] 5CD","uid":6857461,"size":1852274393,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b46aa812b3fe6b9da39a9fec596ac7f01b207f86&amp;dn=Ernest+Tubb+-+The+Yellow+Rose+Of+Texas+%5B1954-1960%5D+5CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bonnie335","files":287,"time":1322752015,"description":"Ernest Tubb - The Yellow Rose Of Texas [1954-1960] \n\nBear Family Records 5 disc set. Release: 1995. With Covers &amp; Discography\n\n\n\n\nThis five-CD/150-song collection, covering the end of 1954 up through 1960, is the only way to hear any of this material, other than finding his old albums (which isn't such a bad idea). By 1955, Ernest Tubb was one of the most popular and beloved country artists in Nashville, adored by the public and revered by his fellow musicians. His work as host and player on the radio (and short-lived television) broadcasts of the Grand Ole Opry and the Midnight Jamboree, made him a familiar figure to millions, his genial presence punctuated by an easygoing sense of humor. Disc One of this set includes numerous highlights in a wide range of styles. The second disc is more consistent in tone and content, mixing blues and midtempo ballads, most of which are compiled here for the very first time, including four priceless cuts pairing Tubb off with the Wilburn Brothers. By this time, Tubb's backing band included Hank Garland sharing electric lead guitar chores with Grady Martin, with Tommy Jackson still on the fiddle and Floyd Kramer at the piano, and all of it is among the best-played country music of its era. By the fourth disc, Tubb is settling comfortably into musical middle age; the settling down comes not a moment too soon for a man whose second marriage produced its fourth child in 1958, about the same time his first grandchild was born. Disc Five opens with Tubb at his most mature and sophisticated, freely moving between honky tonk, country-pop, and modern country sounds, his voice at its richest. His band, however, is lacking its edge, with lead guitarist Billy Byrd replaced by Leon Rhodes, and the later songs from this period show Tubb slackening off as well, a somewhat less interesting singer and interpreter. ~ Bruce Eder ","torrent":{"xt":"urn:btih:b46aa812b3fe6b9da39a9fec596ac7f01b207f86","amp;dn":"Ernest+Tubb+-+The+Yellow+Rose+Of+Texas+%5B1954-1960%5D+5CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b46aa812b3fe6b9da39a9fec596ac7f01b207f86","infoHashBuffer":{"type":"Buffer","data":[180,106,168,18,179,254,107,157,163,154,159,236,89,106,199,240,27,32,127,134]},"announce":[],"urlList":[]}}