{"title":"Spoons - Collectible (Greatest Hits) 1994 [FLAC] - Kitlope","uid":6806249,"size":421832528,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b4f4b0c72151e879b7f88165fcbf6854130ec94a&amp;dn=Spoons+-+Collectible+%28Greatest+Hits%29+1994+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":18,"time":1320873205,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\n\nTorrent Hash: B4F4B0C72151E879B7F88165FCBF6854130EC94A\nFile Size: 402.29 MB\nYear: 1994\nLabel: MCA\nCatalog #: MCAD-11186\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nSpoons are a Canadian New Wave new romantic synth pop music group, formed in 1979 in Burlington, Ontario. They recorded several Canadian chart hits between 1982 and 1989, and in 1983, they won Group of the Year at the U-Know awards. Their most popular songs include &quot;Romantic Traffic&quot;, &quot;Nova Heart&quot;, &quot;Old Emotions&quot; and &quot;Tell No Lies&quot;.\n\nSpoons was formed in Burlington, Ontario in 1979. The band initially consisted of Gordon Deppe (lead vocals and guitar), Sandy Horne (vocals and bass), Brett Wickens (keyboards, synths) and Peter Shepherd (drums). Deppe, Horne and Wickens attended Aldershot High School, and Deppe and Horne (the only constant members of the band) dated in high school.\n\nIn late 1979, Shepherd left the band and was replaced by Derrick Ross on drums. Spoons then released an independent single, &quot;After the Institution&quot;, in 1980 on Mannequin Records. Shortly thereafter, Wickens left the band to release an electronica album under the pseudonym Ceramic Hello, also on Mannequin Records, and later became a graphic designer designing album covers for such artists as Peter Gabriel. He was replaced by keyboardist Rob Preuss, who was only fifteen when he joined Spoons.\n\nThe band's first album, Stick Figure Neighbourhood, was released in 1981, and is notable for being one of the earliest New Wave albums engineered by Daniel Lanois.\n\nThe following year, Spoons released their breakthrough album Arias &amp; Symphonies. This album spawned three Top 40 hits in Canada: &quot;Nova Heart&quot;, &quot;Arias &amp; Symphonies&quot;, and &quot;Smiling in Winter&quot;. All were dance-oriented New Wave hits.\n\nAround this time, Spoons' higher profile allowed them to become the opening act for bands such as Culture Club, Simple Minds, and The Police.\n\nSpoons' 1983 album, Talkback was produced by Nile Rodgers. Rodgers had actually been approached to produce tracks for Culture Club, but after seeing them in concert, he was unimpressed with that band's reliance on backing tapes -- he was, however, taken with the Spoons opening set, and elected to produce them instead. The Talkback album included the hit &quot;Old Emotions&quot;. Following that, the band expanded their sound somewhat, releasing a two-sided hit in 1984 with &quot;Tell No Lies&quot; b/w &quot;Romantic Traffic&quot;, also produced by Rodgers. The upbeat &quot;Tell No Lies&quot; featured a more mainstream pop sound than was customary for Spoons, while &quot;Romantic Traffic&quot; was a downtempo song with adult contemporary leanings that would become the group's most enduring hit.\n\nBoth &quot;Tell No Lies&quot; and &quot;Romantic Traffic&quot; later found their way onto the soundtrack for the film Listen to the City, in which Horne was featured in a supporting role. However, Listen to the City was not an official Spoons album, as it consisted largely of instrumental music and was credited solely to Gordon Deppe.\n\nIn 1985 both Preuss and Ross left Spoons, and were replaced by Scott MacDonald (keyboards) and Steve Kendry (drums), respectively. The band also switched from New Wave imprint Ready Records, which had folded after the release of Listen to the City, to the more rock-oriented Anthem Records label. Accordingly, Spoons' 1986 single &quot;Bridges Over Borders&quot; marked a departure from their characteristic sound and showcased a harder rock orientation, as did later single &quot;Rodeo&quot;.\n\nThe new Spoons line-up released the album Bridges Over Borders in 1986, but was a commercial disaster as it did not chart in the Canadian Top 100, nor did any of the three singles pulled from the LP. The follow-up LP Vertigo Tango reunited the band with Arias &amp; Symphonies producer John Punter, and was a partial return to the band's New Wave roots. The album featured the band's final hit single, &quot;Waterline&quot; (1989), a languid, introspective ballad.\n\nSpoons took a break from recording in the 1990s to allow time to focus on family, but Deppe and Horne, along with various other players, reunited for several Spoons reunion gigs in the 1990s and into the next decade. In 2007, Spoons released Unexpected Guest at a Cancelled Party, a collection of previously unreleased material recorded between 1982 and 1985 by the Deppe, Horne, Preuss, Ross line-up.\n\n2008 saw the release of &quot;Limited Edition&quot; which is a greatest-hits of sorts and was released on the Ready Records Imprint to replace the out-of-print &quot;Collectible Spoons.&quot;\n\nThe band continues to play occasional shows in the Toronto and Hamilton area. At the Woodbine Park Summerfest for Vinyl 95.3, the band released their first new studio work in over 20-years - the double A-Side &quot;Imperfekt/Breaking In&quot; which was limited to 100 copies.\n\nIn the Spring of 2010, a Spoons lineup of Deppe &amp; Horne, with producer Jeff Carter, began recording their sixth studio album, &quot;Static in Transmission&quot;. The first single released from these sessions was the aforementioned limited-edition &quot;imperfekt&quot; b/w &quot;Breaking In&quot;. The release date for &quot;Static in Transmission&quot; was March 29, 2011. In March, 2011, the band began filming for the first single to go to radio for the album, &quot;You Light Up&quot;, which is being created by the band's former Keyboardist, Stephen Sweeney. To promote the new album, a tour is expected with Casey MQ on keyboards and Chris McNeill on drums. \n\n\n\n\n\nCollectible 1994\n\n\nCollectible Spoons is a greatest hits collection by the Burlington band Spoons. It includes material from their first four albums on Ready Records (including a couple tracks from their lesser-known debut album Stick Figure Neighbourhood), but ignores the last two (much more guitar-driven) albums, Bridges Over Borders and Vertigo Tango on Anthem Records. This is currently the only widely available Spoons album on CD. The photo on the front of the album is taken in the CN Tower's Space Deck.\n\n\nTracks: \n\n\n1.\t&quot;Trade Winds&quot; (Gordon Deppe) - 2:15\n2.\t&quot;Nova Heart&quot; (Deppe) - 4:24\n3.\t&quot;Arias &amp; Symphonies&quot; (Deppe) - 4:47\n4.\t&quot;Smiling in Winter&quot; (Deppe, Sandy Horne) - 3:48\n5.\t&quot;Romantic Traffic&quot; (Deppe, Rob Preuss) - 3:33\n6.\t&quot;Tell No Lies&quot; (Deppe) - 2:54\n7.\t&quot;Talk Back&quot; (Deppe, Preuss) - 4:36\n8.\t&quot;Old Emotions&quot; (Deppe, Horne) - 3:41\n9.\t&quot;The Rhythm&quot; (Deppe, Horne) - 4:06\n10.\t&quot;Red Light&quot; (Deppe) - 4:39\n11.\t&quot;Conventional Beliefs&quot; (Deppe) - 3:52\n12.\t&quot;One in Ten Words&quot; (Deppe, Preuss) - 4:09\n13.\t&quot;Blow Away&quot; (Deppe) - 5:57\n14.\t&quot;Nova Heart (extended mix)&quot; - 6:41\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:b4f4b0c72151e879b7f88165fcbf6854130ec94a","amp;dn":"Spoons+-+Collectible+%28Greatest+Hits%29+1994+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f4b0c72151e879b7f88165fcbf6854130ec94a","infoHashBuffer":{"type":"Buffer","data":[180,244,176,199,33,81,232,121,183,248,129,101,252,191,104,84,19,14,201,74]},"announce":[],"urlList":[]}}