{"title":"BBC Empire of the Tsars; Romanov Russia with Lucy Worsley 1 of 3","uid":13163753,"size":1174387160,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b5605b4ec672f5a518960a0c04fe305ad5290a0b&amp;dn=BBC+Empire+of+the+Tsars%3B+Romanov+Russia+with+Lucy+Worsley+1+of+3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":1,"time":1452184309,"description":"58:58\r\n\r\nLucy Worsley travels to Russia to tell the extraordinary story of the dynasty that ruled the country for more than three centuries. It's an epic tale that includes giant figures such as Peter the Great and Catherine the Great, the devastating struggle against Napoleon in 1812, and the political murders of Nicholas II and his family in 1918 which brought the dynasty to a brutal end.\r\n\r\nIn this first episode, Lucy investigates the beginning of the Romanovs' 300-year reign in Russia. In 1613, when Russia was leaderless, 16-year-old Mikhail Romanov was plucked from obscurity and offered the crown of Russia. Mikhail was granted absolute power and began the reign of the Romanovs as the most influential dynasty in modern European history.\r\n\r\nLucy also charts the story of Peter the Great, the ruthless and ambitious tsar who was determined to modernise Russia at the end of the 17th century. Lucy traces Peter's accession to the throne as a nine-year-old, when he witnessed a revolt led by royal guards and the slaughter of his uncles and close advisors. Sixteen years later, Peter would vengefully execute a thousand rebellious guards. Throughout his reign, Peter would demonstrate an unwavering commitment to establishing Russia as a naval power - Lucy explores the lengths to which Peter would go to ensure this became a reality, including the creation of a new maritime capital, St Petersburg.\r\n\r\nLucy shows how the Romanovs embraced and sponsored the arts on an astonishing scale - from building spectacular palaces to commissioning grand artworks - that all still dazzle today.\r\n\r\nAs well as studying this unique royal family, Lucy also considers the impact the Romanovs had on the lives of ordinary Russians, who were often little better than slaves to the elite.\r\n\r\nSource: BBC FOUR TS[MPEG/MPA] DDD\r\n\r\n\r\n\r\nMPEG 576i (CUVID HW Deinterlace) &gt; x264 (High @L3.1) 2pass 720*576 (1.09Gb) approx. 2.46Mbps\r\nMPA 224Kbps 48Khz &gt; AC3 192Kbps 48Khz\r\nselectable SRT English CC Subtitles\r\n\r\nSize: 1/4 DVD\r\n\r\nEnjoy,\r\n\r\nPls help seed to keep torrent alive","torrent":{"xt":"urn:btih:b5605b4ec672f5a518960a0c04fe305ad5290a0b","amp;dn":"BBC+Empire+of+the+Tsars%3B+Romanov+Russia+with+Lucy+Worsley+1+of+3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5605b4ec672f5a518960a0c04fe305ad5290a0b","infoHashBuffer":{"type":"Buffer","data":[181,96,91,78,198,114,245,165,24,150,10,12,4,254,48,90,213,41,10,11]},"announce":[],"urlList":[]}}