{"title":"Pere Portabella - Cuadecuc, vampir (1971)","uid":7691505,"size":992387243,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b5f2f80f6ce88223b93b863611fa8c95ebe621e8&amp;dn=Pere+Portabella+-+Cuadecuc%2C+vampir+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mfccorrea","files":4,"time":1349264662,"description":"Vampir-Cuadecuc is a 1970 experimental feature film by Catalan filmmaker Pere Portabella. The entire film is photographed on high contrast black &amp; white film stock, which gives it the appearance of a degraded film print, evoking early Expressionist horror films such as F. W. Murnau's Nosferatu or Carl Theodor Dreyer's Vampyr. It was shot on the set of Jesus Franco's Count Dracula, starring Christopher Lee and Herbert Lom. The sound track is by frequent Portabella collaborator Carles Santos, and the only spoken dialogue in the film appears only in the last scene, which features Lee reading from Bram Stoker's original novel.\n\nThe film tells an abbreviated version of the Dracula story using behind-the-scenes footage from Count Dracula. Thus, we see crew members and lights in dramatic scenes; often, these scenes are preceded by sequences where we see the set and actors being prepared. For example, before Dracula is shown rising from his coffin, Christopher Lee is seen getting made up and climbing into the coffin as a crew member covers him in fake spiderwebs. This gives the film a humorous tone: scenes meant to shock in Jesus Franco's original film are intercut with the actors making faces between takes and fooling around with the crew.\n\nThe film was considered very subversive at the time of its release; many identify Christopher Lee's Dracula with Francisco Franco. By showing the almost campy falseness that goes into creating the &quot;frightening&quot; image of Dracula (Portabella often focuses on the poorly-made special effects and the shoddy filming conditions), the filmmakers lampoon the similarly transparent efforts of dictators like Franco to create powerful images of themselves in the media.\n\nRip specs:\n\n   General\n      Complete name : Cuadecuc, Vampir.mkv\n      Format : Matroska\n      File size : 946 MiB\n      Duration : 1h 6mn\n      Overall bit rate : 1 997 Kbps\n   Video #1\n      Codec ID : V_MPEG4/ISO/AVC\n      Bit rate : 1 766 Kbps\n      Width : 766 pixels\n      Height : 576 pixels\n      Display aspect ratio : 4:3\n      Frame rate : 25.000 fps\n   Audio #2\n      Codec ID : A_AC3\n      Bit rate mode : Constant\n      Bit rate : 192 Kbps\n      Sampling rate : 48.0 KHz\n      Language : English\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0066517/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0066517/&lt;/a&gt;\n\nEnglish audio (few words); French, Spanish and Portuguese subtitles\n\nMy rip","torrent":{"xt":"urn:btih:b5f2f80f6ce88223b93b863611fa8c95ebe621e8","amp;dn":"Pere+Portabella+-+Cuadecuc%2C+vampir+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5f2f80f6ce88223b93b863611fa8c95ebe621e8","infoHashBuffer":{"type":"Buffer","data":[181,242,248,15,108,232,130,35,185,59,134,54,17,250,140,149,235,230,33,232]},"announce":[],"urlList":[]}}