{"title":"Francis: Man of Prayer - Mario Escobar - Audiobook MP3","uid":10706664,"size":126269123,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b61a463cfb22bb77a39e83248d437fd5509f9f9b&amp;dn=Francis%3A+Man+of+Prayer+-+Mario+Escobar+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1407300314,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nFrancis: Man of Prayer\n\nWritten by: Mario Escobar\nNarrated by: Eduardo Gumucio\nLength: 4 hrs and 22 mins\nFormat: Unabridged\nRelease Date:06-05-13\n\nFirst Jesuit. First Latin American. And a new pope who chose as his first act a simple request: please pray for me. The recent resignation of Pope Benedict XVI took the world by surprise and for good reason. More than 600 years had passed since a pope last left his post. Jorge Mario Bergoglio, now Pope Francis, is a man of prayer, a man of action, and a humble man who has always promoted others over himself. In fact, it was Bergoglio who bowed out of the running in the papal election of 2005 to facilitate the rise of Benedict XVI.\n\nHowever, the new pope faces a Catholic Church in crisis - a church that has lost the media pull of John Paul II and is still hounded by pedophile scandals and the filtration of documents from former papal administrations. His first year may not be an easy one, but neither this man nor the church itself has ever shied away from the challenges thrust upon them. Pope Francis is austere and simple but has vast theological training. He is a man of his time but one who also travels by subway and bus just like any other citizen.\n\nTirelessly fighting poverty and marginalization, he is a beacon of hope for the poor, persecuted sectors of the church. Has a Catholic spring finally arrived after a very long winter? Francis is the complete biography of a humble man who has suddenly become one of the most powerful and influential men on the planet. ","torrent":{"xt":"urn:btih:b61a463cfb22bb77a39e83248d437fd5509f9f9b","amp;dn":"Francis%3A+Man+of+Prayer+-+Mario+Escobar+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b61a463cfb22bb77a39e83248d437fd5509f9f9b","infoHashBuffer":{"type":"Buffer","data":[182,26,70,60,251,34,187,119,163,158,131,36,141,67,127,213,80,159,159,155]},"announce":[],"urlList":[]}}