{"title":"Textbook of Radiographic Positioning and Related Anatomy, 8E [St","uid":11175662,"size":268861058,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6ddc81109940993df6774dc06ecaa74e3aacf86&amp;dn=Textbook+of+Radiographic+Positioning+and+Related+Anatomy%2C+8E+%5BSt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":-1,"time":1412781033,"description":"TITLE/EDITION Textbook of Radiographic Positioning and Related Anatomy, 8e \nAuthor: Kenneth L. Bontrager MA RT(R) (Author), John Lampignano MEd RT(R) (CT) (Author)\nSeries: Textbook of Radiographic Positioning and Related Anatomy\nHardcover: 848 pages\nPublisher: Mosby; 8 edition (February 21, 2013)\nLanguage: English\nISBN-10: 0323083889\nISBN-13: 978-0323083881\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nFocusing on one projection per page, Textbook of Radiographic Positioning and Related Anatomy, 8th Edition includes all of the positioning and projection information you need to know in a clear, bulleted format. Positioning photos, radiographs, and anatomical images, along with projection and positioning information, help you visualize anatomy and produce the most accurate images. With over 200 of the most commonly requested projections, this text includes all of the essential information for clinical practice.\n\nLists and definitions of the most common pathologies likely to be encountered during specific procedures helps you understand the whole patient and produce radiographs that will make diagnosis easier for the physician.\nLabeled radiographs identify key radiographic anatomy and landmarks to help you determine if you have captured the correct diagnostic information on your images.\nEvaluation Criteria for each projection provide standards for evaluating the quality of each radiograph and help you produce the highest quality images.\nClinical Indications sections explain why a projection is needed or what pathology is demonstrated to give you a better understanding of the reasoning behind each projection.\nIncreased emphasis on digital radiography keeps you up to date with the most recent advances in technology.\nCompletely updated content offers expanded coverage of important concepts such as, digital imaging systems, updated CT information and AART exam requirements.\nMore CT procedures with related sectional images, especially for areas such as skull and facial bones, reflect the shift in the field from conventional radiography to CT.\nUpdated art visually demonstrates the latest concepts and procedures with approximately 500 new positioning photos and 150 updated radiographic images.\nAdditional critique images provide valuable experience analyzing images to prepare you to evaluate your own images in the practice environment.\nUpdated Technique and Dose boxes reflect the higher kV now recommended for computed and digital radiography.\nImaging Wisely program information from ASRT provides protocols to minimize radiation exposure during digital procedures.\nThe latest standards for computed radiography and digital radiography (CR/DR) from the American Association of Physicists in Medicine ensures you are current with today's procedures and modalities.","torrent":{"xt":"urn:btih:b6ddc81109940993df6774dc06ecaa74e3aacf86","amp;dn":"Textbook+of+Radiographic+Positioning+and+Related+Anatomy%2C+8E+%5BSt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6ddc81109940993df6774dc06ecaa74e3aacf86","infoHashBuffer":{"type":"Buffer","data":[182,221,200,17,9,148,9,147,223,103,116,220,6,236,170,116,227,170,207,134]},"announce":[],"urlList":[]}}