{"title":"Under The Dome Episode 13 (720p)","uid":10726387,"size":231606550,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b6e0173d8777172968fbddf09249254a0988032f&amp;dn=Under+The+Dome+Episode+13+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shareregi","files":2,"time":1407568524,"description":"The monarch hatches, and the butterfly starts flying around inside the mini dome violently and creating expanding black spots where it crashes against the surface. These spots are mirrored in the big dome and begin to expand until both domes are jet black, casting the town into permanent darkness. Joe suggests the four touch the dome, but Linda cuts in, stating the egg is police property; the four choose not to stop her, knowing she will be knocked unconscious allowing them to escape. Junior, Angie, Joe, and Norrie then touch the dome together, the mini dome shatters releasing both the Egg and butterfly, and at first it seems to hover round their prime candidate for Monarch, Barbie, but finally, they discover that the Monarch is Julia. They receive a visit from one of the dome's people who looks like Alice. The visitor states that they have taken human form to &quot;bridge the divide&quot;, and that the reason for the dome is &quot;to protect them&quot;. When they ask from what, the reply is &quot;you will see, in time&quot;. They also discover that they must earn the light by keeping the egg safe. Barbie then gets captured by Junior. Big Jim thinks that his family are the chosen ones because his mentally ill wife had been painting pink stars and eggs in her last days before suicide, indicating she had some knowledge of things to come. When Junior confronts him, he admits that he has actually committed the killings he accused Barbie of, but just to save the town. They put Barbie in a noose and then Julia has to choose to save the egg and the lives of the entire town, or save Barbie by giving the egg to Big Jim within one hour. She accepts the responsibility of the title Monarch and chooses the egg (and the lives of everybody in the dome) and protects it by throwing it into the lake. The egg starts to glow, and the pink stars rise to the sky. Big Jim says the Lord is blessing the hanging, the stars continue to rise and remove the dark black &quot;curtain&quot;, replacing it with a curtain of piercing bright white light, increasing in intensity until things start to fade to white. Junior seeks guidance from his dad, who continues to tell him to pull the lever.","torrent":{"xt":"urn:btih:b6e0173d8777172968fbddf09249254a0988032f","amp;dn":"Under+The+Dome+Episode+13+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6e0173d8777172968fbddf09249254a0988032f","infoHashBuffer":{"type":"Buffer","data":[182,224,23,61,135,119,23,41,104,251,221,240,146,73,37,74,9,136,3,47]},"announce":[],"urlList":[]}}