{"title":"Watchmen.[1-12].[.cbz].[X0.]","uid":5503221,"size":208026611,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b7555be582478749c85b87c06f9df5eb5afd92f4&amp;dn=Watchmen.%5B1-12%5D.%5B.cbz%5D.%5BX0.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xosuitehearts","files":-1,"time":1271661962,"description":"*******************************\n*ALL FILES ARE IN .CBZ FORMAT.*\n*******************************\n\nHOW TO OPEN .CBZ FILES: http://comical.sourceforge.net/\n\nDownload &quot;Comical&quot; .cbz .cbr viewer, then you're set to go\n\n~X0.\n-----------------------------------------------------------------\n\nWatchmen is a twelve-issue comic book limited series created by writer Alan Moore, artist Dave Gibbons, and colorist John Higgins. The series was published by DC Comics during 1986 and 1987, and has been subsequently reprinted into collected form. Watchmen originated from a story proposal Moore submitted to DC featuring superhero characters that the company had acquired from Charlton Comics. As Moore's proposed story would have left many of the characters unusable for future stories, managing editor Dick Giordano convinced the writer to create original characters instead.\n\nMoore used the story as a means to reflect contemporary anxieties and to critique the superhero concept. Watchmen takes place on an alternate history Earth where superheroes emerged in the 1940s and 1960s, helping the United States to win the Vietnam War. The country is edging closer to a nuclear war with the Soviet Union, freelance costumed vigilantes have been outlawed and most costumed superheroes are in retirement or working for the government. The story focuses on the personal development and struggles of the protagonists as an investigation into the murder of a government sponsored superhero pulls them out of retirement, and eventually leads them to confront a plot to stave off nuclear war by killing millions of people.\n\nCreatively, the focus of Watchmen is on its structure. Gibbons used a nine-panel grid layout throughout the series and added recurring symbols such as a blood-stained smiley. All but the last issue feature supplemental fictional documents that add to the series' backstory, and the narrative is intertwined with that of another story, a fictional pirate comic titled Tales of the Black Freighter, which one of the characters reads. Structured as a nonlinear narrative, the story skips through space, time and plot. Watchmen has received critical acclaim both in the comics and mainstream press, and is regarded by critics as a seminal text of the comics medium. After a number of attempts to adapt the series into a feature film, director Zack Snyder's Watchmen was released in 2009.  ","torrent":{"xt":"urn:btih:b7555be582478749c85b87c06f9df5eb5afd92f4","amp;dn":"Watchmen.%5B1-12%5D.%5B.cbz%5D.%5BX0.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7555be582478749c85b87c06f9df5eb5afd92f4","infoHashBuffer":{"type":"Buffer","data":[183,85,91,229,130,71,135,73,200,91,135,192,111,157,245,235,90,253,146,244]},"announce":[],"urlList":[]}}