{"title":"Ah Boys To Men Part 1 [DVDRip] [XviD] [UNCOMPRESSED]","uid":8465914,"size":1324598750,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b79c7cc5b586d0c91946bde52c7055e3f2168182&amp;dn=Ah+Boys+To+Men+Part+1+%5BDVDRip%5D+%5BXviD%5D+%5BUNCOMPRESSED%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"trynothingy","files":-1,"time":1368352544,"description":"  .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-\n / /   / /   / /   / /   / /   / /   / /   / / \n`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'\n\nTITLE.........[ Ah Boys To Men\nYEAR..........[ 2012\nRUNTiME.......[ 1:48:14\n\nAUDiO.........[ 48000Hz  128 kb/s tot , stereo (2/0) \nLANGUAGE......[ English/Mandarin       \nVIDEO.........[ 2904 kbps XviD ISO MPEG-4 25.000 FPS\nRESOLUTiON....[ 720 x 414\nDAR...........[ 1.739 (40:23)\nQUALiTY FRAME.[ 0.201\nSUBS..........[ English\nSIZE..........[ 1.23 GB\nSUBTITLE......[ ENGlISH HARDCODED\n\n\nMovie details:\nPart one of Ah Boys to Men opens with the Republic of Singapore apparently being under an immense invasion from a fictional army, with iconic Singaporean landmarks (such as the Merlion and the Esplanade) coming under fire and many civilians killed brutally. It is later revealed that the war was fictitious setting of a war-based role-playing game played by Ken Chow (Joshua Tan), a rich and spoiled child reluctant to enlist into National Service. Ken plans to study abroad with his girlfriend Amy (Qiu Qiu), but his plans are derailed by NS. After being chided by Amy for his childishness, Ken kicks down a nearby rubbish bin, to be apprehended by two policemen in the vicinity. A disappointed and embarrassed Amy walks away.\nBack home, after being driven back by his father (Richard Low), Ken confides to his parents about his fears of National Service. His overprotective mother (Irene Ang) decides to help him think of ways to defer, but to no avail. Eventually, they are all forced to face the hard truth - there is no going against the law. The Chow family sadly send off Ken on the day of his enlisting. Thereafter, Ken and a few other recruits are assigned to Ninja Company (Platoon 2, Section 2) and are sent to their bunk and introduced to their Platoon Sergeant (Tosh Zhang), a portrayal of the tough-nails sergeant stereotype. Whilst waiting for the mandatory haircut, Ken gets to know a few people - &quot;Lobang&quot; (Wang Wei Liang), Aloysius Jin Sia-lan [Sia-lan being a reference to a crude Hokkien slang term meaning extreme disgrace] (Maxi Lim) and &quot;I.P. Man&quot; (Noah Yap).\nAfter a two weeks' worth of training, Ken and the other recruits are allowed to book out. A lavish party is thrown to celebrate Ken's return, but his mood is ruined when he is shown a photo of his girlfriend with another man. Ken angrily confronts her and demands that they meet, which she agrees to. She later admits that she has fallen for another man and dumps Ken on the highway. Determined to win her back, Ken devises a plan to escape from Pulau Tekong and send her off, for he feels she is merely just testing him. Ken stops drinking water, in hopes to get a heat stroke, for which he would be sent home for ten days; he takes the extra measure of sleeping under a ceiling-fan after dousing himself in cold water. However, he gets into a situation worse than expected and he is quickly sent off to a hospital after collapsing during training. Ken's father is alerted of his son's critical condition while in a company meeting. He quickly drives off to the hospital, but the shock and strain is too much and he suffers a heart attack while driving and violently collides with another vehicle.\nKen wakes up in the next scene, surrounded by his two sisters, in a hospital ward. He realises his foolish actions have caused much trouble for many people and cannot bear to face his father, who has survived the car crash and is recuperating in another ward in the same hospital. Awakened to reality, Ken is finally fit enough to go back to training. The episode ends at this junction, and snippets of the next episode are shown.","torrent":{"xt":"urn:btih:b79c7cc5b586d0c91946bde52c7055e3f2168182","amp;dn":"Ah+Boys+To+Men+Part+1+%5BDVDRip%5D+%5BXviD%5D+%5BUNCOMPRESSED%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b79c7cc5b586d0c91946bde52c7055e3f2168182","infoHashBuffer":{"type":"Buffer","data":[183,156,124,197,181,134,208,201,25,70,189,229,44,112,85,227,242,22,129,130]},"announce":[],"urlList":[]}}