{"title":"Black Anal Beauties [ButtMan] - (720p)","uid":14358003,"size":6865071303,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b896cdc2dd8bd6637754ef2546e110d05ad141df&amp;dn=Black+Anal+Beauties+%5BButtMan%5D+-+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"distinc","files":11,"time":1461070527,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=7825812786\r\n \nhttp://imagedisco.net/?g=5301983128\r\n\r\n\r\n\r\nPlot:\r\n\r\nIn Mike Adriano`s Black Anal Beauties, four gorgeous, black sistas go one-on-one with the ass-obsessed king of POV+, indulging in deep, intimate anal worship, face-fucking and ass-to-mouth fun. This DVD, released on the Buttman Magazine Choice imprint, explores a special brand of WM/BF interracial porn we don`t see enough of! Petite, 18-year-old stunner Megan Vaughn is eager to please, and she repeatedly declares her love for all forms of anal play before gagging and drooling on Mike`s big white cock. He slides four fingers deep inside Megan`s dark bunghole, following it with his prick, and lets her experience the flavor of her own ass by sucking his dick again. Megan`s ass is smeared with baby oil and her throat fucked before she`s fed a thick load of the director`s cum; she swallows it all.Sophisticated slut Imani Rose is a shorthaired cutie with an all-natural body and some serious sexual skills. In her first-ever interracial scene, Imani gives Mike a messy, salivating blowjob and gets her big, round honey muffin greased up, drilled by Mike`s sizable dick and splattered with his semen.Evanni Solei is a super-fine teenager with a slender, petite frame that includes a respectable pair of natural boobs and a perfect, cushiony ass. She gets it invaded with a rubber toy, pushes it out with her talented sphincter, then takes Mike`s cock in her ass and mouth, and even jacks his shaft between her fine tits. Evanni`s oily buttocks receive a hot spray of jizz for all her hard work.And big-assed starlet Nyomi Banxxx gets her big, round rack worshipped and her black browneye expanded in a scene that includes more oily visuals, ass-to-mouth flavor, throat-gagging blowjobbery and tit-fucking. Interracial ass play will unite the world!","torrent":{"xt":"urn:btih:b896cdc2dd8bd6637754ef2546e110d05ad141df","amp;dn":"Black+Anal+Beauties+%5BButtMan%5D+-+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b896cdc2dd8bd6637754ef2546e110d05ad141df","infoHashBuffer":{"type":"Buffer","data":[184,150,205,194,221,139,214,99,119,84,239,37,70,225,16,208,90,209,65,223]},"announce":[],"urlList":[]}}