{"title":"Ethical Oil: The Case for Canada's Oil Sands - Ezra Levant","uid":9517018,"size":4330127,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8b33def4da6b8f2323aea7b73e94308c0e2075c&amp;dn=Ethical+Oil%3A+The+Case+for+Canada%27s+Oil+Sands+-+Ezra+Levant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Rustgold","files":5,"time":1390543775,"description":"Format: Searchable PDF, mobi, epub, rtf \n\n\nCanada's &quot;no. 1 defender of freedom of speech&quot; and the bestselling author of Shakedown makes the timely and provocative case that when it comes to oil, ethics matter just as much as the economy and the environment.\n\nIn 2009, Ezra Levant's bestselling book Shakedown revealed the corruption of Canada's human rights commissions and was declared the &quot;most important public affairs book of the year.&quot; In Ethical Oil, Levant turns his attention to another hot-button topic: the ethical cost of our addiction to oil. While many North Americans may be aware of the financial and environmental price we pay for a gallon of gas or a barrel of oil, Levant argues that it is time we consider ethical factors as well. With his trademark candor, Levant asks hard-hitting questions: With the oil sands at our disposal, is it ethically responsible to import our oil from the Sudan, Russia, and Mexico? How should we weigh carbon emissions with human rights violations in Saudi Arabia? And assuming that we can't live without oil, can the development of energy be made more environmentally sustainable? In Ethical Oil, Levant exposes the hypocrisy of the West's dealings with the reprehensible regimes from which we purchase the oil that sustains our lifestyles, and offers solutions to this dilemma. Readers at all points on the political spectrum will want to read this timely and provocative new book, which is sure to spark debate.\n\n\n","torrent":{"xt":"urn:btih:b8b33def4da6b8f2323aea7b73e94308c0e2075c","amp;dn":"Ethical+Oil%3A+The+Case+for+Canada%27s+Oil+Sands+-+Ezra+Levant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8b33def4da6b8f2323aea7b73e94308c0e2075c","infoHashBuffer":{"type":"Buffer","data":[184,179,61,239,77,166,184,242,50,58,234,123,115,233,67,8,192,226,7,92]},"announce":[],"urlList":[]}}