{"title":"Evil.Anal.20.XXX.DVDRip.x264-XCiTE","uid":9569777,"size":1905316151,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b8e5e2a3bb7dd6ac4a4135b9d8ba289c306df65b&amp;dn=Evil.Anal.20.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"xxxlavalxxx","files":5,"time":1391606808,"description":"World-class pervert and legendary superstud Manuel Ferrara knows what bad girls crave. The notorious French-American director has built his career on servicing the needs of gorgeous women particularly those that love huge cock in their tight assholes! a milestone in Manuels long-running butt sex series, and the four-scene edition showcases in brand new scenes some of the most stunning girls hes ever sodomized. Busty blonde beauty Alexis Monroe hungrily devours Manuels enormous cock, stroking his heavy balls. He sinks his massive dick deep inside the sultry sluts tight rectum. Alexis worships his prick ass-to-mouth, rims his bunghole and enjoys a huge, messy mouthful of sperm. Stacked, fishnet-clad stripper Aleksa Nicole shows off her killer curves and phat, meaty ass and takes Manuels four fingers deep in her tight bunghole. She worships the directors meat with gagging, deep-throat panache and eagerly rides his huge pole until her sphincter gapes. Athletic, busty bombshell Krissy Lynn works out, toning her huge, meaty ass in the gym, and sucks Manuels enormous, uncut prick and balls in a loving, POV-style blow job. He chokes Krissy while passionately fucking her fine booty and finally showers her with hot cum. Cute Bailey Blue and petite sweetheart Trinity St. Clair employ sphincter-stretching toys and curious tongues, even going ass-to-ass with a long double-dong, until Manuel invades them with his giant penis. The sinful sluts are in for a butt-load of anal pleasure!\n\nAlexis Monroe, Aleska Nicole, Krissy Lynn, Trinity St. Clair, Bailey Blue.\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=39257294305658238336.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=39257294305658238336.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=31797697791712874032.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=31797697791712874032.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:b8e5e2a3bb7dd6ac4a4135b9d8ba289c306df65b","amp;dn":"Evil.Anal.20.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8e5e2a3bb7dd6ac4a4135b9d8ba289c306df65b","infoHashBuffer":{"type":"Buffer","data":[184,229,226,163,187,125,214,172,74,65,53,185,216,186,40,156,48,109,246,91]},"announce":[],"urlList":[]}}