{"title":"Satan Exposed - Jeff L. Dial","uid":11773429,"size":379510,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b93c30e8e45b17ed1a41665f8a2d94953ed5a70d&amp;dn=Satan+Exposed+-+Jeff+L.+Dial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427167707,"description":"\nSATAN EXPOSED - A Bible Study of Repentance and Lordship Salvation\n\nMost Christians today have their full attention on the religious, social, moral, political, and economic issues of our world today. While Christians everywhere are debating these issues, the devil continues his subtle and deceitful attack on the gospel of the grace of God. Far above anything else the devil is doing today, his top priority is to add good works to the plan of salvation. Unfortunately, the hearts and minds of many Christians are blind to the devil?s evil schemes by which he damns souls to Hell every day.\n\nThis Bible study exposes how the devil has successfully added good works to the plan of salvation. This study also shows how the devil deceives many Bible preachers and teachers into supporting works salvation through an incorrect de\u001f nition of the term ?repentance? and the heresy that has become widely known in our day as ?lordship salvation.?\n\nIn this work you will see how the devil has been busy perverting the gopsel and using well meaning but misguided Christians to keep sinners from the free gift of salvation. Our prayer is that the Lord will be glorified as another one of our enemies tacticts is exposed","torrent":{"xt":"urn:btih:b93c30e8e45b17ed1a41665f8a2d94953ed5a70d","amp;dn":"Satan+Exposed+-+Jeff+L.+Dial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b93c30e8e45b17ed1a41665f8a2d94953ed5a70d","infoHashBuffer":{"type":"Buffer","data":[185,60,48,232,228,91,23,237,26,65,102,95,138,45,148,149,62,213,167,13]},"announce":[],"urlList":[]}}