{"title":"Gordon Downie (of Tragically Hip) - Discography [FLAC] Kitlope","uid":6197752,"size":975524293,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b992539798551f7f65265abd8332d4a8fc239c5f&amp;dn=Gordon+Downie+%28of+Tragically+Hip%29+-+Discography+%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":49,"time":1298498411,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA (LG GH24LS50 for The Grand Bounce)\nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: B992539798551F7F65265ABD8332D4A8FC239C5F\nFile Size: 930.33 MB\nLabel: Zoe, Rounder\n\n\nAlbum, Years &amp; Catalog # in this Torrent: \n\n\nCoke Machine Glow 2001 7697422112 *\nBattle of the Nudes 2003 MRCD 6411 *\nThe Grand Bounce 2010 0252734824 *\n\n\n\n* Denotes My Rip\n\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nGordon Downie (born February 6, 1964) is a Canadian rock musician, writer and occasional actor. He is the lead singer and lyricist for the Canadian rock band The Tragically Hip. He has released three solo albums, Coke Machine Glow in 2001, Battle of the Nudes in 2003; and The Grand Bounce in 2010. Coke Machine Glow was sold along with a book of poetry of the same name, included with the CD. Canadian indie band The Dinner Is Ruined plus Julie Doiron and Josh Finlayson, called The Country of Miracles, served as his backing band for all three solo albums.\n\nDownie was born in Amherstview, Ontario.[1] He is the godson of former Boston Bruins general manager and coach Harry Sinden.[2] He attended Ernestown Secondary School (Odessa, Ontario) in grade nine and part of grade ten. He graduated from Kingston Collegiate and Vocational Institute in 1982, a school also attended by his band-mates. Downie then studied film at Queen's University in Kingston.[3] Downie was a minor league hockey goalie and played for an Ontario championship winning Bantam level team in 1979.\n\nComparisons have been drawn between Gordon Downie and Michael Stipe of R.E.M. because both are known for writing intelligent, eclectic, and introspective lyrics, the meaning of which are often difficult to decipher, and also because they share similar performing styles.[4][5][6][7]\n\nDownie has cameo appearances in Men with Brooms, in which The Tragically Hip play a curling team. Downie also made a cameo appearance in the 2008 indie drama Nothing Really Matters, directed by Jean-Marc PichÃƒÂ©. Downie also appears in the Trailer Park Boys movie The Big Dirty, in which he and Alex Lifeson play a pair of police officers. More recently, he and other members of the band can be seen in the final episode of Trailer Park Boys, entitled &quot;Say Goodnight to the Bad Guys&quot;, in which he is harassed while eating a bologna sandwich at a singles dance. Downie is also featured in the sitcom Corner Gas in the episode &quot;Rock On!&quot; in which The Tragically Hip are shown as a local band practising in the main character's garage. Colin James is also featured in the same episode. Most recently, Downie appeared in Michael McGowan's film, One Week as a pot smoking philosopher alongside fellow Canadian Joshua Jackson.\n\nDownie is mentioned in the second volume of the Scott Pilgrim series of graphic novels, Scott Pilgrim Vs. the World. In it, the title character and his friend listen to one of Downie's solo albums, and repeatedly describe him as &quot;a genius&quot;.\n\nDownie worked with fellow Canadian band City and Colour to contribute vocals on the track &quot;Sleeping Sickness&quot; for the album, Bring Me Your Love.\n\nDownie is a trustee of Lake Ontario through his support of the Waterkeeper Alliance.\n\n\n\n\n\n\n\n\nCoke Machine Glow 2001\n\n\nCoke Machine Glow was the first solo album released by Gordon Downie, the singer for The Tragically Hip. It was released in 2001.\n\nEarly copies of the album were released as a joint package with a book by Downie, also titled Coke Machine Glow. The book included the song lyrics from the album and other poetry. As a result of the album's sales, the book is one of the best-selling volumes of poetry ever published by a Canadian writer.[citation needed]\n\nDownie's backing band on Coke Machine Glow was credited as &quot;the Goddamned Band&quot;. Participating musicians included Julie Doiron, Josh Finlayson, Atom Egoyan and members of The Dinner Is Ruined.\n\n\nTracks: \n\n\n1.\t&quot;Starpainters&quot;\n2.\t&quot;Vancouver Divorce&quot;\n3.\t&quot;SF Song&quot;\n4.\t&quot;Trick Rider&quot;\n5.\t&quot;Canada Geese&quot;\n6.\t&quot;Chancellor&quot;\n7.\t&quot;The Never-Ending Present&quot;\n8.\t&quot;Nothing but Heartache in Your Social Life&quot;\n9.\t&quot;Blackflies&quot;\n10.\t&quot;Lofty Pines&quot;\n11.\t&quot;Boy Bruised by Butterfly Chase&quot;\n12.\t&quot;Mystery&quot;\n13.\t&quot;Elaborate&quot;\n14.\t&quot;Yer Possessed&quot;\n15.\t&quot;Every Irrelevance&quot;\n16.\t&quot;Insomniacs of the World, Goodnight&quot;\n\n\n\n\n\n\n\n\nBattle Of The Nudes 2003\n\n\nBattle of the Nudes is the second solo album by Gordon Downie, lead singer of The Tragically Hip. It was released in 2003.\n\nDownie's backing band on Coke Machine Glow was credited as &quot;Country of Miracles&quot;. Participating musicians included Julie Doiron, Josh Finlayson and members of The Dinner Is Ruined.\n\nTracks: \n\n\n1.\t&quot;Into The Night&quot;\n2.\t&quot;Figment&quot;\n3.\t&quot;Christmastime In Toronto&quot;\n4.\t&quot;Willow Logic&quot;\n5.\t&quot;Pascal's Submarine&quot; (Gordon Downie on harmonica and drums) (with the brass section and trumpet solo by Chris Botti)\n6.\t&quot;11th Fret&quot;\n7.\t&quot;Who By Rote&quot;\n8.\t&quot;Steeplechase&quot;\n9.\t&quot;More Me Less You&quot;\n10.\t&quot;We're Hardcore&quot;\n11.\t&quot;Pillform No. 2&quot;\n12.\t&quot;Pillform No. 1&quot;\n\n\n\n\n\n\n\nThe Grand Bounce 2010\n\n\n\nThe Grand Bounce is the third solo album by Gordon Downie, the lead singer of The Tragically Hip. It was released on June 8, 2010.[2]\n\nDownie's backing band, &quot;The Country of Miracles&quot;, is composed of established Canadian musicians Julie Doiron (vocals, guitar, bass), Josh Finlayson (bass, guitar), Dale Morningstar (lead guitar), Dave Clark (drums), and Dr. Pee (keyboards).\n\n\nTracks: \n\n\n1.\t&quot;The East Wind&quot;\n2.\t&quot;Moon Over Glenora&quot;\n3.\t&quot;As a Mover&quot;\n4.\t&quot;The Dance and Its Disappearance&quot;\n5.\t&quot;The Hard Canadian&quot;\n6.\t&quot;Gone&quot;\n7.\t&quot;The Drowning Machine&quot;\n8.\t&quot;Yellow Days&quot;\n9.\t&quot;Night Is for Getting&quot;\n10.\t&quot;Moonslow Yer Lashes&quot;\n11.\t&quot;Retrace&quot;\n12.\t&quot;Broadcast&quot;\n13.\t&quot;Pinned&quot;\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:b992539798551f7f65265abd8332d4a8fc239c5f","amp;dn":"Gordon+Downie+%28of+Tragically+Hip%29+-+Discography+%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b992539798551f7f65265abd8332d4a8fc239c5f","infoHashBuffer":{"type":"Buffer","data":[185,146,83,151,152,85,31,127,101,38,90,189,131,50,212,168,252,35,156,95]},"announce":[],"urlList":[]}}