{"title":"Actual Tools Actual Multiple Monitors v8.9","uid":15738603,"size":11878569,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ba2a42b8c25e22ef1c9b5651337fc59a561d96ae&amp;dn=Actual+Tools+Actual+Multiple+Monitors+v8.9&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LxByte","files":1,"time":1472868379,"description":"Actual Tools Actual Multiple Monitors v8.9\n\n[!] Important\n[+] New\n[-] Fixed error\n[*] Changes\n\n---------------------------------------------------------------------------\nActual Multiple Monitors 8.9 (22.07.2016)\n---------------------------------------------------------------------------\n[+] The ability is added to invoke advanced title button dialogs (usually\n    invoked via right-click on a button) for a currently active window\n    via hotkeys. The following hotkeys have been added:\n\n    - Show the &quot;Move to specific monitor&quot; dialog      (Win-Ctrl-/)\n    - Show the &quot;Maximize to selected monitors&quot; dialog (Win-Ctrl-Num*)\n    - Show the &quot;Put into Divider tile&quot; dialog         (Win-Ctrl-Num5)\n\n    You can change the default key combinations in the Hotkeys-Actions panel.\n\n    This feature can be useful on monitors with high resolutions (up to 4K)\n    where distance to a required button may be too long to drag the mouse there\n    just to invoke the dialog via right click. Using the hotkeys above will make\n    the dialogs appear exactly under the mouse pointer, ready for immediate use.\n\n[+] The CFL command line switch is expanded with the ability to specify\n    an arbitrary folder where the configuration files should be stored:\n\n    ActualMultipleMonitorsCenter.exe CFL &quot;&quot;\n\n[*] Overall stability is improved.\n\n[*] Image processing for slideshows (both background and screen saver) has been\n    optimized to use less memory and work faster even for huge images (like\n    NASA space photos having up to 20K pixels resolution).\n\n[*] Proper scaling in high DPI resolutions has been finally implemented for:\n\n    - Actual Taskbar jump lists and thumbnail previews\n\n    - extra title buttons\n\n    - Log window\n\n[*] Evaluation dialog has been restyled.\n\n[*] Proper scaling in high DPI resolutions has been finally implemented for\n    program dialogs (About, Register, Check for Updates, etc.).\n\n[-] Actual Taskbar did not get behind fullscreen Google Chrome windows.\n\n[-] Windows 7: Multi-monitor Alt-Tab Task Switcher showed only once in the\n    Classic visual theme.\n\n[-] Auto-detection of free space for extra title buttons worked incorrectly in\n    high DPI resolutions for Windows Explorer and Microsoft Office windows.\n\n[-] Some features stopped working in Skype windows after saving the\n    Actual Multiple Monitors configuration.\n\n[-] Windows 7+: Specific window settings with certain Window Caption criterion\n    specified did not apply to Microsoft Management Console windows (Event\n    Viewer, Task Scheduler, Disk Manager, etc.).\n\n[-] Intuit QuickBooks windows hung for a while after right clicking the extra\n    title buttons.\n\n[-] Windows 10: Start Screen parts were unwantedly touched by the group commands\n    like &quot;Gather all windows from&quot; or &quot;Swap all windows with&quot; (if the program\n    was installed with the support of administrative utilities).\n\n[-] Windows 10: If the &quot;Replace the system taskbar&quot; option was on, the system\n    taskbar Search box popped over Actual Taskbar after clicking the Start\n    button.\n\n[-] Windows 10: &quot;Desktop Divider Up/Down/Left/Right&quot; hotkeys worked improperly.\n\n[-] Windows 10: Desktop Divider layouts did not switch on mouse wheel rolling.\n\n[-] Window did not restore properly its position and size if the Maximize to\n    Desktop action was applied several times in a row.\n\n[-] Windows 8.1: Mirroring of Windows Media Player stopped working if the player\n    window was relocated.\n\nSimply the Best Multi-Monitor Software for Windows 7, Windows 8/8.1, and even Windows 10!\n\n    Get fully functional taskbar with Start menu and system tray on each monitor\n    Quickly move windows between monitors\n    Set its own wallpaper and screensaver on each monitor\n    Play a game on one monitor and chat, surf web, etc. on others\n\nOfficial Website: http://www.actualtools.com/multiplemonitors/","torrent":{"xt":"urn:btih:ba2a42b8c25e22ef1c9b5651337fc59a561d96ae","amp;dn":"Actual+Tools+Actual+Multiple+Monitors+v8.9","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba2a42b8c25e22ef1c9b5651337fc59a561d96ae","infoHashBuffer":{"type":"Buffer","data":[186,42,66,184,194,94,34,239,28,155,86,81,51,127,197,154,86,29,150,174]},"announce":[],"urlList":[]}}