{"title":"Allen-George Washington,Spymaster(espionage in US civil war)(200","uid":4640234,"size":2390252,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb3bc581cb50e443af90d10da56df92eaa811792&amp;dn=Allen-George+Washington%2CSpymaster%28espionage+in+US+civil+war%29%28200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1231692315,"description":"This is Thomas B. Allen's intriguing book George Washington, Spymaster - How the Americans Outspied the British and Won the Revolutionary War (2004) which lays out various covert and espionage operations that won the American Revolutionary War under mastermind George Washington who later became first president of the new American Republic. Grade 6-9-Codes and ciphers, invisible ink, secret messages and codes, spies, counterspies and even double agents! The author relates the main events of the Revolution chronologically, consistently revealing the shadowy role of intelligence and counterintelligence. Members of the Culper Ring, the &quot;mole&quot; in the Sons of Liberty, and daring women worked as spies, fighting on the secret front where Patriots and Tories looked and sounded alike. Washington's role as spymaster adds a fascinating and fresh perspective on the life of this revered founding father who did far more than cross the Delaware. Even the book looks like a publication from the 1700s. Set in an antique typeface, it is well illustrated with black-and-white reproductions of archival art and Harness's charming pen-and-ink sketches. Messages written in the Talmadge code (1783) appear throughout, with a key in the appendix. The concise narrative traces Washington's use of spies and makes a convincing case for the pivotal role that espionage played in defeating the British. Laced with details about invisible ink, codes and double agents, the discussion sometimes draws parallels between eighteenth-century deceptions and the methods and vocabulary of modern espionage. The black-and-white illustrations include maps, ink drawings, and reproductions of period paintings, prints, and documents. The extensive, informative back matter includes a time line of the war, a glossary, a substitution code used during the Revolution, notes expanding on the text, source notes for quotes, and an annotated list of recommended books and Internet sites. Spymaster presents a documented but little known story that you would normally associate with James Bond rather than George Washington and his espionage network that provided him with necessary information to fool and finally defeat the British forces over 200 years ago. 190 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:bb3bc581cb50e443af90d10da56df92eaa811792","amp;dn":"Allen-George+Washington%2CSpymaster%28espionage+in+US+civil+war%29%28200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb3bc581cb50e443af90d10da56df92eaa811792","infoHashBuffer":{"type":"Buffer","data":[187,59,197,129,203,80,228,67,175,144,209,13,165,109,249,46,170,129,23,146]},"announce":[],"urlList":[]}}