{"title":"An Economic Commentary on the Bible - Gary North","uid":11707878,"size":45937523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbccc6b78855d41a03219010009d41bd976f6dd1&amp;dn=An+Economic+Commentary+on+the+Bible+-+Gary+North&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1424211059,"description":"An Economic Commentary on the Bible, a 31-volume exposition in one e-book: \n(Pre-published version, non-proofread with custom-made cover.)\n\n\nThe Bible mandates free market capitalism. It is anti-socialist. - Gary North:\n\n The essence of democratic socialism is this re-written version of God's commandment: &quot;Thou shalt not steal, except by majority vote.&quot;\n&quot;Economic democracy&quot; is the system whereby two wolves and a sheep vote on what to have for dinner.\nChristian socialists and defenders of economic planning by state bureaucrats deeply resent this interpretation of their ethical position. They resent it because it's accurate.\nWhen Christianity adheres to the judicial specifics of the Bible, it produces free market capitalism. \nOn the other hand, when Christianity rejects the judicial specifics of the Bible, it produces socialism or some politically run hybrid &quot;middle way&quot; between capitalism and socialism, where politicians and bureaucrats make the big decisions about how people's wealth will be allocated. Economic growth then slows or is reversed. Always.\nFree market capitalism produces long-term economic growth. Socialism and middle-way economic interventionism by the state produce poverty and bureaucracy. If your goal is to keep poor people poor, generation after generation, you should promote socialism. But be sure to call it economic democracy in order to fool the voters.\n\nThe Bible is an anti-socialist document. Socialist propagandists for over four centuries have claimed that the Bible teaches socialism, but we have yet to see a single Bible commentary written by a socialist. If the Bible teaches socialism, where is the expository evidence?\nWhen I say that the Bible mandates a moral and legal social order that inevitably produces free market capitalism, I have the evidence to back up my position. My critics -- critics of capitalism -- do not. \nThe next time you hear someone say that the Bible teaches anything but free market capitalism, ask him or her which Bible commentary demonstrates this. You will get a blank stare followed by a lot of verbal tap-dancing about &quot;the ultimate ethic of the Bible&quot; or &quot;the upholding of the poor in the Bible.&quot; You will be given a lot of blah, blah, blah. Blah, blah, blah is not a valid substitute for biblical exposition.\n\nFact: There has never been an expository Bible commentary that shows that the Bible teaches anything other than free market capitalism.\nBeginning in April, 1973, I began writing a verse-by-verse commentary on the economics of the Bible. The first essay, on Genesis 1:26-28, appeared in the May, 1973 issue of the Chalcedon Report.\nAn economic commentary on the Bible had never been attempted before. I discuss only those passages that relate to economics. \nNo one before me had ever attempted to write a Bible commentary on a specific academic discipline. I hope mine becomes a model for others.\nI have continued working on this project ever since. I limited my writing to one essay per month from 1973 to 1976. Beginning in the summer of 1977, I began working 10 hours per week, 50 weeks per year on this project. \nI needed every minute. \nI completed the posting of the entire series, 31 volumes, in August 2012.\n\nWritten by Gary North","torrent":{"xt":"urn:btih:bbccc6b78855d41a03219010009d41bd976f6dd1","amp;dn":"An+Economic+Commentary+on+the+Bible+-+Gary+North","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbccc6b78855d41a03219010009d41bd976f6dd1","infoHashBuffer":{"type":"Buffer","data":[187,204,198,183,136,85,212,26,3,33,144,16,0,157,65,189,151,111,109,209]},"announce":[],"urlList":[]}}