{"title":"A Voyage to Arcturus by David Lindsay [republicV]","uid":7877625,"size":2359552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbd9b28036c82e96b5d71e11ec8b4418c93fc784&amp;dn=A+Voyage+to+Arcturus+by+David+Lindsay+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"republicV","files":-1,"time":1354387244,"description":"A stunning achievement in speculative fiction, A Voyage to Arcturus has inspired, enchanted, and unsettled readers for decades. It is simultaneously an epic quest across one of the most unusual and brilliantly depicted alien worlds ever conceived, a profoundly moving journey of discovery into the metaphysical heart of the universe, and a shockingly intimate excursion into what makes us human and unique. After a strange interstellar journey, Maskull, a man from Earth, awakens alone in a desert on the planet Tormance, seared by the suns of the binary star Arcturus. As he journeys northward, guided by a drumbeat, he encounters a world and its inhabitants like no other, where gender is a victory won at dear cost; where landscape and emotion are drawn into an accursed dance; where heroes are killed, reborn, and renamed; and where the cosmological lures of Shaping, who may be God, torment Maskull in his astonishing pilgrimage. At the end of his arduous and increasingly mystical quest waits a dark secret and an unforgettable revelation.\n\nA Voyage to Arcturus is a novel by Scottish writer David Lindsay, first published in 1920. It combines fantasy, philosophy, and science fiction in an exploration of the nature of good and evil and their relationship with existence. It has been described by critic and philosopher Colin Wilson as the &quot;greatest novel of the twentieth century&quot; and was a central influence on C. S. Lewis's Space Trilogy.\n\nFrom: BitTorrentScene [BTScene]","torrent":{"xt":"urn:btih:bbd9b28036c82e96b5d71e11ec8b4418c93fc784","amp;dn":"A+Voyage+to+Arcturus+by+David+Lindsay+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbd9b28036c82e96b5d71e11ec8b4418c93fc784","infoHashBuffer":{"type":"Buffer","data":[187,217,178,128,54,200,46,150,181,215,30,17,236,139,68,24,201,63,199,132]},"announce":[],"urlList":[]}}