{"title":"God in America [2010] PBS Frontline - American Experience","uid":7880687,"size":3751131829,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bbf5a572f37bb526f2f69418dc17b7f01933f133&amp;dn=God+in+America+%5B2010%5D+PBS+Frontline+-+American+Experience&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1354484265,"description":"God In America - Typical Episode\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 597 MiB\nDuration                                 : 59mn 38s\nNominal bit rate                         : 900 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 478 pixels\nDisplay aspect ratio                     : 16:9\nScan type                                : Progressive\nBits/(Pixel*Frame)                       : 0.087\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1651080/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1651080/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pbs.org/godinamerica/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/godinamerica/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/AAGAaAaEM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AAGAaAaEM&lt;/a&gt;\n\nSince the days when the Puritan &quot;city on a hill&quot; beckoned on the horizon of the New World, religious faith and belief have forged America's ideals, molded its identity and shaped its sense of mission at home and abroad.\n\nFor the first time on television, God in America explores the tumultuous 400-year history of the intersection of religion and public life in America, from the first European settlements to the 2008 presidential election. A co-production of AMERICAN EXPERIENCE and FRONTLINE, this six-hour series examines how religious dissidents helped shape the American concept of religious liberty and the controversial evolution of that ideal in the nation's courts and political arena; how religious freedom and waves of new immigrants and religious revivals fueled competition in the religious marketplace; how movements for social reform -- from abolition to civil rights -- galvanized men and women to put their faith into political action; and how religious faith influenced conflicts from the American Revolution to the Cold War.\n\nInterweaving documentary footage, historical dramatization and interviews with religious historians, the six-part series is narrated by actor Campbell Scott and includes appearances by actors Michael Emerson (as John Winthrop), Chris Sarandon (as Abraham Lincoln) and Keith David (as Frederick Douglass), among others.\n\n&quot;The American story cannot be fully understood without understanding the country's religious history,&quot; says series executive producer Michael Sullivan. &quot;By examining that history, God in America will offer viewers a fresh, revealing and challenging portrait of the country.&quot;\n\nAs God in America unfolds, it reveals the deep roots of American religious identity in the universal quest for liberty and individualism -- ideas that played out in the unlikely political union between Thomas Jefferson and defiant Baptists to oppose the established church in Virginia and that were later embraced by free-wheeling Methodists and maverick Presbyterians. Catholic and Jewish immigrants battled for religious liberty and expanded its meaning. In their quest for social reform, movements as different as civil rights and the religious right found authority and energy in their religious faith. The fight to define religious liberty fueled struggles between America's secular and religious cultures on issues from evolution to school prayer, and American individualism and the country's experiment in religious liberty were the engine that made America the most religiously diverse nation on earth.\n\nGod in America comprises six 60-minute episodes:\n\nGod In America - 01 - A New Adam\nGod In America - 02 - A New Eden\nGod In America - 03 - A Nation Reborn\nGod In America - 04 - A New Light\nGod In America - 05 - Soul of a Nation\nGod In America - 06 - God and Caesar","torrent":{"xt":"urn:btih:bbf5a572f37bb526f2f69418dc17b7f01933f133","amp;dn":"God+in+America+%5B2010%5D+PBS+Frontline+-+American+Experience","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf5a572f37bb526f2f69418dc17b7f01933f133","infoHashBuffer":{"type":"Buffer","data":[187,245,165,114,243,123,181,38,242,246,148,24,220,23,183,240,25,51,241,51]},"announce":[],"urlList":[]}}