{"title":"Seth Godin: Sliced bread and other marketing delights","uid":4682727,"size":61356050,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bc44d51cfa3749dd4f0536b6a17302019fec744c&amp;dn=Seth+Godin%3A+Sliced+bread+and+other+marketing+delights&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1233131542,"description":"In a world of too many options and too little time, our obvious choice is to just ignore the ordinary stuff. Marketing guru Seth Godin spells out why, when it comes to getting our attention, bad or bizarre ideas are more successful than boring ones.\n\n&quot;Seth Godin may be the ultimate entrepreneur for the Information Age,&quot; Mary Kuntz wrote in Business Week nearly a decade ago. &quot;Instead of widgets or car parts, he specializes in ideas -- usually, but not always, his own.&quot; In fact, he's as focused on spreading ideas as he is on the ideas themselves.\n\nAfter working as a software brand manager in the mid-1980s, Godin started Yoyodyne, one of the first Internet-based direct-marketing firms, with the notion that companies needed to rethink how they reached customers. His efforts caught the attention of Yahoo!, which bought the company in 1998 and kept Godin on as a vice president of permission marketing. Godin has produced several critically acclaimed and attention-grabbing books, including Permission Marketing, All Marketers Are Liars, and Purple Cow (which was distributed in a milk carton). In 2005, Godin founded Squidoo.com, a Web site where users can share links and information about an idea or topic important to them.\n\n    &quot;[Godin] is a demigod on the Web, a best-selling author, highly sought-after lecturer, successful entrepreneur, respected pundit and high-profile blogger. He is uniquely respected for his understanding of the Internet.&quot;\n\nForbes.com\n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:bc44d51cfa3749dd4f0536b6a17302019fec744c","amp;dn":"Seth+Godin%3A+Sliced+bread+and+other+marketing+delights","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc44d51cfa3749dd4f0536b6a17302019fec744c","infoHashBuffer":{"type":"Buffer","data":[188,68,213,28,250,55,73,221,79,5,54,182,161,115,2,1,159,236,116,76]},"announce":[],"urlList":[]}}