{"title":"Hilary Mantel - Bring Up the Bodies","uid":8923107,"size":629618208,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bc6fafe71c8d46061bd941beb52a7e4a5dc6bb74&amp;dn=Hilary+Mantel+-+Bring+Up+the+Bodies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NC5845","files":-1,"time":1379303296,"description":"Winner of Booker Prize.\n\nIn Hilary Mantel's words:\n\nBring Up the Bodies is the second part of my trilogy about Thomas Cromwell, chief minister to Henry VIII. I have been interested in Cromwell for years, and wanted to get beyond the negative portrayal of him in popular history and fiction. He was a ruthless man, certainly, but no more so than other contemporary politicians; and in Henry, a man of violent temper, he had a very demanding employer. As soon as you get back beyond the prejudices about Cromwell, you find a clever, enterprising, resilient and optimistic man, with a story well worth telling. He was at the center of Henry's court for almost ten years, and when you look at events from his point of view, they seem very different from the stories of the Tudor court to which we've grown accustomed.\n\nOriginally I thought I would tell the story in just one book. But as I made progress with Wolf Hall, I discovered the richness and depth of the material. I was glad to alter my plans. Now the project will reach a conclusion in The Mirror &amp; The Light, the book that is still ahead of me.\n\nHow is it different from Wolf Hall?\n\nWolf Hall takes in a huge span of time, describing Cromwell's early life, and reaching back into the previous century, to show the forces that shaped England before he was born. The foreground action of the book occupies several years, ending in July 1535, on the day of the execution of Cromwell's political antagonist, Thomas More.\n\nThe action of Bring Up The Bodies occupies only nine months, and within that nine months it concentrates on the three weeks in which Henry's second wife, Anne Boleyn, is arrested, tried and executed for treason. So it is a shorter, more concentrated read. There are no diversions once the plot against Anne begins to accelerate, and the tension builds as her death approaches.\n\nIt's quite possible to read Bring Up The Bodies without reading Wolf Hall. It makes sense in its own terms. But I think a reader will get a deeper experience by starting with the first book and seeing the characters evolve.","torrent":{"xt":"urn:btih:bc6fafe71c8d46061bd941beb52a7e4a5dc6bb74","amp;dn":"Hilary+Mantel+-+Bring+Up+the+Bodies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc6fafe71c8d46061bd941beb52a7e4a5dc6bb74","infoHashBuffer":{"type":"Buffer","data":[188,111,175,231,28,141,70,6,27,217,65,190,181,42,126,74,93,198,187,116]},"announce":[],"urlList":[]}}