{"title":"Ray Bradbury - Death Is a Lonely Business - Unb","uid":4744153,"size":212449413,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bcb8fd235a4d0ef3410de1b6d0357dc4cf23b095&amp;dn=Ray+Bradbury+-+Death+Is+a+Lonely+Business+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RamJamSam","files":7,"time":1235729085,"description":"Ray Bradbury - Death Is a Lonely Business - Unb\nRead By:  Robert O'Keefe\nRuntime:  8 Hours and 25 Minutes\n\n\n\n\n\nRay Bradbury, the undisputed Dean of American storytelling, dips his accomplished pen into the cryptic inkwell of noir and creates a stylish and slightly fantastical tale of mayhem and murder set among the shadows and the murky canals of Venice, California, in the early 1950s.\n\nToiling away amid the looming palm trees and decaying bungalows, a struggling young writer (who bears a resemblance to the author) spins fantastic stories from his fertile imagination upon his clacking typewriter. Trying not to miss his girlfriend (away studying in Mexico), the nameless writer steadily crafts his literary effort-until strange things begin happening around him.\n\nStarting with a series of peculiar phone calls, the writer then finds clumps of seaweed on his doorstep. But as the incidents escalate, his friends fall victim to a series of mysterious accidents-some of them fatal. Aided by Elmo Crumley, a savvy, street-smart detective, and a reclusive actress of yesteryear with an intense hunger for life, the wordsmith sets out to find the connection between the bizarre events, and in doing so, uncovers the truth about his own creative abilities.\n\n\n\n\n\nGooD SeeDinG!\n","torrent":{"xt":"urn:btih:bcb8fd235a4d0ef3410de1b6d0357dc4cf23b095","amp;dn":"Ray+Bradbury+-+Death+Is+a+Lonely+Business+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb8fd235a4d0ef3410de1b6d0357dc4cf23b095","infoHashBuffer":{"type":"Buffer","data":[188,184,253,35,90,77,14,243,65,13,225,182,208,53,125,196,207,35,176,149]},"announce":[],"urlList":[]}}