{"title":"P.G. Wodehouse - The Clicking of Cuthbert","uid":3880697,"size":367159359,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bcda7e617e56abd13f195818fbc375d3a553724e&amp;dn=P.G.+Wodehouse+-+The+Clicking+of+Cuthbert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"st9635","files":11,"time":1194655431,"description":"P.G. Wodehouse - The Clicking of Cuthbert\n\nRead by Jonathon Cecil\n\nUnabridged.  Running Time 6 Hrs 20 Mins\n\n6 CDs converted to 6 MP3 files at 128 kbit/s\n\n\nAbout The Book\nFrom the pen of P.G. Wodehouse, &amp;#039;The Clicking of Cuthbert&amp;#039; is a collection of short stories on the subject of golf. One storyincludes the thoughts of Miss Forrester who thinks it is the silliest game ever invented.\nCan anyone find new sources of humor in golf? Certainly, it takes a great humorist to do so. P.G. Wodehouse pulled off this feat by combining an obvious love for the game with sense of irony about the humiliations that golfers experience for their sport, a subtle mix of love and how golf can complicate that emotion, and a hilariously overbearing narrator who is obviously the biggest windbag in the golf club. \n\nAbout The Author\nP.G. Wodehouse (1881-1975) To the envy of every writer, Sir Wodehouse invented a character whose name has entered our vocabulary. Jeeves, the generic name of any butler, came into being as the impeccable &quot;gentleman&amp;#039;s gentleman,&quot; whose employer was Bertie Wooster. Witty and prolific, Wodehouse wrote over 100 novels, as well as many short stories, sketches, librettos, and lyrics for Irving Berlin, Cole Porter, and George Gershwin. Knighted shortly before his death, he was born and educated in England.\n\nAbout The Reader\nJonathan Cecil was born in London, England on 22 February 1939 and is the son of Lord David Cecil. He is a vastly experienced actor, appearing at Shakespeare?s Globe as well as in such West End productions as The Importance of Being Ernest, The Seagull and The Bed Before Yesterday. He has toured in The Incomparable Max, Twelfth Night and An Ideal Husband, while among his considerable TV and film appearances are The Rector?s Wife, Just William, Murder Most Horrid and As You Like It.\n","torrent":{"xt":"urn:btih:bcda7e617e56abd13f195818fbc375d3a553724e","amp;dn":"P.G.+Wodehouse+-+The+Clicking+of+Cuthbert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcda7e617e56abd13f195818fbc375d3a553724e","infoHashBuffer":{"type":"Buffer","data":[188,218,126,97,126,86,171,209,63,25,88,24,251,195,117,211,165,83,114,78]},"announce":[],"urlList":[]}}