{"title":"Jung Chang - Mao  The Unknown Story","uid":4341231,"size":860844035,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:be32c81b958b21e1e013f68f6d553583e015ae1b&amp;dn=Jung+Chang+-+Mao++The+Unknown+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rjeong","files":5,"time":1218609251,"description":"In the epilogue to her biography of Mao Tse-tung, Jung Chang and her husband and cowriter Jon Halliday lament that, &quot;Today, Mao&amp;#039;s portrait and his corpse still dominate Tiananmen Square in the heart of the Chinese capital.&quot; For Chang, author of Wild Swans, this fact is an affront, not just to history, but to decency. Mao: The Unknown Story does not contain a formal dedication, but it is clear that Chang is writing to honor the millions of Chinese who fell victim to Mao&amp;#039;s drive for absolute power in his 50-plus-year struggle to dominate China and the 20th-century political landscape. From the outset, Chang and Halliday are determined to shatter the &quot;myth&quot; of Mao, and they succeed with the force, not just of moral outrage, but of facts. The result is a book, more indictment than portrait, that paints Mao as a brutal totalitarian, a thug, who unleashed Stalin-like purges of millions with relish and without compunction, all for his personal gain. Through the authors&amp;#039; unrelenting lens even his would-be heroism as the leader of the Long March and father of modern China is exposed as reckless opportunism, subjecting his charges to months of unnecessary hardship in order to maintain the upper hand over his rival, Chang Kuo-tao, an experienced military commander.\n\nUsing exhaustive research in archives all over the world, Chang and Halliday recast Mao&amp;#039;s ascent to power and subsequent grip on China in the context of global events. Sino-Soviet relations, the strengths and weakness of Chiang Kai-shek, the Japanese invasion of China, World War II, the Korean War, the disastrous Great Leap Forward, the vicious Cultural Revolution, the Vietnam War, Nixon&amp;#039;s visit, and the constant, unending purges all, understandably, provide the backdrop for Mao&amp;#039;s unscrupulous but invincible political maneuverings and betrayals. No one escaped unharmed. Rivals, families, peasants, city dwellers, soldiers, and lifelong allies such as Chou En-lai were all sacrificed to Mao&amp;#039;s ambition and paranoia. Appropriately, the authors&amp;#039; consciences are appalled. Their biggest fear is that Mao will escape the global condemnation and infamy he deserves. Their astonishing book will go a long way to ensure that the pendulum of history will adjust itself accordingly.\n\nBreakdown of a BIG Book: 5 Things You&amp;#039;ll Learn from Mao: The Unknown Story\n\n1. Mao became a Communist at the age of 27 for purely pragmatic reasons: a job and income from the Russians.\n\n2. Far from organizing the Long March in 1934, Mao was nearly left behind by his colleagues who could not stand him and had tried to oust him several times. The aim of the March was to link up with Russia to get arms. The Reds survived the March because Chiang Kai-shek let them, in a secret horse-trade for his son and heir, whom Stalin was holding hostage in Russia.\n\n3. Mao grew opium on a large scale.\n\n4. After he conquered China, Mao&amp;#039;s over-riding goal was to become a superpower and dominate the world: &quot;Control the Earth,&quot; as he put it.\n\n5. Mao caused the greatest famine in history by exporting food to Russia to buy nuclear and arms industries: 38 million people were starved and slave-driven to death in 1958-61. Mao knew exactly what was happening, saying: &quot;half of China may well have to die.&quot;","torrent":{"xt":"urn:btih:be32c81b958b21e1e013f68f6d553583e015ae1b","amp;dn":"Jung+Chang+-+Mao++The+Unknown+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be32c81b958b21e1e013f68f6d553583e015ae1b","infoHashBuffer":{"type":"Buffer","data":[190,50,200,27,149,139,33,225,224,19,246,143,109,85,53,131,224,21,174,27]},"announce":[],"urlList":[]}}