{"title":"Rachmaninov Plays Rachmaninov  (Piano Rolls)","uid":4614123,"size":240952477,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:be39d1776f5f9789a7102ee975c5c6364decce2a&amp;dn=Rachmaninov+Plays+Rachmaninov++%28Piano+Rolls%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sheila6","files":23,"time":1230746584,"description":"Music : Classical : Lossless\n\n\nA Window in Time: Rachmaninoff Performs His Solo Piano Works\n\n\nAll tracks composed by Sergey Rachmaninov and recorded by Sergey Rachmaninov on piano rolls.\n\n\n1 Morceaux de fantaisie (5), for piano, Op. 3 No 2, Prelude\n2 Lilacs, song for voice &amp; piano, Op. 21/5\n3 Transcription of Rimsky-Korsakov's &quot;Flight of the Bumblebee&quot; from &quot;The Tale of the Tsar Saltan&quot; for piano, TN iii/9\n4 Morceaux de fantaisie (5), for piano, Op. 3 No 1, Elegie\n5 Morceaux de salon, for piano, Op. 10 No 3, Barcarolle\n6 Transcription of Kreisler's &quot;Liebesfreud&quot; for piano, TNiii/5\n7 Transcription of Kreisler's &quot;Liebesleid&quot; for piano, TN iii/5\n8 Morceaux de fantaisie (5), for piano, Op. 3 No 3, Melodie\n9 Etudes-Tableaux, for piano, Op. 39 No 4 in B minor\n10 Transcription of Schubert's &quot;Wohin?&quot; from &quot;Die Schone Mullerin&quot; for piano, TN iii/10\n11 Morceaux de fantaisie (5), for piano, Op. 3 No 4, Polichinelle\n12 Polka W.R., for piano in A flat major, TN ii/18\n13 Prelude for piano No.6 in G minor, Op. 23/5\n14 Morceaux de fantaisie (5), for piano, Op. 3 No 5, Serenade\n15 Transcription of Bizet's &quot;Minuet&quot; from &quot;L'Arlesienne-Suite No 1&quot; for piano, TN iii/3\n16 Transcription of Mussorgsky's &quot;Hopak&quot; from opera &quot;Sorochintsy Fair&quot; for piano (also for piano &amp; vioin), TN iii/8\n17 Etudes-Tableaux, for piano, Op. 39 No 6 in A minor\n18 Morceaux de salon, for piano, Op. 10 No 5, Humoresque\n19 Transcription of Smith's &quot;The Star-Spangled Banner&quot; for piano, TN iii/11\n\n\n\nReview:\n\nThis collection of Rachmaninoff's solo piano performances relies on a mix of old and new technologies. Between 1919 and 1929, Rachmaninoff cut these 19 performances to piano rolls, which would then be played back through reproducing pianos capable of accurately re-creating the original performances through pneumatic devices that animated the rolls with living nuances and shades - a facet that differentiated the classier reproduction keyboards from the more common &quot;player pianos.&quot; \n\nThis set updates the technology with electronic devices - transparently, though expertly, replacing the pneumatics. Played back on a Bosendorfer Reproducing Piano, this collection sounds astounding, full of Rachmaninoff's lickety-quick motion and his punching intensity when striking the keys. \n\nThere are 18 Rachmaninoff selections - some of them collaborations - and one gem, &quot;The Star-Spangled Banner,&quot; taken to new places in this 1919 reading. --Andrew Bartlett","torrent":{"xt":"urn:btih:be39d1776f5f9789a7102ee975c5c6364decce2a","amp;dn":"Rachmaninov+Plays+Rachmaninov++%28Piano+Rolls%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be39d1776f5f9789a7102ee975c5c6364decce2a","infoHashBuffer":{"type":"Buffer","data":[190,57,209,119,111,95,151,137,167,16,46,233,117,197,198,54,77,236,206,42]},"announce":[],"urlList":[]}}