{"title":"A History of Electric Cars.epub","uid":10033909,"size":27914349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be4633957d7b159663f3e12df652a59a9d983d51&amp;dn=A+History+of+Electric+Cars.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1398378333,"description":"A History of Electric Cars by Nigel Burton\n\nRequirements: Epub Reader, 27 MB\n\nOverview: One hundred years ago electric cars were the most popular automobiles in the world. In the late nineteenth century and at the start of the twentieth century, they outsold every other type of car. And yet, within a couple of decades of the start of the twentieth century, the electric car had vanished. Thousands of battery-powered cars disappeared from the streets, replaced by the internal combustion engine, and their place in the history of the automobile was quietly erased. A century later, electric cars are making a comeback. Fears over pollution and global warming have forced manufacturers to reconsider the electric concept. A History of Electric Cars presents for the first time the full story of electric cars and their hybrid cousins. It examines how and why electric cars failed the first time - and why today's car manufacterers must learn the lessons of the past if they are to avoid repeating previous mistakes all over again.\n\nThe book examines in detail:\n\nEarly vehicles such as the Lohner-Porsche gas-electric hybrid of 1901\n\nKey figures in the history of the electric car development such as Henry Ford\n\nSir Clive Sinclair's plans to build a number of electric vehicles, designed to sit alongside the Sinclair C5\n\nThe return of the electric technology to vehicles as diverse as the NASA Lunar Rover, commuting vehicles and supercars\n\nFuture developments in electric cars.\n\nGenre: Non Fiction , Technology","torrent":{"xt":"urn:btih:be4633957d7b159663f3e12df652a59a9d983d51","amp;dn":"A+History+of+Electric+Cars.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4633957d7b159663f3e12df652a59a9d983d51","infoHashBuffer":{"type":"Buffer","data":[190,70,51,149,125,123,21,150,99,243,225,45,246,82,165,154,157,152,61,81]},"announce":[],"urlList":[]}}