{"title":"Blade The Vampire Hunter","uid":4865782,"size":663843955,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bf1d108da07bad22f19ac0e01cb2860ea1d8af99&amp;dn=Blade+The+Vampire+Hunter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1240508098,"description":"Collection of comics featuring Blade, the Marvel Universe's foremost vampire hunter.\n\nBlade was born in a whorehouse in the Soho neighborhood of London, England at some time in the late nineteenth century. Blade's mother was attacked by a vampire whilst she was giving birth and killed her. However, this inadvertently passed along certain enzymes in his own blood to the infant. This resulted in Blade having quasi-vampiric abilities, including a greatly prolonged lifespan and the ability to sense supernatural creatures, as well as an immunity to complete vampirism. Blade grew up and dedicated his life to avenging his mothers death and killing all vampires.\n\nBlade was Created by writer Marv Wolfman and penciller Gene Colan. The artist recalled in 2003, &quot;Marv told me Blade was a black man, and we talked about how he should dress, and how he should look - very heroic looking. That was my input. The bandoleer of blades - that was Marv's idea. But, I dressed him up. I put the leather jacket on him and so on&quot;. Colan based the character's features on &quot;a composite of black actors&quot; including NFL football star-turned-actor Jim Brown.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:bf1d108da07bad22f19ac0e01cb2860ea1d8af99","amp;dn":"Blade+The+Vampire+Hunter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf1d108da07bad22f19ac0e01cb2860ea1d8af99","infoHashBuffer":{"type":"Buffer","data":[191,29,16,141,160,123,173,34,241,154,192,224,28,178,134,14,161,216,175,153]},"announce":[],"urlList":[]}}