{"title":"The Devils Rejects[ENG][UNrated][DVDrip]","uid":4771570,"size":1469170296,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c033abe1d3df3db79c38219e21974a218755aaa0&amp;dn=The+Devils+Rejects%5BENG%5D%5BUNrated%5D%5BDVDrip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"oxyman","files":4,"time":1237058626,"description":"Its six months after the events of 'House of 1000 Corpses'. The sadistic Firefly family are awakened in their home by police outside - led by Sheriff John Quincy Wydell. The game is up and their crimes have been discovered. The family (including Baby, Mama, Otis and Rufus - Tiny is missing) arm themselves and begin a shoot-out with the cops. Rufus is killed and Mama stays behind with his body and is arrested. However, two of the most dangerous members of the family - Baby and Otis - escape.\n\nOtis and Baby trick a passing woman to steal her car. Baby lies down in the road and pretends to be injured. When the woman steps out of her car, Otis attacks and kills her and the two set off in her car. They call Baby's father, Captain Spaulding, who arranges to meet them at a run-down motel. The two then force their way into a room where a travelling country band Banjo and Sullivan are staying. The band consists of two couples and their roadie. Otis shoots the roadie and they keep the band hostage. Otis and Baby mentally torture the group, forcing one woman to strip whilst Otis molests her with a gun. Finally, Otis takes the two men of the group out in the car to help dig up some guns her buried. Out in the desert, one of the men tries to attack Otis, who then kills both of the men easily.\n\nBack at the motel, Baby plays mind games with the women--Wendy and Gloria--forcing them to hit each other just so Wendy can use the toilet. When Baby allows Wendy to go to the bathroom, she tries to escape, screaming and banging and smashing the window. Gloria then steals Baby's gun and threatens to shoot her. Baby pleads while Gloria shouts to her friend that its ok to come out, that she has the situation under control. However, as the bathroom door opens, Baby throws a knife into Gloria's chest and kills her. Before she dies, Baby reveals to her that the gun Baby was holding them hostage with was not even loaded. Wendy rushes through the door crying and begins to run away from the hotel. Wendy bumps into a passer who happens to be Captain Spaulding and with a shout of 'Grab that bitch!' from Baby, Spaulding headbutts Wendy and carries her back into a motel. Otis returns with the guns and a mask made from the skin and hair of Adam, and he forces Wendy to wear it. Now reunited, Spaulding, Baby, and Otis decide to leave the motel and seek out Spaulding's brother, Charlie Altamont. They decide to leave Wendy behind lashed to the door of the motel room, and she is discovered by a maid. Set free, Wendy goes berserk and rushes out of the motel. In a blind panic, she rushes into the highway and is crushed when a large truck runs over her.\n\nMeanwhile, Wydell slowly begins to lose his sanity, when during his attempt to interrogate Mother Firefly for the whereabouts with her kin, she reveals that she murdered his brother George (an event that occurred in the first film). Later, after having dreams of his brother urging him to avenge him, Wydell stabs Mother Firefly to death.\n\nCharlie Altamont offers Otis and the others shelter from the police. After leaving Charlie's whorehouse to purchase some chickens, Charlie is threatened at gunpoint by Wydell to give up the Fireflys. With the help of a pair of amoral bounty hunters known as the &quot;Unholy Two&quot;, the sheriff takes the family back to the Firefly house where he delights in torturing them in ways similar to the methods they used on their own victims. He nails Otis's hands to his chair and staples crime scene photographs to Otis' and Baby's stomach, as well as taunting Baby about the death of her mother.\n\nHe lights the house on fire and leaves Otis and Spaulding to burn while taking Baby outside to murder her. Charlie Altamont returns to save the Firefly family, but is brutally axed by Wydell. It is only the last minute intervention of Tiny that saves the Firefly family; the giant returns and snaps Wydell's neck. The Rejects are saved and share a brief tearful reunion. Tiny decides to go back into the burning house to die alone and Otis, Baby, and Spaulding escape in Charlie's car. The film's final scene has the trio driving into the middle of a police barricade, with no sound heard except Lynyrd Skynyrd's Free Bird. As the tempo of the last portion of the song increases, they grab their guns and go forward in a final blaze of glory, being shot to death by the police.","torrent":{"xt":"urn:btih:c033abe1d3df3db79c38219e21974a218755aaa0","amp;dn":"The+Devils+Rejects%5BENG%5D%5BUNrated%5D%5BDVDrip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c033abe1d3df3db79c38219e21974a218755aaa0","infoHashBuffer":{"type":"Buffer","data":[192,51,171,225,211,223,61,183,156,56,33,158,33,151,74,33,135,85,170,160]},"announce":[],"urlList":[]}}