{"title":"Beethoven - The Complete Symphonies - Jochum","uid":6091232,"size":2001970867,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c0bbdb88cd9a0fea957f5ce0773993288a5cbe4b&amp;dn=Beethoven+-+The+Complete+Symphonies+-+Jochum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rosie1966","files":49,"time":1294531715,"description":"Recorded 1967-1969, Royal Concertgebouw Orch, Amsterdam, the Netherlands\n\nWhen people think of the conductor Eugen Jochum they think first of his Bruckner and of the vast melodies, the enormous harmonies, the endless sequences, the eternal tempos, and the infinite lengths of his interpretations of that late nineteenth century Austrian peasant mystic's symphonies. Jochum's two complete cycles of Bruckner's symphonies -- one in the '60s for Deutsche Grammophon and the other in the '70s for EMI -- are commonly held by devotees to be the greatest ever recorded. At the time, however, Jochum's name was in many ways even more closely linked with Beethoven's. He recorded the complete cycle of Beethoven's symphonies three times -- first in the '50s for DG, then in the '60s for Philips, and finally in the '70s for EMI -- but when they think of him, many people have trouble remembering Jochum recorded them even once, much less with the Berlin Philharmonic, the Concertgebouw Orchestra, and the London Philharmonic. The relevant question, though, is what does the echt Brucknerian Jochum do with Beethoven?\n\nHe doesn't do Bruckner with him. In this six-disc set of his '60s cycle with the Concertgebouw Orchestra, Jochum's Beethoven is strong, supple, straight, and true. His tempos are muscular and flexible. His rhythms are powerful and direct. His themes are shaped and sculpted. His structures are lucid and dramatic. His climaxes are inevitable and incontrovertible. Jochum sometimes pushes forward in developments and sometimes pulls back at recapitulations, but he unfailingly keeps the music driving relentlessly toward ultimate transcendence of the coda. The Concertgebouw plays for its principal guest conductor with a polished ensemble, a rough-hewn sound, and a dedication that could easily pass for devotion. Compared with his Bruckner, Jochum's Beethoven is an enlightened revolutionary, a spiritual humanist, and far and away the greatest symphonist of all time. On the evidence of these recordings, when people think of Eugen Jochum, perhaps they should think first of Beethoven. Philips' late-'60s stereo sound is absolutely translucent and undeniably present. \n-James Leonard, All Music Guide\n\nEnjoy!\nthanks to the original ripper on AvaxHome","torrent":{"xt":"urn:btih:c0bbdb88cd9a0fea957f5ce0773993288a5cbe4b","amp;dn":"Beethoven+-+The+Complete+Symphonies+-+Jochum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0bbdb88cd9a0fea957f5ce0773993288a5cbe4b","infoHashBuffer":{"type":"Buffer","data":[192,187,219,136,205,154,15,234,149,127,92,224,119,57,147,40,138,92,190,75]},"announce":[],"urlList":[]}}