{"title":"Extreme - More Than Words (2nafish)","uid":5731308,"size":156557316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c25bbc75a0cc6cb0f98d9f1ed05dfd814f78bc53&amp;dn=Extreme+-+More+Than+Words+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2nafish","files":-1,"time":1280659646,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;More Than Words&quot; is a ballad written and originally performed by the rock band Extreme. It is built around acoustic guitar work by Nuno Bettencourt and the vocals of Gary Cherone (with harmony vocals from Bettencourt). Released in 1990 on the album Extreme II: Pornograffiti, the song marked a departure from the funk metal that had permeated the band's style previous to its release.\n\nThe song itself asks the person to whom it is addressed to show love through &quot;more than words&quot;.\n\nThe video for &quot;More Than Words&quot; was parodied by &quot;Weird Al&quot; Yankovic for his original song, &quot;You Don't Love Me Anymore&quot;. The comedic duo Paul and Storm produced an original pastiche of the song entitled &quot;More Than Two&quot; on their album Gumbo Pants. Also, Amateur Transplants wrote a comedic song to the same tune as &quot;More Than Words&quot; entitled &quot;Northern Birds&quot;, which was released on their 2006 album &quot;We Are So Bad&quot;. The video was also parodied by Jason Segel and the cast of How I Met Your Mother in an online tie-in music video on the episode &quot;The Sexless Innkeeper&quot;.\n\nOn March 23, 1991, &quot;More Than Words&quot; entered the U.S. Billboard Hot 100 at number eighty-one and soon after reached number one. It also reached number two in the UK Singles Chart, where the group had had success before its American breakthrough. Though they had made a few European charts before, this brought the band to their first mainstream success in the United States.\n\nExtreme followed &quot;More Than Words&quot; with another power ballad, &quot;Hole Hearted&quot;, which was slightly faster paced than &quot;More Than Words&quot;, but nevertheless topped at number four in the United States and number three in Canada.\n\nPornograffitti (also titled as Extreme II: Pornograffitti) is the second album released by Boston rock band Extreme. The title is a portmanteau of pornography and graffiti.\n\nThe album sold very well, peaking at #10 on the Billboard 200 and being certified double platinum in the U.S. by the RIAA. It is the band's best selling album. Two singles from Pornograffiti, &quot;More Than Words&quot; and &quot;Hole Hearted,&quot; made the top-5 on the Billboard Hot 100. Two other tracks, &quot;Decadence Dance&quot; and &quot;Get The Funk Out,&quot; made the lower half of Billboard's rock chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c25bbc75a0cc6cb0f98d9f1ed05dfd814f78bc53","amp;dn":"Extreme+-+More+Than+Words+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c25bbc75a0cc6cb0f98d9f1ed05dfd814f78bc53","infoHashBuffer":{"type":"Buffer","data":[194,91,188,117,160,204,108,176,249,141,159,30,208,93,253,129,79,120,188,83]},"announce":[],"urlList":[]}}