{"title":"Blue Cheer - Crossroads Festival April 11 (2008)","uid":5154272,"size":105353088,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c27a8a0215b3f7f09fd491281fd0462b14033422&amp;dn=Blue+Cheer+-+Crossroads+Festival+April+11+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1257754930,"description":"Size: 100 MB\nBitrate: 320\nmp3\nFound in OuterSpace\nNo Artwork\n\nBlue Cheer is an American blues-rock band that initially performed and recorded in the late 1960s and early 1970s, and has been sporadically active since. Based in San Francisco, Blue Cheer played in a psychedelic blues-rock style, and are also credited as being pioneers of heavy metal music. According to Tim Hills in his book, The Many Lives of the Crystal Ballroom, &quot;Blue Cheer was the epitome of San Francisco psychedelia. The band was rumored to have been named for a brand of LSD and promoted by renowned LSD chemist and former Grateful Dead patron, Owsley Stanley.\n\nThe band's sound was something of a departure from the music that had been coming out of the Bay Area: Blue Cheer's three musicians played heavy blues-rock, and played it very loud.\n\n1966-1969: Golden Years\nThe group came together in 1966. It was co-founded by Eric Albronda and Jerry Russell, music aficionados who wanted to become involved with the San Francisco music scene of the 1960s. Both moved with Dickie Peterson from Davis, California, to San Francisco. Peterson had previously been with the Davis-based band, Andrew Staples &amp; The Oxford Circle. Later Blue Cheer members Paul Whaley and Gary Lee Yoder also played with this band at the time. Original personnel were singer/bassist Dickie Peterson, guitarist Leigh Stephens and Eric Albronda as a drummer. Then Albronda was replaced by Paul Whaley, who was joined by three others: Dickie's brother Jerre Peterson (guitar), Vale Hamanaka (keyboards) and Jerry Whiting (vocals, harmonica). Albronda continued his association with Blue Cheer as a member of Blue Cheer management, as well as being the producer or co-producer of five Blue Cheer albums.\n\nEarly on, it was decided that the lineup should be trimmed down. It is said that Blue Cheer decided to adopt a power trio configuration after seeing Jimi Hendrix perform at the Monterey Pop Festival.[5] Hamanaka and Whiting were asked to leave. And Jerre Peterson didn't want to remain in the group without them. So he departed as well, leaving Dickie, Leigh and Paul as a trio. Their first hit was a cover version of Eddie Cochran's &quot;Summertime Blues&quot; from their debut album Vincebus Eruptum (1968). The single peaked at #14 on the Billboard Hot 100 chart, their only such hit, and the album peaked at #11 on the Billboard 200 chart.\n\nThe group's sound was hard to categorise, but was definitely blues-based, psychedelic, and loud.\n\nThe &quot;Summertime Blues&quot; single was backed with Dickie Peterson's original song &quot;Out Of Focus&quot;. Petersen also contributed to the album the eight-minute &quot;Doctor Please&quot; and &quot;Second Time Around&quot;, which features Paul Whaley's frantic drum solo. Filling out the record, the band cranks out blues covers &quot;Rock Me Baby&quot; and Mose Allison's &quot;Parchman Farm&quot; (titled &quot;Parchment Farm&quot;).\n\nThe group underwent several personnel changes, the first occurring after the 1968 release of Outsideinside after Leigh Stephens left the band due to musical differences or, as some report, deafness, He was replaced by Randy Holden, formerly of Los Angeles garage rock band The Other Half On 1969's New! Improved! Blue Cheer there were different guitarists on side 1 and 2, Randy Holden and Bruce Stephens, due to Holden's unanticipated departure from the band. Ralph Burns Kellogg also joined the band on keyboards. Blue Cheer's style now changed to a more commercial hard rock sound ÃƒÂ  la Steppenwolf or Iron Butterfly. For the fourth album Blue Cheer, Bruce Stephens left and was succeeded by Gary Lee Yoder who helped complete the album.\n\nThe new line-up of Peterson, Ralph Burns Kellogg, Norman Mayell (drums) and Yoder in 1970 saw the release of The Original Human Being and then 1971's Oh! Pleasant Hope. When Oh! Pleasant Hope failed to dent the sales charts, Blue Cheer temporarily split up by 1972.\n\nThere was a temporary resumption in 1974 with Dickie Peterson being joined by brother Jerre, Ruben de Fuentes(guitar) and Terry Rae(drums)[11] for some tour dates. This grouping continued on briefly in 1975 with former Steppenwolf bassist Nick St. Nicholas replacing Dickie. The group was then largely inactive for nearly three years, until 1978.\n\nDickie returned in 1978-79 with a fresh line-up of Tony Rainier on guitar and Mike Fleck on drums. This version of the group never got out of rehearsal studios. Blue Cheer was then inactive for a further three years.\n\nBlue Cheer was inactive from 1980 to 1983. In 1984, Peterson had better luck when he returned with Whaley and Rainier as Blue Cheer and a brand new album The Beast is Back, which was released on the European label Megaforce Records . Whaley left again in 1985, as drummer Bret Heartman took over, only to be succeeded by Billy Carmassi in 1987. That same year, Dickie led yet another new lineup of the Cheer that had Ruben de Fuentes back on guitar and Eric Davis on drums. In 1988, the trio further changed, being now composed of Dickie Peterson (bass), with Andrew &quot;Duck&quot; McDonald(guitar) and Dave Salce(drums).\n\nFrom 1988 to 1993, Blue Cheer toured mainly in Europe. During this time, they played with classic rock acts as well as then-up-and-coming bands: Mountain, Outlaws, Thunder, The Groundhogs, Ten Years After, The Yardbirds, Danzig, Mucky Pup and others.\n\n1989 saw the release of Blue Cheer's first official live album, Blitzkrieg over NÃƒÂ¼remberg. This album was recorded during Blue Cheer's first European tour in decades.\n\n1990 saw the release of the Highlights &amp; Lowlives studio album, composed of blues-based heavy metal and one ballad. The album was produced by notable grunge producer Jack Endino. The line-up was Peterson, Whaley on drums and McDonald on guitars.\n\nBlue Cheer followed up &quot;Highlights&quot; with the much heavier Dining with the Sharks. McDonald was replaced by German ex-Monsters guitar player Dieter Saller. Peterson was on bass and vocals again, and Paul Whaley was again on drums. Also featured is a special guest appearance by Groundhogs guitarist Tony McPhee. The album was produced by Roland Hofmann.\n\nGary Holland, (ex-Dokken), replaced Whaley on drums in 1993.\n\nIn the early 1990s, Peterson and Whaley re-located to Germany. Whaley still lives there, while Peterson moved back to California in 1994. After Peterson came back to the U.S., Blue Cheer was dormant from 1995 to 1998.\n\nIn 1999, Peterson &amp; Whaley got together with guitarist McDonald, to resume touring as Blue Cheer. This band configuration has remained largely constant from 1999 to the present.\n\nIn 2000, Blue Cheer was the subject of a tribute album, Blue Explosion - A Tribute to Blue Cheer, featuring such bands as Pentagram, Internal Void, Hogwash and Thumlock.\n\nPeterson and Leigh Stephens were together once again in Blue Cheer with drummer Prairie Prince at the Chet Helms Memorial Tribal Stomp in San Francisco's Golden Gate Park on October 29th, 2005, and their lively performance drew old rockers like Paul Kantner and others from backstage to observe. They did some recordings in Virginia in Winter 2005 with Joe Hasselvander of Raven and Pentagram on drums, due to Paul Whaley choosing to remain in Germany. While Hasselvander played on the entire album, his contribution was reduced to drums on five songs, with Paul Whaley re-recording the drum parts on the balance of the album. This was because Whaley was set to rejoin the band and it was felt that he should contribute to the album, prior to touring. The resulting CD, What Doesn't Kill You..., released in 2007, features contributions from both Whaley and Hasselvander as a consequence.\n\nBlue Cheer's video for Summertime Blues made an appearance in 2005 documentary Metal: A Headbanger's Journey, where Geddy Lee of Rush referred to the group as one of the first heavy metal bands.\n\nThe band is also regarded as the godfathers of stoner rock. Bands like Kyuss, Fu Manchu, Nebula and Monster Magnet have cited their &quot;heavy-fuzz rock&quot; as a massive influence on them.\n\nApril 11, 2008, Crossroads Festival, Harmonie, Bonn, Germany\n\n01. Parchment Farm\n02. Rollin' Dem Bones\n03. Out Of Focus\n04. Just A Little Bit\n05. Maladjusted Child\n06. Summertime Blues\n07. The Hunter \n\nand there's an interview part\n\n\nweird, or what?","torrent":{"xt":"urn:btih:c27a8a0215b3f7f09fd491281fd0462b14033422","amp;dn":"Blue+Cheer+-+Crossroads+Festival+April+11+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c27a8a0215b3f7f09fd491281fd0462b14033422","infoHashBuffer":{"type":"Buffer","data":[194,122,138,2,21,179,247,240,159,212,145,40,31,208,70,43,20,3,52,34]},"announce":[],"urlList":[]}}