{"title":"[PSX] Policenauts (English) [NTSC-J]","uid":6447575,"size":1729957077,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:c2ba2a2bc7e03dda8d72ae540c7c788ae075b367&amp;dn=%5BPSX%5D+Policenauts+%28English%29+%5BNTSC-J%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1307315979,"description":"Policenauts for the Sony Playstation One                            Rel. 01/19/1996\n \n\nFormat:        CD-R NTSC-J\nLang.:         English\nDiscs:         2\nImage:         ISO\nRequirements:  Modded/Chipped Playstation or Ps2, Breaker Pro/Boot-cd, \n               Game Enchancer/Built-in Mod, or psx emulator.\n               (You only need to use one of these mentioned methods)\n\n\nCompressed with 7zip. Game was tested and works.\n\n\n\nNote: No Psone Backup Disc/game or copy will work unless your Psone or Ps2 \n      Console is modded, or if you use a Boot Disc like Breaker Pro, or\n      Use a Game Enchancer Plug in Port which is like a boot disc and\n      Can Load Backups.\n\n\n\n\nRelease Notes - Patched to english, can be played with a modded psone/ps2.\n                Or Emulator (Included).\n\n\n\nGame Description:\n\nThe game centers on Jonathan Ingram, one of the five &quot;Policenauts&quot;, astronauts with police training, assigned to ensure the safety of Beyond Coast, mankind's first fully-functional space colony in the year 2013. A freak accident occurs while testing a new space walking suit and Jonathan is drifted away into space and is presumed dead by his colleagues. He is found alive and well nearly 25 years later thanks to the cold-sleep module connected to the suit. Three years later, Jonathan (now a private investigator working in the former Los Angeles) is visited by his former wife, Lorraine. She asks for Jonathan's help in solving the disappearance of her current husband, Kenzo Hojo, the only clues he left behind being a torn leaf, a set of capsules, and the word &quot;Plato&quot;. Jonathan is reluctant to take her case at first. However, after Lorraine leaves his office, she is attacked and murdered by a man in a black motorcycle suit. Jonathan, unable to catch the culprit, decides to fulfill his ex-wife's final request and travels to Beyond. There he is reunited with his former partner from his LAPD days, Ed Brown, who agrees to help Jonathan investigate the circumstances surrounding Hojo's disappearance and Lorraine's murder.\n\nPolicenauts is very similar to Snatcher. It is also written by Hideo Kojima, has a great story, and features shooting sequences. To put it shortly, if you liked Snatcher, you'll like Policenauts as well. Actually, Policenauts is in many ways a better game.\n\nGame is also playstation mouse compatible. And is More point and click.\n\n\nGame Pics Included.\n\n\nBurn with Alcohol 120% (Included).\n\n\nSet DataType to Playstation (Write Method Raw/Dao) and burn at 8x Speed.\n\nUse Verbatim or Tayio Yuden CD-R Media for best quality, or if other media isn't\nworking.\n\n\nIf this is working fine for you let us know post a comment.\n\n\nPlease Seed This When your done.\n\n(I Can't seed 24/7 do your part and seed to keep the torrent healthy).\n\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:c2ba2a2bc7e03dda8d72ae540c7c788ae075b367","amp;dn":"%5BPSX%5D+Policenauts+%28English%29+%5BNTSC-J%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2ba2a2bc7e03dda8d72ae540c7c788ae075b367","infoHashBuffer":{"type":"Buffer","data":[194,186,42,43,199,224,61,218,141,114,174,84,12,124,120,138,224,117,179,103]},"announce":[],"urlList":[]}}