{"title":"Inverse Theory for Petroleum Reservoir Characterization and Hist","uid":14695672,"size":7108716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2e0f11bddf598ff2a788c33ebe05adcc9c8c2a0&amp;dn=Inverse+Theory+for+Petroleum+Reservoir+Characterization+and+Hist&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1464228574,"description":"Inverse Theory for Petroleum Reservoir Characterization and History Matching - Dean S. Oliver et al. (CUP, 2008).pdf\r\n\r\nISBN 978-0-521-88151-7\r\n\r\nThis book is a guide to the use of inverse theory for estimation and conditional simulation of flow and transport parameters in porous media. It describes the theory and practice of estimating properties of underground petroleum reservoirs from measurements of flow in wells, and it explains how to characterize the uncertainty in such estimates. Early chapters present the reader with the necessary background in inverse theory, probability and spatial statistics. The book demonstrates how to calculate sensitivity coefficients and the linearized relationship between models and production data. It also shows how to develop iterative methods for generating estimates and conditional realizations. The text is written for researchers and graduates in petroleum engineering and groundwater hydrology and can be used as a textbook for advanced courses on inverse theory in petroleum engineering. It includes many worked examples to demonstrate the methodologies and a selection of exercises","torrent":{"xt":"urn:btih:c2e0f11bddf598ff2a788c33ebe05adcc9c8c2a0","amp;dn":"Inverse+Theory+for+Petroleum+Reservoir+Characterization+and+Hist","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2e0f11bddf598ff2a788c33ebe05adcc9c8c2a0","infoHashBuffer":{"type":"Buffer","data":[194,224,241,27,221,245,152,255,42,120,140,51,235,224,90,220,201,200,194,160]},"announce":[],"urlList":[]}}