{"title":"PF61-66 Shattered Star","uid":8595680,"size":151911116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c32f25de576efe6a6dea3b187aece7fe807f1846&amp;dn=PF61-66+Shattered+Star&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":6,"time":1371755322,"description":"The Pathfinder RPG builds on more than 10 years of system development and the largest open playtest in the history of tabletop gaming to create an unparalleled fantasy RPG experience. Players need only the Pathfinder RPG Core Rulebook to play, but Paizo Publishing produces a wide range of books and accessories to enhance your Pathfinder experience, from hardcover rules compendiums to complete campaigns to packets of beautiful full-color maps.\n\nAdventure Path Description:\n\nFrom the ashes of Thassilon, an ancient power shall rise again!\n\nThe ancient empire of the runelords may be long dead, yet the legacy of Thassilon continues to haunt the frontier realm of Varisia. With the rise of one runelord only narrowly thwarted, Korvosa reeling after the curse of the Crimson Throne nearly brought the city to its knees, and Riddleport rebuilding after a close call with a falling star, the people of Varisia fear that the greatest threat to their land has yet to play its hand. When agents of the newest Pathfinder Society lodge in Magnimar learn of a fragmented artifact scattered throughout the lands of old Thassilon, it falls to a new band of heroes to step in and gather up the seven fragments of this Shattered Star. For if the greatest prize of Thassilon's first ruler cannot save Varisia... what can?\n\nShards of Sin\nCurse of the Lady's Light\nThe Asylum Stone\nBeyond the Doomsday Door\nInto the Nightmare Rift\nThe Dead Heart of Xin\n\n\nPS: Support the companies, which games you enjoy! Like Paizo","torrent":{"xt":"urn:btih:c32f25de576efe6a6dea3b187aece7fe807f1846","amp;dn":"PF61-66+Shattered+Star","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c32f25de576efe6a6dea3b187aece7fe807f1846","infoHashBuffer":{"type":"Buffer","data":[195,47,37,222,87,110,254,106,109,234,59,24,122,236,231,254,128,127,24,70]},"announce":[],"urlList":[]}}