{"title":"Natasha's Dance_ A Cultural History of Russia.pdf","uid":6374870,"size":51542493,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3330c2972ca2a79b51b82225cce032691c25df7&amp;dn=Natasha%5C%27s+Dance_+A+Cultural+History+of+Russia.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"baboo456","files":1,"time":1304821606,"description":"Figes (history, Univ. of London; A People's Tragedy) describes the twists and turns of Russian history through cultural and artistic events from the founding of Rus in the 12th century through the Soviet era. He uses Tolstoy's War and Peace as a centerpiece of art imitating life. The title of Figes's book comes from the scene in which Natasha Rostov and her brother Nikolai are invited by their &quot;uncle&quot; to a rustic cabin to listen to him play Russian folk music on his guitar. Natasha instinctively begins a folk dance that is prompted by &quot;unknown feelings in her heart.&quot; Tolstoy would have us believe that &quot;Russia may be held together by unseen threads of native sensibilities,&quot; writes Figes. Nowhere is the clash between the European culture of the upper class and the Russian culture of the peasantry more evident. &quot;The complex interactions between these two worlds had a crucial influence on the national consciousness and on all the arts of the 19th century.&quot; This interaction is a major feature of this book, which traces the formation of a culture. The writing style is distinctly nonacademic, making for a very enjoyable read. ","torrent":{"xt":"urn:btih:c3330c2972ca2a79b51b82225cce032691c25df7","amp;dn":"Natasha%5C%27s+Dance_+A+Cultural+History+of+Russia.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3330c2972ca2a79b51b82225cce032691c25df7","infoHashBuffer":{"type":"Buffer","data":[195,51,12,41,114,202,42,121,181,27,130,34,92,206,3,38,145,194,93,247]},"announce":[],"urlList":[]}}