{"title":"Space Engineers v01.108.946","uid":12760570,"size":4078580135,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c365b218a8aca17a4dd32b21849680a024979ee4&amp;dn=Space+Engineers+v01.108.946&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1447527349,"description":"About This Game\r\nSpace Engineers is a sandbox game about engineering, construction, exploration and survival in space and on planets. Players build space ships, space stations, planetary outposts of various sizes and uses (civil and military), pilot ships and travel through space to explore planets and gather resources to survive. Featuring both creative and survival modes, there is no limit to what can be built, utilized and explored.\r\n\r\nSpace Engineers features a realistic, volumetric-based physics engine: everything in the game can be assembled, disassembled, damaged and destroyed. The game can be played either in single or multiplayer modes.\r\n\r\nVolumetric objects are structures composed from block-like modules interlocked in a grid. Volumetric objects behave like real physical objects with mass, inertia and velocity. Individual modules have real volume and storage capacity.\r\n\r\nSpace Engineers is inspired by reality and by how things work. Think about modern-day NASA technology extrapolated 60 years into the future. Space Engineers strives to follow the laws of physics and doesn't use technologies that wouldn't be feasible in the near future.\r\n\r\nSpace Engineers concentrates on construction and exploration aspects, but can be played as a survival shooter as well. We expect players will avoid engaging in direct man-to-man combat and instead use their creativity and engineering skills to build war machines and fortifications to survive in space and on planets. Space Engineers shouldn’t be about troops; it should be about the machinery you build","torrent":{"xt":"urn:btih:c365b218a8aca17a4dd32b21849680a024979ee4","amp;dn":"Space+Engineers+v01.108.946","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c365b218a8aca17a4dd32b21849680a024979ee4","infoHashBuffer":{"type":"Buffer","data":[195,101,178,24,168,172,161,122,77,211,43,33,132,150,128,160,36,151,158,228]},"announce":[],"urlList":[]}}