{"title":"Missile Command","uid":7369942,"size":459709974,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c3a9a4b1abbdecbcb6e65b686eebcc7f5c3d9b83&amp;dn=Missile+Command&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"esharoth","files":-1,"time":1340205252,"description":"Title: Missile Command\nGenre: action / arcade / sci-fi\nReleased: 16th November 1999\nDeveloper: Meyer Glass Interactive\nPublisher: Hasbro Interactive\nDescription:\nBased on the 1980 arcade hit from Atari, Missile Command features two basic modes of play: Classic and Ultimate. Classic is similar to the original game but with updated graphics and sound. You must defend six cities from wave after wave of missiles. Some missiles begin at the top of the screen; others are dropped from enemy craft. Some are MIRVs, meaning they split into two or more warheads as they descend. Other enemies include bombers, satellites and smart missiles.\n\nTo defend your cities, you are provided with three Missile Pods placed equidistant along the bottom of the play field, in the middle and on either side. To target your missiles, you maneuver your crosshairs (with a mouse) across the landscape and sky. When the crosshairs are in place, fire a missile from one of your Pods, preferably the Pod closest to the incoming missile. When the missile explodes, any enemy caught in the blast radius is destroyed. As you probably guessed, cities are vulnerable to missile fire; what you may not know is that Missile Pods are vulnerable as well (however, the pods, unlike the cities, renew themselves after you complete a wave).\n\nMissiles at your disposal are limited within each round. At the end of each wave, you get bonus points for remaining missiles and intact cities. When all of your cities are destroyed, the game is over. For every 10,000 points you score (in default mode), you earn an extra city. However, never more than six cities appear onscreen at once.\n\nThe Ultimate mode of play shares many of the basic play mechanics of the Classic game but adds lots of new features, including weapon upgrades, rotating Pods, special weapons, a weapons purchasing system and power-ups. Also in the mix is a partially scrolling play field (with off-screen enemies), a radar screen, helpful voice effects, new enemies, mothership bosses, 3D graphics and the ability to actually win the game (as opposed to merely trying to stay alive forever).\n\nNew weapons include splitting warheads, shield missiles, missiles with a larger blast radius, faster missiles and Electronic Impulse Missiles which create a massive localized electromagnetic disturbance that overloads the electronic components of an enemy weapon or craft in range. Your mission is to fight off waves of alien attacks on cities located in key regions of the world. Pod pilots - Firewall, Tactix and Case - will send you to where you are needed most.\n\nHow to play:\n1) Download the torrent files;\n2) Mount or burn disc image;\n3) Run SETUP.EXE to install;\n4) Play the game with the disc inserted.\n\n! Notice\nTested and working perfectly on Windows 7 x64.","torrent":{"xt":"urn:btih:c3a9a4b1abbdecbcb6e65b686eebcc7f5c3d9b83","amp;dn":"Missile+Command","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3a9a4b1abbdecbcb6e65b686eebcc7f5c3d9b83","infoHashBuffer":{"type":"Buffer","data":[195,169,164,177,171,189,236,188,182,230,91,104,110,235,204,127,92,61,155,131]},"announce":[],"urlList":[]}}