{"title":"166 Days - Jennifer Clark.epub","uid":9997036,"size":792178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3cef53dd9e6cb72b689a03028b1bf16b2953f76&amp;dn=166+Days+-+Jennifer+Clark.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1397935228,"description":"Afghanistan. Outside the wire. Combat. Green Berets. Insurgents. All words Jennifer Clark, Air Force Physician Assistant, never imagined would pertain to her, yet would soon become her reality. In 2008 she was faced with a deployment into the trenches of the most violent regions of Afghanistan as an augmentee to a US Army team of Green Berets. Her duty was to lead a Female Treatment Team, which was comprised of a female provider and a female medic, tasked to provide medical care to the underserved women and children in Afghanistan. She would run the clinic located on a firebase that was once a Taliban stronghold taken over by Coalition Forces in 2002. She was a young officer; newly commissioned after serving five years as an enlisted medic, with just less than one year of experience as a Physician Assistant. The child lying in blood-soaked clothes as his father screamed frantically in Pashtu beside him, the man who traveled for five days by camel after his arm was blown up in an explosion, the beautiful little girl covered in blood with shrapnel wounds to her entire abdomen, face and arms. These were a few of the hundreds of patients with unimaginable ailments Jennifer Clark treated during her deployment to Afghanistan, a country where, she discovered, &quot;children never had a childhood, women lived in constant fear and men knew nothing but a life of fighting&quot;. 166 Days: My Journey through the Darkness is a page turning account of innocent people losing their lives simply because they frequented the wrong place at the wrong time and of lives sacrificed to the cause by brave and committed young men. 166 Days illustrates the challenges Jennifer faced daily; from being a female in a Special Forces world of men, to treating patients with indescribable conditions and the frequent attacks of the firebase by the Taliban. 166 Days is a gripping account of war, but it is more than that.","torrent":{"xt":"urn:btih:c3cef53dd9e6cb72b689a03028b1bf16b2953f76","amp;dn":"166+Days+-+Jennifer+Clark.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3cef53dd9e6cb72b689a03028b1bf16b2953f76","infoHashBuffer":{"type":"Buffer","data":[195,206,245,61,217,230,203,114,182,137,160,48,40,177,191,22,178,149,63,118]},"announce":[],"urlList":[]}}