{"title":"Kennedy Assassination Collection","uid":9519833,"size":5391989496,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c449b7476b6a09c80fe473c0a895cccef35a0077&amp;dn=Kennedy+Assassination+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"888guy","files":23,"time":1390605922,"description":"WARNING: If your a video-phile, you will be disappointed with the quality of the included videos.  They are offered here for their historical value and not as an example of high-def video at it's best - these apparently have been ripped from VCR tape.  Nonetheless, they are &quot;watchable&quot; and, in my view, fascinating in terms of content.  Also, I've included 3 episodes of &quot;The Men Who Killed Kennedy&quot; which can be are very difficult to find and which are prohibited from distribution in the US.\n\n\nMany of these files (not all of them) are already available for download via other torrents.  I've simply assembled this package for anyone who might - like myself - be interested in the Kennedy Assassination and the various theories surrounding JFK's murder.  These, in my opinion, are some of the most thought-provoking and revelatory materials I've come across regarding JFK's assassination.\n\n\nA Personal Experience:\n\nAs a young kid (age 11)I found the murder of Oswald and the death of Ruby to be bizarrely synchronous (as well as the deaths of a lot of other witnesses).  And, of course, there was the Zapruder film.  As someone who had been an NRA member since age 9, it appeared clear to me that the fatal shot had clearly come from the front. Then, something happened which piqued my curiosity even further.\n  \nIn 1978 I had Thanksgiving dinner with a high-ranking FBI official - a good friend of J. Edgar Hoover - at his Maryland ranch.  He was the father of a co-worker and I'd been invited for the holiday.  In his den, over a few drinks, I casually asked him what he believed really happened to JFK.  At the mention of JFK's name he turned beet red and launched into a vitriolic tirade in which - among other things - he described JFK as a f**cking whoremonger&quot;, and, &quot;a communist&quot;.  He summed it all up saying something  to the effect that JFK had &quot;gotten what he'd deserved in Dallas&quot;. His hatred of Kennedy was like nothing I'd ever seen - he was virtually overjoyed that both JFK and RFK had been murdered.  It was a weird Thanksgiving and  it made clear to me that a lot of high-powered folks in Washington wanted Kennedy dead.  \n\nI know that some will disagree, but it's my opinion that Lee Harvey Oswald never killed anyone.\n     \nIncluded in this download are the following:\n     \n&gt;&gt; &quot;The Men Who Killed Kennedy&quot;, a 9-part video series in .avi and .mpg format   \n   (relatively low-quality, TV video) - Produced in the UK over a number of years,\n   this series provides compelling testimony from a variety of sources which calls   \n   into question the lone assassin theory.  On the other hand, one episode names   \n   three individuals as the likely &quot;hit men&quot;, and, all of them have iron-clad \n   alibis.  Evidence has subsequently shown that they could not have been involved.\n   Parts 7 though 9 have been banned for distribution in the United States as,   \n   among other things, the final episode accuses Lyndon Johnson of complicity in \n   the killing of JFK.  It was aired once, on The History Channel in the United   \n   States, and resulted in a flurry of lawsuits (one coming from Lady Bird  \n   Johnson). I don't believe the 3 last episodes are available on most bit torrent   \n   sites....\n        \n    [1] The Coup d'Etat.avi\n    [2] The Forces of Darkness.avi\n    [3] The Cover-Up.avi\n    [4] The Patsy.avi\n    [5] The Witnesses.avi\n    [6] The Truth Shall Set You Free.avi\n    [7] Smoking Guns.mpg\n    [8] The Love Affair.mpg\n    [9] The Guilty Men.avi\n    \n&gt;&gt; &quot;Evidence of Revision -  LBJ, Hoover and Others&quot; - This is Part 3 of an   \n    otherwise rather boring video series and offers a fascinating look at the FBI, \n    J. Edgar Hoover, LBJ, and the Kennedy assassination.\n    \n&gt;&gt; Two 4-hour episodes of Coast to Coast AM - November 16th, 2013, and November 22,   \n   2013.  The November 16th program features Roger Stone who theorizes that LBJ was   \n   at the center of the plot to kill Kennedy - and in my opinion, he makes a damned \n   persuasive case for his theory.  The November 22nd show features a variety of   \n   guests.  I have included all four hours of each program (some of which may not  \n   be relevant to the JFK case).\n&gt;&gt; Two copies of The Warren Commission Report in PDF format.  One is easier to  \n   navigate and read, but is lacking the photographs and diagrams.   The other is    \n   virtual photocopy of the entire report.\n\n\nI understand that some individuals still subscribe to the lone assassin theory.  I feel as though the evidence is overwhelming that the theory of a lone assassin is unmitigated bullshit - but I respect anyone's right to disagree.  At any rate, I hope some folks will find these materials interesting......","torrent":{"xt":"urn:btih:c449b7476b6a09c80fe473c0a895cccef35a0077","amp;dn":"Kennedy+Assassination+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c449b7476b6a09c80fe473c0a895cccef35a0077","infoHashBuffer":{"type":"Buffer","data":[196,73,183,71,107,106,9,200,15,228,115,192,168,149,204,206,243,90,0,119]},"announce":[],"urlList":[]}}