{"title":"Black Diamond Heavies - Every Damn Time","uid":4310510,"size":38028435,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c49674cb5daea4c57f61a0167a47300db7f74de3&amp;dn=Black+Diamond+Heavies+-+Every+Damn+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"baader666","files":10,"time":1216787631,"description":"Black Diamond Heavies - Every Damn Time\n\nStripping the deep blues to its frame and running the music through a big stack of amps while shaking it into a cold sweat, the Black Diamond Heavies are a band from East Nashville, TN, who prove that in terms of sonic impact and soulful energy, size doesn&amp;#039;t matter much at all. The Black Diamond Heavies were formed by keyboard man and vocalist John Wesley Myers, Mark &quot;Porkchop&quot; Holder on guitar and harmonica, and drummer Van Campbell. Myers was previously a member of the feral blues-punk combo the Immortal Lee County Killers, while Campbell had kept time with the Invisibles and the Rum Circus. The Black Diamond Heavies started gigging in 2004 and self-released an EP called You Damn Right in 2005. The record and especially the BDHs&amp;#039; wildly frantic live shows won them a rabid fan following, especially in the South, but in early 2006 Holder amicably left the band, unhappy with the rigors of life on the road. Myers and Campbell opted not only to continue without Holder, but to not replace him; stripped down to a two-piece, the band&amp;#039;s music became even more raw and intense than before, and in the summer of 2006 the band scored a record deal with noted garage punk label Alive Records. The Black Diamond Heavies&amp;#039; first full-length album, Every Damn Time, was released in early 2007. ","torrent":{"xt":"urn:btih:c49674cb5daea4c57f61a0167a47300db7f74de3","amp;dn":"Black+Diamond+Heavies+-+Every+Damn+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c49674cb5daea4c57f61a0167a47300db7f74de3","infoHashBuffer":{"type":"Buffer","data":[196,150,116,203,93,174,164,197,127,97,160,22,122,71,48,13,183,247,77,227]},"announce":[],"urlList":[]}}