{"title":"Stan Getz - Captain Marvel [24 bit FLAC] vinyl","uid":8111598,"size":955085017,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c50ed5a087bb8b73437e961b727a8f8a9af265a8&amp;dn=Stan+Getz+-+Captain+Marvel+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"24.96","files":-1,"time":1360197702,"description":"One of the more remarkable aspects of Stan Getz's 1972 masterpiece is just how organic he was able to keep the sound. The band surrounding Getz on this Columbia date was led by Chick Corea with his Return to Forever (electric) bassist Stanley Clarke, drummer Tony Williams, and Brazilian master percussionist Airto. With the exception of Clarke, all the rest had played with Miles Davis in his then-experimental electric bands. Corea's Return to Forever was just getting itself off the fusion ground, while Williams had been with John McLaughlin and Larry Young in Lifetime on top of his experience with Davis. But make no mistake, this is a Stan Getz record, his gorgeous tenor tone furiously and fluidly playing through all of Corea's difficult changes on Corea's Latin carnival jam, &quot;La Fiesta,&quot; and shapeshifting his way through mode changes on &quot;Five Hundred Miles High.&quot; The nucleus for the bedrock of Return to Forever was in the Getz laboratory of extended complex harmony and a strict adherence to melodic improvisation. Billy Strayhorn's &quot;Lush Life&quot; is the space in which Getz teaches the band about dynamic, texture, and ambience - he even has Clarke bowing his bass. This band, combining as it did the restlessness of electric jazz with Getz's trademark stubbornness in adhering to those principles that made modern jazz so great, made for a tension that came pouring out of the speakers with great mutual respect shining forth from every cut - especially the steamy Latin-drenched title track. Captain Marvel is arguably the finest recording Getz made during the 1970s.","torrent":{"xt":"urn:btih:c50ed5a087bb8b73437e961b727a8f8a9af265a8","amp;dn":"Stan+Getz+-+Captain+Marvel+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c50ed5a087bb8b73437e961b727a8f8a9af265a8","infoHashBuffer":{"type":"Buffer","data":[197,14,213,160,135,187,139,115,67,126,150,27,114,122,143,138,154,242,101,168]},"announce":[],"urlList":[]}}