{"title":"Mississippi Fred McDowell I Do Not Play No Rock 'n' Roll (mp3@","uid":6145248,"size":149239669,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c57c6b8100ee7d4d46174322dedd2d201f422636&amp;dn=Mississippi+Fred+McDowell+I+Do+Not+Play+No+Rock+%5C%27n%5C%27+Roll+%28mp3%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":15,"time":1296607555,"description":"MISSISSIPPI FRED McDOWELL I DO NOT PLAY NO ROCK N ROLL\nAudio CD October 30, 2001 \nOriginal Release Date: 1969 \nLabel: Varese Sarabande\nFormat:Mp3@320\n\nBy the time acoustic blues master Mississippi Fred McDowell finally plugged in for the first time, something this recording captures, his songs were already a major part of the emerging blues-rock scene of the late 1960s. The slide-guitar genius was a Delta blues purist of the first degree who ignored all else, even while serving as a significant influence on a new generation of blues players. His influence endures, and his music, in its original form, remains riveting. The best example is the timeless classic &quot;You Got to Move,&quot; covered by the Rolling Stones in a surprisingly faithful rendition on 1971's Sticky Fingers and radically reconfigured by adventurous jazz diva Cassandra Wilson three decades later on Belly of the Sun. Both versions are excellent, but McDowell's original, saturated with searing sincerity and electrifying licks, is better. In similar style, McDowell demonstrates the inspiration behind &quot;Kokomo Me Baby&quot; (popularized by his protÃƒÂ©gÃƒÂ© Bonnie Raitt), &quot;Good Morning Little Schoolgirl,&quot; and &quot;Baby Please Don't Go,&quot; all core material of the modern blues-rock repertoire. All have since been done in different styles, but none have been done better. If you're looking for the real roots of modern blues and you haven't explored McDowell's ragged but righteous creations, you need to immediately redefine your search and hear his inspirational source music firsthand. \n\nTracklist\n1. Baby Please Don't Go\n2. Good Morning Little School Girl \n3. Kokomo Me Baby \n4. That's All Right Baby \n5. Red Cross Store \n6. Everybody's Down On Me\n7. 61 Highway \n8. Glory Hallelujah \n9. Jesus Is On The Mainline \n10 My Baby She Gonna Jump And Shout \n11. Long Line Skinner \n12. You Got To Move \n13The Train I Ride \n14. You Ain't Gonna Worry My Life Anymore \n\nRecorded at Malaco Studios, Jackson, Mississippi in September 1969.\n Originally released on Capitol (SM-409)[Tracks 1-9]\n\n\nPersonnel includes: Mississippi Fred McDowell (vocals, electric guitar); Jerry Puckett (bass); Dulin Lancaster (drums).","torrent":{"xt":"urn:btih:c57c6b8100ee7d4d46174322dedd2d201f422636","amp;dn":"Mississippi+Fred+McDowell+I+Do+Not+Play+No+Rock+%5C%27n%5C%27+Roll+%28mp3%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c57c6b8100ee7d4d46174322dedd2d201f422636","infoHashBuffer":{"type":"Buffer","data":[197,124,107,129,0,238,125,77,70,23,67,34,222,221,45,32,31,66,38,54]},"announce":[],"urlList":[]}}