{"title":"The four conversations - Daily Communication That brings results","uid":7925977,"size":956546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c65ede9650efa8a59817679cd7d2e1c0452db570&amp;dn=The+four+conversations+-+Daily+Communication+That+brings+results&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"KatQwerty","files":3,"time":1355583560,"description":"\n[b]Voted as the BOOK of the YEAR by 800CEO reads in 2009[/b]\n\nMost conversations to get things done at work are of one of four types-initiative conversations, conversations for understanding, performance conversations, or conversations for closure-but they are often done poorly or misused. This book shows managers and employees how to use the right conversation at the right time, plan and start each conversation well, and finish each conversation effectively.\n\n \n [b]Praise for The Four Conversations[/b]\n\n&quot;Conversation is the simplest, oldest, and most effective way for people to communicate. Yet too many people find conversations intimidating. Here are well-tested conversational practices that offer real support for leaders to discover the extraordinary benefits of communicating well.&quot;\n--Margaret J. Wheatley, author of Leadership and the New Science and Turning to One Another\n\n&quot;A seminal work that shows leaders how to move from unproductive chatter to conversations that make things happen.&quot;\n--Dave Logan, Professor at Marshall School of Business, University of Southern California, cofounder and senior partner of CultureSync, and author of Tribal Leadership and The Three Laws of Performance\n\n&quot;The Four Conversations takes the old ideas of workplace communication to an entirely new level of effectiveness and ease.&quot;\n--Jack Stack, President and CEO, SRC Holdings Corporation, and author of The Great Game of Business\n","torrent":{"xt":"urn:btih:c65ede9650efa8a59817679cd7d2e1c0452db570","amp;dn":"The+four+conversations+-+Daily+Communication+That+brings+results","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c65ede9650efa8a59817679cd7d2e1c0452db570","infoHashBuffer":{"type":"Buffer","data":[198,94,222,150,80,239,168,165,152,23,103,156,215,210,225,192,69,45,181,112]},"announce":[],"urlList":[]}}