{"title":"Joel Faflak - A Handbook of Romanticism Studies [2012][A]","uid":10397400,"size":2236010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c66d09bb2c424465de8b7edfe360bf75fd28d2d1&amp;dn=Joel+Faflak+-+A+Handbook+of+Romanticism+Studies+%5B2012%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403285931,"description":"Description\nProduct Details\nBook Title: A Handbook of Romanticism Studies\t\nBook Author: Joel Faflak, Julia M. Wright\nHardcover: 434 pages\nPublisher: Wiley-Blackwell; 1 edition (April 16, 2012)\nLanguage: English\nISBN-10: 9812700668\nISBN-13: 978-1-4443-3496-8\n\n===================================================================================\nBook Description\nPublication Date: April 16, 2012 | ISBN-10: 9812700668 | ISBN-13: 978-9812700667 | Edition: 1\nThe Handbook to Romanticism Studies is an accessible and indispensible resource providing students and scholars with a rich array of historical and up-to-date critical and theoretical contexts for the study of Romanticism.\nFocuses on British Romanticism while also addressing continental and transatlantic Romanticism and earlier periods\nUtilizes keywords such as imagination, sublime, poetics, philosophy, race, historiography, and visual culture as points of access to the study of Romanticism and the theoretical concerns and the culture of the period\nExplores topics central to Romanticism studies and the critical trends of the last thirty years.\n\n===================================================================================\nFrom the Back Cover\nA Handbook of Romanticism Studies features a collection of original essays by leading scholars, examining the literature of the Romantic period through the lens of critical and cultural theory. The entries explore key terms organized under the headings of Aesthetics and Media, Theories of Literature, Ideologies and Institutions, and Disciplinary Intersections. Some of these terms have been central to Romanticism studies for some time, such as imagination, sublime, and poetics. Other terms reflect critical trends of the last thirty years, including philosophy, race, historiography, and visual culture. The result is a collection which provides both introductory overviews and in-depth analyses of a variety of topics, offering a wide range of entry points to the study of Romanticism, from debates over the formal properties of high art to the impact of philosophical and scientific debates on conceptions of culture and cultural works. A Handbook of Romanticism Studies is an accessible and indispensible resource providing both students and scholars with a rich array of historical and up-to-date critical and theoretical contexts for the study of the literature and culture of the Romantic period.\n\n===================================================================================\nAbout the Author\nJoel Faflak is Associate Professor of English and Theory at the University of Western Ontario. He is author of Romantic Psychoanalysis: The Burden of the Mystery (2007), co-author of Revelation and Knowledge (2011) and editor of Sanity, Madness, Transformation: The Psyche of Romanticism (2005).\nJulia M. Wright is Canada Research Chair in European Studies at Dalhousie University. She is the author of Blake, Nationalism and the Politics of Alienation (2004) and Ireland, India, and Nationalism in Nineteenth-Century Literature (2007) and the editor of Irish Literature 1750-1900: An Anthology (Wiley-Blackwell, 2008) and the 2-volume A Companion to Irish Literature (Wiley-Blackwell, 2010).\n===================================================================================","torrent":{"xt":"urn:btih:c66d09bb2c424465de8b7edfe360bf75fd28d2d1","amp;dn":"Joel+Faflak+-+A+Handbook+of+Romanticism+Studies+%5B2012%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c66d09bb2c424465de8b7edfe360bf75fd28d2d1","infoHashBuffer":{"type":"Buffer","data":[198,109,9,187,44,66,68,101,222,139,126,223,227,96,191,117,253,40,210,209]},"announce":[],"urlList":[]}}