{"title":"Eye4Software GPS Mapping v5.0.12.1214 Incl Crack [TorDigger]","uid":8353263,"size":19825428,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c68277d96b6b820a0768f5c4a6f7f0444b8897de&amp;dn=Eye4Software+GPS+Mapping+v5.0.12.1214+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":9,"time":1365410188,"description":"Eye4Software GPS Mapping\n\nThe Eye4Software GPS Mapping software can be used for realtime navigation or positioning, route planning and to manage or convert your maps, waypoints, tracks and GPS routes. \nThe software supports different types of map formats like including: GeoTIFF, Arc/Info files, AutoCad DXF/DGN files, ESRI Shapefiles, BSB nautical charts and image files like GIF, BMP, JPG, TIF and PNG files, which can be calibrated using different map projections.\nWaypoint, track and route information can be uploaded and downloaded to or from a GPS receiver supporting NMEA0183 or Garmin PVT (USB), or can be exported or imported to different file formats like Garmin PCX, GPS Exchange and OziExplorer files. \n\nApplications of this software includes:\n\n-Survey, Map Format Conversion, Map Coordinate Conversion, Editing Maps, Research, Track and Trace, etc.\n\nRequirements:\n\nThe software will work with almost any (NMEA0183 compatible) GPS receiver, and can be used on any desktop, laptop or netbook computer running Windows XP SP2 or higher.\nTo receive realtime GPS information, you need a NMEA-0183 compatible (D)GPS device (most GPS devices around support the NMEA-0183 protocol) attached to your computer using an USB, Bluetooth or RS232 serial connection, or a Garmin GPS device connected directly to the computer using its USB interface.\n\nHomepage: http://www.eye4software.com\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:c68277d96b6b820a0768f5c4a6f7f0444b8897de","amp;dn":"Eye4Software+GPS+Mapping+v5.0.12.1214+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c68277d96b6b820a0768f5c4a6f7f0444b8897de","infoHashBuffer":{"type":"Buffer","data":[198,130,119,217,107,107,130,10,7,104,245,196,166,247,240,68,75,136,151,222]},"announce":[],"urlList":[]}}