{"title":"Koki Mitani - Rajio no jikan aka Welcome Back, Mr. McDonald","uid":6280422,"size":1436289926,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c775026531e9ee8210d43532a9f7b97d9539b072&amp;dn=Koki+Mitani+-+Rajio+no+jikan+aka+Welcome+Back%2C+Mr.+McDonald&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1301411954,"description":"Koki Mitani - Rajio no jikan aka Welcome Back, Mr. McDonald (1997)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0133170&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0133170&lt;/a&gt;  \n\nLanguage\tJapanese\nSubtitles\tEnglish + Japanese sub/idx   \n &lt;a href=&quot;\nhttp://img.photobucket.com/albums/v326/theobviousguy/ss/ADC/rajionojikan/rajionojikanposter.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img.photobucket.com/albums/v326/theobviousguy/ss/ADC/rajionojikan/rajionojikanposter.jpg&lt;/a&gt;\n\nComedy is certainly not the first thing that comes to mind when we think of Japanese cinema. But a few more films like Koki Mitani's hilarious screwball farce &quot;Welcome Back, Mr. McDonald&quot; could change all that.\n\nThis movie is ostensibly a goofy comedy about a live radio drama that goes haywire after the imperious diva playing the lead insists on certain last-minute changes. Her demands set in motion a desperate chain of events that transform a sudsy romantic drama set in a Japanese fishing village into a ludicrous action-adventure fantasy set in the United States.\n\n&quot;Welcome Back, Mr. McDonald&quot; can be taken as pure, giddy fun in a farcical tradition that has all but disappeared from American movie comedy in the age of the salacious gross-out. But it can also be taken as a good-natured invitation to Japanese culture to lighten up. Its manic surface only partially conceals its satiric barbs.\n\nAs the broadcast skids out of control, the movie pokes gleeful fun at the Japanese insistence on order and good manners at all costs and on the rigidity of corporate politics and pecking orders. Finally the movie ridicules Japan's envious fascination with the gaudy detritus of American popular culture. \n\nAt the center of this madness is Miyako Suzuki (Kyoka Suzuki), a meek housewife whose radio play &quot;The Woman of Destiny&quot; is being broadcast nationally after winning a bogus contest sponsored by the station to provide cheap programming. (Her play was the only entry.)\n\nAfter a rehearsal in which all goes smoothly, word comes down that the lead actress, Nokko Senbon (Keiko Toda), who has connections with the station's bigwigs, would like her character's name changed from Ritsuko to Mary Jane and her nationality from Japanese to American.\n\nAfter the nervous producer, Ushijima (Masahiko Nishimura), reluctantly agrees, Nokko demands that Mary Jane be a high-powered New York City trial lawyer. It isn't long before her competitive male co-star begins making his own demands for script changes.\n\nHe, too, wants an American name and occupation. Inspired by the logo on a bag of takeout food, he chooses Donald McDonald and insists his character be a pilot. For silly reasons too complicated to go into, the setting is eventually moved to Chicago.\n\n\nOn top of everything, the station's sound effects library is locked, and no one can find the key. In desperation the producers call on an elderly guard who used to improvise acoustic sound effects on old-time radio to help them out. Some of the most uproarious scenes show radio technicians desperately executing ideas that use everything from a flushing toilet (for a dam bursting) to a vacuum cleaner (a rocket launching).\n\nOnce the show goes on the air, station breaks and commercials are juggled while sound effects are readied and the script written. Periodically the movie cuts away to show a Japanese trucker (Ken Watanabe) who has tuned into the program on the road and becomes mesmerized.\n\nIn the middle of it all, who should show up in the studio but Miyako's anxious husband (Yoshimasa Kondo), a car salesman who assumes his wife's play is autobiographical and becomes extremely agitated on discovering that it involves a romantic triangle.\n\nAs Miyako, desperate to calm his fears, watches her tear-jerker being re-made into an action-adventure yarn in which the hero is lost in space, her ultimate concern is that the story have a happy ending. When that ending doesn't seem forthcoming, she locks herself in the studio in protest until a solution is devised. \n\n&quot;Welcome Back, Mr. McDonald&quot; may be a one-joke movie, but the inventive ways in which that joke is extended and embellished insure there is never a stale moment. The fast-paced comic timing and sharp ensemble performances that give even the minor characters defined personalities make for a delirious comic portrait of human vanity and ingenuity in the wonderful world of entertainment. \n &lt;a href=&quot;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard01-31.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard01-31.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard02-31.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard02-31.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard03-31.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard03-31.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard04-25.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard04-25.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard05-23.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1004.photobucket.com/albums/af169/kashmir_kittie/Clipboard05-23.png&lt;/a&gt;\n\n-----------my rip----------\n\n~~~~~~ Rajio no Jikan.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,425,305,600                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:43:35                \nFrame Count:....................................148990             \nFrame Width (pixels):...........................704                  \nFrame Height (pixels):..........................384                  \nAspect Ratio:...................................1.833                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1633                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.252&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n  \n\n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n                      &lt;a href=&quot;\nhttps://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.org/index.php&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&quot;  ","torrent":{"xt":"urn:btih:c775026531e9ee8210d43532a9f7b97d9539b072","amp;dn":"Koki+Mitani+-+Rajio+no+jikan+aka+Welcome+Back%2C+Mr.+McDonald","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c775026531e9ee8210d43532a9f7b97d9539b072","infoHashBuffer":{"type":"Buffer","data":[199,117,2,101,49,233,238,130,16,212,53,50,169,247,185,125,149,57,176,114]},"announce":[],"urlList":[]}}