{"title":"LEGO.Legends.of.Chima.S01E02.The.Great.Story.WEB-DL.XviD.MP3","uid":8111603,"size":179982761,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c7b53e11ed8ec00388410c829b5849ab8f8a995f&amp;dn=LEGO.Legends.of.Chima.S01E02.The.Great.Story.WEB-DL.XviD.MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"loadstone2k12","files":-1,"time":1360198033,"description":"LEGO: Legends of Chima - Season 1 - Episode 2 (WEB-DL - XviD)\n-------------------------------------------------------------\n\nThe world of CHIMA is a magical land ruled by tribes of highly-advanced animals.\nThese creatures walk and talk like humans. They drive vehicles, use machinery, and\nlive in amazing castles and forts. But make no mistake about it: these are animals,\nwith claws, fangs, tails, and sometimes wings. And now they are engaged in a full\nscale conflict. Once a pristine, natural paradise, the land of CHIMA has become a\nbattle ground for the animal tribes. Best friends are now worst enemies. Weaponry\npummels the once-sacred temples. Animalistic vehicles charge furiously at each other\nin jungle jousts. The animals fight for control of a natural resource called CHI, a\npower that is both a source of life and holds the potential for destruction. Only a\nfew brave heroes in CHIMA understand the true nature of CHI and its importance.\nTheir stories, and the stories of those who seek to conquer the CHI, are known as...\nTHE LEGENDS OF CHIMA.\n\nProduced by M2Film and The LEGO Group.\n\n &lt;a href=&quot;\nhttp://imageshack.us/a/img856/5523/legochimas102avi.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageshack.us/a/img856/5523/legochimas102avi.png&lt;/a&gt;\n\nCragger is depressed by his great responsibility as king. Crooler on the other hand\nsees the situation as an opportunity to make the Crocodiles the most powerful tribe\nin CHIMA. Using a mystical glowing flower she clouds Cragger's judgement and makes\nhim turn against the lions... the aim is to control all of the precious CHI. It is\nCHI day... a celebration of CHI at the Lion City, with racing events where the\ntribes compete for the powerful Golden CHI. Laval wins the games, but in the process\nangers the Wolves. Athend of the festival Cragger attempts to disrupt the games, and\nlater allies with the disgruntled Wolves and the sneaky Ravens. They launch a\nmassive assault on the Lions city to get their CHI. The Lions call upon the Gorillas\nand the Eagles to aid them in the battle. During the battle, Laval ends up in\njeopardy but gets saved at the last moment by a fabled, long forgotten Legend Beast.\nIt carries him back into the battle.\n\nLEGO.Legends.of.Chima.S01E02.The.Great.Story.WEB-DL.XviD.MP3.avi\n\nVideo: Xvid 624x352 23.976fps [Qf 0.18]\nAudio: MPEG Audio Layer 3 48000Hz stereo [128Kbps VBR]\nSubs: English Closed Captions (SubRip Text)\nDuration: 00:22:04\nFile size: 171 MB\n\n\n- Courtesy of Your Friendly Neighborhood...\n\n\n","torrent":{"xt":"urn:btih:c7b53e11ed8ec00388410c829b5849ab8f8a995f","amp;dn":"LEGO.Legends.of.Chima.S01E02.The.Great.Story.WEB-DL.XviD.MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7b53e11ed8ec00388410c829b5849ab8f8a995f","infoHashBuffer":{"type":"Buffer","data":[199,181,62,17,237,142,192,3,136,65,12,130,155,88,73,171,143,138,153,95]},"announce":[],"urlList":[]}}