{"title":"Angel Blade Punish - Episodes 1 - 3 - Hentai","uid":4851928,"size":3544485547,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c8407039ac504028cac6bca26a63f563e91d6bef&amp;dn=Angel+Blade+Punish+-+Episodes+1+-+3+-+Hentai&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"EvilTSAngel","files":-1,"time":1239907786,"description":"What They Say\nMoena was a normal college girl until she discovered that she had special powers hidden within her body by her father. When Dark Mother and her army of sexy demon women threaten the virgins of the world, Moena transforms into the naked masked heroine Angel Blade. Dark Mother kidnaps Moena's stepmother, the weighty endowed Kyoka. With the help of a team of barely dressed heroines, Angel Blade storms the demon's stronghold. With the help of the dark-skinned succubus Nail, a former villain, they reach the heart of evil and face off with Dark Mother herself!\n\nThe Review!\nThe virgins of the world are threatened again and it's up to Moena to fight back against the Dark Mother.\n\nAudio: \nFor our primary viewing session, we listened to this show in its original language of Japanese. The stereo mix for the show is a bit better than your average adult fare as there is much more story and more action involved here than those so the mix exerts itself a bit more and the stereo channels have more flowing through them. Dialogue is clean and clear throughout and we had no problems with dropouts or distortions during regular playback.\n\nVideo: \nOriginally released to video in 2004, the transfer for the final OVA is presented in its original aspect ratio of 1.78:1 and is enhanced for anamorphic playback. This change from the originals only adds to the great looking animation quality as we get a much more detailed image, the colors seem to pop even more vibrantly and overall it's very clean and smooth. While the original wasn't riddled with problems, the change to this format is definitely a step up and the quality of the visuals only seems to be strengthened by it. Colors are rich and solid, aliasing and cross coloration are essentially non-existent and black levels look really good.\n\nPackaging: \nThe cover artwork plays up the nice character designs as it presents a trio of the characters from the episodes, though one of them is a bit harder to see at first blush, but the layout is still good as the character designs continue to be appealing and they show off just the right amount of skin and fanservice combined with some great looking colors and detail. The back cover provides a number of small shots from the show and some slightly bigger artwork while also giving a decent summary of the premise. The rest of it is filled out with the usual materials such as the production information and the technical grid which accurately lists everything. While the keepcase is clear, there is no reverse side cover.\n\nMenu: \nUsing the artwork of Angel Blade herself from the cover with the same background, her aunt is swapped out for the navigation section which is nicely done, complete with a heart for the selection cursor. If there's anything that's not right with the menu it's that it's not anamorphic which is a surprise. Access times are nice and fast and submenus load quickly. The disc also correctly read our players language presets and played accordingly.\n\nExtras: \nNone.\n\nContent: (please note that content portions of a review may contain spoilers)\nThe original Angel Blade series, which in its US release had a bit of an awkward time due to lag between episodes, was one that at times was appealing because of its great character designs and slick production qualities but also didn't quite hold us as it went on since the story felt weak and almost too similar to a number of other stories that series creator Obari has done in the past. Obari's changed things up slightly here as he takes on the role of executive director while working on storyboards and character designs thereby leaving the full directorial chores to Ogomori. \n\nSince Angel Blade ended on the idea that things weren't really resolved in full, it's easy enough to kick up a new story where the Phantom Lady is up to her usual deviousness and has plans to do bad to the virgins of the world through her wicked ways. She's got to mete out the punishments for the failures during the last round, in which we saw Nailkaizer lose her edge as a bad girl and now becoming one who will aid Angel Blade, but there are plenty of minions left over from the entire adventure who suffer under the Lady. This is all prelude to what she intends to do the next time around and lets us get some nice little quicky punishment material in front of us to get the juices flowing.\n\nThe Phantom Lady is much more hands on this time around as they kidnap Moena's stepmother and put her through the paces so they can lure in Angel Blade and the others that help her, thereby making it easier to take them all down. There are all sorts of tricks and feints along the way as Moena has to deal with it as Angel Blade and her friends that transform as well help out. It's very similar to the original series where there is a lot of action to the series which is really comical at times because of how their outfits are designed but it has plenty of sex as well, including one great arena style sequence in the third episode where a pair of the women are taken down by the male slaves of the Phantom Lady. There's a plot mixed into all of this but it's pretty paper thin and really just designed to string together the sex scenes. That's not really a complaint but it's reminiscent of the original series where I just felt like we had all this great material and it's just there.\n\nThe design of the world and its characters continues to be great but there's still some characters that almost make me cringe due to their breast sizes. There's the large stuff we're used to from mainstream series but these overly massive breasts, almost in the Eiken vein, are just turnoffs. And it's hard to enjoy a show when you've got characters that make you feel that way. There's plenty to enjoy here but it doesn't take much in an adult show that can turn your opinion the other way. Balancing them out becomes important and thankfully there are a lot of characters that are more realistic and their scenes are far more enjoyable. But when one of the women seems to have the body weight of another character in her breasts, it's just plain ew.\n\nIn Summary: \nAngel Blade Punish is a very shiny piece of work but it's a bit shallow at times and has some elements we've seen before as well as elements that just make me avert my eyes from the screen. The show overall is a good follow-up to the original OVA series and one that boasts some better animation quality as well as a technical bump up with the source material but similar to how the original series sort of left me dry over time, the three episodes here essentially did the same thing as it played out. The characters I just can't quite get into no matter how attractive the designs but it's still very easy to see why this show is such a favorite. Obari does some great work here from a technical and sex sense but there's just pieces of it that simply don't work for me.\n\n\nFeatures\nJapanese 2.0 Language,English 2.0 Language,English Subtitles\n\nReview Equipment\nPanasonic PT50LC13 50&quot; LCD RP HDTV, Toshiba HD-A1 Progressive Scan HD DVD player via HDMI -&gt; DVI with upconversion set to 1080i, Sony STR-DE835 DD/DTS receiver, Monster component cable and Panasonic SB-TP20S Multi-Channel Speaker System With 100-Watt Subwoofer\n\nManga info link: &lt;a href=&quot;\nhttp://www.mania.com/angel-blade-punish_article_78078.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mania.com/angel-blade-punish_article_78078.html&lt;/a&gt;\n\nThis is an EvilTSAngel DVDRip!\nCustom Menu's\nThis is episodes 1 - 3","torrent":{"xt":"urn:btih:c8407039ac504028cac6bca26a63f563e91d6bef","amp;dn":"Angel+Blade+Punish+-+Episodes+1+-+3+-+Hentai","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8407039ac504028cac6bca26a63f563e91d6bef","infoHashBuffer":{"type":"Buffer","data":[200,64,112,57,172,80,64,40,202,198,188,162,106,99,245,99,233,29,107,239]},"announce":[],"urlList":[]}}