{"title":"John Coltrane - Ascension (1965) [EAC-FLAC]","uid":14261979,"size":816709192,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c884f068bc187ced32e567973ea79fe46506615d&amp;dn=John+Coltrane+-+Ascension+%281965%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pucholoco","files":11,"time":1460246944,"description":"John Coltrane - Ascension (1965)\r\n           EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 617 Mb\r\n                   Full Artwork @ 600 dpi (tiff) -&gt; 87 Mb\r\n\r\n\r\n\r\nThe album ASCENSION played a profoundly important role in John Coltrane's final period. Recorded in June 1965, almost exactly two years before his death, this session marks Coltrane's final stepping off point into free jazz. The album also marks a division for Coltrane's fans, as there are some that applaud his final escape from jazz tradition while others simply couldn't follow him into the great unknown.\r\n\r\nOne way or another, ASCENSION refuses to be ignored. A stunning list of colleagues joins the legendary saxophonist on his final quest. Besides his famed regular quartet, avant-garde saxophonists Pharaoh Sanders and Archie Shepp, extra bassist Art Davis, and even trumpet star Freddie Hubbard, among others, produce an intense sonic assault. If you're sensitive to dissonant noise and uncontrolled barrages of sound, ASCENSION will offer you no comfort. However, the unbridled emotional onslaught that Coltrane unleashes here dwarfs any other artist's entire output. Love it or hate it, this is one disc that's sure to stay on your mind long after its din has faded.\r\n\r\nAscension is the single recording that placed John Coltrane firmly into the avant-garde. Whereas, prior to 1965, Coltrane could be heard playing in an avant vein with stretched-out solos, atonality, and a seemingly free design to the beat, Ascension throws most rules right out the window with complete freedom from the groove and strikingly abrasive sheets of horn interplay. Recorded with three tenors (Trane, Pharoah Sanders, Archie Shepp), two altos (Marion Brown, John Tchicai), two trumpet players (Freddie Hubbard, Dewey Johnson), two bassists (Art Davis, Jimmy Garrison), the lone McCoy Tyner on piano, and Elvin Jones on the drums, this large group is both relentless and soulful simultaneously. While there are segments where the ensemble plays discordant and abrasive skronks, these are usually segues into intriguing blues-based solos from each member. \r\n\r\nThe comparison that is immediately realized is Ornette Coleman's Free Jazz of five years previous. However, it should be known that Ascension certainly carries its own weight, and in a strange sense makes Coleman's foray a passive adventure – mostly due to an updated sonic quality (à la Bob Thiele) and also Trane's greater sense of passionate spiritualism. Timed at around 40 minutes, this can be a difficult listen at first, but with a patient ear and an appreciation for the finer things in life, the reward is a greater understanding of the personal path that the artist was on at that particular time in his development. \r\n\r\nColtrane was always on an unceasing mission for personal expansion through the mouthpiece of his horn, but by the time of this recording he had begun to reach the level of &quot;elder statesman&quot; and to find other voices (Shepp, Sanders, and Marion Brown) to propel and expand his sounds and emotions. Therefore, Ascension reflects more of an event rather than just a jazz record and should be sought out by either experienced jazz appreciators or other open-minded listeners, but not by unsuspecting bystanders.\r\n\r\n\r\n--------------------------------------------------------------------------------\r\nTracklist:\r\n--------------------------------------------------------------------------------\r\n\r\n01. Ascension (Edition ll)\r\n02. Ascension (Edition l)\r\n\r\n*2009 Impulse! / Verve / UMG | 0602517920248\r\n\r\n\r\nPersonnel: \r\nJohn Coltrane (tenor saxophone)\r\nJohn Tchicai, Marion Brown (alto saxophone)\r\nArchie Shepp, Pharoah Sanders (tenor saxophone)\r\nFreddie Hubbard, Dewey Johnson (trumpet)\r\nMcCoy Tyner (piano)\r\nArt Davis, Jimmy Garrison (bass)\r\nElvin Jones (drums).\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!\r\n\r\n\r\n\r\nJohn Coltrane - Kulu Se Mama (1965) [EAC-FLAC]:\r\n \nhttps://thepiratebay.se/torrent/14053969/John_Coltrane_-_Kulu_Se_Mama_%281965%29_[EAC-FLAC]","torrent":{"xt":"urn:btih:c884f068bc187ced32e567973ea79fe46506615d","amp;dn":"John+Coltrane+-+Ascension+%281965%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c884f068bc187ced32e567973ea79fe46506615d","infoHashBuffer":{"type":"Buffer","data":[200,132,240,104,188,24,124,237,50,229,103,151,62,167,159,228,101,6,97,93]},"announce":[],"urlList":[]}}