{"title":"KAPAP - KRAV PANIM EL PANIM","uid":4526329,"size":2758428944,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c88afe580264b118961e47d1eabae5c0bcabb1ea&amp;dn=KAPAP+-+KRAV+PANIM+EL+PANIM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"serpol","files":4,"time":1227367253,"description":"Krav Panim El Panim - KAPAP  is the Hebrew acronym for Face To Face Combat. It is the original combat system of defensive tactics, hand-to-hand combat and self-defense, employed by the Israeli Defense Forces (IDF), the Israeli National Police, and their special operations and anti-terrorist units.\n\nKAPAP fight tactics originated in the 1940&amp;#039;s and were used by the Palmach (Jewish Strike Brigades) forces in fighting for the independence of the State of Israel. These Palmach units later formed the core of Israel&amp;#039;s special units in the conventional military (IDF).\n\nThe modern day KAPAP combat system is headed by Lt. Col Chaim Pe&amp;#039;er who served in one of Israel&amp;#039;s most elite units, called Matkal, and later on, trained other special units in guerilla warfare and hand to hand combat tactics.\n\n\nAvi Nardia (Major, IDF Res.) Served in a Police special unit as an intelligence team member and defensive tactics/CQB instructor. In 24 years of reserve service to the Israeli Defense Forces (IDF), he earned the rank of Major. As well, he has trained Police agencies and armed forces all over the world; from Police patrol and corrections officers to SWAT, SRT and SERT team members along with Army, Marine and counter terror units to Special Forces. In Israel, he taught defensive tactics and operational behavior at the Operational Police Academy, which is charged with training the entire police force of the country. He is the only instructor to be an official instructor for the Israeli army - Israeli police and Israeli counter terror units.\n","torrent":{"xt":"urn:btih:c88afe580264b118961e47d1eabae5c0bcabb1ea","amp;dn":"KAPAP+-+KRAV+PANIM+EL+PANIM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c88afe580264b118961e47d1eabae5c0bcabb1ea","infoHashBuffer":{"type":"Buffer","data":[200,138,254,88,2,100,177,24,150,30,71,209,234,186,229,192,188,171,177,234]},"announce":[],"urlList":[]}}