{"title":"George C. Edwards III - On Deaf Ears. The Limits of the Bully Pu","uid":10454760,"size":962719,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8b2b822fbcacc53b66ce854d4f62e82a2e69dad&amp;dn=George+C.+Edwards+III+-+On+Deaf+Ears.+The+Limits+of+the+Bully+Pu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1404060837,"description":"Description\nProduct Details\nBook Title: On Deaf Ears: The Limits of the Bully Pulpit\nBook Author: George C. Edwards III (Author)\nHardcover: 320 pages\nPublisher: Yale University Press (November 1, 2003)\nLanguage: English\nISBN-10: 0300100094\nISBN-13: 978-0300100099\n\n===================================================================================\nBook Description\nPublication Date: November 1, 2003 | ISBN-10: 0300100094 | ISBN-13: 978-0300100099\nAmerican presidents often engage in intensive campaigns to obtain public support for their policy initiatives. This core strategy for governing is based on the premise that if presidents are skilled enough to exploit the &quot;bully pulpit&quot;, they can successfully persuade or even mobilize public opinion on behalf of their legislative goals. In this book, George Edwards analyses the results of hundreds of public opinion polls from recent presidencies to assess the success of these efforts. Surprisingly, he finds that presidents typically are not able to change public opinion; even great communicators usually fail to obtain the public's support for their high-priority initiatives. Focusing on presidents' personae, their messages, and the American public, he explains why presidents are often unable to move public opinion and suggests that their efforts to do so may be counterproductive. Edwards argues that shoring up previously existing support is the principal benefit of going public and that &quot;staying private&quot; - negotiating quietly with elites - may often be more conducive to a president's legislative success.\n\n===================================================================================\nReview\n&quot;Every serious scholar and student of American politics should read this book. It will surely be 'must reading' for any course on the American presidency.&quot; Robert Y. Shapiro, Columbia University\n\n===================================================================================\nAbout the Author\nGeorge C. Edwards is Distinguished Professor and the George and Julia Blucher Jordan Chair in Presidential Studies, Texas A &amp; M University. A leading authority on the American presidency, he is also the author of At the Margins: Presidential Leadership of Congress, published by Yale University Press.\n===================================================================================","torrent":{"xt":"urn:btih:c8b2b822fbcacc53b66ce854d4f62e82a2e69dad","amp;dn":"George+C.+Edwards+III+-+On+Deaf+Ears.+The+Limits+of+the+Bully+Pu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8b2b822fbcacc53b66ce854d4f62e82a2e69dad","infoHashBuffer":{"type":"Buffer","data":[200,178,184,34,251,202,204,83,182,108,232,84,212,246,46,130,162,230,157,173]},"announce":[],"urlList":[]}}