{"title":"The Essential Vincent Price","uid":15396330,"size":8540630624,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c8e4bfa9414f8a6d76b612dc8852cd2980d585fb&amp;dn=The+Essential+Vincent+Price&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Psychodad149","files":35,"time":1469402171,"description":"The Essential Vincent Price\r\n\r\nA collection of works displaying some keynote works of Vincent Price, one of America's most noted actors of horror, suspense and the supernatural. \r\n\r\n1 - An Evening of Edgar Allen Poe (1970)\r\nA made-for-TV movie with Price performing four tales of Edgar Allen Poe: The Tell-Tale Heart, The Sphinx, The Cask of Amontillado, and The Pit and the Pendulum. Not simple recitations, but one-man plays, with Price performing each work in character. Inimitably.\r\n\r\n2 - Diary of a Madman (aka The Horla)\r\nFrom a story by Guy de Maupessant, a serious work, with proto-Lovecraftian overtones.  Price plays French magistrate Simon Cordier, who is under the influence of an invisible being called a Horla. The Horla are a race of beings who share Earth with us in some way, although this one states that they are in another plane. They seem to live off of evil, and compel humans to do their bidding. This one forces Cordier to commit murder. Star Trek episode &quot;Wolf In The Fold&quot;, with a murderous invisible being identified with Jack the Ripper, also uses the theme.\r\n\r\n3 - Son of Sinbad\r\nA rollicking, bawdy, classic costume epic from legendary eccentric Howard Hughes. Price co-stars as Persian poet Omar Khayyam, friend and confidant of Sinbad, Son of Sinbad, a girl-chasing rogue. Price, spouting bits of Rubaiyat, provides primarily comic relief to the central plot involving the Caliph of Baghdad (played by Leon Askin, who many will remember best as Gen. Burkhalter from Hogan's Heroes) and the invading army of Tamarlane. Lots of action, lots of beautiful girls, lots of laughs, but not quite the campy humor Price's later films acquired. In fact, this reminds me of an Abbott &amp; Costello movie, with lots of serious action going on while the two leads provide the comic thread running through the tapestry.\r\n\r\n4 - The Abominable Dr. Phibes\r\nPossibly his cinematic master work. Disfigured mad doctor Anton Phibes wreaks vengeance of literally Biblical proportions on the doctors &amp; nurses he blames for the death of his wife. Lurid murder and campy humor blend perfectly as Phibes slays his way through London, keeping one step ahead of Scotland Yard's Inspector Trout. The somewhat startling conclusion is highlighted by the bizarre juxtaposition of an instrumental version of &quot;Somewhere Over The Rainbow&quot; as the credits roll. (In the sequel, Price actually sings this for the finale!) Spoiler alert -- be sure to listen =all the way= to the end. \r\n\r\n5 - The Black Widow \r\nA segment from Alice Cooper's &quot;Welcome To My Nightmare&quot;, in which Price co-starred as Cooper's guide through a nightmare. Cooper, to this day, reportedly plays this segment as an introduction whenever he performs the song.\r\n\r\n6 - The Comedy of Terrors\r\nCo-starring Peter Lorre, Boris Karloff, and featuring British legend Basil Rathbone (oddly billed =after= Rhubarb the Cat). This is pure burlesque, very dark comedy, and terrifically funny. Surprisingly, also from the pen of Richard Matheson. Price and Lorre are unscrupulous undertakers who attempt to supplement their income by the expectable method. What transpires is wholly unexpected.\r\n\r\n7 - The House On Haunted Hill\r\nAn eccentric millionaire has invited a number of guests to stay overnight at a reputedly haunted mansion. A hefty cash prize awaits those who stay the night. Or should I say . . . survive the night. \r\n\r\n8 - The Last Man On Earth\r\nAll you zombie fans, this is it, this IS IT. The grand original. From the Richard Matheson story &quot;I Am Legend&quot;. An interesting contrast is the characterization of the zombies themselves, who are not the brainless shufflers of the modern zombie movie. These have almost as much vampire as zombie to them, and remain self-aware and intelligent. An important sub-plot concerns a group of infected humans who are not entirely gone and are working on a cure for themselves.\r\n\r\n9 - The Price of Fear\r\nA radio series from the BBC. See separate text file.\r\n\r\n10 - The Raven (movie)\r\nPossibly the best of Roger Corman's Poe series starring Price, and co-starring Peter Lorre as the Raven. Very loosely based on the poem, perhaps &quot;inspired&quot; is a better term. Some brilliant comedy, such as the early scene where, the Raven himself having arrived, Price poses him the famous question, &quot;Shall I ever hold again that radiant maiden whom the angels called Lenore?&quot; The response is not the familiar one.\r\n\r\n11 - The Raven (poem)\r\nAn in-character performance of &quot;The Raven&quot;, by Price, co-starring the Raven as Himself.\r\n\r\n12 - The Song of Bernadette\r\nA departure from what we think of the usual Price movie, this is the story of Bernadette Soubirous, the girl who beheld the Blessed Virgin Mary at Lourdes. Price, in a supporting role, is the Church's inquisitor who has come to debunk Bernadette's extraordinary claims","torrent":{"xt":"urn:btih:c8e4bfa9414f8a6d76b612dc8852cd2980d585fb","amp;dn":"The+Essential+Vincent+Price","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8e4bfa9414f8a6d76b612dc8852cd2980d585fb","infoHashBuffer":{"type":"Buffer","data":[200,228,191,169,65,79,138,109,118,182,18,220,136,82,205,41,128,213,133,251]},"announce":[],"urlList":[]}}