{"title":"Kenny G. Discography (All Albums).","uid":4629748,"size":1163215052,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c944bcd0ce5eaf2c3483157b49cd79bb382e1ff8&amp;dn=Kenny+G.+Discography+%28All+Albums%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"cholo24","files":252,"time":1231348114,"description":"Kenny G. Discography (All Albums)\n\nKenny G (inicial tomada de su apellido Gorelick) comenzÃƒÂ³ a tocar en la banda de su escuela de Seattle (Washington), su ciudad natal. En 1976, cuando tenÃƒÂ­a 17 aÃƒÂ±os iniciÃƒÂ³ su carrera profesional con la Barry White's Love Unlimited Orchestra. DespuÃƒÂ©s grabÃƒÂ³ con Cold, Bold &amp; Together (un grupo funk de Seattle) y, tras graduarse en la Universidad de Washington, trabajÃƒÂ³ en 1979 con Jeff Lorber Fusion, grupo con el que publicÃƒÂ³ dos discos. Cuando acompaÃƒÂ±aba en su ciudad los bolos locales de artistas como Johnny Mathis, todavÃƒÂ­a le llamaban Kenny Gorelick.\nEl legendario Clive Davis (presidente de Arista e impulsor de talentos) se fijÃƒÂ³ el peculiar sonido de su saxo y con semejante padrino, la grabaciÃƒÂ³n de su primer disco no se hizo esperar. En 1982 se publicÃƒÂ³ el ÃƒÂ¡lbum Kenny G en el que el artista tocaba saxos soprano y tenor, flauta, sintetizadores y mini moog, ademÃƒÂ¡s de escribir los arreglos de las canciones. Sus dos siguientes discos consiguieron ser Platino, pero fue en 1986 con el ÃƒÂ¡lbum Duetones cuando comenzÃƒÂ³ el despegue al vender cinco millones de discos. Kenny G se habÃƒÂ­a convertido en un fenÃƒÂ³meno a escala internacional.\nEn 1992, Breathless marcÃƒÂ³ el cÃƒÂ©nit de la carrera del saxofonista con 15 millones de ÃƒÂ¡lbumes vendidos. Un rÃƒÂ©cord en la historia de la mÃƒÂºsica instrumental al que siguiÃƒÂ³ otro en la historia de los discos navideÃƒÂ±os porque en 1994, Miracles: The Holiday Album vendiÃƒÂ³ 13 millones de ejemplares. El saxo de Kenny G convertÃƒÂ­a en oro todo lo que tocaba. Los ÃƒÂ©xitos continuaron en la dÃƒÂ©cada siguiente, incluÃƒÂ­do un ÃƒÂ¡lbum con estandars de jazz hasta su penÃƒÂºltimo ÃƒÂ¡lbum en 2004: At Last... The Duets Album.\nDecir saxo es decir Kenny G. Desde que en 1982 publicÃƒÂ³ su primer ÃƒÂ¡lbum, el particular y acariciante sonido de su saxo soprano ha ocupado los primeros puestos tanto en listas de pop como de jazz contemporÃƒÂ¡neo y new age, ha vendido mÃƒÂ¡s de 75 millones de ÃƒÂ¡lbumes, singles y vÃƒÂ­deos y ha llegado a toda clase de pÃƒÂºblicos. Kenny G marca una ÃƒÂ©poca en la mÃƒÂºsica de fusiÃƒÂ³n y es pionero en consolidar una estÃƒÂ©tica de jazz amable, sustituyendo la improvisaciÃƒÂ³n por lÃƒÂ­neas melÃƒÂ³dicas lÃƒÂ­ricas y sencillas y enriqueciendo su mÃƒÂºsica con la colaboraciÃƒÂ³n de grandes cantantes y mÃƒÂºsicos de los estilos mÃƒÂ¡s diversos.\nEn 2006 llega llega The Essential Kenny G que, ademÃƒÂ¡s de ofrecer 30 temas y mÃƒÂ¡s de 155 minutos de mÃƒÂºsica, tiene el atractivo de que ha sido el propio saxofonista el que ha seleccionado el repertorio. SerÃƒÂ­a estÃƒÂºpido pensar que ha elegido sus peores canciones.\n\n\n       The Studio Albums\n\n- Kenny G. - Kenny G. /1982/\n- Kenny G. - G Force /1983/\n- Kenny G. - Gravity /1985/\n- Kenny G. - Duotones /1986/\n- Kenny G. - Silhouette /1988/\n- Kenny G. - Breathless /1992/\n- Kenny G. - The Moment /1996/\n- Kenny G. - Paradise /2002/\n- Kenny G. - Rhythm &amp; Romance /2008/\n\n      The Cover Albums\n\n- Kenny G. - Classics in the Key of G /1999/\n- Kenny G. - At Last...The Duets Album /2004/\n- Kenny G. - I'm in the Mood for Love...The Most Romantic Melodies of All Time /2006/\n\n      The Holiday Albums\n\n- Kenny G. - Miracles: The Holiday Album /1994/\n- Kenny G. - Faith: A Holiday Album /1999/\n- Kenny G. - Wishes: A Holiday Album /2002/\n\n       The Live Album\n\n- Kenny G. - Kenny G Live /1989/\n","torrent":{"xt":"urn:btih:c944bcd0ce5eaf2c3483157b49cd79bb382e1ff8","amp;dn":"Kenny+G.+Discography+%28All+Albums%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c944bcd0ce5eaf2c3483157b49cd79bb382e1ff8","infoHashBuffer":{"type":"Buffer","data":[201,68,188,208,206,94,175,44,52,131,21,123,73,205,121,187,56,46,31,248]},"announce":[],"urlList":[]}}