{"title":"Radio 2 Comedy Season - Dave Allen Goodnight and May Your God Go","uid":5723374,"size":54653641,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cabd8e37e09cf17d8ca7386367dd62bd26aaa3fd&amp;dn=Radio+2+Comedy+Season+-+Dave+Allen+Goodnight+and+May+Your+God+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_Slimoo_","files":1,"time":1280366081,"description":"Dave Allen: Goodnight and May Your God Go With You - Audio Comedy - BBC Radio 2 \n1 x 60 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nEd Byrne celebrates Dave Allen, the sit-down, stand-up comedian, whose unique style entranced and entertained audiences all over the world for over thirty years.\n\nTo some, he was an alternative comedian before the phrase was even coined; never afraid to tackle previously taboo subjects, such as sex, death or, with the routines that he was most famous for, religion. Acclaim and controversy followed him in equal measure, and his work has inspired many modern comedians such as Jack Dee, Dylan Moran and Eddie Izzard.\n\nIn this hour-long documentary, fan Ed Byrne examines Dave's life, career and comic legacy, remembering the impression his TV shows left on him as a small child growing up in Ireland. Ed also explores how Dave's prowess as a storyteller came from the rich oral traditions of their shared Irish heritage.\n\nDave first found fame in the UK thanks to his appearances on The Val Doonican Show in the mid 1960s, and Val talks about how he first came to work with Dave. But before the BBC television series, Dave had already toured much of the world and enjoyed his own massively successful TV show in Australia.\n\nIn 1971, Dave Allen At Large arrived on BBC TV and with its mixture of sketches and Dave's unique sit-down stand up, musing on life from his iconic stool with a glass of whiskey in one hand and a cigarette in the other. He was a star in a golden era that included The Two Ronnies and Morecambe &amp; Wise.\n\nWriter Peter Vincent and actor Michael Sharvell-Martin share their personal recollections of working with Dave throughout the 70s and 80s. The programme also features a rare interview with Dave Allen's son, Ed Allen, who recalls a father who loved his work, but treasured his private time with family and friends even more.\n\nOther contributors include Jimmy Tarbuck (who, like Dave, started his career as a Butlin's Redcoat); Helen Shapiro (who Dave toured with, alongside the Beatles, in the early 60s); Hollywood director Stephen Frears (who cast Dave in a 1979 Alan Bennett play); and comedians Mark Thomas and Jo Caulfield.\n\n\nDave Allen: Goodnight and May Your God Go With You\n\n\nAudio Format    : MP3\nDuration        : 54mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:cabd8e37e09cf17d8ca7386367dd62bd26aaa3fd","amp;dn":"Radio+2+Comedy+Season+-+Dave+Allen+Goodnight+and+May+Your+God+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cabd8e37e09cf17d8ca7386367dd62bd26aaa3fd","infoHashBuffer":{"type":"Buffer","data":[202,189,142,55,224,156,241,125,140,167,56,99,103,221,98,189,38,170,163,253]},"announce":[],"urlList":[]}}