{"title":"warhammer 40,000: Fire Warrior","uid":6551800,"size":1263185920,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cb021404451543646f22ae4724798bedaa8a41bd&amp;dn=warhammer+40%2C000%3A+Fire+Warrior&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Wous112","files":2,"time":1311092525,"description":"The story takes place over a period of 24 hours. The game begins with Kais's first mission, an attempt to rescue Ko'vash from Governor Severus. He infiltrates Severus's prison-fortress, and escapes with Ko'vash intact. As the Orca dropship begins docking with the Tau Emissary class cruiser, it is attacked by an Imperial Battleship, and boarding pods are launched. Kais then fights a desperate battle against a force of Storm Troopers as they try to disable the cruiser's engines, and assassinate the Captain. After Kais fails to rescue the Captain, he and several teams of Fire-Warriors are launched, by boarding pod at the Imperial ship. There,he disables the ship's guns and nearly captures the ship's commander, Admiral Constantine. Kais is clubbed on the head by Captain Ardias, however, and is captured. Ardias brokers a truce between the Imperium and the Tau, and it is revealed that Governor Severus has been seduced by the Powers of Chaos, teleporting a contingent of Word Bearers Chaos Marines onto the ship. They capture the ship's remaining guns, in an attempt to re-start the Imperium-Tau war, but are stopped by Kais's destruction of the guns. Ardias then sets the ship to self-destruct, and Kais escapes via a Dreadnought drop-pod. Landing in the midst of a ruined Imperial city, Kais fights his way to fellow Tau Fire-Warriors, and learns from Ardias that Severus plans to use an Imperial Titan held in the City. Kais destroys the Titan, enters Severus's fortress, and kills Severus and his daemonic master. The game ends with Ardias ordering that the planet should be destroyed to prevent the taint of Chaos from spreading. Many adversaries from the Warhammer 40,000 universe are encountered by the protagonist Kais, such as Dreadnoughts, Chaos Space Marines, Imperial Guard, Daemon princes, and an Imperial Valkyrie.\n\n\nMimimun Spec:\n\nWindows 98/2000/XP\nPentium III 800mhz (1,4 ghz Recommend!)\n128 mb's of ram (256 mb's Recommend!)\n1,5 gb free on hdd\nDirectx 9.0","torrent":{"xt":"urn:btih:cb021404451543646f22ae4724798bedaa8a41bd","amp;dn":"warhammer+40%2C000%3A+Fire+Warrior","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb021404451543646f22ae4724798bedaa8a41bd","infoHashBuffer":{"type":"Buffer","data":[203,2,20,4,69,21,67,100,111,34,174,71,36,121,139,237,170,138,65,189]},"announce":[],"urlList":[]}}