{"title":"It's Immaterial - Life's Hard And Then You Die [1986] [FLAC]","uid":8113116,"size":406100307,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cb282fd3d1e64887ecdc859f6d3bc99f8ee93319&amp;dn=It%27s+Immaterial+-+Life%27s+Hard+And+Then+You+Die+%5B1986%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1360234155,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: It's Immaterial\nRelease: Life's Hard And Then You Die\nDiscogs: 1048582\nReleased: 1986\nLabel: Siren Records\nCatalog#: CD SIREN 4\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: UK\nStyle: Electronic, Rock, Alternative Rock, Folk Rock, Downtempo, Pop Rock, Synth-pop\n\nTracklisting:\n\n01. Driving Away From Home (Jim's Tune) (4:12)\n02. Happy Talk (5:29)\n03. Rope (3:37)\n04. The Better Idea (5:42)\n05. Space (3:59)\n06. The Sweet Life (4:38)\n07. Festival Time (3:52)\n08. Ed's Funky Diner (3:05)\n09. Hang On Sleepy Town (4:20)\n10. Lullaby (6:21)\n11. Washing The Air (5:29)\n12. Ed's Funky Diner (The Keinholz Caper) (5:53)\n13. Driving Away From Home (I Mean After All It's Only 'Dead Man's Curve') (6:30)\n\nIt's Immaterial has qualities that can't be discerned from one listen, at least on the band's debut LP, Life's Hard and Then You Die. Patience is really needed to let this record's oddball hooks kick in. The opening track, &quot;Driving Away From Home (Jim's Tune),&quot; is its most accessible. &quot;Driving Away From Home&quot; is a moody travelogue wherein John Campbell's half-spoken, half-sung vocals and Jarvis Whitehead's locomotive beat capture both the weariness and sense of wonder of being on a long road trip. Musically, the LP is all over the place -- new wave, country, blues, folk, and synth pop. Somehow the smorgasbord of styles works, because the bandmembers aren't being eclectic just for the sake of it; they simply have a wide canvas, keeping the album fresh from beginning to end. When Campbell talks, it isn't because he can't sing; the man has a lovely voice, especially during the transcendent chorus of &quot;Space.&quot; On &quot;Better Idea&quot; and &quot;Hang on Sleepy Town,&quot; Campbell creates an air of sadness that is felt more deeply with each listen. It's Immaterial manages to stay focused, never allowing its genre-bending to veer out of control. &quot;Sweet Life&quot; takes a bite out of Echo &amp; the Bunnymen's brittle, psychedelic riffs and provides a Spanish flavor. Like much of Life's Hard and Then You Die, it grows on the listener. When &quot;Festival Time&quot; erupts into total chaos -- pulsating keyboards, brazen horns, samples of horses, operatic voices -- it sounds like a mess at first, but repeated spins reveal how well crafted it is. The CD version of Life's Hard and Then You Die is the one to search for. The CD adds three bonus cuts -- the gripping &quot;Washing the Air&quot; (with ghostly singing from Campbell and reptilian guitars that recall James Bond's instrumental theme) and different versions of &quot;Ed's Funky Diner&quot; and &quot;Driving Away From Home.&quot;","torrent":{"xt":"urn:btih:cb282fd3d1e64887ecdc859f6d3bc99f8ee93319","amp;dn":"It%27s+Immaterial+-+Life%27s+Hard+And+Then+You+Die+%5B1986%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb282fd3d1e64887ecdc859f6d3bc99f8ee93319","infoHashBuffer":{"type":"Buffer","data":[203,40,47,211,209,230,72,135,236,220,133,159,109,59,201,159,142,233,51,25]},"announce":[],"urlList":[]}}