{"title":"Anne of Green Gables: The Continuing Story dvd 5/6","uid":3949292,"size":4184616960,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cc018eb113f824114f1dab38c08fc50e75ab5e40&amp;dn=Anne+of+Green+Gables%3A+The+Continuing+Story+dvd+5%2F6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elpoderabsoluto","files":14,"time":1198742394,"description":"SINOPSIS\n--La siempre perspicaz y valiente Ana, lista para enfrentar todos los obstaculos que debia sortear para conquistar los corazones de Matthew y Marilla.&quot; Ahora, a los veinte aÃƒÂ±os, Ana regresa a Avonlea por primera vez desde la muerte de Marilla Cuthbert. Gilbert recibe la oferta de un puesto en un hospital de Nueva York y la convence de ir con Ana. Dispone un puesto para ella en una gran editorial. La vida en la gran ciudad no es lo que ella esperaba. Jack Garrison, un atractivo escritor estadounidense le roba el manuscrito a Ana. Asna, se despliega el escenario para las tres horas finales de la historia de &quot;Ana de las tejas verdes&quot; que sigue a los personajes desde Nueva York, el esfuerzo durante la guerra en Europa y eventualmente los regresa a la roja tierra de la Isla PriÃ‚Â¬ncipe Eduardo.---------------------------------------------------------------------------------------\n\nDirector: Stefan Scaini\nActores: Megan Follows, Jonathan Crombie, Cameron Daddo, Schuyler Grant, Patricia Hamiltonm, Greg Spottiswood, Douglas Campbell\nDuraciÃƒÂ³n:185 min\nDistribuidor:\nDiscos:2\nRegiÃƒÂ³n:2\nVideo: 4;3\nIdiomas Audio:espaÃƒÂ±ol e ingles 2.0\nSubtÃƒÂ­tulos:ninguno.\nInfo extra: MenÃƒÂºs interactivos, Acceso directo a escenas, Comentarios del director en InglÃƒÂ©s, Escenas no Incluidas, BiografÃƒÂ­as de los Protagonistas, Efectos Especiales, Comentarios HistÃƒÂ³ricos\n\n\n\nGÃƒ?NERO Y CRÃƒ?TICA\nDrama romantico.\n\n\nViendo esta pelÃƒÂ­cula surge una gran envidia de no poder estar en esos impresionantes parajes canadienses, con esa paz y ese ambiente tan agradable que transmite. Y es que Ana de las Tejas Verdes se ha convertido en una de las pelÃƒÂ­culas televisivas que mÃƒÂ¡s han cautivado (valga la redundancia) mi mente y mi alma. Es una delicia poder ver pelÃƒÂ­culas como esta. La rebelde e inteligente Anne provoca la risa y la frustraciÃƒÂ³n en el espectador en cada momento de su vida, y cÃƒÂ³mo es capaz de iluminar la pantalla con esas trenzas pelirrojas y sus frases ingeniosas para solucionar cualquier problema o menospreciÃƒÂ¡ndose en ocasiones.\nSi Megan Follows ganÃƒÂ³ el premio a mejor actriz por este papel no fue inmerecido. La pelÃƒÂ­cula transmite ternura, amistad, amor, belleza, dolor... y todo rodeado de esos campos preciosos y de una mÃƒÂºsica tan enternecedora que no dejarÃƒÂ¡ indiferente a cualquier persona que la vea.\nUna serie de los ochenta que siempre permanecerÃƒÂ¡ en el corazÃƒÂ³n de mÃƒÂ¡s de un espectador amante a este gÃƒÂ©nero.\n\n\nSISTEMA\n\n{+}PAL {}NTS","torrent":{"xt":"urn:btih:cc018eb113f824114f1dab38c08fc50e75ab5e40","amp;dn":"Anne+of+Green+Gables%3A+The+Continuing+Story+dvd+5%2F6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc018eb113f824114f1dab38c08fc50e75ab5e40","infoHashBuffer":{"type":"Buffer","data":[204,1,142,177,19,248,36,17,79,29,171,56,192,143,197,14,117,171,94,64]},"announce":[],"urlList":[]}}