{"title":"Star Trek - Beyond The Final Frontier","uid":4289779,"size":740147200,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cc81cb756ab2ed056e6e65c8a46fe527f380041e&amp;dn=Star+Trek+-+Beyond+The+Final+Frontier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"circlensess","files":1,"time":1215821286,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0970511&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0970511&lt;/a&gt;\n\nForty years after the start of the Star Trek phenomenon, Paramount commissions Christie&amp;#039;s auction house in New York to sell over a thousand original artifacts (spaceship models, costumes, and props) used in the production of the five television series and ten feature films. Written by yortsnave\n\nParamount Pictures, owner of the Star Trek franchise, decided to celebrate the 40th anniversary of the debut of &quot;Star Trek&quot; (1966) by holding an auction of many of the items that were used in all the live-action Star Trek TV series. The items, stored in several warehouses, included rack after rack of uniforms, pieces of furniture, models of the various versions of the Enterprise and of other starships, and makeup prostheses for characters. Christie&amp;#039;s auction house was chosen to conduct the auction. In this documentary we see how Michael Okuda and Denise Okuda, with assistance from the production staff of all the TV series, chose the items to be auctioned; the problems encountered in preparing the many of the unusual items for shipment to the auction house; and some scenes from the auction held in 2006. There are interviews with many of the stars of all the TV series (although William Shatner is notably absent), series production personnel, and employees of Christie&amp;#039;s. Several unidentified fans who attended the auction and came away with treasured items are also interviewed.\n\n","torrent":{"xt":"urn:btih:cc81cb756ab2ed056e6e65c8a46fe527f380041e","amp;dn":"Star+Trek+-+Beyond+The+Final+Frontier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc81cb756ab2ed056e6e65c8a46fe527f380041e","infoHashBuffer":{"type":"Buffer","data":[204,129,203,117,106,178,237,5,110,110,101,200,164,111,229,39,243,128,4,30]},"announce":[],"urlList":[]}}