{"title":"Sexually Broken--Giant titted MILF Ava Devine blindfolded bound ","uid":10783714,"size":697256627,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cd74240fb331eab83dcde878c3841a807e06ac62&amp;dn=Sexually+Broken--Giant+titted+MILF+Ava+Devine+blindfolded+bound+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"merzedes","files":-1,"time":1408150617,"description":"\nBayimg was down, so not correct shoot image, but same model.\n\n\n\nGiant titted MILF Ava Devine blindfolded bound and fucked roughly by 2 cocks, filled and creampied! | Ava Devine | Matt Williams | Jack Hammer \n\nAugust 15, 2014\n\n\nHigh MP4 only.\n\n\nAva Devine is one of a kind. Huge tits, big blow job lips and a booming ass are not the only thing she brings to the table, she also is a self professed nymphomaniac. This is a lady who lives for the cock. She simply can not get enough. It is her stated intention to fuck the entire world. We can not give her the whole world, but we have 2 dicks available today. We can start with that.\n\nBound down to the legendary Sexuallybroken fuck bed in a doggy position Ava wears nothing but a ring gag and a classic Insex style hood. The blindfolded hood shuts off all vision and the ring gag keeps those giant blow job lips cranked wide open. She can not see or anticipate the cock, all she can do is take what is dished out. And what is dished out is epic amounts of dick. A rope waist belt gives us a handle for a better grip on those hips.\n\nThe huge ring gag keeps that mouth cranked open. Ava can not close her mouth and we slide in balls deep as the drool pours out. Her well trained throat takes every inch. And then it is on. The two cocks slide in from both ends and turn this busty MILF into a sex sandwich. The pounding is brutal and relentless, and Ava takes every stroke like the eager slut that she is. She cums wildly on the dick, gasping and shrieking.\n\nWe use her hard, without mercy, and she loves every minute of it. Her strict bondage keeps her firmly in place as she gets railed. The hood depersonalizes her, reducing her to a bag of holes. This bag of holes proves her worth in the end, as her cunt milks out our hard won cum. We leave this gasping bound sexual animal soaking in her creampie. We will be back later for more... \n\nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/08_15adevine7/SexuallyBroken--Giant-titted-MILF-Ava-Devine-blindfolded-bound-and-fucked-roughly-by-2-cocks-filled-and-creampied.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/08_15adevine7/SexuallyBroken--Giant-titted-MILF-Ava-Devine-blindfolded-bound-and-fucked-roughly-by-2-cocks-filled-and-creampied.php&lt;/a&gt;\n\n15 000 Femdom/BDSM/Fetish torrentuploads in the box, no reason to stop now is there ? :)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)\n\n","torrent":{"xt":"urn:btih:cd74240fb331eab83dcde878c3841a807e06ac62","amp;dn":"Sexually+Broken--Giant+titted+MILF+Ava+Devine+blindfolded+bound+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd74240fb331eab83dcde878c3841a807e06ac62","infoHashBuffer":{"type":"Buffer","data":[205,116,36,15,179,49,234,184,61,205,232,120,195,132,26,128,126,6,172,98]},"announce":[],"urlList":[]}}