{"title":"BBC Why Poverty 2 of 8 Give Us The Money 2012 XviD.1","uid":7892698,"size":735107304,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cdf76eeddc4b3b8374d006ded4f8a84af84945bb&amp;dn=BBC+Why+Poverty+2+of+8+Give+Us+The+Money+2012+XviD.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"plopina","files":2,"time":1354764041,"description":" &lt;a href=&quot;http://www.bbc.co.uk/programmes/p010jxyz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.bbc.co.uk/programmes/p010jxyz&lt;/a&gt;\n\nDocumentary taking an in-depth, behind-the-scenes look at 30 years of Bob \nGeldof and Bono's campaign against poverty. Their work has made them icons of \naid and even garnered them Nobel Peace Prize nominations, but what impact has \nit really had on Africa? Through archive footage and candid new interviews with \nkey players including Geldof, Bono and Bill Gates, the film re-examines three \ndecades of unprecedented campaigns and scrutinises the effectiveness of \ncelebrity-led activism.\n\nNearly 30 years ago, two young pop singers set out to challenge the world. \nTheir aim - to use their celebrity status to end poverty in Africa. After Bob \nGeldof instigated a chart-topping charity single and staged one of the biggest \nrock concerts ever seen, he and Bono joined forces and went on to build a \nmulti-million dollar lobbying organisation. Along the way, they hi-jacked the \nBrits, enlisted IT billionaires, fashion models and academics, won over the \nwiliest of politicians, lobbied world leaders and put the politics of poverty \nfirmly on the international agenda. They raised vast sums for charity and \npersuaded western powers to dramatically reduce third world debt.\n\nBut did they really help make poverty history in Africa? What impact has their \nwork really had on economic growth and poverty reduction? And if they haven't \nmade poverty history, has their campaign at least been responsible for a big \nstep forward?\n\nA BBC Storyville film, produced in partnership with the Open University, the \nfilm screens as part of Why Poverty? - when the BBC and the OU, in conjunction \nwith more than 70 broadcasters around the world, hosts a debate about \ncontemporary poverty.\n","torrent":{"xt":"urn:btih:cdf76eeddc4b3b8374d006ded4f8a84af84945bb","amp;dn":"BBC+Why+Poverty+2+of+8+Give+Us+The+Money+2012+XviD.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdf76eeddc4b3b8374d006ded4f8a84af84945bb","infoHashBuffer":{"type":"Buffer","data":[205,247,110,237,220,75,59,131,116,208,6,222,212,248,168,74,248,73,69,187]},"announce":[],"urlList":[]}}