{"title":"Philosophical Foundations For A Christian Worldview - WLC,JPM","uid":11757037,"size":2376769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce7aeac1e928b2a74a77bd6988b5cde1aaf25d87&amp;dn=Philosophical+Foundations+For+A+Christian+Worldview+-+WLC%2CJPM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1426435042,"description":"What is real?\nWhat is truth?\nWhat can we know?\nWhat should we believe?\nWhat should we do and why?\nIs there a God?\nCan we know him?\nDo Christian doctrines make sense?\nCan we believe in God in the face of evil?\n\nThese are fundamental questions that any thinking person wants answers to. These are questions that philosophy addresses. And the answers we give to these kinds of questions serve as the the foundation stones for consrtucting any kind of worldview. In Philosophical Foundations for a Christian Worldview J.P. Moreland and William Lane Craig offer a comprehensive introduction to philosophy from a Christian perspective. In their broad sweep they seek to introduce readers to the principal subdisciplines of philosophy, including epistemology, metaphysics, philosophy of science, ethics and philosophy of religion. They do so with characteristic clarity and incisiveness. Arguments are clearly outlined, and rival theories are presented with fairness and accuracy. Philosophy, they contend, aids Christians in the tasks of apologetics, polemics and systematic theology. It reflects our having been made in the image of God, helps us to extend biblical teaching into areas not expressly addressed in scripture, facilitates the spiritual discipline of study, enhances the boldness and self-image of the Christian community, and is requisite to the essential task of integrating faith and learning. Here is a lively and thorough introduction to philosophy for all who want to know reality.\n\n\nAbout the author:\nJ. P. Moreland (PhD, University of Southern California; ThM, Dallas Theological Seminary) is Distinguished Professor of Philosophy at Talbot School of Theology, Biola University, in La Mirada, California. He also serves as director of Eidos Christian Center. He has written, edited or contributed to over twenty books including Christianity and the Nature of Science, Does God Exist? (with Kai Nielsen) and Philosophical Naturalism: A Critical Analysis. He has also published more than fifty articles in journals such as Philosophy and Phenomenological Research, American Philosophical Quarterly, Australasian Journal of Philosophy, Metaphilosophy, Pacific Philosophical Quarterly, Southern Journal of Philosophy, Religious Studies and Faith and Philosophy. He is a fellow of the Discovery Institute's Center for Science and Culture.\n\nWilliam Lane Craig (PhD, philosophy, University of Birmingham; ThD, systematic theology, University of Munich) is Research Professor of Philosophy at T albot School of Theology, Biola University, in La Mirada, California. He is also president of the Evangelical Philosophical Society. Craig has published articles in philosophical and theological journals such as The Journal of Philosophy, American Philosophical Quarterly, Philosophical Studies, Philosophy, British Journal for the Philosophy of Science, Modern Theology and Religious Studies. He has written or cowritten more than twenty books, including The Kalam Cosmological Argument; Divine Foreknowledge and Human Freedom; Theism, Atheism and Big Bang Cosmology and God, Time and Eternity","torrent":{"xt":"urn:btih:ce7aeac1e928b2a74a77bd6988b5cde1aaf25d87","amp;dn":"Philosophical+Foundations+For+A+Christian+Worldview+-+WLC%2CJPM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce7aeac1e928b2a74a77bd6988b5cde1aaf25d87","infoHashBuffer":{"type":"Buffer","data":[206,122,234,193,233,40,178,167,74,119,189,105,136,181,205,225,170,242,93,135]},"announce":[],"urlList":[]}}