{"title":"Lily Thai Demanding Jerk Off Instruction DVD 1502","uid":9623259,"size":4012688335,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ceceec175a403518d2803c78d4e8099fc4bc12ea&amp;dn=Lily+Thai+Demanding+Jerk+Off+Instruction+DVD+1502+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"jackhandy001","files":15,"time":1392549738,"description":" WOW this girl from the Hood is MEAN! She Screams at you to get off over her Panty Covered Crotch &amp; Body! Non Stop Nasty Panty J/O Talk! If you are looking for something different Don't Miss Lily! WARNING! EXTREME VERBAL ASSAULT! \n 64 Minutes.\n\n\nClick here for possible sample video clips  \n    \n \nLoading\n     \n\n \n21 year old, nasty talking Asian hottie Lily Thai comes at you with attitude and commands you to jack your little cock. Her tight black shorts are snug on her slender ass as she stands right over you she lets you know you are not worthy to see her panties until you spit on your hand and jerk your cock for her. After some more nastyness, she lets you sorry fucks see her light green size 2 bikini panties. She stands over you and puts her finger on her tight panty covered pussy and slowly rubs and pushes it in. Lastly she pulls off her moist panties and lick the damp crotch while commanding you to &quot;jack off you little whore!&quot; Second scene, if you can handle it, she pounds her fist on to her crotch, this time in orange, nylon bikini shorts. &quot;I want you to jerk your tiny little prick!&quot; she demands. Now, legs spread she lets you sniff her pussy through the shorts as she pats her snatch. She slides those down her legs to show you small, orange and black mesh thong panties. Super close-ups as she continues the verbal assault which is too perverted to quote! Stripping to nude, she rubs her meaty wet snatch in your face. 3rd scene, Lily roll plays in her plaid school uniform catching you sneaking peeks up her dress at her white cotton bikini panties. How Cute! After a few minutes she tells you to fuck off, tired with your perverted ways and tells you to jack off! She tells you to stroke it raw. Off with the dress for some panty tugging, as you see her ass straining through the materials. The panties come off as you do too! Whew! Bad girl, nasty fucking slut mouth, great fucking panty whore! Live Sound. \n","torrent":{"xt":"urn:btih:ceceec175a403518d2803c78d4e8099fc4bc12ea","amp;dn":"Lily+Thai+Demanding+Jerk+Off+Instruction+DVD+1502+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceceec175a403518d2803c78d4e8099fc4bc12ea","infoHashBuffer":{"type":"Buffer","data":[206,206,236,23,90,64,53,24,210,128,60,120,212,232,9,159,196,188,18,234]},"announce":[],"urlList":[]}}