{"title":"CHERiE DEViLLE gets THE LEXiNGTON STEELE TREATMENT 558p","uid":14885107,"size":519823475,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:cf15a28ce60577b5354e8f8a8ac9bfd64d502e5b&amp;dn=CHERiE+DEViLLE+gets+THE+LEXiNGTON+STEELE+TREATMENT+558p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"distinc","files":1,"time":1465726783,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=5200450523\r\n \nhttp://imagedisco.net/?g=2670392040\r\n\r\nPlot:\r\n\r\nLex picked the right day to stop by Jules' place. Cherie Deville is showing off her hot body in some very strappy lingerie. It's clear from the start that all of her holes are up for grabs (and more) for Lex the Impaler!! After she spends a nice chunk of time showing her her sweet ass and pussy, playing with her perfect nipples, she's ready for the big black cock! Cherie cannot contain herself and immediately drops down and tries to fit as much of that cock down her throat as she possibly can. This is a nice, slippery blowjob that turns into some sweet fucking outdoors. These two are gonna have a lot of fun with each other and as soon as the action gets started inside, it doesn't stop. Cherie is so fucking horny and she cums hard just a few minutes in when she takes Lex's huge dick inside. Her pussy grips it so tight and doesn't let go. She loves talking dirty to the legendary pipe layer and he just can't wait to fuck her in every way. He bends her over and sneaks a peek at her sweet asshole before she rides his cock with her tight wet pussy some more. There's plenty of straight up fucking and then they lube up and she bends her perfect booty over to take all of his massive cock in her asshole. All of it, all of it - that's what Cherie wants and that's what Cherie gets. She's so happy to take it all and plays with her pussy as Lex drills his cock balls deep, fast and hard inside that beautiful backdoor. Cherie is a professional slut when she takes that cock and doesn't even close her eyes when Lex shoots his big load all over her eager face. Anytime these two fuck each other should be a paid event!","torrent":{"xt":"urn:btih:cf15a28ce60577b5354e8f8a8ac9bfd64d502e5b","amp;dn":"CHERiE+DEViLLE+gets+THE+LEXiNGTON+STEELE+TREATMENT+558p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf15a28ce60577b5354e8f8a8ac9bfd64d502e5b","infoHashBuffer":{"type":"Buffer","data":[207,21,162,140,230,5,119,181,53,78,143,138,138,201,191,214,77,80,46,91]},"announce":[],"urlList":[]}}