{"title":"OCRKit 2.2 [K'ed]","uid":8817398,"size":14752822,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:cf2cf5a532827bb4981121ad609cc3cab60f04b7&amp;dn=OCRKit+2.2+%5BK%27ed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"weebey7","files":1,"time":1376615357,"description":"Convert any PDF or graphic file into searchable PDF, RTF, HTML and TXT\n\nSearchable Text\n\nOCRKit is a simple and streamlined Mac application, that features the advanced Optical Character Recognition technology, allowing you to convert scanned or printed documents into searchable and editable text. This is particularly useful for PDF documents received via e-mail or created by DTP applications. It can be a great help for everyone, home users, corporate users at work and educational institutions.\n\nYou can use the copy and paste tools on the document, instead of retyping everything and correct it. It increases the efficiency and effectiveness of office workflow. OCRKit is fast and accurate, ensuring the document's content remains intact while saving time as well.\n\n\nOCR Engine\n\nThe OCR engine recognizes the following languages:\n\nBulgarian, Croatian, Czech, Danish, Dutch, English, Estonian, Finnish, French, German, Hungarian, Italian, Latvian, Lithuanian, Polish, Portuguese, Rumanian, Russian, Serbian, Slovenian, Spanish, Swedish, Turkish, Ukrainian, and Norwegian.\n\nAutomatic rotation\n\nThe automatic rotation determines the orientation of each scanned sheet automatically, therefore avoiding the need to manually pre-sort a stack before you scan. As the automatic rotation works independently from the OCR mechanism, the feature also helps to improve OCR results.\n\nMulti-Page Documents\n\nThere are no limits to the number of pages of the PDF or TIFF documents. There are also no limits to the number of pages that can be processed each day.\nSimply Drag and Drop\n\nIt works very easy, just by dragging a document into the app dock icon or, by opening the document with the OCRKit application (Open With &gt; ).\nAppleScript Support\n\nOCRKit includes AppleScript support, so professional users can use it for programmed batch conversion. ","torrent":{"xt":"urn:btih:cf2cf5a532827bb4981121ad609cc3cab60f04b7","amp;dn":"OCRKit+2.2+%5BK%27ed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2cf5a532827bb4981121ad609cc3cab60f04b7","infoHashBuffer":{"type":"Buffer","data":[207,44,245,165,50,130,123,180,152,17,33,173,96,156,195,202,182,15,4,183]},"announce":[],"urlList":[]}}