{"title":"Sandra Brown - Honor Bound","uid":10376951,"size":442996477,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cf4965b19f51bfdc0f7368c184b8c1cfa46d30c4&amp;dn=Sandra+Brown+-+Honor+Bound+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"twocows","files":13,"time":1403019123,"description":"Aislinn Andrews met Lucas Greywolf under unusual circumstances--she caught the escaped convict raiding her refrigerator. But was he a troublemaker who aroused dissidence among Arizona's Native Americans...or a hero who'd gone to prison for a crime he hadn't committed? It didn't really matter now, since Lucas Greywolf had taken her hostage. He was going home to the reservation of his birth, honor bound to pay last respects to his dying grandfather. And Aislinn was his ticket home.\n\nThrough their journey across the hot Arizona desert, Aislinn was alternately intrigued and infuriated by this rebel with a cause. This defiant, determined man made no secret of his hatred for her kind: the Anglos who betrayed his people.\n\nYet among his people, Aislinn saw another side to Lucas Greywolf as she was swept into a world where sacred tradition clashed with despair and poverty, where family, heritage, and honor was all that remained. Transformed by his world, by his strength, by her growing love for this complicated, proud man, she gave in to her heart's demands, knowing that Lucas would soon return to prison. Neither anticipated the gift he'd leave behind.","torrent":{"xt":"urn:btih:cf4965b19f51bfdc0f7368c184b8c1cfa46d30c4","amp;dn":"Sandra+Brown+-+Honor+Bound+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf4965b19f51bfdc0f7368c184b8c1cfa46d30c4","infoHashBuffer":{"type":"Buffer","data":[207,73,101,177,159,81,191,220,15,115,104,193,132,184,193,207,164,109,48,196]},"announce":[],"urlList":[]}}