{"title":"Abigail  Williams - Discography (2005-2012)  ak","uid":11756504,"size":522879998,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf54115164e0c146f3127a38788061617433f8ab&amp;dn=Abigail++Williams+-+Discography+%282005-2012%29++ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"analogkid6103","files":46,"time":1426398280,"description":"Abigail Williams\n\nCountry of origin:\n    United States\nLocation:\n    Phoenix, Arizona (early), Olympia, Washington (now)\nStatus:\n    Active\nFormed in:\n    2004\n\nGenre:\n    Melodic Black/Deathcore (early), Atmospheric/Symphonic Black Metal (later)\nLyrical themes:\n    Metaphysicalism, Spiritualism, Occultism, Nature\nCurrent label:\n    Candlelight Records\n\nYears active:\n    2004-2007, 2007-2012, 2012-present \n\nThe band originally formed in Phoenix, Arizona, but soon moved to New York City, then Los Angeles, and is now based out of Olympia, Washingon.\n\nThe band's name comes from a girl of the same name who played a significant role in the Salem Witch Trials of 1692 and was depicted as the central antagonist in the play The Crucible by Arthur Miller.\n\n Abigail Williams broke up for a short time soon after the release of the &quot;Legend&quot; EP, during the constant split of members, then officially reformed with an all new line-up except Ken Sorceron, moving from Tempe, Arizona to the Cleveland/Detroit area. During this time, Ashley Jurgemeyer was replaced by Kristen Randall (ex-Winds of Plague). A short while later, the band dropped all its new members and was rejoined by Ellyllon. Bassist Tommy Harwood Jr. (of the band Plaguehammer), also rejoined the fold soon after. The band also relocated again to New York City.\n\nIn May 2008, Ken Sorceron announced that Abigail Williams had finally become a full band again with 6 permanent members, including the newest addition on drums, Sam Paulicelli from Mutiny Within. Ellyllon parted ways with the band once again Fall 2008 to pursue other musical interests including her solo classical project, her other band Orbs, and playing on a tour for Cradle of Filth for became finally a session member of they.\n\nThe band recruited Alana Potocnik (Winds of Plague, ex-The Breathing Process), as a Ashley's replacement but she short left to join Winds of Plague. Again they suffered an important split of members, including former guitarists Bjorn Dannov and Mike Wilson. In 2009 the band welcomes Ken Bedene on drums, Ian Jeckelis on guitars and Tristan McCann (Oceano) on bass. This last left short time ago and they decided to continue as a three-piece switching Ken Bedene from drums to bass. The second album &quot;In the Absence of Light&quot; shows a total change into a Black Metal band. Sorceron is also playing guitar as a full-time member for Aborted meanwhile Ian Jeckelis are doing the same for God Dethroned.\n\nName \tType \tYear \tReviews\n\nLegend \tEP \t2006 \t\n\nIn the Shadow of a Thousand Suns \tFull-length \t2008 \t\n\nWatchtower \tSingle \t2009 \t\n\nTour 2009 EP / In the Shadow of a Thousand Suns (Agharta) \tEP \t2009 \t\n\nMalediction \tSingle \t2010 \t \n\nIn the Absence of Light \tFull-length \t2010 \t\n\nBecoming \tFull-length \t2012 \t\n\n\nMembers/Players:\n\nKen Sorceron \tGuitars, Vocals (2004-present)\nSee also: Bro Jovi, Missing, Vesica Piscis, ex-Aborted, ex-Belhor, ex-Lord Mantis, ex-Nibirus (live), ex-Mercitron, ex-System Divide (live), ex-Awesome, ex-Born of Fire, ex-Guns, ex-Kyds vs Columbus, ex-Nihil, ex-Victims in Ecstacy, ex-Virii, ex-N17 (live)\nIan Jekelis \tGuitars (lead) (2009-present)\nSee also: ex-Abysmal Dawn, ex-Artisan, ex-God Dethroned (live)\nJeff Wilson \tBass (2013), Guitars (2013-present)\nSee also: Chrome Waves, Doomsday, Wolvhammer, Liar in Wait, Missing, ex-Bringers of Disease, ex-Krieg, ex-Dyngyr, ex-Nachtmystium\t\nWill Lindsay \tBass (2014-present)\nSee also: Anatomy of Habit, Lord Mantis, A Storm of Light (live), ex-Indian, ex-Middian, Bloodyminded, ex-Wolves in the Throne Room, ex-Nachtmystium, ex-Ahisma, ex-Human Certainty, ex-The Detonators, ex-Happy Bastards (live)\nCharlie Fell \tDrums (2014-present)\nSee also: ex-Floating Fantasy, ex-Avichi, ex-Lord Mantis, ex-Nachtmystium (live) \n\nFor TRACK LISTING SEE FILES, NOT ENOUGH ROOM TO POST ALL OF EM seed and enjoy","torrent":{"xt":"urn:btih:cf54115164e0c146f3127a38788061617433f8ab","amp;dn":"Abigail++Williams+-+Discography+%282005-2012%29++ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf54115164e0c146f3127a38788061617433f8ab","infoHashBuffer":{"type":"Buffer","data":[207,84,17,81,100,224,193,70,243,18,122,56,120,128,97,97,116,51,248,171]},"announce":[],"urlList":[]}}