{"title":"Tree of Knowledge The Bright and the Dark Sides of Science prabh","uid":9415157,"size":6346755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf6568a4698277e9206f6131ffbd627d9909aa80&amp;dn=Tree+of+Knowledge+The+Bright+and+the+Dark+Sides+of+Science+prabh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"prabhu_","files":2,"time":1388424119,"description":"The Tree of Knowledge The Bright and the Dark Sides of Science\n\nby Ronchi, Claudio\n &lt;a href=&quot;\nhttp://www.nhbs.com/images/jackets_resizer_large/20/208409.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nhbs.com/images/jackets_resizer_large/20/208409.jpg&lt;/a&gt;\n\nabout book :-\n\nA fascinating long view of science by an author with extensive &quot;insider&quot; knowledge\nWarns against the assumption that science equates with salvation\nPaints plausible pictures of different futures, showing how they relate to our use and abuse of science\n\nWhether considered a divine gift or a Promethean conquest, science has indisputably and indelibly marked the course of human history. A product of the intellectual elite, but always nourished by the many fruits of its applications, science appears today to be a perfect system, whose laws and discoveries guide all human activities. Yet the foundations of its authority remain an open question, entailing disquieting aspects that are also to be identified in modern science. Furthermore it is seen to be exerting an increasing power over mankind. Readers are invited to follow an itinerary through the history of science, a voyage which, in the end, enables them to catch a glimpse of two divergent futures: One in which science accelerates the downfall of Homo sapiens, and another in which it helps our species to engage in a new and positive adventure, whose outcome nobody can know.\n\nabout this author :-\n\nCLAUDIO RONCHI was born in Milan in 1940. He attended the Classic Grammar School and after graduating in mathematics and physics from the State University of Milan, he joined the European Fast Reactor Project. He worked in German, French, English and Americans laboratories. In the 1990s he was requisitioned by the European Commission to establish a collaborative effort with the countries of the former Soviet Union. To this end he coordinated the first joint nuclear research projects with important Russian and European laboratories. Until his retirement he was head of the Materials Research Division of the European Institute of Transuranium Elements to Karlsruhe, where he also supervised  PhD works of students from all over the world. He presently lives in Germany.\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n\n","torrent":{"xt":"urn:btih:cf6568a4698277e9206f6131ffbd627d9909aa80","amp;dn":"Tree+of+Knowledge+The+Bright+and+the+Dark+Sides+of+Science+prabh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf6568a4698277e9206f6131ffbd627d9909aa80","infoHashBuffer":{"type":"Buffer","data":[207,101,104,164,105,130,119,233,32,111,97,49,255,189,98,125,153,9,170,128]},"announce":[],"urlList":[]}}