{"title":"Garrow's Law    (BBC - Season 2 - Complete)","uid":6818525,"size":2308128915,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d03e35b4026092d4ce64b684185b6f667e61c563&amp;dn=Garrow%5C%27s+Law++++%28BBC+-+Season+2+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"neil1966hardy","files":6,"time":1321309026,"description":"Set around trials at the Old Bailey in Georgian London against a backdrop of corruption and social injustice, Garrow's Law is a legal drama inspired by the life of pioneering barrister William Garrow. the series, co-created by Tony Marchant, is based on real legal cases from the late 18th century, as recorded in the Old Bailey Proceedings. Andrew Buchan as Garrow leads a cast including Alun Armstrong and Lyndsey Marshal.\n\nFrom rape and murder to high treason and corruption, each episode begins with the investigation of a real crime sourced from the published accounts of Old Bailey trials, available in a fully searchable edition online.[4] In an age when defence counsel was for the minority, the youthful Garrow and his associate John Southouse, a solicitor, work to uncover the truth or fight for justice, championing the underdog and pioneering the rigorous cross-examination of prosecution witnesses that paved the way for the modern legal system.\nA gifted maverick, at times arrogant and with a burning sense of destiny, Garrow's drive to change the nature of the trial creates powerful enemies both in the corrupt underworld and among the political elite.\n\nA major subplot running through the first series concerns Garrow's attempts to win the love of Lady Hill. The attempts appear unsuccessful but almost cost Garrow his life in episode three when Garrow challenges Silvester, his main courtroom rival, to a duel when Silvester insinuates that Garrow and Lady Hill's relationship has become intimate and then refuses to withdraw the allegation. Lady Hill's husband is Sir Arthur Hill, an important politician and member of the government. The storyline continues in the second series when Sir Arthur accuses his wife of adultery with Garrow.\n\nAs well as William Garrow, the series also includes other non-fictional characters, most notably Sir Francis Buller, a controversial judge of the age. However, the series is not a biographical documentary. According to the Story Editor of Garrow's Law, Mark Pallis, the show &quot;aims to give viewers a real sense of what life was like in legal London towards the end of the 18th century; to give people a chance to experience the big legal landmarks and the cases that caused a stir at the time.&quot;\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d03e35b4026092d4ce64b684185b6f667e61c563","amp;dn":"Garrow%5C%27s+Law++++%28BBC+-+Season+2+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03e35b4026092d4ce64b684185b6f667e61c563","infoHashBuffer":{"type":"Buffer","data":[208,62,53,180,2,96,146,212,206,100,182,132,24,91,111,102,126,97,197,99]},"announce":[],"urlList":[]}}