{"title":"Winterfylleth - The Ghost Of Heritage  2008","uid":11609561,"size":80772007,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d0e40e4a57ffe80e6f48bdee3035d8ce8989d7d8&amp;dn=Winterfylleth+-+The+Ghost+Of+Heritage++2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"analogkid6103","files":9,"time":1417393734,"description":"mp3 bitrate vbr Winterfylleth The Ghost Of Heritage  &quot;This album is dedicated to all those who throughout the ages have been actively involved in the preservation of our proud ancestral heritage, rich national culture, folklore, and tradition. We will honour you forever!&quot; The quote is taken from the booklet of &quot;The Ghost of Heritage&quot; by England's WINTERFYLLETH (or &quot;winter full moon&quot; in Olde English and representing the month of October and the Anglo-Saxon festival of the arrival of winter) and sums up exactly the lyrical themes of this young black metal act's full-length debut. That is, a factual exploration of watershed events and pivotal points in the history of England.\n\nFeaturing members of ATAVIST and WODENSTHRONE, The act's self-described &quot;English Heritage Metal&quot; is a relatively unique brand of folk-laced, expansive, and semi-progressive (i.e., not cluttered) black metal that takes multiple listens to fully appreciate. Trust me, once you've spent an ample amount of time with &quot;The Ghost of Heritage&quot; it will sink its claws into you permanently. There is a certain density to the album that requires some patience to fully absorb. Yet it is not because of a needless layering or random instrumentation; just a classy and intelligent style of composition that comes off as weighty as the topics covered.What really makes &quot;The Ghost of Heritage&quot; go is the pacing and track placement, which are done in a way to assure momentum is retained, even when the lights turn low on a track like the charming, primarily acoustic instrumental (save for some choral effects) &quot;The March of Maldon&quot;. Aside from those lighter moments, the album contains plenty of furious black metal tempos and caustic vocals, yet even in these cases the majesty of it all comes across loud and clear. The use of the aforementioned mid-range choral effects and incorporation of folky acoustic guitars are especially well done in the context of these songs as well. It never sounds forced and always bolsters the album's sonic might and epic feel (check out the manner in which the acoustic-driven &quot;Guardian of the Herd&quot; builds). The use of clean, yet brawny, vocals on songs like album highlight &quot;Brithnoth: The Battle of Maldon (991 AD)&quot; turns a strong song into a triumphant and memorable one. It's all about peaks and valleys.\n\n &quot;The Ghost of Heritage&quot; is no exception. It just goes to show that there is no dearth of dearth of ideas in black metal for those willing to put forth a Herculean effort.                      vbr                                                                                       1. \tMam Tor (The Shivering Mountain) \t06:14 \t  \n2. \tThe March to Maldon \t03:46 \t \n3. \tBrithnoth: the Battle of Maldon (991 AD) \t07:38 \t \n4. \tForging the Iron of England \t05:12 \t \n5. \tThe Ghost of Heritage \t05:27 \t \n6. \tDefending the Realm \t05:21 \t  \n7. \tGuardian of the Herd \t04:49 \t  instrumental\n8. \tCasting the Runes \t05:23 \t \n9. \tAn Englishman's Verse \t05:04 \t \n  \t48:54                                                                               Simon Lucas \tDrums, Spoken Word\nChris Naughton \tGuitars, Bass, Vocals\nRichard Brass \tGuitars, Vocals                                                        Released in digipak format.\nRe-released on tape in 2011 by Night Birds Records.\n\nRe-released on CD in 2012 by Candlelight Records, with new cover art / layout, and two previously unreleased bonus tracks recorded during the album sessions:\n\nBoth bonus tracks were later re-recorded in 2010 for the &quot;The Mercian Sphere&quot; album","torrent":{"xt":"urn:btih:d0e40e4a57ffe80e6f48bdee3035d8ce8989d7d8","amp;dn":"Winterfylleth+-+The+Ghost+Of+Heritage++2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e40e4a57ffe80e6f48bdee3035d8ce8989d7d8","infoHashBuffer":{"type":"Buffer","data":[208,228,14,74,87,255,232,14,111,72,189,238,48,53,216,206,137,137,215,216]},"announce":[],"urlList":[]}}