{"title":"Atlas of Digestive Endoscosection [PDF] [StormRG]","uid":10611175,"size":43366711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1c1a0952bc7b980fda832732beb2e6b330d613b&amp;dn=Atlas+of+Digestive+Endoscosection+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":-1,"time":1406038341,"description":"Author:Pinghong Zhou, Liqing Yao, Xinyu Qin \nHardcover: 322 pages\nPublisher: Springer; 2014 edition (March 6, 2014)\nLanguage: English\nISBN-10: 9400779321\nISBN-13: 978-9400779327\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nDigestive Endoscopic Resection provides a minimally invasive method of diagnosing and treating gastrointestinal cancer. This book contains a comprehensive and detailed introduction to this technique. It includes preoperative preparation, surgical methods, intraoperative complications and postoperative management of advanced endoscopic procedures. It mainly focuses on endoscopic submucosal dissection (ESD) and endoscopic submucosal tunneling technologies, such as peroral endoscopic myotomy (POEM) and submucosal tunneling endoscopic resection (STER). This book presents essential surgical steps and diagnostic illustrations of these fast developing techniques. It provides a theoretical basis and valuable technical guidance for experts to perform ESD and summarizes this new treatment of gastrointestinal disease not only early cancers but also other gastrointestinal disorders including esophageal achalasia, etc. The Atlas of Digestive Endoscopic Resection will serve as an ideal reference for physicians and surgeons involved in endoscopic minimally invasive surgery.","torrent":{"xt":"urn:btih:d1c1a0952bc7b980fda832732beb2e6b330d613b","amp;dn":"Atlas+of+Digestive+Endoscosection+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1c1a0952bc7b980fda832732beb2e6b330d613b","infoHashBuffer":{"type":"Buffer","data":[209,193,160,149,43,199,185,128,253,168,50,115,43,235,46,107,51,13,97,59]},"announce":[],"urlList":[]}}