{"title":"Total Spy v3.0 (2-click run)(registred)","uid":8596213,"size":3245215,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d297c9b59634dfee822cae1c8c8af2a115c38d9d&amp;dn=Total+Spy+v3.0+%282-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"The_Duck1","files":5,"time":1371766908,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nVersion 3.0\n\nDescription:\nTotal Spy is an all-in-one invisible spy software! With this program you will know exactly what other users are doing on your computer. \n\nTotal Spy records keystrokes, scans the clipboard for changes, and monitors web navigation. It also captures screenshots, so you can see exactly what other users are doing. Total Spy collects all recorded information to a hidden location on the hard drive, so you can view it later. Total Spy runs in stealth mode so other users are not aware of it's presence.\n\nKey features:\n* Invisible to everyone except you. You only have to press the hot key combination you choose to unhide Total Spy.\n* Records everything that is entered from the keyboard.\n* Monitors all internet navigation (visited URLs and website titles).\n* Scans Windows clipboard for changes.\n* Monitors the screen by taking snapshots.\n* Can autostart in hidden mode upon logon, so you don't have to hide Total Spy manually after each system reboot.\n\nDo you have children? With Total Spy you can protect them from dangerous contacts. You can read their online chats and emails along with monitoring the websites they visit. Don't hesitate! You have the right to know, because YOU ARE THE PARENT! \n\nDoes your girl/guy cheat on you? Total Spy will help you find out whether or not your girlfriend, boyfriend, wife or husband is cheating on you when you are away.\n\nAre you an Employer? Do all your employees use their computer resources and internet connection solely for your business? Do they work as hard when you're away as they do when you are watching over their shoulders? Do you suspect your employees' productivity is lacking? Total Spy can help! Just install it on their computers and you can view reports anytime via LAN connection.\n\nLost your progress typing? How many times have you lost important data typed into a text editor because your computer suddenly froze/crashed or the application aborted for no apparent reason? With Total Spy running these are worries of the past!\n\nTake control of your computer, install Total Spy today!","torrent":{"xt":"urn:btih:d297c9b59634dfee822cae1c8c8af2a115c38d9d","amp;dn":"Total+Spy+v3.0+%282-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d297c9b59634dfee822cae1c8c8af2a115c38d9d","infoHashBuffer":{"type":"Buffer","data":[210,151,201,181,150,52,223,238,130,44,174,28,140,138,242,161,21,195,141,157]},"announce":[],"urlList":[]}}