{"title":"Dr. David R. Hawkins - 2008 Audiobooks","uid":6121431,"size":1030452997,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d29bbbbb5d73f8984c5849d883d1880d0b39b77c&amp;dn=Dr.+David+R.+Hawkins+-+2008+Audiobooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"adenxoxo","files":-1,"time":1295765384,"description":"Dr. David R. Hawkins - 2008 Audiobooks\n\nCOMPLETE AUDIOBOOKS FROM 2008 LECTURE SERIES IN M4B FORMAT\n\n\nLecture #01 - Spirituality: Reason and Faith\nLecture #02 - The Clear Pathway to Enlightenment\nLecture #03 - Belief, Trust, and Credibility\nLecture #04 - Overcoming Doubt, Skepticism and Disbelief\t \nLecture #05 - Practical Spirituality\nLecture #06 - Freedom: Morality and Ethics\nLecture #07 - A Unique Sedona Seminar with Bonus Audio\n\n\nGloria in Excelsis Deo!\n\n\n~*~*~ Please Seed For As Long As Possible ~*~*~\n\n\n\nDR. DAVID R. HAWKINS\nBiography Summary\n\nSir David R. Hawkins, M.D., Ph.D. is a nationally renowned psychiatrist, physician, researcher, and lecturer. He co-authored the ground-breaking work, Orthomolecular Psychiatry with Nobel Laureate Linus Pauling, that helped revolutionize psychiatry. His national television appearances include The MacNeil/Lehrer News Hour, The Barbara Walters Show, and The Today Show. Winner of the Huxley Award, knighted by the Sovereign Order of the Hospitaliers of St. John of Jerusalem, nominated for the Templeton Prize and honored in the East with the title &quot;Tae Ryoung Sun Kak Tosa&quot; (Foremost Teacher of the Way to Enlightenment), Dr. Hawkins' honors are vast. His background is detailed in Who's Who in America and Who's Who in the World, and his work has been acclaimed by many world leaders and Nobelists, including Mother Teresa.\n\nDr. Hawkins has lectured at the University of Argentina; Notre Dame, Stanford, and Harvard Universities; Westminster Abbey; and the Oxford Forum. In addition, he has been an advisor to Catholic, Protestant, and Buddhist monasteries. He has conferred with foreign governments on international diplomacy and has been instrumental in resolving long-standing conflicts that were major threats to world peace. He is the author of the best-selling trilogy, Power vs. Force (published in 17 languages), The Eye of the I, and I: Reality and Subjectivity, and four additional books, including Truth vs. Falsehood, Transcending the Levels of Consciousness, Discovery of the Presence of God and Spirituality and Modern Man.\n\n\n\n~*~*~ Please Seed For As Long As Possible ~*~*~\t\t\t\t\n","torrent":{"xt":"urn:btih:d29bbbbb5d73f8984c5849d883d1880d0b39b77c","amp;dn":"Dr.+David+R.+Hawkins+-+2008+Audiobooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d29bbbbb5d73f8984c5849d883d1880d0b39b77c","infoHashBuffer":{"type":"Buffer","data":[210,155,187,187,93,115,248,152,76,88,73,216,131,209,136,13,11,57,183,124]},"announce":[],"urlList":[]}}