{"title":"Sissel Kyrkjebo - Til deg 2010","uid":6781663,"size":240660513,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d2ca8b00aeab3fc46275792d2887ffb2dbdf85ba&amp;dn=Sissel+Kyrkjebo+-+Til+deg+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"barber9","files":-1,"time":1319924396,"description":"Sissel KyrkjebÃƒÂ¸, also simply known as Sissel, is a Norwegian soprano.\n\nSissel is considered one of the world's top crossover sopranos. Sissel's musical style runs the gamut from pop recordings and folk songs, to classical vocals and operatic arias. She possesses a crystalline voice and wide vocal range, sweeping down from mezzo-soprano notes, in arias such as Mon coeur s'ouvre a ta voix from Saint-Saens's opera Samson et Dalila, to the F natural above soprano C. She sings mainly in English and Norwegian, but has also sung songs in Swedish, Danish, Gaelic, Italian, French, Russian, Icelandic, Faeroese, German, Neapolitan, Maori, Japanese and Latin.\n\nShe is well known for singing the Olympic Hymn (Hymne Olympique) at the opening and closing ceremonies of the 1994 Winter Olympics in Lillehammer, Norway, for duets with Placido Domingo, Charles Aznavour, Jose Carreras, Neil Sedaka, Warren G, Brian May, Bryn Terfel, Josh Groban, Diana Krall, Russell Watson and The Chieftains, and her participation on the Titanic film soundtrack.\n\nSissel received her first U.S. Grammy nominations on December 6, 2007 for a collaboration with the Mormon Tabernacle Choir. Spirit of the Season, a collection of songs from the choirs 2006 Christmas concert featuring Sissel and the Orchestra at Temple Square, was nominated for the Best Classical Crossover Album of the Year, as well as Best Engineered Classical Album.\n\nSissel's combined solo record sales (not including soundtracks and other albums to which she contributed) amount to 10 million albums sold, most of them in Norway, a country with 4.7 million people. Her albums have also sold well in Sweden, Denmark and Japan. Together with Odd Nordstoga, they are the only Norwegian artists to have an album go 11 times platinum in album sales for their album StrÃƒÂ¥lande jul (Glorious Christmas).\n\nSissel was married from 1993 to 2004 to Danish-American comedian and singer Eddie Skoller. They have two daughters. (wikipedia)\n\n- - -\n\nSissel KyrkjebÃƒÂ¸ - Til deg  2010\n(Oslo Universal)\n\n 1. Velkommen hjem. \n 2. TÃƒÂ¤tt intill dig. \n 3. Saknar dig nu. \n 4. Folkestadsvisa. \n 5. Den fÃƒÂ¶rsta sommaren. \n 6. Hole in the world. \n 7. Levande dÃƒÂ¶d. \n 8. En drÃƒÂ¶m om dig och mig. \n 9. Dagane. \n10. Goodbye\n\n\nMedverkande:\nOdd Nordstoga, sÃƒÂ¥ng\n","torrent":{"xt":"urn:btih:d2ca8b00aeab3fc46275792d2887ffb2dbdf85ba","amp;dn":"Sissel+Kyrkjebo+-+Til+deg+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2ca8b00aeab3fc46275792d2887ffb2dbdf85ba","infoHashBuffer":{"type":"Buffer","data":[210,202,139,0,174,171,63,196,98,117,121,45,40,135,255,178,219,223,133,186]},"announce":[],"urlList":[]}}