{"title":"Alejandro Silva Power Cuarteto [ASPC] - Discografia","uid":4700146,"size":280110092,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d3e849bd7c25c3a614c8193467bb634ba9d38f57&amp;dn=Alejandro+Silva+Power+Cuarteto+%5BASPC%5D+-+Discografia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elquenoseedeatodoeldia","files":56,"time":1233690851,"description":"Alejandro Silva (19 de junio de 1969) es un guitarrista y mÃƒÂºsico chileno. Su estilo estÃƒÂ¡ ligado al Metal progresivo y sus canciones consisten en trabajos instrumentales. Es endorsado por la marca de guitarras IbaÃƒÂ±ez. Las influencias de la primera parte de su carrera es principalmente Eddie Van Halen y Brian May entre los mÃƒÂ¡s populares; en la segunda parte de su carrera es influenciado por Joe Satriani, Steve Vai y Paul Gilbert, quienes tocaron con el chileno\n\nSilva comenzÃƒÂ³ a tocar guitarra a los 15 aÃƒÂ±os de forma autodidacta. Fue participe del conjunto de rock chileno MandrÃƒÂ¡cula, tras la salida de su guitarrista principal y en 1999 forma &quot;Power Cuarteto&quot; con el cual ha grabado tres discos. Los integrantes del grupo Power Cuarteto Son: Alejandro Silva (1Ã‚Âª guitarra), CristÃƒÂ³bal Arriagada (2Ã‚Âª guitarra), Guido Fregonara (Bajo), el cual fue reemplazado el aÃƒÂ±o 2005 por el bajista Rodrigo GarcÃƒÂ­a, Gonzalo Muga &quot;El Tata&quot; (BaterÃƒÂ­a).\n\nEntre los mÃƒÂºsicos con los que ha tocado Silva destacan Steve Vai, Joe Satriani, Marty Friedman, Paul Gilbert y Billy Sheehan. En 1997 se encuentra con Steve Vai en una conferencia de prensa, lo que &quot;lo puso en el mapa&quot;, lo que significo que en 2004 fuese invitado de honor al G3 organizado por Joe Satriani, convirtiÃƒÂ©ndose asÃƒÂ­ en G4, el cual fue integrado por Joe Satriani, Steve Vai, Robert Fripp y el chileno.\n\nEs ademÃƒÂ¡s un profesor de guitarra particular, ingeniero en sonido, y tiene una lÃƒÂ­nea de amplificadores con su nombre; Piece of Shit (PoS). Alejandro Silva ha recorrido gran parte de Latinoamerica mostrando sus cualidades con la guitarra y es conocido en gran parte del mundo gracias a su actuaciÃƒÂ³n en el G4 y por otras diversas giras que ha realizado.\n\nContenido:\n\nAlejandro Silva I (1999)\nDIOS EOL (2002)\nASPC LIVE (2003)\nORDEN &amp; CAOS (2007)\n\nDisfruten/Enjoy &amp; Seed/Comparte ctm\n\nDetails:","torrent":{"xt":"urn:btih:d3e849bd7c25c3a614c8193467bb634ba9d38f57","amp;dn":"Alejandro+Silva+Power+Cuarteto+%5BASPC%5D+-+Discografia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3e849bd7c25c3a614c8193467bb634ba9d38f57","infoHashBuffer":{"type":"Buffer","data":[211,232,73,189,124,37,195,166,20,200,25,52,103,187,99,75,169,211,143,87]},"announce":[],"urlList":[]}}