{"title":"Wendy Leigh - The Secret Letters of Marilyn Monroe and Jacquelin","uid":8225014,"size":363147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d407030cd91f2f09b38c99d68cd2534026230bc8&amp;dn=Wendy+Leigh+-+The+Secret+Letters+of+Marilyn+Monroe+and+Jacquelin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SectorVector","files":1,"time":1362578313,"description":"This is a work of fiction as described below.\n\nLeigh, biographer to the stars (including Liza Minelli, Prince Edward, and JFK Jr.), has apparently discovered a more innovative method for exploiting celebrities. In this weird novel, Leigh has imagined several years of correspondence between Marilyn Monroe and Jacqueline Kennedy. Although it is not badly written and is fairly compelling to read, the stereotypes (emotional nutcase and slutty sex-maniac Marilyn versus the Queen of all established society, Jacqueline Kennedy) are overblown, and reading it feels somehow inappropriate. The novel takes place during the years between Marilyn's marriage to Joe DiMaggio (who doesn't come off looking very good here) and her alleged affair with President Kennedy (which she confesses to Mrs. Kennedy in full, lurid detail). In addition, while Leigh clearly states that this is a novel, she incorporates actual events as well as footnotes that blur the line between fiction and reality.\n\nAn audacious example of epistolary evesdropping. Revealing, entertaining and compelling. -- John Madden, Director of Shakespeare in Love\n\nLeigh captures the writing voices of these two icons nearly pitch perfectly in every sentence....Strong, warm, empathetic. -- Kirkus Review \n\n","torrent":{"xt":"urn:btih:d407030cd91f2f09b38c99d68cd2534026230bc8","amp;dn":"Wendy+Leigh+-+The+Secret+Letters+of+Marilyn+Monroe+and+Jacquelin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d407030cd91f2f09b38c99d68cd2534026230bc8","infoHashBuffer":{"type":"Buffer","data":[212,7,3,12,217,31,47,9,179,140,153,214,140,210,83,64,38,35,11,200]},"announce":[],"urlList":[]}}