{"title":"Breaking into Japanese literature","uid":4159220,"size":62163554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d412ebc4dd1fd347e4255e9720e44775d4e27015&amp;dn=Breaking+into+Japanese+literature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"wmzz","files":24,"time":1209295535,"description":"Breaking into Japanese Literature: Seven Modern Classics in Parallel Text\nAuthor: Giles Murray\nPublisher: Kodansha International\nPage: 242\nYear: 2003\nFormat: djvu + mp3\nFile size: 33.6 mb + 25.2 mb\n\n    Reading great books in the original should be the culmination of language study, but reading Japanese literature unassisted is a daunting task that can defeat even the most able of students. Breaking into Japanese Literature is specially designed to help you bypass all the frustration and actually enjoy classics of Japanese literature.\n\n    Breaking into Japanese Literature features seven graded stories covering a variety of genres: whether it&amp;#039;s the spellbinding surrealism of Natsume Soseki&amp;#039;s Ten Nights of Dreams, the humor of Akutagawa Ryunosuke&amp;#039;s fable of temple life (&quot;The Nose&quot;), or the excitement of his historic thrillers (&quot;In a Grove&quot; and &quot;Rashomon&quot;), you are sure to find a story that appeals to you in this collection.\n\n    The unique layout-with the original Japanese story in large print, an easy-to-follow English translation and a custom dictionary-was created for maximum clarity and ease of use. There&amp;#039;s no need to spend time consulting reference books when everything you need to know is right there in front of your nose.\n\n    To make Japanese literature fun, Breaking into Japanese Literature also has some unique extra features: mini-biographies to tell you about the authors&amp;#039; lives and works, individual story prefaces to alert you to related works of literature or film, and original illustrations to fire your imagination.\n    Best of all, MP3 sound files of all the stories have been made available for FREE on the Internet.\n\n    Breaking into Japanese Literature provides all the backup you need to break through to a new and undiscovered world-the world of great Japanese fiction. All the hard work has been taken care of so you can enjoy the pleasures of the mind. Why not take advantage?\n\nLearn\n    o 50% of all common-use kanji covered\n    o Kanji entry numbers given for follow-up study\n    o Japanese + English translation + custom dictionary on the same page\n    o Every single kanji word explained\n\nListen\n    o Free download of sound files from the Net\n\nLook\n    o 7 original atmospheric illustrations\n\nLink\n    o Original stories for Kurosawa&amp;#039;s Rashomon and Dreams\n\n    All the stories in this book are available on the Internet as MP3 sound files read by professional Japanese actors.\n\n    For students who want to consolidate their understanding of kanji, the entry numbers for any of the 2,230 characters in The Kodansha Kanji Learner&amp;#039;s Dictionary have been provided when those characters feature in Breaking into Japanese Literature. This makes cross-referencing a matter of seconds.\n","torrent":{"xt":"urn:btih:d412ebc4dd1fd347e4255e9720e44775d4e27015","amp;dn":"Breaking+into+Japanese+literature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d412ebc4dd1fd347e4255e9720e44775d4e27015","infoHashBuffer":{"type":"Buffer","data":[212,18,235,196,221,31,211,71,228,37,94,151,32,228,71,117,212,226,112,21]},"announce":[],"urlList":[]}}