{"title":"Big.Fish.Audio.Colours.MULTiFORMAT.DVDR-PHOTONE","uid":11825394,"size":5570666653,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d4514005be1be6bf27168df39a22fa32d20a02a1&amp;dn=Big.Fish.Audio.Colours.MULTiFORMAT.DVDR-PHOTONE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":2,"time":1429470480,"description":"URL : http://www.bigfishaudio.com/...6;1:::::::::::Colours:517942\n\nThis massive 7.3 GB collection (3 GB of 24-bit WAV files) of Indie,\nCinematic, and Ambient Pop Styles is a showcase of artists and groups\nlike One Republic, Ellie Goulding, Capital Cities, Imagine Dragons,\nColdplay, Florence and the Machine, Fun, Goyte, Clavin Harris, Beck,\nand so many more!\n\nColours contains an enormous collection of Song Kits and Instrument\nKits that give you the freedom to simply use one layer of the\ninstrument by itself or increase its depth, complexity, and beauty by\nadding additional complimentary instrument parts. Colours includes Male\nVocalists (Dry and Wet), Acoustic Guitars, Nylon Guitars, Electric\nGuitars (Clean, Distorted and FX), Acoustic and Electric Drums, Melodic\nand Non-Melodic Percussion, Synth Bass, Pianos, Keys, Synths, Pads,\nSoundscapes, and several additional instruments that provide you with\ntoday's Indie Cinematic sound. By giving you the ability to add the\namount of depth and texture needed, along with multiple variations and\nrhythmic figures, Colours gives you total creative freedom and allows\nyou to tweak to your hearts content!\n\nColours contains Drum and Percussion Elements which give you the\nfreedom to create amazing drum and percussion grooves quickly and\neasily. Drum and Percussion Elements contains individual drum kit and\npercussion pieces (kick, snare, hi-hat, toms, cymbals, shaker,\ntambourine, sticks and many more) that you can use individually or mix\nn match to create an unlimited variety of drum and percussion grooves\nand rhythmic textures. There's also an enormous selection of Drum and\nPercussion Hits which have all been recorded with multiple velocities,\ninsuring dynamic performances every time!\n\nColours also includes Multi-Sampled Instruments including Mallets,\nSynths, and Pads for you to mix n match, remix, and adjust any way you\nlike. Let Colours spark your creative flames and inject your projects\nwith the emotion of today's hottest Indie, Cinematic, and Ambient Pop\nmusic!","torrent":{"xt":"urn:btih:d4514005be1be6bf27168df39a22fa32d20a02a1","amp;dn":"Big.Fish.Audio.Colours.MULTiFORMAT.DVDR-PHOTONE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4514005be1be6bf27168df39a22fa32d20a02a1","infoHashBuffer":{"type":"Buffer","data":[212,81,64,5,190,27,230,191,39,22,141,243,154,34,250,50,210,10,2,161]},"announce":[],"urlList":[]}}