{"title":"Abused.The.Untold.Story.EN.SUB.HEVC.x265.WEBRIP.[MPup]","uid":14295266,"size":278473397,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d49896637794fb07baa43daece8737588d5d7e23&amp;dn=Abused.The.Untold.Story.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1460443262,"description":"BBC.Documentary.2016.04.11.Abused.The.Untold.Story.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\n[i][color=&quot;blue&quot;]This torrent is HEVC x26[/color][color=&quot;red&quot;]5[/color][/i]\r\n[b][color=&quot;purple&quot;]It is[/color] [color=&quot;orange&quot;][u]NOT[/u][/color] [color=&quot;purple&quot;]a x26[/color][color=&quot;red&quot;]4[/color] [color=&quot;purple&quot;]torrent[/color][/b]\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nLandmark documentary telling the story of those who stood up and broke their silence about sexual abuse, changing Britain forever. This is the definitive account of a national scandal, assembling an unprecedented range of voices, from the survivors and their friends and family to the professionals who led reform of some of the country's biggest institutions. Through candid and revealing testimony, the film not only explores the devastating long-term effects of abuse, it celebrates the extraordinary resilience and spirit of ordinary British people.\r\n\r\nIn 2012 Britain was shaken by horrific revelations of sexual abuse by Jimmy Savile, abuse that had gone unchecked for decades. Thousands of people came forward to talk about their own experiences - many for the first time - and the shocking scale of abuse was revealed. It reached far beyond Savile and into the very heart of British society. Some of those victims speak publicly for the first time about the consequence of abuse in their relationships and in their families.\r\n\r\nAlongside those survivors, this film brings together for the first time the professionals at the very heart of the story: the journalists who met the first victims of Savile to speak publicly, the police commander of Operation Yewtree who would uncover the shocking scale of his crimes, the former director of public prosecution who was forced to accept mistakes made by the CPS and overhaul the way it dealt with abuse cases, and the charities who were overwhelmed by the sheer number of people coming forward.\r\n\r\nThese multiple perspectives build into a gripping account of how secrets and silence took hold of British society but in the end couldn't stand in the way of people's need to tell the truth","torrent":{"xt":"urn:btih:d49896637794fb07baa43daece8737588d5d7e23","amp;dn":"Abused.The.Untold.Story.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d49896637794fb07baa43daece8737588d5d7e23","infoHashBuffer":{"type":"Buffer","data":[212,152,150,99,119,148,251,7,186,164,61,174,206,135,55,88,141,93,126,35]},"announce":[],"urlList":[]}}