{"title":"Horror Manga Pack [scanalated]","uid":8785633,"size":2082702580,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d52edd1bc2ea6223c89afa60415801367efeb3dc&amp;dn=Horror+Manga+Pack+%5Bscanalated%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"horrorhound","files":53,"time":1375825434,"description":"Horror Manga Series Pack\n\n\n\n\n\nKurozuka:\nEscaping from a brother who had just ascended the throne, Kurou Yoshitsune, along with his servant, comes across a house in the middle of a desolate mountain. Oddly enough, only a young woman by the name of Kuromitsu lives there, who seems to possess a very dark and ominous past. \nThey begin a relationship which transcends life and memory. Kurozuka tells the tale of a journey undertaken by immortals, and those who chase after immortality. \nThe majority of this story takes place many centuries in the future, after Kurou has been separated from Kuromitsu. Having lost almost all of his memories, Kurou seeks to understand why he cannot die, to rediscover his identity, and to find the woman that haunts his dreams.\n\n\nKiseijuu aka Parasyte:\nThey arrive in silence and darkness. They descend from the skies. They have a hunger for human flesh. They are everywhere. They are parasites, alien creatures who must invade - and take control of - a human host to survive. And once they have infected their victims, they can assume any deadly form they choose: monsters with giant teeth, winged demons, creatures with blades for hands. But most have chosen to conceal their lethal purpose behind ordinary human faces. So no one knows their secret - except an ordinary high school student. Shin is battling for control of his own body against an alien parasite, but can he find a way to warn humanity of the horrors to come?\n\n\nElfen Lied:\nThe story involves human mutations called &quot;dicloniuses,&quot; who grow horns on their heads and possess telekinetic powers, in the form of invisible &quot;arms&quot; called vectors.\nThe tendency for violence among dicloniuses varies among characters. Certain scientists contain them in a Facility in cells, where they are subject to inhumane experiments to test their abilities or where they await execution for being too dangerous. \nAn infectious virus is also associated with the mutation. This virus is spread through non-lethal contact with the vectors of a diclonius. \nThe main non-mutant character in the story is Kouta, who ends up becoming increasingly involved with these dicloniuses, as they seek refuge from the scientists. \nThe main diclonius character is Lucy/Nyuu, a killer whose alter ego is a hapless and very cute child whose vocabulary and intelligence are quite limited. \nAfter a large amount of choice occurrences, the lives of these two characters become inexplicably intertwined.\n\n\nAnother:\n26 years ago, in a third-year classroom of a middle school, there was a student named Misaki. As an honors student who was also good at sports, the charming girl was popular with her classmates. When she suddenly died, her classmates decided to carry on as if she was still alive until graduation. \nThen, in the spring of 1998, a boy named Kouichi Sakakibara transfers to that classroom, and he grows suspicious of the fearful atmosphere in that classroom. In particular, there is a beautiful, aloof girl named Misaki Mei who wears an eyepatch and is always alone drawing pictures.\n\n\n\nTech/notes:\nFormats are either zip or rar. All are tagged by original scanalators. This is just a pack of horror manga for readers who want it. Seed and enjoy, if this gets seeded a few more packs will be uped.None of these are my scans!\n","torrent":{"xt":"urn:btih:d52edd1bc2ea6223c89afa60415801367efeb3dc","amp;dn":"Horror+Manga+Pack+%5Bscanalated%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d52edd1bc2ea6223c89afa60415801367efeb3dc","infoHashBuffer":{"type":"Buffer","data":[213,46,221,27,194,234,98,35,200,154,250,96,65,88,1,54,126,254,179,220]},"announce":[],"urlList":[]}}