{"title":"Breuer - Hitler's Undercover War - Nazi Espionage Invasion of U","uid":7058652,"size":2019369,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5867bd632062325ffee3f5b8deee95a80745370&amp;dn=Breuer+-+Hitler%5C%27s+Undercover+War+-+Nazi+Espionage+Invasion+of+U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1330215005,"description":"This is William Breuer's shocking book Hitler's Undercover War - The Nazi Espionage Invasion of the USA (1989) which is a remarkable recounting on Nazi espionage efforts in the United States, during, and well before WWII. Soon after Hitler came to power in 1933, his secret service chief, Wilhelm Canaris, launched a large number of undercover agents across the Atlantic. From the very start, modern readers will be amazed at how unsecured American industrial and military sites were at the time. As the author points out, the U.S. in the 1930s was a spy's paradise, a booming industrial giant with hardly any security safeguards in place.  Throughout the book, virtual amateur agents are able to bluff their way onto military bases, aviation plants, and the like, and are able to extract the most detailed information to pass along to Germany. Not until the FBI got fully organized in counterespionage and the U.S. entered the war, were such transparent ploys regularly detected and thwarted. Breuer traces the most effective Nazi agents and the FBI's slow awakening to their threat. The reader is plunged into a world of microdots, invisible ink, incendiary pencils, coded signals to offshore U-boats, bull-necked Nazi supporters, curvaceous blondes, sinister figures with hatbrims pulled low over their eyes, and agents who sing like canaries after they're nabbed. Hitler's Undercover War is a well-researched account of Nazi agents' penetration of military installations, defense plants and high-level government agencies in Washington, and the FBI's delivery of what the author calls the knockout blow. 380 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:d5867bd632062325ffee3f5b8deee95a80745370","amp;dn":"Breuer+-+Hitler%5C%27s+Undercover+War+-+Nazi+Espionage+Invasion+of+U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5867bd632062325ffee3f5b8deee95a80745370","infoHashBuffer":{"type":"Buffer","data":[213,134,123,214,50,6,35,37,255,238,63,91,141,238,233,90,128,116,83,112]},"announce":[],"urlList":[]}}