{"title":"Tropico Mucho Macho Edition","uid":7790068,"size":1374655081,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d6058c9bdb606388106ce15d848c8af9b155180d&amp;dn=Tropico+Mucho+Macho+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ManillaFace","files":1,"time":1351998261,"description":"Just two .iso's. Mount, install, and enjoy!\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nCome to the Caribbean as the dictator of your own tropical island. This bundle contains the original banana republic society simulator Tropico and its expansion package Tropico: Paradise Island.\n\nTropico is a development simulation in which the player becomes the dictator of a small Caribbean island. The only real goal of the game is to stay in power, but the ease of this task is influenced by hundreds of dynamic factors that determine the island's status and the citizen's satisfaction. Unlike classic &quot;sand-box&quot; games such as SimCity or Caesar III, each citizen in Tropico exists as a unique entity, affected by upbringing, education, job, and living conditions. However, unlike the direct interface of a character-based life simulation like The Sims, the Tropico player cannot control these virtual charges directly. The dictator must instead persuade and manipulate the citizens of Tropico into behaving in a particular way.\n\nThe Paradise Island expansion delivers over 20 additional scenarios, as well as new buildings and vehicles to support the military endeavors and tourist trade of the player's island. Additions include army bases and dungeons as well as beach villas and tennis courts. Dictators seeking yanqui dollars will find that new visitor types like &quot;spring breakers&quot; and &quot;eco-tourists&quot; may now be enticed to the player's island paradise, if they can be provided with the particular kinds of rest and relaxation they crave.","torrent":{"xt":"urn:btih:d6058c9bdb606388106ce15d848c8af9b155180d","amp;dn":"Tropico+Mucho+Macho+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6058c9bdb606388106ce15d848c8af9b155180d","infoHashBuffer":{"type":"Buffer","data":[214,5,140,155,219,96,99,136,16,108,225,93,132,140,138,249,177,85,24,13]},"announce":[],"urlList":[]}}