{"title":"Wilko Johnson - Back In The Night - The Best Of","uid":3431645,"size":84544963,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d61c0c545e39ac7abada1f48370186b76eeafdba&amp;dn=Wilko+Johnson+-+Back+In+The+Night+-+The+Best+Of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"stefh","files":20,"time":1137237974,"description":"Best-known as the guitarist in Dr. Feelgood, one of British pub rock's greatest bands, Wilko Johnson went on to a long solo career playing the kind of rootsy, R&amp;B-based rock &amp; roll he loved. Born John Wilkinson (which he inverted to come up with his stage name) in 1947, Johnson grew up in the coastal Canvey Island area, and played around the local music scene during the '60s (often in jug bands). He studied at Newcastle University beginning in 1967, but returned home during breaks to keep up his musical activities. In 1971, after returning from a trip to India, he joined the band that became Dr. Feelgood, and quickly became one of their focal points thanks to his maniacally intense stage presence. Dr. Feelgood played locally for a couple of years and made their debut in London in the summer of 1973; their distinctively scruffy image and menacing energy soon made them a hot commodity on the pub rock circuit. The band released their debut album, Down By the Jetty, in 1975; Johnson stayed for two more studio albums (Malpractice and Sneakin' Suspicion) and the chart-topping live document Stupidity, contributing a number of fine original songs. However, tensions between Johnson and the rest of the group led to his departure toward the end of 1977.\n\n","torrent":{"xt":"urn:btih:d61c0c545e39ac7abada1f48370186b76eeafdba","amp;dn":"Wilko+Johnson+-+Back+In+The+Night+-+The+Best+Of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d61c0c545e39ac7abada1f48370186b76eeafdba","infoHashBuffer":{"type":"Buffer","data":[214,28,12,84,94,57,172,122,186,218,31,72,55,1,134,183,110,234,253,186]},"announce":[],"urlList":[]}}