{"title":"Bloom's Literary Themes Set I","uid":9461974,"size":5938425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6e4940e8562847a8704bd121fa430939bb6636a&amp;dn=+Bloom%27s+Literary+Themes+Set+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1389372232,"description":"About The Series\nCertain great literary themes reappear continually throughout the world's literature and are a major component of today's literature curriculum standards. The Bloom's Literary Themes series examines how these themes function in classic literary works, from the Bible to the novels of Toni Morrison. Some of the approximately 20 essays in each title were written specifically for the series; others are excerpts of important critical analyses published in books or journals. This latest addition to the Bloom's Literary Criticism imprint is the perfect complement to other Bloom's critically acclaimed series, such as Bloom's Guides, Bloom's Modern Critical Views, and Bloom's Modern Critical Interpretations.\n\nEach title features:\n\nOriginal essays and excerpts from published critical analyses that discuss the role of the title theme in various works\nAn index for easy reference\nTwo introductory essays by Harold Bloom.\n\nBloom's Literary Themes: Alienation\nIn literature, the theme of alienation is frequently represented through characters that are psychologically isolated from society. This volume contains 19 essays that explore the role of alienation in such works as The Bell Jar, Waiting for Godot, The Iliad, and many other works.\n\nFeaturing original essays and excerpts from previously published critical analyses, this addition to the Bloom's Literary Themes series gives students valuable insight into the title's subject theme.\n\nBloom's Literary Themes: Civil Disobedience\nThe role of civil disobedience, the act of defying society for the greater good, has been a theme of many famous and often controversial literary works. This volume explores the role of civil disobedience in 1984, Antigone, The Crucible, Fahrenheit 451, the speeches of Malcolm X, and many more works.\n\nFeaturing original essays and excerpts from previously published critical analyses, this addition to the Bloom's Literary Themes series gives students valuable insight into the title's subject theme.\n\nBloom's Literary Themes: Dark Humor\nThe technique of dark humor seeks to create comedy through the use of satirical wit and grotesque situations. This thematic technique can be found in A Clockwork Orange, &quot;A Good Man Is Hard to Find,&quot; A Modest Proposal, &quot;The Love Song of J. Alfred Prufrock,&quot; White Noise, &quot;The Yellow Wallpaper,&quot; and many others, as examined by this new volume.\n\nFeaturing original essays and excerpts from previously published critical analyses, this addition to the Bloom's Literary Themes series gives students valuable insight into the title's subject theme.\n\nBloom's Literary Themes: Death and Dying\nSome of the greatest works of literature have wrestled with the task of illuminating the human experience of death. This new title discusses the role of death and dying in works such as Beloved, A Farewell to Arms, Lord of the Flies, Paradise Lost, and many others. Featuring approximately 20 essays, Death and Dying provides valuable insights on this recurring theme in literature.","torrent":{"xt":"urn:btih:d6e4940e8562847a8704bd121fa430939bb6636a","amp;dn":"+Bloom%27s+Literary+Themes+Set+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6e4940e8562847a8704bd121fa430939bb6636a","infoHashBuffer":{"type":"Buffer","data":[214,228,148,14,133,98,132,122,135,4,189,18,31,164,48,147,155,182,99,106]},"announce":[],"urlList":[]}}