{"title":"The Secret in their Eyes &amp; English subtitles DVDrip and Srt-rucu","uid":5375200,"size":1419787869,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6f9c469596fb00bdd74088aa75e88291c5fcd39&amp;dn=The+Secret+in+their+Eyes+%26+English+subtitles+DVDrip+and+Srt-rucu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"emirturco","files":-1,"time":1266552911,"description":"The Secret in Their Eyes\nSpanish original name: El Secreto de sus ojos (2009)\n\nReal DVDrip by rucucu from the official DVD. and English Subs.\nDVDrip from the official DVD and English Subtitles extracted from the official DVD and corrected and sycronized better by rucucu\nSpanish language\nEnglish subtitles SRT\nVideo.avi\n\n\n\n\nVideo:\n(Frames 720 x 320; 23,976 fps)\nLeght 180,120 frames ( 2:05:12.50)\nFour Cc code: fourCC: Xvid\nXvid-MPEG-4\nDecompressor: Xvid MPEG-4 Codec\n\nAudio Stream:\nSampling rate: 48000 hz\nChannles: 2 Stereo\nAudio tag: tag: 0x0055, ACM Decodable MPEG-1 Layer 3 (MP3)\nFraunhofer 115 MPEG layer 3 Codec\n128 KBps\n02,05,12\n\n\nIMDB: 8,5 4034 votes\n\nNominated for Oscar Best Foreign Language Film: \n\nEl Secreto de Sus Ojos (Argentina) \n. Another 14 wins &amp; 10 nominations \n\nThe film made by Juan Jose Campanella, won tonight the Goya award for best foreign movie, and the actress Soledad Villamil was rewarded for her performance as the revelation actress.\n\n\nEl secreto de sus ojos (2009) \n\nPlot:\nA man wants to solve a murder committed 30 years ago.\n\nUser Reviews from IMDB:\n\n\nAuthor: monty_lnct from India\n\nOne of the most perfect movie i have ever seen.This type of movie come once in a while,and remains with you for a long time.\n\nThe best thing of the movie is cinematography that makes movie so beautiful.They use camera so well and scenes are shot so beautifully especially soccer match scene.They give a very realistic feel to movie. the scene of the crime is shown very realistic.\n\nGreat acting by all the actors.all characters are very well portrait by actors.\n\nThe story of the movie is so emotional and deeply involving and have very well written dialogues. this movie kept me so engaged with all the perfect twists and pace. this movie have everything crime,romance,drama,thriller and have some moments that makes you laugh.\n\nDirection of the movie is flawless,this movie is almost perfect in all the departments.I hardly found any mistake in the movie.\n\nThis movie deserves at least three Oscar nomination this year for screenplay ,cinematography and best movie in foreign language.\n\nThis movie is a masterpiece and will be remembered among greatest movies ever made(at least by me).\n\nI give this movie 10/10 \n\n\nAuthor: l_JohnOwens_l from Boston\nRating: 10/10\n\n&quot;El Secreto de sus Ojos&quot; hit me with unspeakable strength. I didn't expect to like it so much, so I owe a review to those in analysis measures before seeing it or those interested in some opinion.\n\nFirst off, Campanella works with flawless effort all of the technical aspects of the film. It even starts with a double exposure effect, mixed with some sad shots of a beautiful Buenos Aires that hints the spectacle ahead of us. One shot especially, from a chopper in a soccer field edited with a crane shot is breathtaking. Nothing to envy from Hollywood upper class.\n\nBut the main strength of the movie comes from the powerful narrative dominion Director Campanella has over characters, spaces and silences. Many moments are coldly tense, scary and very, very intense. This crossover from genres by Campanella couldn't have been better. Crime stories often fall in common places, this one relies on the fragile psychological state of the audience to draw all of it's intense dialog, acting and scenes.\n\nI cannot stop recommending it, Argentina can open it's market with movies such as this. It has many, many memorable moments, it interwines comedy perfectly and it is doubtful you will instantly forget it, as it is so well constructed. See it if you can! \n\nENJOY AND COMMENT.\n","torrent":{"xt":"urn:btih:d6f9c469596fb00bdd74088aa75e88291c5fcd39","amp;dn":"The+Secret+in+their+Eyes+%26+English+subtitles+DVDrip+and+Srt-rucu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6f9c469596fb00bdd74088aa75e88291c5fcd39","infoHashBuffer":{"type":"Buffer","data":[214,249,196,105,89,111,176,11,221,116,8,138,167,94,136,41,28,95,205,57]},"announce":[],"urlList":[]}}