{"title":"Dean Motter + Michael Lark: Batman - Nine Lives (DC)","uid":8576476,"size":29575293,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d7663f0144b4b69ef766277a079c738cb37399c3&amp;dn=Dean+Motter+%2B+Michael+Lark%3A+Batman+-+Nine+Lives+%28DC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fudoh101","files":1,"time":1371290695,"description":"Written by Dean Motter\nArt by Michael Lark\nPaperback: 126 pages\nPublisher: DC Comics (2003)\nLanguage: English\n\nNine Lives differs from the normal Batman canon because it is set in the 1940s at a time when Gotham City is rife with organized crime. Rather than being a superhero story, it more closely resembles a detective comic book from the same era, before the idea of superheroes had been introduced. Though Batman still exists, members of his rogues gallery appear as normal criminals rather than mutated, disfigured or technologically enhanced characters, a similar approach to that of Christopher Nolan's Batman film series. Part of the story's appeal is its clever use of creating more human identities for supervillains such as Joker, Penguin, and Two-Face.\nThe story begins with noirish narration, following the Batman down a sewer in search of a crocodile. Upon finding and wrestling the animal he is hit on the head by a mysterious assailant. When he awakens, he is lying next to the body of Selina Kyle (Catwoman in the normal canon).\nOnce the body is discovered, Private Detective Dick Grayson (Robin) is accused by Commissioner Gordon of having something to do with the murder. As the story progresses we find out that Selina Kyle earned the nickname of Catwoman because she owned the Kit Kat Club (a place of ill repute). She used her sexual allure to keep the club from going under financially, but she later resorted to blackmail, because she knew the secrets of many of Gotham's most wanted criminals.","torrent":{"xt":"urn:btih:d7663f0144b4b69ef766277a079c738cb37399c3","amp;dn":"Dean+Motter+%2B+Michael+Lark%3A+Batman+-+Nine+Lives+%28DC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7663f0144b4b69ef766277a079c738cb37399c3","infoHashBuffer":{"type":"Buffer","data":[215,102,63,1,68,180,182,158,247,102,39,122,7,156,115,140,179,115,153,195]},"announce":[],"urlList":[]}}