{"title":"Eric Clapton The Best Of - 20th Century Masters","uid":3723222,"size":74253161,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d77e1cec791bdf556a0dff1d6bd4a746dc77afc8&amp;dn=Eric+Clapton+The+Best+Of+-+20th+Century+Masters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ekolb","files":13,"time":1182729779,"description":"Eric Patrick Clapton CBE (born 30 March 1945), nicknamed &quot;Slowhand&quot;, is a Grammy Award winning English guitarist, singer and composer, who is one of the most successful musicians of the 20th century, garnering an unprecedented three inductions into the Rock and Roll Hall of Fame. Often viewed as one of the greatest guitarists of all time among critics and fans alike, Eric Clapton  was ranked 4th in Rolling Stone?s list of The Greatest Guitarists of All Time and #53 on their list of the The Immortals: 100 Greatest Artists of All Time. Although Clapton&amp;#039;s musical style has varied throughout his career, it has always remained rooted in the blues. Clapton is credited as an innovator in several phases of his career, which have included blues-rock (with John Mayall &amp; the Bluesbreakers and The Yardbirds) and psychedelic rock (with Cream). Clapton has also achieved great chart success in genres ranging from Delta blues (Me and Mr. Johnson) to pop (&quot;Change the World&quot;) and reggae (&quot;I Shot the Sheriff&quot;). Clapton also achieved fame with Derek and the Dominos with the song &quot;Layla&quot;.\n\nPersonnel include: Eric Clapton (vocals, guitar); George Terry (vocals, guitar); Bobby Whitlock (vocals, piano, organ); Rita Coolidge, Yvonne Elliman, Marcy Levy (vocals); Duane Allman (guitar); Albhy Galuten (piano); Dick Simms (keyboards); Carl Radle (bass guitar); Jamie Oldaker, Jim Gordon (drums); Derek &amp; The Dominos. Liner Note Author: Scott Schinder. Recording information: 1970 - 1977. This 20TH CENTURY MASTERS collection culls Eric Clapton&amp;#039;s biggest hits from three extremely successful 1970s solo releases--his self-titled debut, 461 OCEAN BOULEVARD, and SLOWHAND. The breezy melancholy of &quot;Promises,&quot; from &amp;#039;78s BACKLESS, and two cuts from LAYLA AND OTHER ASSORTED LOVE SONGS (recorded with Clapton&amp;#039;s short-lived group Derek &amp; the Dominos), including the epic &quot;Layla,&quot; round out the set. Clapton&amp;#039;s readings of two J.J. Cale songs, the creepy rocker &quot;Cocaine&quot; and the celebratory foot-stomper &quot;After Midnight,&quot; are definitive FM fare, as is the smooth and easy, country-inflected &quot;Lay Down Sally,&quot; complete with its irresistible, honky-tonk guitar lick. Treatments of Bob Dylan&amp;#039;s &quot;Knockin&amp;#039; on Heaven&amp;#039;s Door&quot; and Bob Marley&amp;#039;s &quot;I Shot the Sheriff&quot; reinforce Clapton&amp;#039;s penchant for faithful, heartfelt covers accented by his understated singing and matchless, fluid guitar work. Appearances by Leon Russell, Stephen Stills, and Rita Coolidge boost the already top-notch caliber of musicianship here. While classic-rock completists will want to own the individual records these singles appeared on, this BEST OF provides a concise roundup of the guitar legend&amp;#039;s key &amp;#039;70s studio performances.\n\n20th Century Masters: The Millennium Collection: The Best Of Eric Clapton CD\n\nCategory Rock/Pop, Rock \nLabel Polydor \nOrig Year 2004 \nDiscs 1 \nStreet Date Jun 15, 2004 \nStudio/Live Studio \nMono/Stereo Stereo \nProducer Tom Dowd; Delaney Bramlett; Albhy Galuten; Bill Levenson (Compilation) \n\n\nTrack Listing  \n  1. I Shot The Sheriff \n  2. After Midnight \n  3. Knockin&amp;#039; On Heaven&amp;#039;s Door \n  4. Wonderful Tonight \n  5. Layla \n  6. Cocaine \n  7. Lay Down Sally \n  8. Bell Bottom Blues \n  9. Promises \n  10. Let It Rain \n  11. Let It Grow \n\nEnjoy! and please seed..\nEkolb","torrent":{"xt":"urn:btih:d77e1cec791bdf556a0dff1d6bd4a746dc77afc8","amp;dn":"Eric+Clapton+The+Best+Of+-+20th+Century+Masters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d77e1cec791bdf556a0dff1d6bd4a746dc77afc8","infoHashBuffer":{"type":"Buffer","data":[215,126,28,236,121,27,223,85,106,13,255,29,107,212,167,70,220,119,175,200]},"announce":[],"urlList":[]}}