{"title":"Calibre 1.42","uid":10444788,"size":56086016,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d7ce54b3b93e26d6afafa05a81920cdec18119b2&amp;dn=Calibre+1.42&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"The_Doctor-","files":1,"time":1403936735,"description":"Version 1.42 of Calibre licensed under the GNU GPL v.3 for Windows XP, Windows Vista, Windows 7, and Windows 8.\n\nCalibre is a free and open source e-book library management application developed by users of e-books for users of e-books.\n\n\nChanges in 1.42\n\n    New Features\n    Edit Book: new tool to easily add a cover to the book. It automatically generates the HTML wrapper and takes care of marking the covers files as covers in the OPF.\n    Edit Book: Improve the performance of inline spell checking, especially noticeable when editing large HTML files (over 100KB in size).\n    Edit Book: Run syntax highlighting in the background, reducing user interface latency when editing large files\n    Template language: Add a new function (group_re) to use grouping regular expressions with groups, where you can replace the matched groups with result of another template.\n    Edit Book: Check Book: Add a check for HTML files with non UTF-8 encoding declarations\n    Edit Book: Spell check dialog: Add an option to make filtering the word list case sensitive\n    \nBug Fixes\n    Get Books: Fix integration with ebook.de broken by website changes\n    MOBI Input: Preserve the dc:rights metadata during conversion.\n    Edit Book: Fix non-BMP unicode characters causing matching tag highlighting to be slightly off on linux\n    Edit Book: When editing HTML files that have charset encoding declarations, automatically change the declared encoding (if any) to UTF-8 on save, since the editor always saves files in the UTF-8 encoding.\n    Edit Book: Fix various problems when editing EPUB files with non-ascii internal filenames on OS X.\n    Edit Book: Remove unused CSS: Fix an error if an HTML file links to a missing stylesheet\n    Economic and Political Weekly by Krittika Goyal\n\nImproved news sources\n    Deadspin","torrent":{"xt":"urn:btih:d7ce54b3b93e26d6afafa05a81920cdec18119b2","amp;dn":"Calibre+1.42","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7ce54b3b93e26d6afafa05a81920cdec18119b2","infoHashBuffer":{"type":"Buffer","data":[215,206,84,179,185,62,38,214,175,175,160,90,129,146,12,222,193,129,25,178]},"announce":[],"urlList":[]}}