{"title":"Tuxedomoon - Cabin In The Sky[FLAC - LOSSLESS]","uid":4329969,"size":344946295,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d81d1c0c66b4994fcacd03994e9680013912ffdd&amp;dn=Tuxedomoon+-+Cabin+In+The+Sky%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"99AM","files":16,"time":1217984806,"description":"FLAC files + CUE sheet\nRelease date: July 20, 2004\n\n\nTrack Listing:\n1. A Home Away\n2. Baron Brown\n3. Annuncialto\n4. Diario Di Un Egoista\n5. La Piu Bella\n6. Cagli Five-0\n7. Here&amp;#039;Til X-Mas\n8. Chinese Mike\n9. La Piu Bella Reprise\n10. The Island\n11. Misty Blue\n12. Luther Blisset\n13. Annuncialto Redux\n\n\nTuxedomoon formed in San Francisco In 1977 by Blaine Reininger and Steven Brown. Each founder was studying electronic music at San Francisco City College. Brown and Reininger each were electronic keyboardists. Brown played a multitude of other instruments and Reininger played violin, a distinct sound in the catalog of Tuxedomoon. Brown was connected to the S.F. theatre scene which supplied equipment and assistance from local singers, musicians like Victoria Lowe and the soon to be official vocalist Winston Tong. Tong&amp;#039;s background was in performance art and he floated in and out of the band. Later, after releasing their first EP, No Tears, and an array of tarnsitioning members, Peter Principle became a permanent member of the band. Their original singer Victoria Lowe was gone before her vocal performance was released on No Tears.\n\nIn 1979 Tuxedomoon signed with The Residents&amp;#039; Ralph label. A label with an international following and reputation for handling experimental artists, Tuxedomoon attracted more European attention with their sound that mixed live theatrics and performance with experimental Jazz with soundscapes, European lounge standards and the outer periphery of pop music. After the1980 LP entitled, Half Mute, the band made a tour of Europe and came back to the states with Tong&amp;#039;s friend and artist/filmaker Bruce Geduldig. In 1981 the band released Desire and the band moved to Rotterdam, The Netherlands.\n\nWhile in Rotterdam, Reininger began to work on solo projects and later the band Divine and Statton. Alison Statton, of Young Marble Giants fame, was the vocalist. The band composed the score for a ballet by Maurice Bejart that was released as an album called, Divine. In 1983, Reininger left the band permanently. Tuxedomoon was then joined by the horn player Luc Van Lieshout of Belgium&amp;#039;s Flat Earth Society. The members still continued to work on solo and side projects and eventually released their most known work together, the 1985 LP, Holy Wars.\n\nCabin In the Sky reunites the stalwarts of Tuxedomoon, sans Winston Tong. Brown, Principle, Reininger, Van Lieshout and Gedulig have regrouped to produce the first new work from Tuxedomoon in almost 20 years. The band is joined by varied collaborators such as\n\n* John McEntire (Tortoise and Thrill Jockey Records)\n* Tarwater (German Elecronic Instrumentalists)\n* Marc Colin (Nouvelle Vague who covered Tuxedomoon&amp;#039;s, In A Manner of Speaking)\n* DJ Hell (German Mixmaster and ran International DeeJay Gigolo)\n* Aksak Maboul (Eclectic Crammed Disc label mate).\n\nThe CD is a three-fold digipak that has slick graphics of fuzzy photos. The information given is directed at the artists and the production team and track list.\n\nThe CD starts off with the reminiscent sound of Tuxedomoon. Deep bass that is atmospheric and funky. Metallic and distorted guitar melds with trumpet and horns. Minimal and dark in it&amp;#039;s approach and a fine intro-tune with the distinct vocalization of their early records. Adding in some keyboards the arrangement is tight and complex despite its simplicity that allows for space between the instrumentation that is nice combination of distinct parts.\n\nBaron Brown is a sentimental theatrics that jazz infused and cinematic. Brown and Reininger combine their voacls. It hints at The Residents but with more beauty than the oddness of The Residents. Violin adds drama and beauty while a clicking and slightly primal bass pushes the song along. Accordian and piano segments add texture and interest that ends with a segment of that harkens old war marches. Again the group beautifully fuses disparate instrumentation to make a simple and detailed composition.\n\n\n\nThird on Cabin is Annucialto. It is a gliding keyboard base that adds piano and harmonica with atmosphere and aplomb. It is has a beauty that contains an underlying terror. Another beautiful arrangement that has a slight &quot;old west&quot; feel that merges to jazz. Again there is a cinematic feel that soundtracks an unknown visual. Simple clarinet fuses the whole piece and leads to its end.\n\nStarting out with a bit of an industrial feel Diario Di Un Egoista is a soothing song with edgy elements. Combining percussive accoutrements and &quot;hot horn&quot; leads with a tragic and swashing brass horn section the song is also and intricate weave of eclectic sources. Although it is cohesive it never dedicates itself to one particular approach. Textural and deep the sound is once again cinematic. Egoista then leads to the one- minute field recording titled La Piu Bella. If you know Italian you will benefit.\n\nAfter the field-recorded soundscape the album flawlessly transitions into the sweet sounds of Cagli Five-O. Cool jazz trumpet flits and flights through a lovely simple arrangement of piano, horns, guitar and bass. Romantic and theatrical the sound is laidback and dreamy but begins to separate to a slightly more disruptive and ominous sound while never losing the prevailing prettiness. Easing into the mix is found sounds as the song begins to swerve but never loses the composure that is the center of this intelligent and darkly beautiful instrumental track.\n\nHere &amp;#039;Til X-Mas is suave with a core of ambient nerve. Horns and vocals combine with flaring tremulous strings. The song has a cabaret quality with clip-clop percussion, whistling and vocal storytelling style with a Tom Waits swagger. Chinese Mike starts with a hard beat of Euro-Disco but settles to be more like X-Mas. The sound is again theatric with German and Eastern European cabaret horns and tales. Chinese Mike takes a drastic left turn and slows to a more ambient and atmospheric sound collage. The influence of the collaborative artists is most evident in this track. Tuxedomoon is channeled through DJ Hell, and Tarwater. As it drifts away the song breaks down and dissipates in to the ethereal and lovely La Piu Bella Reprise. These three songs are a truly amazing set of polymorphous beauty.\n\nThe Island is another song that seems geared to a soundtrack to a visual that is created by each individual that hears it. Starting with ocean waves the song has a slight Polynesian feel. The quite beauty is challenged by patched synthesizer sound wave patterns. Like so many other songs on this reunion release the beauty is always challenged by a nervy mysteriousness that keeps the music from steering into sappy sentimentality.\n\nMisty Blue is another complex arrangement that has a simple core. This track is a very loungey offering that contains a primal tip-tap electric percussive sound that smolders and dances like island natives around a raging fire while Reninger deftly keeps the smooth, lounge delivery.\n\nThe last original track is Luther Blisset. With a Latin flavor Tuxedomoon&amp;#039;s eccentric combinations of styles it clashes to a heavy metal guitar. But they know just when to let it go. As with all other tracks on the CD, Luther Blisset has the quality of unnerving the listener but allowing the true beauty to bring you back into the real intrigue of the song. The intrigue comes from the beatiful core that is central to the tracks on the CD.\n\nThe final cut is the lush and beautiful Annuncialto Redux and is a fantastic end to a beautiful voyage. The sound is much like McEntire&amp;#039;s Tortoise or Tarwater&amp;#039;s Ronald Lippok&amp;#039;s side project, To Rococco Rot. The sounds are melodic. The nervous edge is missing. The sound is collaged which gives a freeform feel that is highly planned and retains improvisational qualities. It is a very sweet ending.\n\nOne is left wondering why Winston Tong was not part of the reunion? Not for one moment did I think that the album would be better or required Tong&amp;#039;s participation. With the revolving order of members of Tuxdomoon here you get the loyalist members who made up the main thread holding together this group of transient artists. I am glad to have them back. Now that their earlier influence has been reinterpreted the time is right for the acceptance that eluded them in the old days. Perhaps today&amp;#039;s listeners are less frightened and more adapted to the experiments in sound that Tuxedomoon has been famous for over 20 years.\n\nTuxedomoon is back with a modernized and aged sound that is both a nostalgic listen and very present in experimental traditions of today. In their origination Tuxedomoon broke new ground as an artistic, experimental, post-punk band of many influences. Some may see the collaborations as a drawback but they are kindred-spirit guides that have aided their inspirational elders in freshening up their sound while still being who they are, a band with a cinemascopic sound that is rife with imagery and eccentric, international influences.\n\n(Review by James F. Kraus from Gullbuy.com)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:d81d1c0c66b4994fcacd03994e9680013912ffdd","amp;dn":"Tuxedomoon+-+Cabin+In+The+Sky%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81d1c0c66b4994fcacd03994e9680013912ffdd","infoHashBuffer":{"type":"Buffer","data":[216,29,28,12,102,180,153,79,202,205,3,153,78,150,128,1,57,18,255,221]},"announce":[],"urlList":[]}}