{"title":"Hell on Wheels - Season 1 - Episodes 1 thru 10","uid":13553137,"size":5975267621,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d829e3499935b557c8a7507a68653bd927c8eaa9&amp;dn=Hell+on+Wheels+-+Season+1+-+Episodes+1+thru+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"POtHS11","files":16,"time":1455572742,"description":"Hell on Wheels - Season 1 - Episodes 1 thru 10\r\n\r\n\r\nDark, dirty, crude, and totally awesome\r\n\r\nAuthor: ScreenplaySteve from United States\r\n\r\n16 January 2012\r\n\r\n\r\n\r\nThis show has it all- two hard-as-nails, but flawed protagonists, sleazy politicians, a slick railroad tycoon staying one step ahead of the legalities, grit, sex, humor, and of course, the Fair Haired Maiden of the West. The characters are deep and intense, although occasionally caricatured to the point of cartoonish. Their is something of a realism to their good-bad pendulum: the good guys are mostly good, but show some real bad, too. The bad guys are cursed with feelings and emotions that are sometimes fragile. They elicit something close to sympathy.\r\n\r\nIf you like action, this show has more than most. Shooting, killing, hard-working, rough and tumble action that keeps you riveted and keeps the show fresh. It even has a guy who gets shot point blank in the mouth and lives.\r\n\r\nThe storyline is itself relatively simple. Good guy out for revenge for the murder of his wife and son. The acting is generally decent, certainly not Shakespearean, but with heart and charm. It's the portrayal of the characters that really keeps the show pumping.\r\n\r\nBy the way, did I mention sex? Not graphic, but pervasive. Prostitutes here, prostitutes their, prostitutes everywhere. You will definitely hear your share of grunts and howls. Is it possible to show whores groveling with the johns in the mud, but in a tasteful, non-slutty sort-of way? I think they achieved just that.\r\n\r\nIn all, Hell On Wheels is a slick, witty, well crafted yarn, edgy enough for our modern times, but rooted in enough historical interest for lovers of westerns","torrent":{"xt":"urn:btih:d829e3499935b557c8a7507a68653bd927c8eaa9","amp;dn":"Hell+on+Wheels+-+Season+1+-+Episodes+1+thru+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d829e3499935b557c8a7507a68653bd927c8eaa9","infoHashBuffer":{"type":"Buffer","data":[216,41,227,73,153,53,181,87,200,167,80,122,104,101,59,217,39,200,234,169]},"announce":[],"urlList":[]}}