{"title":"The Judas Curse Series by Angella Graff","uid":15537641,"size":4303377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8fe33e0cdc6a2c1e1f934703ffd4dad79554409&amp;dn=The+Judas+Curse+Series+by+Angella+Graff&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"steve-kon","files":1,"time":1470896730,"description":"The Judas Curse Series by Angella Graff\r\n\r\nFormat: EPUB, AZW3\r\n\r\n1. The Awakening: The Awakening is a tale of immortals, ancient gods, and a Detective who doesn’t believe in any of it. Detective Ben Stanford is forced to come face to face with theology, mythos and everything he refused to believe in as his world is turned upside down by Mark, the immortal Gospel writer, who requests the detective’s help in finding his missing companion, Judas Iscariot.\r\n\r\nAs Ben dives deeper into the world of broken Theology, ancient religions and terrifying Greek gods, he’s forced to come to terms with the world where vast forces struggle in their endless game of power. He must make his way, with the help of companions he doesn’t believe in or trust, to try and stop a potential global disaster.\r\n\r\n2. The Judas Kiss: In the next Installment of The Judas Curse, Detective Ben Stanford is ready to put the past at rest. Without warning, he’s pulled down once again into the chaos of gods, theology, and mystery. Told that his sister is alive and the two immortals, Mark and Judas, have been kidnapped by the treacherous goddess, Nike, Ben must find a way to rescue the pair before she can harness their powers.\r\n\r\nWhile Mark waits alone, forced to write out the story of how their powers came to be, and Judas lay tortured by the angry Goddess, a reluctant Ben must enlist the help of a hesitant being from the ancient Norse Pantheon.\r\n\r\nTime is ticking, and the hard-headed detective must use everything he learned in the past to prevent another disaster, which could potentially wipe-out the human race.\r\n\r\n3. Cry, Nike!: With Nike's power at her weakest, Detective Ben Stanford must band together with immortals Mark and Judas, and the Norse gods Thor and Heimdall, and form a plan to take her down for good.\r\n\r\nDiscovering a traitor in their midst, Ben forms a treaty with an unlikely source. Another breed of supernatural being appears, and another villain, who is willing to do everything he can to stop the group from taking the goddess down.\r\n\r\nAs the group moves forward with their plans, Ben discovers a new power, new friendships, and learns to make true sacrifices to save himself, his friends, and ultimately humanity.\r\n\r\n4.The Empty Vessel:Benjamin Stanford has had enough. Leaving the world of the supernatural behind, Ben desperately tries to find his place back in the real world.\r\n\r\nThe supernatural world, however, has other ideas. Dealing with a string of random suicides, Ben knows the insane god, Apollo, is behind it. Reluctantly teaming up with Hades and Jude, Ben goes on a journey to try and find a solution to an unkillable god.\r\n\r\nKnowing Ben is on the case, Mark and Alex make their way to Europe with a plan of their own. Something has to be done about the portals, and Alex thinks he has the answer. But it comes at a price, a price Mark may not be willing to pay.\r\n\r\nWill the detective and his Devil companion manage to find a solution and keep Jude safe? And will Mark be willing to compromise everything he believes in if it will save the world? \r\n\r\n5.The Rise of Apollo:In the final installment of the Judas Curse series, Ben Stanford leads the charge against Apollo. With the winged god’s powers rising, a new threat forms on the horizon. Secrets are revealed, and alliances will be formed to help Ben on the path to defeating Apollo.\r\n\r\nBen must use what he can to discover the source of his power and his purpose if he’s going to have a hope in saving humanity from immortal monsters. But most importantly, Ben must decide whether or not humanity is worth saving in the end","torrent":{"xt":"urn:btih:d8fe33e0cdc6a2c1e1f934703ffd4dad79554409","amp;dn":"The+Judas+Curse+Series+by+Angella+Graff","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8fe33e0cdc6a2c1e1f934703ffd4dad79554409","infoHashBuffer":{"type":"Buffer","data":[216,254,51,224,205,198,162,193,225,249,52,112,63,253,77,173,121,85,68,9]},"announce":[],"urlList":[]}}