{"title":"Mike + the Mechanics - The Living Years [FLAC+MP3](Big Papi)","uid":9905396,"size":406966623,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d9244678845be9cba8bd356fb2b4a060bff9e2d0&amp;dn=Mike+%2B+the+Mechanics+-+The+Living+Years+%5BFLAC%2BMP3%5D%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1396824194,"description":"Source: Atlantic 7 81923-2 CD 1988\n\nIf you love this group there is also a 25th Anniversary version of this release by another pirate.  This download is a CDrip from the original 1988 release.\n\n- Big Papi\n\n\n\nBy L.A. Scene\n \nA trend that emerged in the mid 1980s was the emergence of the Supergroup. The term Supergroup refers to a group that is formed by multiple members that have achieved success in other groups. Probably the most popular of the Supergroups was The Power Station (Robert Palmer, Tony Thompson of Chic, John and Andy Taylor of Duran Duran). Other examples included Asia and the Traveling Wilburys. However for all practical purposes, it was The Power Station that put the term Supergroup on the map. Supergroups are formed for many reasons: Supergroups such as The Power Station and The Traveling Wilburys were basically formed to be (originally) one time efforts. Other groups such as Asia were formed following the demise of other bands. And yet others are formed as &quot;side projects&quot;. Some people tend to forget when it comes to Mike + The Mechanics that they are a Supergroup. The band was formed as a side project by Genesis Guitar and Bass player Mike Rutherford. This side project would lead to commercial and critical success. Mike + The Mechanics first album, the self-titled album &quot;Mike + The Mechanics&quot; would have some commercial success - including three Top 40 hits. While some thought that Mike + The Mechanics would be a one-time effort, the success of that debut album would lead to a follow-up album called &quot;Living Years&quot;. While it is the title track, &quot;The Living Years&quot; that garnered song of the year consideration, this is a solid album top to bottom. This album gets my pick for 1989's co-Album of the Year (the other album was Tears For Fears' &quot;The Seeds of Love&quot;)\n\nThe same band lineup returns for Mike + The Mechanics' second album. This includes the co-lead vocalists of Paul Carrack (formerly of Squeeze) and Paul Young (formerly of Sad Cafe), Keyboard player Adrian Lee, Drummer Peter Van Hooke, and of course, Mike Rutherford himself on Guitar and Bass. Christopher Neil returns again to co-produce the album with Rutherford. Once again Neil hits pay dirt with alternating Young and Carrack's lead vocals - as he did on the debut album. In addition, there is an even stronger portfolio of songs for &quot;Living Years&quot;. B.A. Robertson and Neil once again team up with Rutherford on songwriting chores. In addition Paul Young has some songwriting contributions. While the first album had more of a classic rock feel, this album seems to strike a balance between Adult-Contemporary with some harder edged Rock.\n\nAs for the lead vocals, the rule of thumb for the first album was that Carrack delivered the intense vocals while Young focused on the passionate vocals. On &quot;Living Years&quot;, this rule of thumb continues. In addition Carrack focuses on the softer songs while Young takes up the harder edged tracks. Here is a song by song review:\n\n&quot;Nobody's Perfect&quot;: has a bit of a harder edge to it. Young delivers trademark passionate vocals. This song deals with a fact of human nature that people are not going to be perfect during their life on earth.\n\n&quot;The Living Years&quot;: This is the well-documented tribute to Rutherford's father. Carrack delivers the intense vocals in this tribute. Often overlooked on this song is the King's House School Choir on the chorus. The lyric, &quot;you can listen as well as you hear&quot; is a simple one, yet one of the great pearls of wisdom that applies to everyday life.\n\n&quot;Seeing is Believing&quot;: Another harder edged song and Young comes across with some very intense vocals. The song deals with someone believing everything that is put before him. This was an underrated song.\n\n&quot;Nobody Knows&quot;: This might be the best track of the collection. This is one of those songs that completely blows you away. It's Carrack on vocals this time and the intensity is high. More of an Adult-Contemporary song, this song is a passionate reflection on what has gone wrong in a relationship.\n\n&quot;Poor Boy Down&quot;: Young delivers perhaps his most passionate vocals on any &quot;Mechanics&quot; album. The deals with someone who faces adversity, but never quits and keeps coming back.\n\n&quot;Blame&quot;: Young continues the passionate vocals on a another harder edged song. This song has a feel like the first Mechanics' album.\n\n&quot;Don't&quot;: Although there are no bad tracks on this album, this is one of the weaker tracks. This deals with a man looking to open a heart to a woman as opposed to just a physical relationship - yet he seems stymied by the woman.\n\n&quot;Black and Blue&quot;: Young delivers very passionate vocals on the track that has the &quot;Genesis&quot; influence. This song features a riff played by Rutherford and Phil Collins. It also was recorded by Tony Banks.\n\n&quot;Beautiful Day&quot;: This song is also right up there with the best of any Mechanics' songs. This song deals with the positives that a relationship can produce. There is a terrific guitar solo by Rutherford in this song. Young's vocals are outstanding, but there are some nice background vocals that compliment him.\n\n&quot;Why Me?&quot;: This song is almost the polar opposite of &quot;Beautiful Day&quot;. It is a very intense (and dark) song and Paul Carrack does a great job at delivering that intensity. This song could have a lot of interpretations, but I think it deals with someone fighting for a cause. The ending that says &quot;Now you may try to break my body; Lock me up and throw away the key; But you'll never, never break my sprit; I'm Free!&quot; really sums it up the story.\n\nThe liner notes include the lyrics for all of the songs. While Mike + The Mechanics didn't maintain their commercial success throughout the 90s, they have managed to keep this side project going for nearly two decades. Overall, this is one of the great albums of the 1980s. It clearly has more than just the well-known title track. Whether you are a Genesis fan, 80s fan, or just a music fan - this album has a lot to offer. Highly recommended.\n\n\nimage\n\n---------------------------------------------------------------------\nMike + the Mechanics - The Living Years\n---------------------------------------------------------------------\n\nArtist...............: Mike + the Mechanics\nAlbum................: The Living Years\nGenre................: Pop/Rock\nSource...............: CD\nYear.................: 1988\n\nFLAC\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 63 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 264kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Mike + the Mechanics - Nobody's Perfect [04:48]\n2. Mike + the Mechanics - The Living Years [05:32]\n3. Mike + the Mechanics - Seeing Is Believing [03:13]\n4. Mike + the Mechanics - Nobody Knows [04:23]\n5. Mike + the Mechanics - Poor Boy Down [04:33]\n6. Mike + the Mechanics - Blame [05:23]\n7. Mike + the Mechanics - Don't [05:45]\n8. Mike + the Mechanics - Black &amp; Blue [03:27]\n9. Mike + the Mechanics - Beautiful Day [03:38]\n10. Mike + the Mechanics - Why Me? [06:25]\n\nPlaying Time.........: 47:11","torrent":{"xt":"urn:btih:d9244678845be9cba8bd356fb2b4a060bff9e2d0","amp;dn":"Mike+%2B+the+Mechanics+-+The+Living+Years+%5BFLAC%2BMP3%5D%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9244678845be9cba8bd356fb2b4a060bff9e2d0","infoHashBuffer":{"type":"Buffer","data":[217,36,70,120,132,91,233,203,168,189,53,111,178,180,160,96,191,249,226,208]},"announce":[],"urlList":[]}}