{"title":"The Basics Of Digital Privacy - Simple Tools To Protect Your Per","uid":9568232,"size":8563752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d92c9976e8247298ecf902a3697087cba3cdd3ed&amp;dn=The+Basics+Of+Digital+Privacy+-+Simple+Tools+To+Protect+Your+Per&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"GoonerTPB","files":3,"time":1391562900,"description":"The Basics of Digital Privacy: Simple Tools to Protect Your Personal Information and Your Identity Online by Denny Cherry\n\n\nFormat: mobi/epub/azw3\nLength: 152 pages\nGenre: Non-Fiction/Computers &amp; Technology\nDate: 31 December 2013\n\nWho's watching you online? These days, it's hard to be sure. But the recent Edward Snowden revelations of NSA data mining and the constant threat of identity theft from criminals mean your privacy is in jeopardy.\n\nThe Basics of Digital Privacy teaches you how to protect the privacy of your data and your identity while surfing, searching, and interacting with others in a virtual world. Author Denny Cherry teaches professionals how to keep huge databases secure, and he will introduce you to the basic concepts of protecting your identity, your financial data, and your personal information from prying eyes while using your computer and smartphone. You'll learn how to stay connected and conduct business online, while protecting your privacy with every keystroke and click.\n\nIt gives you clear, non-technical explanations of how to safely store personal information online, create secure usernames and passwords for websites, and participate in social media without compromising your privacy. Learn how to find out who's watching you online, and what the law has to say about your privacy rights. A great resource for anyone who ventures into the online world on a daily basis!\n\nAuthor:\n\nDenny Cherry is the owner and principal consultant for Denny Cherry &amp; Associates Consulting and has over a decade of experience working with platforms such as Microsoft SQL Server, Hyper-V, vSphere and Enterprise Storage solutions. Denny's areas of technical expertise include system architecture, performance tuning, security, replication and troubleshooting. Denny has written several books and dozens of technical articles on SQL Server management and how SQL Server integrates with various other technologies.","torrent":{"xt":"urn:btih:d92c9976e8247298ecf902a3697087cba3cdd3ed","amp;dn":"The+Basics+Of+Digital+Privacy+-+Simple+Tools+To+Protect+Your+Per","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d92c9976e8247298ecf902a3697087cba3cdd3ed","infoHashBuffer":{"type":"Buffer","data":[217,44,153,118,232,36,114,152,236,249,2,163,105,112,135,203,163,205,211,237]},"announce":[],"urlList":[]}}