{"title":"Brenda Lee - Little Miss Dynamite [1956-1962] Bear Family 4CD","uid":7889901,"size":2115330270,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da802867d6fa205283571bcf72073cf26a0faae1&amp;dn=Brenda+Lee+-+Little+Miss+Dynamite+%5B1956-1962%5D+Bear+Family+4CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"bonnie335","files":138,"time":1354702008,"description":"Brenda Lee - Little Miss Dynamite - 1956-1962 \n\n\nFive hours of pure gold on four CDs, covering the 127 songs that Brenda Lee recorded during the years 1956 through 1962, with the added allure of an 84-page hardcover book. What's more, there's hardly a second-rate song or performance here, and Lee's singing style evolved so far that there are surprises throughout. Her early rockabilly sides are among the best in the field, and Disc One covers her evolution from country-rockin' teen rockabilly queen to an astonishingly precocious pop star with rock roots. Even Lee's early sides, whether hot rockabilly or slow ballads, are all intense experiences -- there's just something eerily compelling about 12-year-old Brenda Lee delivering &quot;Your Cheatin' Heart&quot; and sounding like she means all of the yearning and torment behind it. By 1957, her voice and her style had evolved more toward mainstream pop, virtually paralleling Elvis Presley's musical moves of the same era, but, like Elvis, Lee occasionally burst out with hard-rocking sides as late as 1959. Disc Two shows off Lee's mid-teen years, when she was doing pop standards that shouldn't have worked with anyone less than 30, but making them pay off -- her hot, raspy voice made even her pop stuff work better than Elvis's and outclassed the work of any other female singer who made that same jump to mainstream music. Disc Three may be the best of the four here, her rock sides alternating with equally compelling pop performances. Much of Disc Four is on the softer side, but even here she comes up with exciting pop/rock songs. By this time, she was nearing 18 years old, and already had a catalog of recordings behind her that would have been the envy of any veteran. As usual with Bear Family, the book is as fascinating as the music. ","torrent":{"xt":"urn:btih:da802867d6fa205283571bcf72073cf26a0faae1","amp;dn":"Brenda+Lee+-+Little+Miss+Dynamite+%5B1956-1962%5D+Bear+Family+4CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da802867d6fa205283571bcf72073cf26a0faae1","infoHashBuffer":{"type":"Buffer","data":[218,128,40,103,214,250,32,82,131,87,27,207,114,7,60,242,106,15,170,225]},"announce":[],"urlList":[]}}