{"title":"Bobby Hutcherson - Components (1965) [2015 _HRA 24-192]","uid":11767519,"size":1441020726,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dbcc98d14c2735b17b6a682ea2c9d82ea2eec73b&amp;dn=%5CBobby+Hutcherson+-+Components+%281965%29+%5B2015+_HRA+24-192%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":11,"time":1426914083,"description":"Bobby Hutcherson - Components (1965/2015)\n FLAC (tracks) 24 bit/192 kHz | Time - 40:59 minutes | 1,42 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Components is the second in Hutcherson's string of ten (!) consecutive superlative releases for Blue Note from 1965 to 1969. The first half of this disc features Hutcherson's compositions, including what might be called his signature tune, &quot;Little B's Poem.&quot; The piece, dedicated to Hutcherson's son, captures a wonderful sense of child-like enjoyment. As it's name implies, &quot;Tranquility&quot; is a reflective piece, and it prominently displays Hutcherson's ballad mastery--as well as Hubbard's and Hancock's. The title cut, &quot;Components,&quot; is an unconventional hard-bop swinger, as is &quot;West 22nd Street Theme&quot;.\n\n\n Perhaps the single album that best sums up Bobby Hutcherson's early musical personality, Components is appropriately split into two very distinct halves. The first features four Hutcherson originals in a melodic but still advanced hard bop style, while the latter half has four free-leaning avant-garde pieces by drummer Joe Chambers. Hutcherson allots himself more solo space than on Dialogue, but that's no knock on the excellent supporting cast, which includes Herbie Hancock on piano, James Spaulding on alto sax and flute, Freddie Hubbard on trumpet, and Ron Carter on bass. It's just more Hutcherson's date, and he helps unite the disparate halves with a cool-toned control that's apparent regardless of whether the material is way outside or more conventionally swinging. In the latter case, Hutcherson's originals are fairly diverse, encompassing rhythmically complex hard bop (the title track), pensive balladry (&quot;Tranquillity,&quot; which features a lovely solo by Hancock), down-and-dirty swing (&quot;West 22nd Street Theme&quot;), and the gaily innocent &quot;Little B's Poem,&quot; which went on to become one of Hutcherson's signature tunes and contains some lyrical flute work from Spaulding. The Chambers pieces tend to be deliberate explorations that emphasize texture and group interaction in the manner of Dialogue, except that there's even more freedom in terms of both structure and tonal center. (The exception is the brief but beautiful closing number, &quot;Pastoral,&quot; an accurate title if ever there was one.) Components illustrated that Hutcherson was not only the most adventurous vibes player on the scene, but that he was also capable of playing more straightforward music with intelligence and feeling.  \n\n\nTracklist:\n\n 01 - Components\n 02 - Tranquillity\n 03 - Little B's Poem\n 04 - West 22nd Street Theme\n 05 - Movement\n 06 - Juba Dance\n 07 - Air\n 08 - Pastoral\n\n Produced by Alfred Lion.\n Recorded on June 10, 1965 at Van Gelder Studio, Englewood Cliffs.\n Digitally remastered.\n\nMusicians:\n Bobby Hutcherson - vibraphone\n James Spaulding - alto saxophone, flute\n Freddie Hubbard - trumpet\n Herbie Hancock - piano\n Ron Carter - double bass\n Joe Chambers - drums","torrent":{"xt":"urn:btih:dbcc98d14c2735b17b6a682ea2c9d82ea2eec73b","amp;dn":"%5CBobby+Hutcherson+-+Components+%281965%29+%5B2015+_HRA+24-192%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbcc98d14c2735b17b6a682ea2c9d82ea2eec73b","infoHashBuffer":{"type":"Buffer","data":[219,204,152,209,76,39,53,177,123,106,104,46,162,201,216,46,162,238,199,59]},"announce":[],"urlList":[]}}