{"title":"THE HORNET'S NEST - Jimmy Carter. John McDonough {FerraBit}","uid":5484000,"size":1186612680,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dbcc4e06ecc44da527871a1d472edf8b08d5b7a6&amp;dn=THE+HORNET%5C%27S+NEST+-+Jimmy+Carter.+John+McDonough+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FerraBit","files":-1,"time":1270596201,"description":"THE HORNET'S NEST by Jimmy Carter (2003)\nA Novel of the Revolutionary War\n\nRead by . . : John McDonough\nPublisher . : Recorded Books (2004) #C2379 , ID-65991\nISBN . . . .: 1402566840 | 9781402566844\nFormat . . .: MP3. 187 tracks, 1.10 GB\nBitrate . . : ~110 kbps (iTunes 9, VBR (highest), Mono, 44.1 kHz)\nSource . . .: 19 CDs (23 hours)\nGenre . . . : Historical Fiction, Civil War\nUnabridged .: Unabridged\n\nNicely tagged and labeled, combined about half of the CD tracks, scanned cover included.\n\nThanks for sharing &amp; caring.\nCheers, FerraBit\nApril 2010\n\n Links:\nhttp://en.wikipedia.org/wiki/Jimmy_Carter\n\n  Originally posted:               &lt;a href=&quot;\nhttps://thepiratebay.se/user/FerraBit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/FerraBit&lt;/a&gt; (TPB) &amp; Demonoid\nPlease present your library card, and comment me some loving.\n______________________________________\n\nFrom Recorded Books:\n\nWith this riveting novel, New York Times best-selling author Jimmy Carter becomes the first American president to write a work of fiction. In 1773, Ethan Pratt leaves Philadelphia to escape the escalating tension between America and Britain. But when he lands in Georgia, he is swept into a horrific struggle pitting neighbor against neighbor in a bloody fight for survival.\n - - -\n\nThe first work of fiction by a President of the United States -- a sweeping novel of the American South and the War of Independence.\n\nIn his ambitious and deeply rewarding novel, Jimmy Carter brings to life the Revolutionary War as it was fought in the Deep South; it is a saga that will change the way we think about the conflict. He reminds us that much of the fight for independence took place in that region and that it was a struggle of both great and small battles and of terrible brutality, with neighbor turned against neighbor, the Indians' support sought by both sides, and no quarter asked or given. The Hornet's Nest follows a cast of characters and their loved ones on both sides of this violent conflict -- including some who are based on the author's ancestors.\n\nAt the heart of the story is Ethan Pratt, who in 1766 moves with his wife, Epsey, from Philadelphia to North Carolina and then to Georgia in 1771, in the company of Quakers. On their homesteads in Georgia, Ethan and his wife form a friendship with neighbors Kindred Morris and his wife, Mavis. Through Kindred and his young Indian friend Newota, Ethan learns about the frontier and the Native American tribes who are being continually pressed farther inland by settlers. As the eight-year war develops, Ethan and Kindred find themselves in life-and-death combat with oppos- ing forces.\n\nWith its moving love story, vivid action, and the suspense of a war fought with increasing ferocity and stealth, The Hornet's Nest is historical fiction at its best, in the tradition of such major classics as The Last of the Mohicans.\n - - -\n\nFrom Booklist:\n\nCarter continues to have one of the most productive and varied post-political careers of any former U.S. president. A prodigious writer with 16 works of nonfiction to his credit, Carter turns to fiction with this account of the Revolutionary War as fought in the Deep South. Because most of the accessible literature revolves around battles fought in New England and the Middle Atlantic colonies, it is easy to overlook the fierce fighting that took place in Florida, Georgia, and the Carolinas. The plot revolves around the migration of newlyweds Ethan and Epsey Pratt from Philadelphia to a homestead in Georgia. When the War for Independence heats up, the Pratts and their friends and neighbors--many of them Quakers--are forced into the vortex of historical events beyond their control. What Carter lacks in narrative style and characterization, he more than makes up for in the breadth of historical fact and detail interwoven into this obvious labor of love. It is not surprising that a history-maker would turn to history for fictional inspiration; what is surprising is the effectiveness of his debut effort.\n","torrent":{"xt":"urn:btih:dbcc4e06ecc44da527871a1d472edf8b08d5b7a6","amp;dn":"THE+HORNET%5C%27S+NEST+-+Jimmy+Carter.+John+McDonough+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbcc4e06ecc44da527871a1d472edf8b08d5b7a6","infoHashBuffer":{"type":"Buffer","data":[219,204,78,6,236,196,77,165,39,135,26,29,71,46,223,139,8,213,183,166]},"announce":[],"urlList":[]}}