{"title":"Light in Engineering, Architecture and the Environment","uid":9715166,"size":15809147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc023be1f5e020470f2097cf3461866492f9c9aa&amp;dn=Light+in+Engineering%2C+Architecture+and+the+Environment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394148954,"description":"English | 2011 | ISBN: 1845645502 | 272 pages | PDF | 15.08 Mb\n\nThe Wessex Institute of Technology has for years been convening conferences on sustainable architecture and planning, design in nature, heritage architecture and environmental health. With the growing importance of lighting in the creation of better, healthier environments, the enhancement of heritage architecture, and the recovery of urban areas, as well as new developments in more sustainable lighting, it became clear that a conference focusing on lighting issues would be useful.\nThis book contains the papers to be presented at the first International Conference on Lighting in Engineering, Architecture and the Environment discussing the latest developments in a variety of topics related to light and illumination, from its engineering aspects to its use in arts and architecture and the effect of light on living systems and human health. Ranging from discussions of technical issues regarding equipment designs and light measurement to human perception of its effects, the book will be of interest to architects, planners, environmental health experts, and stage designers in academia, industry and government, as well as colleagues discussing the latest developments in a variety of topic related to light and illumination.","torrent":{"xt":"urn:btih:dc023be1f5e020470f2097cf3461866492f9c9aa","amp;dn":"Light+in+Engineering%2C+Architecture+and+the+Environment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc023be1f5e020470f2097cf3461866492f9c9aa","infoHashBuffer":{"type":"Buffer","data":[220,2,59,225,245,224,32,71,15,32,151,207,52,97,134,100,146,249,201,170]},"announce":[],"urlList":[]}}