{"title":"Sexually Broken--Tiny big-booty hottie Jynx Maze  Matt Williams","uid":8902628,"size":1229987440,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:dc58b2417152ed924bd259d66a7d6a97d3267e0f&amp;dn=Sexually+Broken--Tiny+big-booty+hottie+Jynx+Maze++Matt+Williams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1378839653,"description":"Tiny big-booty hottie Jynx Maze is bound, face fucked, deep throated and pussy fucked to orgasms! | Jynx Maze | Matt Williams\n\nSeptember 9, 2013 \n\n\nMP4 only. \n\n\nLittle Latina Jynx Maze has the type of bubblebutt that can make most men lose their mind. Curves like that make you believe in Heaven and think it can be reached between Jynx's sweet cheeks. Here on the Sexuallybroken stage, we aren't looking for heaven, we just want to throat fuck these bitches into utter submission. We are not going to be distracted by ass.\n\nThe set up is simple, clean and effective bondage. A large wooden pillar at mouth hole height is affixed to the stage. Shackle your slut into place and go to town. Jynx is completely immobilized and at our mercy, her epic bootie properly displayed. Let the throat training commence! It doesn't matter how pretty a girl is, the addition of rock hard cock to the back of her tonsils always makes her look better. Beauty magazines take note.\n\nThe cock goes in, the drool and moans come out. Every millimeter of her face pussy is thoughly owned. Jynx breathes when we let her, and only then, otherwise she is completely impaled on our fuckstick. There is nothing like limited air to really make you appreciate what you have. Jynx brings one more thing to the table other then that epic ass of hers....a ridiculously sensitive pussy. Each uncontrollable orgasm ripped from that pussy hurts more then the one before.\n\nWe love sensitive pussies around here. They are so much fun to play with. Adding a vibrator to the mix causes Jynx to attempt to launch herself sideways to avoid the intense stimulation-an attempt completely foiled by the fact she is securely shackled in place. She can't escape the pleasure, she can't escape the massive orgasms, she can't take it....but she has no choice but to take it. The orgasms and cock overload leave her a broken shell of a porn girl, eyes glazed and drool coated. We leave her shackled and spent. Come back any time Jynx, we love training! \n\nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_09jmaze2/SexuallyBroken-Jynx-Maze-Matt-Williams-Tiny-big-booty-hottie-Jynx-Maze-is-bound-face-fucked-deep-throated-and-pussy-fucked-to-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_09jmaze2/SexuallyBroken-Jynx-Maze-Matt-Williams-Tiny-big-booty-hottie-Jynx-Maze-is-bound-face-fucked-deep-throated-and-pussy-fucked-to-orgasms.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:dc58b2417152ed924bd259d66a7d6a97d3267e0f","amp;dn":"Sexually+Broken--Tiny+big-booty+hottie+Jynx+Maze++Matt+Williams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc58b2417152ed924bd259d66a7d6a97d3267e0f","infoHashBuffer":{"type":"Buffer","data":[220,88,178,65,113,82,237,146,75,210,89,214,106,125,106,151,211,38,126,15]},"announce":[],"urlList":[]}}