{"title":"Napoleonic Wars #1-3 (2011-12) Adrian Goldsworthy (multi)","uid":9506013,"size":5458519,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc6b7ec220a740a2e404ff4ba1f1d465e3652e34&amp;dn=Napoleonic+Wars+%231-3+%282011-12%29+Adrian+Goldsworthy+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1390318750,"description":"Napoleonic Wars #1-3 by Adrian Goldsworthy\n\n\nFormat: mobi/epub/azw3\nLength: 400/336/368 pages\nGenre: Historical/Action/Adventure\nDate: 1 January 2011 - 9 August 2012\n\nTrue Soldier Gentlemen is the first in a series of novels set during the Napoleonic Wars. At the heart of the story are the adventures of the fictional 106th Regiment of Foot, as they fight their way through Portugal, Spain, Canada, France, and finally to the ridge at Waterloo.\n\nTrue Soldier Gentlemen (#1) (2011)\n\nA brilliant new Napoleonic military fiction series from one of the UK's brightest young historians.\n\nThe year is 1808 and Hamish Williams is a 'gentlemen volunteer' in the 106th regiment of foot, a man serving with the ranks but living with the officers and uncomfortable in both worlds: looked down on by those with the money or influence to buy their rank and distrusted by the common soldiers who know he is not one of them.\n\nBut Williams is determined to prove by deeds alone that he is a man worthy of advancement and when the 106th embarks for Portugal to begin what will become known as the Peninsula War against Napoleon, he knows his chance of glory is at hand. Soon he is receiving a sharp lesson in the realities of war, as the 106th undergoes a bloody baptism at the hands of the French - and he realises that his single-minded devotion to honour may not, after all, be the quickest route to promotion.\n\nBeat The Drums Slowly (#2) (2011)\nSend Me Safely Back Again (#3) (2012)\n\nAuthor:\n\nAdrian Goldsworthy was born in 1969 in Cardiff. He was educated in Penarth and then read Ancient and Modern History at St. John's College, Oxford, where he subsequently completed his doctorate in ancient history. His D.Phil. Thesis was the basis for his first book, The Roman Army At War 100 BC - AD 200, which looked at how the Roman army actually operated on campaign and in battle.","torrent":{"xt":"urn:btih:dc6b7ec220a740a2e404ff4ba1f1d465e3652e34","amp;dn":"Napoleonic+Wars+%231-3+%282011-12%29+Adrian+Goldsworthy+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc6b7ec220a740a2e404ff4ba1f1d465e3652e34","infoHashBuffer":{"type":"Buffer","data":[220,107,126,194,32,167,64,162,228,4,255,75,161,241,212,101,227,101,46,52]},"announce":[],"urlList":[]}}