{"title":"Lauryn Hill - 1998 - The Miseducation Of Lauryn Hill [EAC - FLAC","uid":7354610,"size":492893849,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dd2d5739dba6cd725b47dee310f1350fbab4e03b&amp;dn=Lauryn+Hill+-+1998+-+The+Miseducation+Of+Lauryn+Hill+%5BEAC+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_mustalainen_","files":-1,"time":1339718282,"description":"The Miseducation of Lauryn Hill is the debut solo album by American musician Lauryn Hill, released August 25, 1998, on Columbia Records. Recording sessions for the album took place from late 1997 to June 1998, and were held primarily at Tuff Gong Studios in Jamaica. The album's lyrics deal with Hill's pregnancy at the time, the turmoil in her former group the Fugees, themes of love, and God, while its music incorporates elements of R&amp;B, hip hop, soul, reggae, and gospel. The album's title was inspired by the film and autobiographical novel The Education of Sonny Carson, and Carter G. Woodson's The Mis-Education of the Negro.[1]\n\nUpon release, The Miseducation of Lauryn Hill debuted at number one on the Billboard 200 chart, selling 422,624 copies in its first week, which broke a record for first week sales by a female artist.[2] The album spent 81 weeks on the Billboard 200[3] and topped the Billboard Year-End Top R&amp;B/Hip-Hop Albums chart.[4] In 1999, The Miseducation of Lauryn Hill garnered ten Grammy nominations at the 41st Grammy Awards, winning five, making Hill the first female recording artist to receive that number of nominations, as well as awards in one night. The album was certified Gold on September 29, 1998 by the Recording Industry Association of America (RIAA), for shipments of over 500,000 copies, and on December 17, 2001, it was certified 8x Platinum in the United States. As of April 2012, the album has sold over 7,106,000 copies in the United States alone. [5]\n\nInitially, The Miseducation of Lauryn Hill received a great amount of critical praise for its lyric themes and genre variance. Since its release, the album has perpetuated its acclaim from most music critics and publications, and has been widely recognized as a crucial and influential component of the neo soul sub-genre. The album has appeared on numerous accolades, with many past and contemporary critics regarding it as one of the greatest albums of the 1990s, as well as one of the greatest albums of all time.\n\n\n1\t\tIntro\t\t\t\t0:47\n2\t\tLost Ones\t\t\t5:32\n3\t\tEx-Factor\t\t\t5:27\n4\t\tTo Zion\t\t\t\t6:09\n5\t\tDoo Wop (That Thing)\t\t5:19\n6\t\tSuperstar\t\t\t4:56\n7\t\tFinal Hour\t\t\t4:15\n8\t\tWhen It Hurts So Bad\t\t5:40\n9\t\tI Use to Love Him\t\t5:41\n10\t\tForgive Them Father\t\t5:14\n11\t\tEvery Ghetto, Every City\t5:13\n12\t\tNothing Even Matters\t\t5:50\n13\t\tEverything Is Everything\t4:52","torrent":{"xt":"urn:btih:dd2d5739dba6cd725b47dee310f1350fbab4e03b","amp;dn":"Lauryn+Hill+-+1998+-+The+Miseducation+Of+Lauryn+Hill+%5BEAC+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd2d5739dba6cd725b47dee310f1350fbab4e03b","infoHashBuffer":{"type":"Buffer","data":[221,45,87,57,219,166,205,114,91,71,222,227,16,241,53,15,186,180,224,59]},"announce":[],"urlList":[]}}