{"title":"Brideshead Revisited - Evelyn Waugh   (BBC Audio)","uid":5109976,"size":218802900,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dd5a837203e95183e907dbe1f7eaaf89dad7add8&amp;dn=Brideshead+Revisited+-+Evelyn+Waugh+++%28BBC+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":-1,"time":1254679729,"description":"Brideshead Revisited - by Evelyn Waugh - BBC Radio Classic Drama\n\n\n\nIn 1944 Captain Charles Ryder travels with a company of soldiers to Brideshead. It's a place he's been to before, and one which serves as a potent reminder of the decadent and stylish lifestyle now destroyed by the austerity of the Second World War.\n\nEvelyn Waugh's moving and nostalgic novel revisits a golden age, when Ryder was a student at Oxford in the 1920s and in thrall to the captivating but tragic Sebastian Flyte. As the story unfolds over the next two decades, Ryder traces his friendship with Sebastian and his involvement with the young man's aristocratic Catholic family - in particular Julia, the eldest Flyte daughter.\n\nBen Miles stars as Charles Ryder with Jamie Bamber as Sebastian in this full-cast dramatisation, which also features Eleanor Bron and Edward Petherbridge.\n\nAdapted by Jeremy Front and directed by Marion Nancarrow with original music by Neil Brand\n\nFour episodes of approximately one hour each.\n\n\n\nEpisode 1:\nCaptain Charles Ryder finds himself posted to Brideshead Castle, scene of the beginnings of his friendship with Sebastian Flyte.\n\nEpisode 2:\nFriendship with the ebullient Sebastian Flyte continues to open up new vistas for Charles - including a trip to the infamous Ma Mayfield's and meeting more of the Marchmain family. For Sebastian, however, the family is closing in.\n\nEpisode 3:\nWith their friendship strained, as Sebastian continues his drinking, so Charles begins to be lured by Paris and Art.\n\nEpisode 4:\nCharles is overwhelmed by meeting Julia again on board ship, but will his relationship with the Marchmain family still prove to be jinxed?\n\n\n\nWith:\nCharles Ryder.....Ben Miles\nSebastian.....Jamie Bamber\nLady Marchmain.....Eleanor Bron\nLord Marchmain.....Edward Petherbridge\n\n\nRipped from the audio torrent site radioarchive.cc - Registration is FREE!!\n\n\nType : mpeg 1 layer III\nBitrate : 128\t\nMode : joint stereo\nFrequency : 48000 Hz\nEncoder : Lame 3.96\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:dd5a837203e95183e907dbe1f7eaaf89dad7add8","amp;dn":"Brideshead+Revisited+-+Evelyn+Waugh+++%28BBC+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd5a837203e95183e907dbe1f7eaaf89dad7add8","infoHashBuffer":{"type":"Buffer","data":[221,90,131,114,3,233,81,131,233,7,219,225,247,234,175,137,218,215,173,216]},"announce":[],"urlList":[]}}