{"title":"The Alzheimer's Answer Book{BBS}","uid":6825193,"size":9712295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd79d857fbe1e27a56510b88acf3da161810cecb&amp;dn=The+Alzheimer%5C%27s+Answer+Book%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321537216,"description":"Q&amp;A\nIs Alzheimer's disease hereditary? Are there memory exercises I should be doing now? Is all dementia Alzheimer's, or are there other forms? How do I make time for both my parent with Alzheimer's and my children? How long can someone live with this disease?\n\nAll caregivers and families touched by Alzheimer's and dementia face a seemingly overwhelming number of emotional decisions. The Alzheimer's Answer Book serves as a much-needed resource for you in this difficult time and is full of the sound advice and immediate guidance you need.\n\nWritten by an experienced doctor who began his career as a geriatric psychiatrist, The Alzheimer's Answer Book covers such topics as:\n\n    * What are the causes of Alzheimer's and dementia\n    * What preparations do I need to make immediately after diagnosis?\n    * Are there medications available that help slow the progress of the disease?\n    * How can I tell if my parent is in pain?\n    * How can I avoid &quot;caregiver burnout&quot; when I'm constantly caring for a parent?\n    * Where can I find resources and support in my community?\n    * What are the differences between Medicare and Medicaid, and how do I know what insurance will and will not cover?\n\nWritten in an easy-to-read Q&amp;A format, The Alzheimer's Answer Book explains confusing medical lingo and provides straightforward answers to all of your most pressing questions.\n\n\n# Paperback: 352 pages\n# Publisher: Sourcebooks, Inc. (November 1, 2008)\n# Language: English\n# ISBN-10: 1402213441\n# ISBN-13: 978-1402213441","torrent":{"xt":"urn:btih:dd79d857fbe1e27a56510b88acf3da161810cecb","amp;dn":"The+Alzheimer%5C%27s+Answer+Book%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd79d857fbe1e27a56510b88acf3da161810cecb","infoHashBuffer":{"type":"Buffer","data":[221,121,216,87,251,225,226,122,86,81,11,136,172,243,218,22,24,16,206,203]},"announce":[],"urlList":[]}}