{"title":"Willis Jackson - Legends Of Acid Jazz (1959) [FLAC]","uid":6185712,"size":478852281,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ddb37ed12497c02ceaaa660ea24485c930988a11&amp;dn=Willis+Jackson+-+Legends+Of+Acid+Jazz+%281959%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":25,"time":1298103644,"description":"eac secure cue log scans\n\nWillis Jackson - Legends Of Acid Jazz\nRecorded: 1959 - 1960\nReleased: 1998\nLabel: Prestige\nTime: 76:01\n\n\nArtist Info\nAn exciting tenor saxophonist whose honking and squeals (although influenced by Illinois Jacquet) were quite distinctive, Willis Jackson was also a strong improviser who sounded perfectly at home with organ groups. He played locally in Florida early on, until joining Cootie Williams (on and off during 1948-1955). His two-sided honking feature &quot;Gator Tail&quot; with &quot;Cootie&quot; (which earned Williams a lifelong nickname) was a hit in 1948, and he started recording as a leader in 1950. Jackson was married to singer Ruth Brown for eight years, and often appeared on her recordings during this era. His extensive series of Prestige recordings (1959-1964) made him a big attraction on the organ circuit. Although generally overlooked by critics, Willis Jackson continued working steadily in the 1970s and '80s. In 1977, he recorded one of the finest albums of his career for Muse, Bar Wars.\n\n\nReview\nWillis &quot;Gator&quot; Jackson's initial reputation was made as a honking and screaming tenor saxophonist with Cootie Williams' late-'40s orchestra and on his own R&amp;B-ish recordings. By 1959, Jackson had de-emphasized some of his more extroverted sounds (although they occasionally popped up) and had reemerged as a solid swinger influenced by Gene Ammons and (on ballads) Ben Webster. This CD reissue from 1998 brings back in full two of Jackson's 1959-60 LPs: Blue Gator and Cookin' Sherry. Some of the music (which often falls into the soul-jazz genre) is reminiscent of the funky groove music that would become popular in the late '60s. Jackson sounds fine and is joined throughout by guitarist Bill Jennings, organist Jack McDuff, one of three bassists, one of two drummers, and sometimes Buck Clarke on conga. The accessible music alternates between warm ballads and jump tunes.\n\n\nTracklist\n1. Blue Gator\n2. Try A Little Tenderness\n3. Gator's Tail\n4. This Nearly Was Mine\n5. East Breeze\n6. She's Funny That Way\n7. Mellow Blues\n8. Sportin'\n9. When I Fall In Love\n10. Cookin' Sherry\n11. Where Are You?\n12. Contrasts","torrent":{"xt":"urn:btih:ddb37ed12497c02ceaaa660ea24485c930988a11","amp;dn":"Willis+Jackson+-+Legends+Of+Acid+Jazz+%281959%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddb37ed12497c02ceaaa660ea24485c930988a11","infoHashBuffer":{"type":"Buffer","data":[221,179,126,209,36,151,192,44,234,170,102,14,162,68,133,201,48,152,138,17]},"announce":[],"urlList":[]}}