{"title":"SAS Ultimate Guide to Combat","uid":8228576,"size":5754224,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddc18d2f268e9cff7afe1d297253f483ff0718fc&amp;dn=SAS+Ultimate+Guide+to+Combat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thenmeunseen","files":1,"time":1362674051,"description":"SAS Ultimate Guide to Combat\n\n'I'm not going to teach you how to survive in snowy mountains with only a tea bag; this book will teach you how to fight and survive war in the 21st century.'--Robert Stirling, from the Introduction\n\nIn the tradition of John 'Lofty' Wiseman's SAS Survival Handbook comes a new combat handbook from a seasoned speical forces soldier. Whereas Wiseman initiated hundreds of thousands of readers to the survival techniques developed by the SAS in far-flung covert ops in Burma, the Middle East, Africa, and elsewhere, Stirling's focus is on fighting techniques for the contemporary soldier.\n\nStirling, a combat veteran of Northern Ireland, the Bush Wars in Africa, and Afghanistan, provides a fully-illustrated training-manual for combat readiness. This is the stuff they don't teach you in boot camp, but they damn well should. Stirling writes in a aggressive style that will appeal to the warrior in every reader. He also serves up first-hand anecdotes and advice drawn from operations that went well--and those that went wrong.\n\nTable of Contents: Why Do You Need This Book - Tools of the Soldier's Trade - Food, Shelter &amp; Dealing with Weather - Medical Aid - How to Avoid Getting Shot - How to Avoid Blast Injury - How to Deal with Suicide Bombers - How to Deal with Bombs Under the Road - How to Survive an Interrogation - Defending a Position - Attacking the Enemy\n\nFormat: Mobi\n\nIf you like the book then please by a copy and support the author\n\nSeed and Enjoy!!\n\n","torrent":{"xt":"urn:btih:ddc18d2f268e9cff7afe1d297253f483ff0718fc","amp;dn":"SAS+Ultimate+Guide+to+Combat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc18d2f268e9cff7afe1d297253f483ff0718fc","infoHashBuffer":{"type":"Buffer","data":[221,193,141,47,38,142,156,255,122,254,29,41,114,83,244,131,255,7,24,252]},"announce":[],"urlList":[]}}