{"title":"J.Fish, T.Belytschko - A First Course In Finite Elements (2007)","uid":4508142,"size":6596609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddf1e46d17d29f5e5dea3dc5e39312a881ac86ce&amp;dn=J.Fish%2C+T.Belytschko+-+A+First+Course+In+Finite+Elements+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fransfl","files":1,"time":1226676641,"description":"Book Description:\n\nDeveloped from the authors, combined total of 50 years undergraduate and graduate teaching experience, this book presents the finite element method formulated as a general-purpose numerical procedure for solving engineering problems governed by partial differential equations. \n\nFocusing on the formulation and application of the finite element method through the integration of finite element theory, code development, and software application, the book is both introductory and self-contained, as well as being a hands-on experience for any student.\n\nThis authoritative text on Finite Elements:\n\n* Adopts a generic approach to the subject, and is not application specific\n* In conjunction with a web-based chapter, it integrates code development, theory, and application in one book\n* Provides an accompanying Web site that includes ABAQUS Student Edition, Matlab data and programs, and instructor resources\n* Contains a comprehensive set of homework problems at the end of each chapter\n* Produces a practical, meaningful course for both lecturers, planning a finite element module, and for students using the text in private study.\n* Accompanied by a book companion website housing supplementary material that can be found at http://www.wileyeurope.com/college/Fish \n\nA First Course in Finite Elements is the ideal practical introductory course for junior and senior undergraduate students from a variety of science and engineering disciplines.  The accompanying advanced topics at the end of each chapter also make it suitable for courses at graduate level, as well as for practitioners who need to attain or refresh their knowledge of finite elements through private study.","torrent":{"xt":"urn:btih:ddf1e46d17d29f5e5dea3dc5e39312a881ac86ce","amp;dn":"J.Fish%2C+T.Belytschko+-+A+First+Course+In+Finite+Elements+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddf1e46d17d29f5e5dea3dc5e39312a881ac86ce","infoHashBuffer":{"type":"Buffer","data":[221,241,228,109,23,210,159,94,93,234,61,197,227,147,18,168,129,172,134,206]},"announce":[],"urlList":[]}}