{"title":"FastPictureViewer Home Basic 1.9.263 (x32 x64) Regkey - PMS","uid":7855865,"size":56223592,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:de38ffd9050a884963707c1f46355d86adbdd6a4&amp;dn=FastPictureViewer+Home+Basic+1.9.263+%28x32+x64%29+Regkey+-+PMS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"the.count","files":-1,"time":1353757641,"description":"FastPictureViewer Home Basic 1.9.263 (32bit and 64bit)+ Regkey---PMS\n\n\n\n================\n[Software INFO:]\n================\n\nFastPictureViewer Home Basic 1.9.263 (x86/x64) | 28/28.1 MB\n\nFastPictureViewer Professional helps iStockphoto inspectors cut through some of the 1/4 million new images they get every month, among other photographers and imaging professionals all over the world, ranging from photo enthusiasts culling their weekend pictures to analysts reviewing consumer behavioral studies made of millions of images, as well as helping wedding photographers, magazine picture editors and print shops do their image selection tasks more efficiently.\n\n\nFastPictureViewer is a free of charge tool capable to visualize almost all the popular photo formats. This software also features ICC color management as well as zooming and copy/move/delete functions. Introducing FastPictureViewer Professional, an image viewer with the speed and features needed to help you review digital photos faster and better than ever before.\n\nDesigned with professional photographers in mind, FastPictureViewer is a minimalist image viewer and culling tool engineered for previewing and rating digital images faster. The program features full ICC color management with support for profiled monitors, instant zooming and copy/move/delete functions, plus industry-standard Adobe XMP and Microsoft Photo rating, ideal for Fast reviewing, culling and rating of large quantities of images.\n\nIt displays shooting data (shutter speed, f-stop, ISO, exposure compensation) and RGB histogram in seamless floating windows and features a built-in program launcher, all in a slick and uncluttered user-interface. A tethering function is also available and works with all cameras fully compatible with the MTP/PTP transfer protocol, which includes most Nikon and recent Canon DSLRs.\n\nThe software supports fast previewing of raw image formats such as Nikon NEF, Canon CR2, Panasonic RW2, Olympus ORF and Adobe DNG through manufacturer-supplied or 3rd party image decoders. Standard image formats such as TIFF/MTIFF, JPEG, HD Photo, PNG, GIF, BMP and ICO are supported.\n\nThe program has been translated to several languages, including Chinese, French, German, Italian, Japanese, Russian and Spanish and is able to browse folders and images who's names can be written in any language, thanks to its support for the Unicode standard. FastPictureViewer is among the firsts of a new breed of hardware accelerated desktop applications and delivers unprecedented speed and ease of use.\n\nFastPictureViewer features:\n- Fastest raw image viewer ever. Period.\n- Instant zooming to 100% view, for quick sharpness checks. Best in industry!\n- RGB histogram, EXIF shooting data and Adobe XMP Rating/Label/Urgency instantaneous &quot;head up&quot; display.\n- Instantaneous single-keystroke copy/move of &quot;keepers&quot; to a preset folder (background copy/move)\n- Rules-based, scriptable batch copy, move, delete, save-for-web automation, multi-threaded parallel operations.\n- Instantaneous display of the next image in line (when computer resources allows) through image pre-loading and in-memory caching.\n- Instant industry-standard Adobe XMP compatible rating and tagging, embedded in standard formats (JPG, JPEG-XR, TIFF) or external sidecars.\n- Fast tethered shooting through the standard MTP/PTP protocol: tether a Nikon D700, D3S or D3X in 64 bit, today, storing pictures on CF card too.\n- Supports most common image formats. Special raster formats like OpenEXR, DDS, PNM, J2K are supported through separately installable image codecs.\n- Supports 23 RAW formats, from 350+ digital cameras models, incl. EOS 1D Mk IV, D3S/D3X and new compact cameras like HS10, NX-10, NEX-5 etc.\n- Professional color management, with ICC v2 and v4 profiles. Profiled monitor support. Supports Canon Kyuanos color engine on Vista and Windows 7.\n- Slickest, most uncluttered user interface in industry including a borderless, true 100% full screen mode: easy to operate and learn!\n- Integration with Windows 7 (Taskbar Jump List) and Windows Vista (thumbnail cache, &quot;Browse with...&quot; shell folder extension). Enables Explorer thumbnails.\n- Native 64-bit and 32-bit editions for Windows 7, Vista, XP SP3 and XP64, multi-core and multi-processor enabled to take full advantage of modern computer hardware, with optional Direct3D GPU acceleration: FPV Pro absolutely flies on 2010 hardware and will squeeze every last bits of your computer's performance.\n\n\nHome Page - http://www.fastpictureviewer.com\n\n\n================\n[INSTALL NOTES]\n================\n\nStep 1: unpack rar archive\nStep 2: run the setup\nStep 3: Use the given reg key to activate\nStep 4: Enjoy and Support Developers, Buy It, They Deserved It!","torrent":{"xt":"urn:btih:de38ffd9050a884963707c1f46355d86adbdd6a4","amp;dn":"FastPictureViewer+Home+Basic+1.9.263+%28x32+x64%29+Regkey+-+PMS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de38ffd9050a884963707c1f46355d86adbdd6a4","infoHashBuffer":{"type":"Buffer","data":[222,56,255,217,5,10,136,73,99,112,124,31,70,53,93,134,173,189,214,164]},"announce":[],"urlList":[]}}