{"title":"Bloodsport : ECW's Most Violent Matches (2005)","uid":4718569,"size":1189520772,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:de7bb91ebe27903ee42aa3a1c219c80f6baaaf6e&amp;dn=Bloodsport+%3A+ECW%5C%27s+Most+Violent+Matches+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cesarth","files":4,"time":1234397795,"description":"Bloodsport : ECW's Most Violent Matches (2005)\n\n\nCatcus Jack &amp; Mikey Whipwreck Vs. Public Enemy (ECW World Tag Team Championship Match) - I am not sure but I think ECW was still EASTERN CHAMPIONSHIP WRESTLING at this point. Even back in those days though, it was already EXTREME! The match itself sees Mikey take a beating as well as Catcus but still pulls off an upset against the favored P.E. \n\nSandman &amp; Terry Funk Vs. Cactus Jack and Shane &quot;Franchise&quot; Douglas - A wild affair from 1995 which saw the introduction of the flaming branding iron! \n\nAxl Rotten Vs. Ian Rotten (Taipei Death Match) - Taking a page from the Jean Claude Van Damn movie &quot;Kickboxer&quot;, these two have an anything goes match with taped fists mixed with superglue and beer glass! VERY BLOODY BOUT! \n\nRey Mystero, Jr. Vs. Psicosis (Mexican Death Match) - These two went at in a match where you must answer a 10 count or lose the bout! Similiar to a &quot;Last Man Standing&quot; match but you must gain a pinfall or submission prior to the 10 count! \n\nShane &quot;Franchise&quot; Douglas Vs. Chris &quot;Lionheart&quot; Jericho Vs. 2 Cold Scorpio Vs. Pitbull #2 (ECW TV Title Match) - This was done Four Corners style where you had to tag in and out. It went on until only one man remained! This match saw Douglas win the TV title and the beginning of a long team-up with Francine, who turned on Pitbull #2 during this match. \n\nTommy Dreamer Vs. Brian Lee (Weapons Match) - The former fake &quot;Undertaker&quot; gives his biggest moment in his time in ECW as he choked-slammed Tommy Dreamer though about 4 or 5 tables to the concrete floor! \n\nRob Van Damn Vs. Sabu (Stretcher Match) - Not really bloody but very physical, especially in the last 10 minutes! \n\nTerry Funk Vs. Sandman Vs. Stevie Rchards (3-Way Dance #1 Contender's Match) - This was at the first ECW PPV called Barely Legal in 1997! You will also see the winner take on then-ECW champ Raven immediately following this match as well! Classic ECW bout!\n\n\nVideo Features:\n384x288\nxvid\n25fps\n116kbps","torrent":{"xt":"urn:btih:de7bb91ebe27903ee42aa3a1c219c80f6baaaf6e","amp;dn":"Bloodsport+%3A+ECW%5C%27s+Most+Violent+Matches+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7bb91ebe27903ee42aa3a1c219c80f6baaaf6e","infoHashBuffer":{"type":"Buffer","data":[222,123,185,30,190,39,144,62,228,42,163,161,194,25,200,15,107,170,175,110]},"announce":[],"urlList":[]}}