{"title":"Rhapsody in Blue (1945)  Robert Alda.avi","uid":4624628,"size":1468258304,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:deab40f35d55e05ddb6dabd922cecc8562a1bd46&amp;dn=Rhapsody+in+Blue+%281945%29++Robert+Alda.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"johnefp","files":-1,"time":1231167161,"description":"Plot Synopsis\tby Hal Erickson\n\nThere's slightly more fancy than fact in this lavish film biography of legendary American composer George Gershwin, but oh! That music! Director Irving Rapper had wanted Tyrone Power to play Gershwin, but Power was still serving in the Marines, so Rapper had to settle for Robert Alda--who isn't bad at all, just a trifle over-enthusiastic. The film traces Gershwin's rise from a &quot;song plugger&quot; for a Manhattan music publishing company to the heights of international fame and fortune. Gershwin's first big hit is &quot;Swanee,&quot; introduced on Broadway by Al Jolson (who plays himself, making his first film appearance in six years). In collaboration with his lyricist brother Ira (well played by Herbert Rudley), George pens hit after hit in show after show. Impresario Charles Coburn is happy with this, but George's kindly old music teacher Albert Basserman wants his prize pupil to aspire to something more artistic. Gershwin responds with &quot;Rhapsody in Blue&quot;, which debuts at Aeolian Hall in 1924 under the baton of bandleader Paul Whiteman (also playing himself). As his fame and workload grows, George finds he has no time at all for romance; the two (fictional) ladies in his life, both of whom eventually realize that they'll always have to play second fiddle to Gershwin's muse, are musical comedy star Joan Leslie and socialite Alexis Smith. Gershwin continues to compose such masterpieces as &quot;An American in Paris&quot;, &quot;Cuban Overture&quot;, &quot;Concerto in F&quot; and the 1935 folk opera Porgy and Bess. He will not allow himself to rest on his laurels, ruthlessly pushing himself to top all his previous accomplishments. Finally, the strain proves too great: George Gershwin dies of a cerebral hemorrhage in 1937, at the age of 39. Featured in the cast as themselves (in addition to those already mentioned) are Gershwin's lifelong friend Oscar Levant, producer George White, and Broadway performers Tom Patricola and Hazel Scott. Morris Carnovsky and Rosemary DeCamp play George's parents, while Julie Bishop is cast as Ira's wife Lee, who is saddled with the film's silliest line: &quot;Ira, promise me that you'll never become a genius.&quot; Alternately hokey and inspired, Rhapsody in Blue has weathered the years as one of Hollywood's most solid biopics. And, as a bonus, we are treated to a virtually complete performance (running a full reel) of the title composition.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0038026/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0038026/&lt;/a&gt;\n\nSUBS\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-12141&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-12141&lt;/a&gt;\n\nAwards:\nNominated for 2 Oscars.\n\nDirector:\nIrving Rapper\nWriters:\nHoward Koch (writer)\nSonya Levien (story)\n\n        Robert Alda\t ... \tGeorge Gershwin\n\n\tJoan Leslie\t... \tJulie Adams\n\n\tAlexis Smith\t... \tChristine Gilbert\n\tCharles Coburn\t... \tMax Dreyfus\n\tJulie Bishop\t... \tLee Gershwin\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 02:21:03\nMovie complete : Yes\n\n[Video]\nResolution : 576x432\nCodec : XviD MPEG-4 codec\nFPS : 23,98\nBitRate : 1262 Kbps\nQuality Factor : 0,22 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 125 Kbps\n\n\nENJOY  AND  SEED\n","torrent":{"xt":"urn:btih:deab40f35d55e05ddb6dabd922cecc8562a1bd46","amp;dn":"Rhapsody+in+Blue+%281945%29++Robert+Alda.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deab40f35d55e05ddb6dabd922cecc8562a1bd46","infoHashBuffer":{"type":"Buffer","data":[222,171,64,243,93,85,224,93,219,109,171,217,34,206,204,133,98,161,189,70]},"announce":[],"urlList":[]}}