{"title":"(Blues) Johnny Farmer - Wrong Doers Respect Me","uid":6029793,"size":90465598,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df43b34beca0e8f2b87166d942b87bc01d8c6bab&amp;dn=%28Blues%29+Johnny+Farmer+-+Wrong+Doers+Respect+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1292057167,"description":"Genre: Blues\nStyles: Delta Blues,\nJuke Joint Blues\nReleased: 1998\nLabel: Fat Possum\nFile: mp3; 320 Kbps\nSize: 86.2 MB\nTime: 36:36 min.\nCovers: Included\n\n01. Death Letter (2:08)\n02. I've Been a Fool (3:35)\n03. Hush Hush Hush Hush (3:45)\n04. Instrumental #1 (1:44)\n05. Trouble Me (4:43)\n06. Way Down South (2:50)\n07. Screamin' and Cryin' (3:02)\n08. It Hurts Me (3:09)\n09. Lonely Road (2:30)\n10. Vacation Song (4:11)\n11. Seven Up (1:35)\n12. Instrumental #2 (3:14)\n\nJohnny Farmer - Guitar &amp; Vocals\n\nRecorded in Oxford, MS.\nProduced by Bruce Watson\nÃ‚Â© 1998 Fat Possum Records &lt;a href=&quot;\nhttp://www.fatpossum.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fatpossum.com&lt;/a&gt;\n\n\nJohnny Farmer's hard life began on May 6, 1932, in Holly Ridge, a small community in the Delta, eight miles east of Leland, Mississippi. His earliest memory is of waking up at four to build a fire for the coffee his father and older brothers consumed before heading to the fields for the day. At twelve Johnny was strong enough to plow a mule with his elders and became one of the most disposable pieces in the sharecropping system. Johnny married in his early twenties. His new bride moved into the two-room shack where Johnny was born and lived with his family. Johnny worked the same fields, has never been farther from home than he could walk in a day, when there arose an opportunity to work on a road crew, a definite improvement over sharecropping. Johnny, like others listed on the payroll book as general labor, worked alongside dozers, graders, and excavators with a pick, shovel, or hoe. Whatever the driver missed with the box blade Johnny fixed with one of his tools. Not surprisingly, he knew how to operate a dozer, and understood precisely how the metal tracks responded to breaking, before ever having the chance to drive one. One day Johnny got his chance, and the rest is history. He became one with the bulldozer, was hell with the dozer, and sat on top of one, weather permitting. For most of the last thirty years. Johnny really is an expert, knows how to low to drop the blade when the ground isn't all the way dry, how much earth can be pushed and how far until either side begins to slip and trench. Johnny would know if the juice stick should be closer to the rabbit than the the turtle and how much closer, Johnny also knows the answers to a heap of more questions along these lines.\n\n&quot;I don't want to make no record; that's not what I do. I'm the best bulldozer driver. I'm not going to stop doing that to try and do something I don't even know I could do in the first place.&quot;\n\nJohnny bought a guitar because there were three songs he enjoyed hearing. After dinner and before bed, if he had any energy left, he would plug in his guitar and practice alone. Even after he learned to play he only played alone. Johnny, with a deep well socket on his pinky, made sound coming out of the small amp mimic the lyrics he'd belted out. If the strings continued mocking him he'd yell, &quot;Hush, Hush, Hush!&quot; at his small Peavey amplifier. It was arresting, Johnny playing slide in his perfect tone, and pausing to scream out and curse for silence and peace. Johnny ended 95% of his songs with &quot;thank you very much.&quot;\n\n\n","torrent":{"xt":"urn:btih:df43b34beca0e8f2b87166d942b87bc01d8c6bab","amp;dn":"%28Blues%29+Johnny+Farmer+-+Wrong+Doers+Respect+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df43b34beca0e8f2b87166d942b87bc01d8c6bab","infoHashBuffer":{"type":"Buffer","data":[223,67,179,75,236,160,232,242,184,113,102,217,66,184,123,192,29,140,107,171]},"announce":[],"urlList":[]}}