{"title":"Black Snake Moan(2007)DVDRip.AC3(ENG)-DROCK","uid":6132213,"size":1468596224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df6402114fd02df1ad6544822e794ed9459d058e&amp;dn=Black+Snake+Moan%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drock232","files":-1,"time":1296167911,"description":"When a weathered, God-fearing ex-blues musician finds the town nymphomaniac severely beaten and left for dead on the side of the road, he vows to cure her of her wicked ways in Hustle &amp; Flow director Craig Brewer's raw and unflinching follow-up. Lazarus (Samuel L. Jackson) is a hard-living ex-blues guitarist for whom the troubled days are beginning to outnumber the good. Rae (Christina Ricci) is a 22-year-old sex addict whose wild ways are finally about to catch up with her. When Lazarus discovers Rae covered in dust and clinging to life on the side of the road, he takes her in and nurses her back to health; but Lazarus isn't your typical caregiver, he's more concerned for Rae's immortal soul than he is for her physical well-being. Now, after chaining Rae down and employing the power of the Good Book to curb the salacious seductress' hedonistic ways, Lazarus will be forced to confront his own darkest demons in order to save the soul of a woman whose one-way ticket to hell has already been paid in full. Now, as Lazarus wages a righteous struggle to redeem the soul of the fallen Rae while simultaneously ensuring that his own life hasn't been lived in vain, the situation threatens to explode as Rae's possessive boyfriend, Ronnie (Justin Timberlake) -- a roughneck Guardsman currently preparing for a tour of duty in Iraq -- comes searching for his missing lover.\n\nRipped with DVD Decrytper and Autogk.","torrent":{"xt":"urn:btih:df6402114fd02df1ad6544822e794ed9459d058e","amp;dn":"Black+Snake+Moan%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df6402114fd02df1ad6544822e794ed9459d058e","infoHashBuffer":{"type":"Buffer","data":[223,100,2,17,79,208,45,241,173,101,68,130,46,121,78,217,69,157,5,142]},"announce":[],"urlList":[]}}