{"title":"[Tereza_Flaxman]Maya 2008 Character Modeling &amp; Animation Pri","uid":11075288,"size":12489604,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df9b1ed31487a85b99bb9a74c587bf0935aadbef&amp;dn=%5BTereza_Flaxman%5DMaya+2008+Character+Modeling+%26amp%3B+Animation+Pri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1411326989,"description":"Are you ready to take on the challenge of animating realistic and compelling characters using the latest version of Maya, the powerful 3D graphics and modeling software? &quot;Maya 2008 Character Modeling and Animation: Principles and Practices&quot; shows beginner to intermediate animation students and enthusiasts how to create professional-quality characters, explaining the full character animation process from pre-production to final full body and facial animation. Each chapter begins by exploring the &quot;why&quot; behind the techniques being presented, followed by step-by-step tutorials to apply your new knowledge. Following a series of hands-on projects you'll learn how to model, rig, and animate, building a comprehensive skill-set as you move progressively through each chapter.You'll learn to master Maya's capabilities on both a technical and artistic level as you create incredible animated characters full of emotion and expression.\n\nPublisher: Cengage Learning; 1 edition (January 7, 2008)\nLanguage: English\nISBN-10: 1584505567\nISBN-13: 978-1584505563\n\nEditorial Reviews\nReview\nChapter 1 The Animation Production Process Chapter 2 Fundamentals of Computer Animation Chapter 3 Modeling and Texturing a Simple Character Chapter 4 Rigging and Animating a Simple Character Chapter 5 NURBS Modeling and Path Animation with Dynamics Chapter 6 Modeling a Biped Character Chapter 7 Rigging a Biped Character Chapter 8 The Art and Science of Animation Chapter 9 Facial Expressions\nAbout the Author\nTereza Flaxman teaches 3D modeling and animation at the Harvard Extension School and Northeastern University. She has been teaching animation for the past seven years at both undergraduate and graduate levels and is a Certified Alias Maya Instructor. Additionally, she has taught at both the School of Film and Animation at the Rochester Institute of Technology - RIT and at the State University of New York (SUNY). She also works as a freelance animator. She has more than fifteen years of experience with high-end 3D animation software, and has used Maya since version 1.0. Her work has been published in several books and magazines and exhibited in shows throughout the U.S. She has a MFA in Animation from the School of Visual Arts in New York City and a BFA from the University of Oregon. ","torrent":{"xt":"urn:btih:df9b1ed31487a85b99bb9a74c587bf0935aadbef","amp;dn":"%5BTereza_Flaxman%5DMaya+2008+Character+Modeling+%26amp%3B+Animation+Pri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df9b1ed31487a85b99bb9a74c587bf0935aadbef","infoHashBuffer":{"type":"Buffer","data":[223,155,30,211,20,135,168,91,153,187,154,116,197,135,191,9,53,170,219,239]},"announce":[],"urlList":[]}}