{"title":"Inside the Foreign Legion: The Sensational Story of the World's","uid":11822302,"size":12999835,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e05ef949ff1388cfe768b6d74b8b5df502f07f41&amp;dn=Inside+the+Foreign+Legion%3A+The+Sensational+Story+of+the+World%27s+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429309476,"description":"The thought of escaping from the pressures of life leads many anguished young men towards the Foreign Legion.The rose-tinted vision of Beau Geste Overrides the truth -- that life in the so-called Army of Strangers is no picnic. The brutality of its training regime and the horror stories of its ruthless NCOs have been told by the thousands who have deserted. But those who stayed and went beyond the beatings and the Legion's tortuous demands that stretch a man's mental and physical endurance to the very limit, and often beyond it, tell a different tale.John Parker's searching interviews with legionnaires past and present offer a new perspective of this most extreme fighting force. The Legion has served in major operations worldwide from the Allied invasion of Narvik during World War II to more recent conflicts including the Gulf War and Bosnia and this book records true, incredible stories by the men who were there, recounted in their own words, presenting the most authentic and detailed account of life in the Legion","torrent":{"xt":"urn:btih:e05ef949ff1388cfe768b6d74b8b5df502f07f41","amp;dn":"Inside+the+Foreign+Legion%3A+The+Sensational+Story+of+the+World%27s+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e05ef949ff1388cfe768b6d74b8b5df502f07f41","infoHashBuffer":{"type":"Buffer","data":[224,94,249,73,255,19,136,207,231,104,182,215,75,139,93,245,2,240,127,65]},"announce":[],"urlList":[]}}