{"title":"Edward Luce -- In Spite of the Gods-The Strange Rise of Modern I","uid":5168620,"size":2827919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0a354cfc152725badc187af5bec64793e2ca3dc&amp;dn=Edward+Luce+--+In+Spite+of+the+Gods-The+Strange+Rise+of+Modern+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"profdreamer","files":1,"time":1258561013,"description":"Edward Luce -- In Spite of the Gods-The Strange Rise of Modern India, PDF, 2.7MB\n\nFrom Publishers Weekly\nA burgeoning economic and geopolitical giant, India has the 21st century stamped on it more visibly than any other nation after China and the U.S. It's been an expanding force since at least 1991, explains journalist Luce, when India let go of much of the protectionist apparatus devised under Nehru after independence in 1947 from Britain, as part of a philosophy of swadeshi (or self-reliance) that's still relevant in India's multiparty democracy. From his vantage as the (now former) Financial Times's South Asia bureau chief, Luce illuminates the drastically lopsided features of a nuclear power still burdened by mass poverty and illiteracy, which he links in part to government control of the economy, an overwhelmingly rural landscape, and deep-seated institutional corruption. While describing religion's complex role in Indian society, Luce emphasizes an extremely heterogeneous country with a growing consumerist culture, a geographically uneven labor force and an enduring caste system. This lively account includes a sharp assessment of U.S. promotion of India as a countervailing force to China in a three-power &quot;triangular dance,&quot; and generally sets a high standard for breadth, clarity and discernment in wrestling with the global implications of New India.","torrent":{"xt":"urn:btih:e0a354cfc152725badc187af5bec64793e2ca3dc","amp;dn":"Edward+Luce+--+In+Spite+of+the+Gods-The+Strange+Rise+of+Modern+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0a354cfc152725badc187af5bec64793e2ca3dc","infoHashBuffer":{"type":"Buffer","data":[224,163,84,207,193,82,114,91,173,193,135,175,91,236,100,121,62,44,163,220]},"announce":[],"urlList":[]}}