{"title":"Fall Out Boy - Thanks For The Memories  (2nafish)","uid":5481460,"size":155105284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e102b41f1d00acc5bab7574e56ac1ca2a8d1ddeb&amp;dn=Fall+Out+Boy+-+Thanks+For+The+Memories++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1270461322,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Thnks fr th Mmrs&quot; (pronounced &quot;thanks for the memories&quot;) is a song by American rock band Fall Out Boy. The song was released as the third single from their fourth album Infinity on High.\n\nThe music video starts out with Patrick Stump and Pete Wentz talking before filming the video, with Patrick asking Pete asking if he was sure about something and Pete replies, &quot;Patrick, the guy's a fucking visionary.&quot; The song then starts up, and then all of a sudden, a monkey yells &quot;Cut!&quot; and calls the band a &quot;joke&quot;, complaining that he should have hired Panic! at the Disco, and then texts somebody on his phone, complaining that the band is &quot;wack&quot;. Later, Andy Hurley is replaced by another monkey, and when he tries to retrieve his drumsticks, he is thrown out of the studio. In one scene, Pete is shown receiving a phone call from William Beckett of fellow-Decaydance band The Academy Is.... Other scenes show the band playing the song on a brightly lit stage with the letters &quot;FOB&quot; in the background, and the band's different communications with the monkeys. Pete then sits on a bed and attempts to kiss Kim Kardashian, only to have the monkey stop him and show him the correct way to kiss her, which might be a reference to a similar scene in the film Mulholland Drive. Unhappy with the monkey's demands, Pete tries to leave, but then he and Kim kiss and Pete decides to stay. In the final scene, Pete breaks the choreography. As the monkey angrily complains about his behavior, he smashes his bass guitar into the &quot;B&quot; from the &quot;FOB&quot; lights on the back wall, similar to the music video for Sum 41's &quot;Still Waiting&quot;, then leaves the stage.\n\nThe &quot;FOB&quot; lights on the back wall of the video can be seen floating on the water in the music video for Fall Out Boy's &quot;What a Catch, Donnie&quot;.\n\nThe song peaked at #11 on the Billboard Hot 100, nine places lower than previous single &quot;This Ain't a Scene, It's an Arms Race&quot;.\n\nIn the UK, it peaked at #12, making it another top 20 hit for the band there. In New Zealand, the song hit #11. In Australia, it reached a peak of #3, after initially peaking at #4, and in Ireland it charted at #17.\n\nThe song also hit the Modern Rock Tracks chart in the U.S., where it charted at #19.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e102b41f1d00acc5bab7574e56ac1ca2a8d1ddeb","amp;dn":"Fall+Out+Boy+-+Thanks+For+The+Memories++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e102b41f1d00acc5bab7574e56ac1ca2a8d1ddeb","infoHashBuffer":{"type":"Buffer","data":[225,2,180,31,29,0,172,197,186,183,87,78,86,172,28,162,168,209,221,235]},"announce":[],"urlList":[]}}