{"title":"Copenhagen.2002.TVrip.Xvid","uid":5515233,"size":733782016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e154171c92a5f1398db6b0d60e562ac2d337978a&amp;dn=Copenhagen.2002.TVrip.Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Deadpool84","files":1,"time":1272226430,"description":"A television adaption of Michael Frayn's celebrated and award-winning stage play about the meeting between physicists Niels Bohr and Werner Heisenberg in 1941 Copenhagen. At this time the young Heisenberg was leading a faltering German reseach program into nuclear energy, while the middle-aged and apparently isolated Bohr was in contact with allied agents, and still held a position of great influence in the nuclear physics research community. After the meeting the two men put different interpretations impressions of why Heisenberg requested the meeting, and what he hoped to gain from it, a theme which mirrors the ambiguity of the &quot;Copenhagen&quot; interpretation widely used in quantum physics. Did Heisenberg go to the avuncular Bohr to seeking his blessing for his role in nuclear research? Why did Heisenberg concentrate on the development of a nuclear reactor, and not perform the calculations that would show that a bomb could be made to work via a fast-neturon reaction in Uranium 235. These and other questions feature in the plot, although unsurprisingly there few certain answers.","torrent":{"xt":"urn:btih:e154171c92a5f1398db6b0d60e562ac2d337978a","amp;dn":"Copenhagen.2002.TVrip.Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e154171c92a5f1398db6b0d60e562ac2d337978a","infoHashBuffer":{"type":"Buffer","data":[225,84,23,28,146,165,241,57,141,182,176,214,14,86,42,194,211,55,151,138]},"announce":[],"urlList":[]}}