{"title":"Philosophers without Gods Meditations on Atheism and the Secular","uid":8890346,"size":1835815,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1d7d04d4225c04e3fbf88636d41faa69e6594eb&amp;dn=Philosophers+without+Gods+Meditations+on+Atheism+and+the+Secular&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1378567425,"description":"Atheists are frequently demonized as arrogant intellectuals, antagonistic to religion, devoid of moral sentiments, advocates of an &quot;anything goes&quot; lifestyle. Now, in this revealing volume, nineteen leading philosophers open a window on the inner life of atheism, shattering these common stereotypes as they reveal how they came to turn away from religious belief. \nThese highly engaging personal essays capture the marvelous diversity to be found among atheists, providing a portrait that will surprise most readers. Many of the authors, for example, express great affection for particular religious traditions, even as they explain why they cannot, in good conscience, embrace them. None of the contributors dismiss religious belief as stupid or primitive, and several even express regret that they cannot, or can no longer, believe. Perhaps more important, in these reflective pieces, they offer fresh insight into some of the oldest and most difficult problems facing the human mind and spirit. For instance, if God is dead, is everything permitted? Philosophers without Gods demonstrates convincingly, with arguments that date back to Plato, that morality is independent of the existence of God. Indeed, every writer in this volume adamantly affirms the objectivity of right and wrong. Moreover, they contend that secular life can provide rewards as great and as rich as religious life. A naturalistic understanding of the human condition presents a set of challenges--to pursue our goals without illusions, to act morally without hope of reward--challenges that can impart a lasting value to finite and fragile human lives. \n\n'This Atheists R Us compilation differs markedly in tone from Hitchens and Dawkins. Excellent fare for Christian small groups whose members are genuinely interested in the arguments raised by atheists.'-- Christianity Today \n\n'Rather than the foolishness of Dawkins or Hitchens, these [essays] are compelling and sophisticated arguments that religious people ought to confront....'-- Tikkun\n\n'Taken as a group, these readable, personal, and provocative essays make it clear that there are many kinds of non-believers, and even many different elements that make up a single skeptical outlook. Contrary to the popular image, atheism isn't all rebellious trumpets and defiant drums. That part of the orchestra is essential, but here we have all the varieties of unreligious experience, a full symphony of unbelief.' -- Free Inquiry\n\n'This collection strikes me as an excellent example of how comprehensible philosophical writing can be at its best. By and large, the essays are written in a clear and direct style, free of philosophical jargon. Many who read it will find themselves also engaged at a level that is not merely academic.'--George I. Mavrodes, Notre Dame Philosophical Reviews","torrent":{"xt":"urn:btih:e1d7d04d4225c04e3fbf88636d41faa69e6594eb","amp;dn":"Philosophers+without+Gods+Meditations+on+Atheism+and+the+Secular","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1d7d04d4225c04e3fbf88636d41faa69e6594eb","infoHashBuffer":{"type":"Buffer","data":[225,215,208,77,66,37,192,78,63,191,136,99,109,65,250,166,158,101,148,235]},"announce":[],"urlList":[]}}