{"title":"The Beatles - Meet The Beatles [Mp3 320] TNT Village","uid":8940256,"size":66450966,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e21dbdb078317b39d3ade0b346db5d97426ae55d&amp;dn=The+Beatles+-+Meet+The+Beatles+%5BMp3+320%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"l.diliberto","files":12,"time":1379642664,"description":"The Beatles - Meet The Beatles [Mp3 320] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=360273&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=360273&lt;/a&gt;\n\nAnno: 20 January 1964\nGenere: Rock\n\nMost can call it from memory: the image of the Beatles disembarking from their plane on a cold February day in New York. Less visible in the old black-and-white film footage, but perhaps more important, is a young girl clutching a copy of the Beatles' just-released second album, Meet the Beatles!, as if the world depended on it. And, to her and millions of other young people, it did. Meet the Beatles! wasn't simply an album; it gave the intangible yearnings of youth a voice and a face (actually, four voices and four faces), and it created a parallel world where escape was only a turntable away. Today, Meet the Beatles! is a collectible in danger of becoming forgotten, if not for the diligence of Beatles fans around the world. Compact discs have replaced vinyl, and the decision to release the original U.K. versions of the Beatles' albums in favor of their U.S. counterparts has rendered albums like Meet the Beatles! and The Beatles' Second Album obsolete. But nothing could make the music on these LPs obsolete. The infectious charm of songs like &quot;I Want to Hold Your Hand,&quot; &quot;I Saw Her Standing There,&quot; &quot;It Won't Be Long,&quot; and &quot;All My Loving&quot; still weave their magic which, if less potent in an age jaded by a generation of musicians who had the benefit of the Beatles' songbook tucked underneath their arms, still carries an aura around it -- just as the first moon landing will never be eclipsed by subsequent forays into space. Meet the Beatles! soon topped the charts, aided by electric appearances on the Ed Sullivan Show that carried the flames of Beatlemania across the ocean, and (together with the single &quot;She Loves You&quot;) kicked off a string of number one singles and albums. Most of the songs were holdovers from the U.K. album With the Beatles, released two months earlier. Capitol, who wisely decided that there might be money in releasing the band's work in the U.S., chose original tracks from their second U.K. album and added the contents of a recent U.S. single plus a B-side, John Lennon's ballad &quot;This Boy,&quot; to the mix. This created the illusion that the Beatles wrote all their own material (since only Meredith Willson's &quot;Till There Was You&quot; was a non-original), an illusion dispelled by the necessarily cover-heavy The Beatles' Second Album. So, in many ways, Meet the Beatles! distilled what was best about the band: original material from Lennon, Paul McCartney, and even George Harrison (his first, &quot;Don't Bother Me&quot;). Everyone gets a chance to sing, including Ringo Starr (&quot;I Wanna Be Your Man,&quot; which Rolling Stones manager Andrew Loog Oldham had coaxed from the band earlier), and the mix of rockers and ballads proves to be a beautiful blend. Let compact disc companies try their hand at historical revision: they can't steal the memories of Americans who still remember how they first met the Beatles, any more than they could pry that album from that young girl's hands. \n\n.: Cover :.\n &lt;a href=&quot;\nhttp://media.tumblr.com/fe4b578da4b07327d74d1cfb0eeb2c62/tumblr_inline_mhh484Unxn1r4bjen.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.tumblr.com/fe4b578da4b07327d74d1cfb0eeb2c62/tumblr_inline_mhh484Unxn1r4bjen.jpg&lt;/a&gt;\n\n.: Tracklist :.\n\nSide one\n\n1. &quot;I Want to Hold Your Hand&quot;\n2. &quot;I Saw Her Standing There&quot;\n3. &quot;This Boy&quot;\n4. &quot;It Won't Be Long&quot;\n5. &quot;All I've Got to Do&quot;\n6. &quot;All My Loving&quot;\nSide two\n\n1. &quot;Don't Bother Me&quot;\n2. &quot;Little Child&quot;\n3. &quot;Till There Was You&quot;\n4. &quot;Hold Me Tight&quot;\n5. &quot;I Wanna Be Your Man&quot;\n6. &quot;Not A Second Time&quot; ","torrent":{"xt":"urn:btih:e21dbdb078317b39d3ade0b346db5d97426ae55d","amp;dn":"The+Beatles+-+Meet+The+Beatles+%5BMp3+320%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e21dbdb078317b39d3ade0b346db5d97426ae55d","infoHashBuffer":{"type":"Buffer","data":[226,29,189,176,120,49,123,57,211,173,224,179,70,219,93,151,66,106,229,93]},"announce":[],"urlList":[]}}