{"title":"Ben Dragon's  - Freedom","uid":10155749,"size":8217103,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e262aeef3ed0a737cec6a1b01daa184e57a92cf2&amp;dn=Ben+Dragon%27s++-+Freedom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Thomas-C","files":1,"time":1400159614,"description":"In this lecture Ben Dragon talks about what &quot;Freedom&quot; really is and how this word, \n(and similar words), are used to manipulate the actions of the public.\n\n\n\n\nThis is a supplement to his book but I'm sure that everyone will find some great! info in it as I did.\n\nI found his stuff REALLY GOOD and I loved his book!.. something that I found tremendously insightful and very helpful in understanding what is going on in this world, who is running it and how they are doing it, and it was a fantastic help in my understanding of myself and the reason that I am here! The ending of his book just BLEW ME AWAY!\n\n\n\nThis guy not only sees through the system, but PROVIDES SOLUTIONS and give answers. Answers that helped me a lot. That's a hell of a lot more than other researchers can say who just constantly say that the sky is falling and provide nothing! to help us.\n\nI realize that most people just entertainment themselves reading other people's work &amp; distracting themselves from reality, but I actually personally benefited from reading what this guy has to say! So I thought that I would share it with others.\n\n\n\nOh... the website that I got it from was;\n\n\n                    clarity.sf-w.net\n\n\n\n\nBen Dragon's E-mail address is:\n\n\n                     b-c AT sf-w.net\n\n\n\nHe has lots more stuff up on his site, but I only have a DSL line and uploads suck!\n\n\n\nHe has more stuff about this and other things on his website.\n\n\nI hope you all like it as much as I do.\n\n\nThomas C.","torrent":{"xt":"urn:btih:e262aeef3ed0a737cec6a1b01daa184e57a92cf2","amp;dn":"Ben+Dragon%27s++-+Freedom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e262aeef3ed0a737cec6a1b01daa184e57a92cf2","infoHashBuffer":{"type":"Buffer","data":[226,98,174,239,62,208,167,55,206,198,161,176,29,170,24,78,87,169,44,242]},"announce":[],"urlList":[]}}