{"title":"[HDLove] Janice Griffith (Sexy Janice / 07.17.2014)","uid":10571488,"size":762330700,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e3505f052bad8ca896839d02b2e0fe5eaf344d2b&amp;dn=%5BHDLove%5D+Janice+Griffith+%28Sexy+Janice+%2F+07.17.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"chkm8te","files":1,"time":1405582503,"description":"[HDLove] Janice Griffith (Sexy Janice / 07.17.2014)\n\nWhat better way is there to impress a sexy babe than by showing of your skills as a musician? Everyone knows hot chicks dig musicians. When this HD Love episode started, we saw Brick at the piano playing a soft serenade on the keys. His girl Janice heard the melody from the next room and entered silently behind him. When he turned around to find her there, a big smile came across his face. We knew exactly why because Janice was a smoking hot babe that was wearing nothing but lingerie. Brick went on and tried to finish his song, but when Janice started rubbing her nice big tits together and biting her lip, he had nothing on his mind but that sweet pussy that was awaiting him. They started to make out, and Brick began undressing Janice. He pulled out those incredible teen tits and started kissing them. Then he pulled off her panties and licked that pussy until Janice was panting and soaking wet. Janice returned the favor by getting on her knees, stroking his cock, and taking that dick down her throat. She sucked that cock passionately like a true freak and had us dying to see her skills at sex. Brick entered that tight snatch and stroked it softly while Janice rubbed her clit and orgasmed. Then she got on top and showed us what we wanted. Janice gave us the perfect view as she worked that hot pussy. It was amazing. After that, Brick pounded Janice hard and deep until he was at wits end. When Janice knew he was going to cum, she got down on her knees and stuck her tongue out to receive his load. Brick held nothing back and unleashed a pool of cum into her mouth and all over her pretty face. This is one HOT HD Love video you will not want to miss!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=po6tksjl7rwi22cfg9mi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=po6tksjl7rwi22cfg9mi.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=1ulkzswajap81u5szrb9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=1ulkzswajap81u5szrb9.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e3505f052bad8ca896839d02b2e0fe5eaf344d2b","amp;dn":"%5BHDLove%5D+Janice+Griffith+%28Sexy+Janice+%2F+07.17.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3505f052bad8ca896839d02b2e0fe5eaf344d2b","infoHashBuffer":{"type":"Buffer","data":[227,80,95,5,43,173,140,168,150,131,157,2,178,224,254,94,175,52,77,43]},"announce":[],"urlList":[]}}