{"title":"Ken Burns Jazz","uid":7087084,"size":347377623,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e3a8781cbce226534873e106610c8759400a9896&amp;dn=Ken+Burns+Jazz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"yezuit666","files":94,"time":1331228241,"description":"The title says it all: Ken Burns JAZZ: The History of America's Music. This 5CD set starts off right from the beginning with a 1931 of Louis Armstrong's &quot;Star Dust&quot; and heads through jazz history ending up with 1992's &quot;Take the &quot;A&quot; Train&quot; by The Lincoln Center Jazz Orchestra. In between, you hear from such greats as Duke Ellington, Benny Goodman, Count Basie, Billie Holiday, Charlie Parker, Thelonious Monk, Miles Davis, John Coltrane, and yes, even Herbie Hancock with 1983's groundbreaking &quot;Rockit&quot;. The set may seem to get out of the gate quite slowly for those just getting introduced to jazz. Also, don't expect miracles in sound quality on the first disc or two. There is just no way you can remove all the hiss from The Original Dixieland Jazz Band's 1917 recording of &quot;Livery Stable Blues&quot;.\n\nBesides going over the favorites and well known artists, this set also branches out to the lesser known artists (at least to me) such as The Dave Brubeck Quartet. By simply going through the beautiful 40+ page color book included, I have stumbled upon unbelievable music that I simply didn't know existed.\n\nI am no music critic, so I won't go into the review of the actual tracks but who should? This is one set that no one should be criticizing. If you want to get into jazz and are looking for something that give you a nice overview, this set is for you. Each disc is absolutely packed, with some discs hitting the 78 minute mark. You won't be disappointed if you pick up this set!\n","torrent":{"xt":"urn:btih:e3a8781cbce226534873e106610c8759400a9896","amp;dn":"Ken+Burns+Jazz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3a8781cbce226534873e106610c8759400a9896","infoHashBuffer":{"type":"Buffer","data":[227,168,120,28,188,226,38,83,72,115,225,6,97,12,135,89,64,10,152,150]},"announce":[],"urlList":[]}}