{"title":"History Channel - The Lost Pyramid (2008)","uid":10489314,"size":733954766,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3fe76f8cd1a0403291c553db168126d7ee91f77&amp;dn=History+Channel+-+The+Lost+Pyramid+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sfbeaudry","files":1,"time":1404521627,"description":"For the first time on television, HISTORYÂ® reveals stunning discoveries that completely alter our understanding of the famous Egyptian temple complex at Giza.\n\n- For years it was believed that the pharaoh Radjedef's temple complex was merely - unfinished.\n- Modern technologies like ground-penetrating radar and CGI illuminate ancient mysteries.\n- HISTORYÂ® has exclusive access to one of the most important Egyptian excavations in decades.\n\n\nThe true glory of Giza is revealed for the first time in 5000 years.\n\nThe unimpressive mound lay ignored for centuries. No one expected evidence hidden under this isolated, unspectacular pile of mud and stone to completely alter our understanding of the famous necropolis on the Giza Plateau, which includes the Great Pyramid and the Great Sphinx.\n\nBut thanks to the groundbreaking work of the world's most respected Egyptologists, we now recognize this structure as the lost burial site of Radjedef, son of the hated Khufu. Built in a seven-year frenzy, this forgotten and much-plundered pyramid was in fact a full sixty feet taller than the Great Pyramid. This one-of-a-kind documentary is the exclusive chronicle of the most recent and exhaustive excavation of the LOST PYRAMID.\n\nJoin an all-star international team of scientists, including Michel Vallogia of Geneva University, Joanne Rowlands of Oxford University, and led by the Head of Egypt's Supreme Council of Antiquities, Dr Zahi Hawass, as they rediscover the fourth and greatest of the pyramids. By tunneling under the pyramid and using advanced technology, including ground-penetrating radar, the experts lay bare the structure of Radjedef's pyramid, identify its layout, and establish the individual chambers. The team also shows how the rediscovery and attribution of Radjedef's pyramid provides the missing clues to build a definitive blueprint of the Giza Plateau.\n\nThe true nature of the LOST PYRAMID could be the last great archeological discovery in Egypt, and with HISTORYÂ® you won't miss a moment.","torrent":{"xt":"urn:btih:e3fe76f8cd1a0403291c553db168126d7ee91f77","amp;dn":"History+Channel+-+The+Lost+Pyramid+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3fe76f8cd1a0403291c553db168126d7ee91f77","infoHashBuffer":{"type":"Buffer","data":[227,254,118,248,205,26,4,3,41,28,85,61,177,104,18,109,126,233,31,119]},"announce":[],"urlList":[]}}