{"title":"The Bias Against Guns (2003) by John Richard Lott Jr.","uid":10121966,"size":1752215,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e447113f7ec41784ee0d250bc0d58afbf478c13c&amp;dn=The+Bias+Against+Guns+%282003%29+by+John+Richard+Lott+Jr.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sakstroy","files":-1,"time":1399685293,"description":"The Bias Against Guns - Why Almost Everything You'Ve Heard About Gun Control Is Wrong (2003) by John Richard Lott Jr.pdf\n\nFollowing up on his controversial study More Guns, Less Crime, economist Lott argues that widespread gun ownership prevents crime. He cites survey data and news reports to argue that the fear that victims might be armed strongly deters criminals, and that guns are used in self-defense or to ward off criminal threats about 2.3 million times a year. Because they impede law-abiding citizens' access to guns, even mild gun-control regulations-assault weapons bans, &quot;one-gun-a-month&quot; laws-actually increase crime, according to Lott, while right-to-carry laws lower crime and help prevent (or violently terminate) terrorist attacks and &quot;rampage&quot; shootings. Even measures to keep guns away from children, like &quot;gun-free school zones&quot; and &quot;safe storage&quot; laws that require guns to be locked away, are misguided because children need guns for self-defense (he cites news reports of kids as young as 11 gunning down criminals). The benefits of untrammeled gun availability are clear, Lott insists, and only the anti-gun bias and selective reporting by the media and government officials have kept this fact out of public consciousness. Lott supports his bold claims with elaborate statistical analyses that tease sometimes small effects out of the welter of factors that influence crime rates; there are lots of graphs and tables, and much space is devoted to scholarly discussions of statistical methodologies. Many readers will find these sections rough going, but Lott's provocative thesis is sure to stir interest among second-amendment stalwarts and gun-control supporters alike. \n\n349 pages\nPublisher: Regnery Publishing (February 1, 2003)\nLanguage: English\nISBN-10: 0895261146\nISBN-13: 978-0895261144","torrent":{"xt":"urn:btih:e447113f7ec41784ee0d250bc0d58afbf478c13c","amp;dn":"The+Bias+Against+Guns+%282003%29+by+John+Richard+Lott+Jr.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e447113f7ec41784ee0d250bc0d58afbf478c13c","infoHashBuffer":{"type":"Buffer","data":[228,71,17,63,126,196,23,132,238,13,37,11,192,213,138,251,244,120,193,60]},"announce":[],"urlList":[]}}