{"title":"2030-Technology That Will Change the World[Team Nanban][TPB] ","uid":7009273,"size":2196412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e49a07de7f83ebf824dbd26a610cc3dde10a01de&amp;dn=2030-Technology+That+Will+Change+the+World%5BTeam+Nanban%5D%5BTPB%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"594mgnav","files":3,"time":1328380629,"description":"2030-Technology That Will Change the World[Team Nanban][TPB]\n\nAUTHOR: Rutger van Santen, Djan Khoe, and Bram Vermeer\n\n2010 | ISBN: 0195377176 | 304 pages | PDF | 1,2 MB\n\nDESCRIPTION:\n\nImagine living in 1958, and knowing that the integrated circuit--the microchip--was about to be invented, and would revolutionize the world. Or imagine 1992, when the Internet was about to transform virtually every aspect of our lives. Incredibly, this book argues that we stand at such a moment right now--and not just in one field, but in many.\n\nIn 2030, authors Rutger van Santen, Djan Khoe, and Bram Vermeer interview over two dozen scientific and technological experts on themes of health, sustainability and communication, asking them to look forward to the year 2030 and comment on the kind of research that will play a necessary role. If we know what technology will be imperative in 2030, the authors reason, what can we do now to influence future breakthroughs?\n\nDespite working in dissimilar fields, the experts called upon in the book - including Hans Blix (Head of the UN investigation in Iraq), Craig Venter (explorer of the human DNA), and Susan Greenfield (a leading world authority on the human brain), among many others - all emphasize the interconnectedness of our global networks in technology and communication, so tightly knit that the world's major conflicts are never isolated incidents. A fresh understanding of the regularities underlying these complex systems is more important than ever.\n\nUsing bright, accessible language to discuss topics of universal interest and relevance, 2030 takes the position that we can, in fact, influence the course of history. It offers a new way of looking forward, a fresh perspective on sustainability, stability and crisis-prevention. For anyone interested in modern science, this book will showcase the technologies that will soon change the way we live.\n\nPLZ SEED AFTER DOWNLOADING..\n\n&quot;SHARING IS CARING&quot;\n\nif u like my releases, then plz add +rep to me in this link.\n              &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=277915&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=277915&lt;/a&gt;\t","torrent":{"xt":"urn:btih:e49a07de7f83ebf824dbd26a610cc3dde10a01de","amp;dn":"2030-Technology+That+Will+Change+the+World%5BTeam+Nanban%5D%5BTPB%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e49a07de7f83ebf824dbd26a610cc3dde10a01de","infoHashBuffer":{"type":"Buffer","data":[228,154,7,222,127,131,235,248,36,219,210,106,97,12,195,221,225,10,1,222]},"announce":[],"urlList":[]}}