{"title":"Jamey Johnson-That Lonesome Song (2007-VBR-Country)","uid":4169966,"size":57992835,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e4a6c676907e536b2d6aa947f69cc147361aa061&amp;dn=Jamey+Johnson-That+Lonesome+Song+%282007-VBR-Country%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cheng","files":14,"time":1209814023,"description":" &lt;a href=&quot;http://www.audiolunchbox.com/images/albums/153k/153629-500.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.audiolunchbox.com/images/albums/153k/153629-500.jpg&lt;/a&gt;\n\n-=Jamey Johnson=-\n\nSinger/songwriter Jamey Johnson is just as comfortable mopping up the tears on the barroom floor with an old Hank Williams-style ballad as he is tearing the roof off with a honky tonk juggernaut. The Alabama native and ex-Marine rose to the top of the Nashville food chain through blood, sweat, and tears. Raised in a devout and deeply musical family helped the new traditionalist find his voice, but it wasn&amp;#039;t until he moved to Music City that the world began to take notice. After laying low for nearly a year, he began appearing at songwriter nights, where he met other writers. As his peers began securing publishing deals, they would ask Johnson to sing on their demos. In 2002, mutual friend and songwriter Randy Hardison turned producer/songwriter Buddy Cannon on to Johnson -- the two became close friends and allies after Hardison&amp;#039;s death later in the year. Johnson&amp;#039;s next convert was publisher Gary Overton, who signed the budding songwriter to EMI. In April of 2005, Johnson signed a record contract with BNA and released his debut, The Dollar, in January of 2006. ~ James Christopher Monger, All Music Guide\n\n---------------------------------------------------------------\n  &gt; Jamey Johnson - That Lonesome Song\n                                      \nArtist...[ Jamey Johnson              \nTitle....[ That Lonesome Song         \nGenre....[ Country                    \nYear.....[ 2007                       \nEncoder..[ LAME3.97 (-V2 --vbr-new)   \nBitrate..[ VBRkbps                    \nQuality..[ Joint-Stereo               \nkHz......[ 44.1kHz                    \nSource...[ CDDA                       \nDate.....[ May-02-2008                \nType.....[ Album                      \nSize.....[ 55,3 MB                    \nLable....[ Big Gassed Records         \nCat.Nr...[ n/a                        \nURL......[ www.jameyjohnson.com       \n\n---------------------------------------------------------------\nNr. ARTIST/TRACK.                                         Time.\n---------------------------------------------------------------\n01  released                                              00:40\n02  high cost of living                                   05:47\n03  angel                                                 04:30\n04  the door is always open                               03:37\n05  mary go round                                         04:55\n06  in color                                              04:54\n07  leave you alone                                       04:26\n08  that lonesome song                                    04:04\n09  dreaming my dreams                                    03:37\n10  next ex thing                                         05:59\n11  women                                                 03:25\n                                                          -----\n                                                  TOTAL:  45:54 min\n---------------------------------------------------------------\nJamey Johnson was raised in Montgomery, Ala., and grew up      \ninfluenced by that state&amp;#039;s famous country musicians such as    \nHank Williams Jr., Vern Gosdin and the band, Alabama. He first \npicked up the guitar when he was around 10 years old when his  \n                                                               \nuncle taught him to play Alabama&amp;#039;s &quot;My Home&amp;#039;s in Alabama.&quot; As a\nteenager, he saved enough money to buy an Epiphone guitar he   \ndubbed Old Maple. On Saturday nights, he and his friends would \ngo to the grave of Hank Williams on the hill above Montgomery  \nto drink beer and sing the legend&amp;#039;s songs. One night he dropped\nOld Maple on the tombstone and splintered its bottom. The      \ninstrument bears that scar to this day.                        \n                                                               \nHe began his singing career in the clubs of Montgomery. His    \nfather thought his son might become a music teacher or a band  \ndirector. But after two years of college, Jamey abruptly quit  \nschool in 1994. For the next eight years he served in the      \nMarine Corps Reserve and perfected his country singing style.  \nThe same week he was discharged, the rest of his unit was      \nordered to Iraq.                                               \n                                                               \nHaving paid his dues in the honky-tonks of Alabama, Johnson    \ngave Nashville a try. He arrived on Jan. 1, 2000, and took a   \njob as a salesman for a sign company. Then he worked for an    \nindustrial pumping company. From 2001 until 2004, he helped run\na construction firm, restoring buildings devastated by fires,  \nhurricanes or tornados.                                        \n                                                               \nIn time, he started singing at songwriter nights and met other \nsongwriters. When those writers got publishing deals, they     \nhired Johnson to sing demos. (His first one was a duet with    \nGretchen Wilson, also a demo singer at the time.) One of those \nwriters, Randy Hardison, praised his talent to producer Buddy  \nCannon. They decided to co-produce some demos for Johnson, but \nHardison was murdered in 2002. The sudden loss brought Johnson \nand Cannon closer together.                                    \n                                                               \nProceeding with their goals, Cannon produced some demos for    \nJohnson and helped secure him a publishing deal. (He co-wrote  \nthe Trace Adkins hit, &quot;Honky Tonk Badonkadonk.&quot;) Johnson       \nstruggled to find a record deal, though, until his seventh     \naudition for RCA Records in April 2005. The label will release \nhis debut album, The Dollar, in early 2006.                    \n","torrent":{"xt":"urn:btih:e4a6c676907e536b2d6aa947f69cc147361aa061","amp;dn":"Jamey+Johnson-That+Lonesome+Song+%282007-VBR-Country%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4a6c676907e536b2d6aa947f69cc147361aa061","infoHashBuffer":{"type":"Buffer","data":[228,166,198,118,144,126,83,107,45,106,169,71,246,156,193,71,54,26,160,97]},"announce":[],"urlList":[]}}