{"title":"Navidad Jazz- Nat_King_Cole-The_Christmas_Song-Remastered-CD-200","uid":5220577,"size":58673205,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e4b15bf4603aa23c5dbe528aae30f8b30a5ac1d4&amp;dn=Navidad+Jazz-+Nat_King_Cole-The_Christmas_Song-Remastered-CD-200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tonkepen","files":23,"time":1260912815,"description":"Su padre Edward Coles era carnicero y diÃƒÂ¡cono en la Iglesia Bautista. Su familia se trasladÃƒÂ³ a Chicago cuando Nat era todavÃƒÂ­a un niÃƒÂ±o. AllÃƒÂ­, su padre se convirtiÃƒÂ³ en ministro de la iglesia y su madre, Perlina Adams, era la encargada de tocar el ÃƒÂ³rgano de la iglesia. Fue la ÃƒÂºnica maestra de piano que tuvo Nat en toda su vida. AprendiÃƒÂ³ tanto jazz como mÃƒÂºsica gospel, sin olvidar la mÃƒÂºsica clÃƒÂ¡sica.\n\nLa familia vivÃƒÂ­a en el barrio de Bronzeville, famoso a finales de los aÃƒÂ±os 20 por su vida nocturna y sus clubes de jazz. Nat visitÃƒÂ³ con frecuencia estos locales, escuchando a artistas como Louis Armstrong o Earl Hines.\n\nInspirado por Hines, Nat iniciÃƒÂ³ su carrera artÃƒÂ­stica a mediados de la dÃƒÂ©cada de los 30 cuando aÃƒÂºn era un adolescente. AdoptÃƒÂ³ el nombre de Nat Cole, abandonando la &quot;s&quot; de su apellido familiar. Su hermano mayor, Eddie, bajista, se uniÃƒÂ³ a la banda de Nat cuando este realizÃƒÂ³ su primera grabaciÃƒÂ³n en 1936. Tuvieron un cierto ÃƒÂ©xito como banda local en Chicago y se convirtieron en habituales en los escenarios de los clubes. De hecho, el sobrenombre de &quot;King&quot; (rey) se lo dieron a Nat en uno de estos locales. Cole participÃƒÂ³ tambiÃƒÂ©n como pianista en una gira junto a Eubie Blake. Cuando la gira llegÃƒÂ³ a Long Beach (California), Nat decidiÃƒÂ³ establecerse allÃƒÂ­.\n","torrent":{"xt":"urn:btih:e4b15bf4603aa23c5dbe528aae30f8b30a5ac1d4","amp;dn":"Navidad+Jazz-+Nat_King_Cole-The_Christmas_Song-Remastered-CD-200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b15bf4603aa23c5dbe528aae30f8b30a5ac1d4","infoHashBuffer":{"type":"Buffer","data":[228,177,91,244,96,58,162,60,93,190,82,138,174,48,248,179,10,90,193,212]},"announce":[],"urlList":[]}}