{"title":"Jonathan Kellermans' Victims (epub format)","uid":7125996,"size":412399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4fa9af65a791acd11b3cd518625d5492339cc37&amp;dn=Jonathan+Kellermans%27+Victims+%28epub+format%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Bookeek","files":3,"time":1332533720,"description":"Alex Delaware # 27 \n\nVictims\n\nUnraveling the madness behind L.A.'s most baffling and brutal homicides is what sleuthing psychologist Alex Delaware does best. And putting the good doctor through his thrilling paces is what mystery fiction's #1 bestselling master of psychological suspense Jonathan Kellerman does with incomparable brilliance. Kellerman's universally acclaimed novels blend the addictive rhythms of the classic police procedural with chilling glimpses into the darkest depths of the human condition. For the compelling proof, look no further than Victims - Kellerman at his razor-sharp, harrowing finest.\n\nNot since Jack the Ripper terrorized the London slums has there been such a gruesome crime scene. By all accounts, acid-tongued Vita Berlin hadn't a friend in the world, but whom did she cross so badly as to end up arranged in such a grotesque tableau? One look at her apartment-turned-charnel house prompts hard-bitten LAPD detective Milo Sturgis to summon his go-to expert in hunting homicidal maniacs, Alex Delaware. But despite his finely honed skills, even Alex is stymied when more slayings occur in the same ghastly fashion . . . yet with no apparent connection among the victims. And the only clue left behind - a blank page bearing a question mark - seems to be both a menacing taunt and a cry for help from a killer baffled by his own lethal urges.\n\nUnder pressure to end the bloody spree and prevent a citywide panic, Milo redoubles his efforts to discover a link between the disparate victims. Meanwhile, Alex navigates the secretive world of mental health treatment, from the sleek office of a Beverly Hills therapist to a shuttered mental institution where he once honed his craft - and where an unholy alliance between the mad and the monstrous may have been sealed in blood. As each jagged piece of the puzzle fits into place, an ever more horrific portrait emerges of a sinister mind at its most unimaginable - and an evil soul at its most unspeakable. 'This one was different,' Alex observes at the start of the case. This one will haunt his waking life, and his darkest dreams, long after its end.","torrent":{"xt":"urn:btih:e4fa9af65a791acd11b3cd518625d5492339cc37","amp;dn":"Jonathan+Kellermans%27+Victims+%28epub+format%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4fa9af65a791acd11b3cd518625d5492339cc37","infoHashBuffer":{"type":"Buffer","data":[228,250,154,246,90,121,26,205,17,179,205,81,134,37,213,73,35,57,204,55]},"announce":[],"urlList":[]}}