{"title":"L.Ispettore.Coliandro.2x03.Doppia.Rapina.iTA","uid":4707569,"size":735567711,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e502589035b6e01aa5ee307feab6a7d2a8683fcb&amp;dn=L.Ispettore.Coliandro.2x03.Doppia.Rapina.iTA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jsph69","files":2,"time":1233911352,"description":"Doppia rapina\n\nIn onda martedÃƒÂ¬ 3 febbraio 2009 alle 21.05 su Rai Due\n\nSceneggiatura di Carlo Lucarelli e Giampiero Rigosi.\nUn gruppo di rapinatori mascherati fa irruzione in una banca prendendo in ostaggio clienti e impiegati per fare aprire dal direttore la cassaforte nel caveau. In una  toilette della banca si trova, perÃƒÂ², Coliandro che, accortosi del tentativo di rapina, riesce ad avvertire i suoi colleghi che arrivano per trattare con i criminali.\nNel frattempo la situazione all'interno della banca si ÃƒÂ¨ capovolta: tre criminali veri che devono recuperare degli importantissimi documenti prima di essere raggiunti da un mandato di cattura emesso dalla dottoressa Longhi, approfittano della situazione per agire: ed ecco che rapinatori (criminali da quattro soldi con armi finte) e ostaggi si trovano prigionieri di feroci banditi pronti a tutto. Ma non hanno fatto i conti con Coliandro che metterÃƒÂ  i bastoni fra le ruote ai veri criminali, in modo rocambolesco e non procedurale.\nRientra in scena Alessia (Cecilia Dazzi) giÃƒÂ  incontrata nell'episodio &quot;In trappola&quot; della prima serie: dopo la morte del fratello decide di cambiare vita e di lavorare in banca dove fortunosamente si imbatterÃƒÂ  nuovamente nel nostro ispettore, sequestrato da una banda di rapinatori insieme ad alcuni clienti.\n","torrent":{"xt":"urn:btih:e502589035b6e01aa5ee307feab6a7d2a8683fcb","amp;dn":"L.Ispettore.Coliandro.2x03.Doppia.Rapina.iTA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e502589035b6e01aa5ee307feab6a7d2a8683fcb","infoHashBuffer":{"type":"Buffer","data":[229,2,88,144,53,182,224,26,165,238,48,127,234,182,167,210,168,104,63,203]},"announce":[],"urlList":[]}}