{"title":"The Big Book of Brain Building Games - Edward E. Scannell &amp; ","uid":9337063,"size":3704691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5139c94c5a0c742c1258b33e7931b3e80b4838c&amp;dn=The+Big+Book+of+Brain+Building+Games+-+Edward+E.+Scannell+%26amp%3B+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386871218,"description":"Games for better brains!\n\nUse the secrets of brain science to improve communication, interpersonal relations, and productivity in any team or group\n\nJump-start any training session, workshop, or retreat with dozens of interactive games that build brain function in fun and engaging ways. The Big Book of Brain-Building Games offers all kinds of stimulating games to help your team improve information retention, camaraderie, and productivity--and requires few or no props. You'll learn what triggers to pull to help your group think and work better with these play-anywhere, crowd-pleasing interactive games.\n\nCan your brain handle the fun?\n\nSpeakers and facilitators know that if you don't engage participants every five to seven minutes, you'll lose them! The Big Book of Brain-Building Games adds the spark you need for a successful meeting and keeps your team alert and connected, whatever the task. With just a handful of materials required, these brain-boosting games will help participants:\ndevelop leadership skills and build self-confidence enhance problem-solving strategies and boost creativity learn cooperation and effective teamwork dramatically improve communications skills--from public speaking to active listening\n\nPlus the icebreakers are guaranteed to grab--and hold--any group's attention! You'll find it all in this latest collection from the trusted Big Books series.","torrent":{"xt":"urn:btih:e5139c94c5a0c742c1258b33e7931b3e80b4838c","amp;dn":"The+Big+Book+of+Brain+Building+Games+-+Edward+E.+Scannell+%26amp%3B+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5139c94c5a0c742c1258b33e7931b3e80b4838c","infoHashBuffer":{"type":"Buffer","data":[229,19,156,148,197,160,199,66,193,37,139,51,231,147,27,62,128,180,131,140]},"announce":[],"urlList":[]}}