{"title":"#003 - John Lennon/Plastic Ono Band (John Lennon)","uid":4302303,"size":95487429,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e56762a5cee8f77702ca491b24b6ff10666a9267&amp;dn=%23003+-+John+Lennon%2FPlastic+Ono+Band+%28John+Lennon%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"West-Independent","files":12,"time":1216371054,"description":"#003 in the West Independent catalog. Originally released in 1970. \n\n\nReview\t       by Stephen Thomas Erlewine\n\nThe clichÃƒÂ© about singer/songwriters is that they sing confessionals direct from their heart, but John Lennon exploded the myth behind that clichÃƒÂ©, as well as many others, on his first official solo record, John Lennon/Plastic Ono Band. Inspired by his primal scream therapy with Dr. Arthur Janov, Lennon created a harrowing set of unflinchingly personal songs, laying out all of his fears and angers for everyone to hear. It was a revolutionary record -- never before had a record been so explicitly introspective, and very few records made absolutely no concession to the audience&amp;#039;s expectations, daring the listeners to meet all the artist&amp;#039;s demands. Which isn&amp;#039;t to say that the record is unlistenable. Lennon&amp;#039;s songs range from tough rock &amp; rollers to piano-based ballads and spare folk songs, and his melodies remain strong and memorable, which actually intensifies the pain and rage of the songs. Not much about Plastic Ono Band is hidden. Lennon presents everything on the surface, and the song titles -- &quot;Mother,&quot; &quot;I Found Out,&quot; &quot;Working Class Hero,&quot; &quot;Isolation,&quot; &quot;God,&quot; &quot;My Mummy&amp;#039;s Dead&quot; -- illustrate what each song is about, and charts his loss of faith in his parents, country, friends, fans, and idols. It&amp;#039;s an unflinching document of bare-bones despair and pain, but for all its nihilism, it is ultimately life-affirming; it is unique not only in Lennon&amp;#039;s catalog, but in all of popular music. Few albums are ever as harrowing, difficult, and rewarding as John Lennon/Plastic Ono Band.\n\nBiography\tby Stephen Thomas Erlewine\n\nOut of all the Beatles, John Lennon had the most interesting -- and frustrating -- solo career. Lennon was capable of inspired, brutally honest confessional songwriting and melodic songcraft; he also had a tendency to rest on his laurels, churning out straight-ahead rock &amp; roll without much care. But the extremes, both in his music and his life, were what made him fascinating. Where Paul McCartney was content to be a rock star, Lennon dabbled in everything from revolutionary politics to the television talk-show circuit during the early &amp;#039;70s. After releasing a pair of acclaimed albums, John Lennon/Plastic Ono Band and Imagine, in the early &amp;#039;70s, Lennon sunk into an infamous &quot;lost weekend&quot; where his musical output was decidedly uneven and his public behavior was often embarrassing. Halfway through the decade, he sobered up and retired from performing to become a house-husband and father. In 1980, he launched a comeback with his wife Yoko Ono, releasing the duet album Double Fantasy that fall. Just as his career was on an upswing, Lennon was tragically assassinated outside of his New York apartment building in December of 1980. He left behind an enormous legacy, not only as a musician, but as a writer, actor and activist.\n\nConsidering the magnitude of his achievements with the Beatles, Lennon&amp;#039;s solo career is relatively overlooked. Even during the height of Beatlemania, Lennon began exploring outside of the group. In 1964, he published a collection of his writings called In His Own Write, which was followed in 1965 by A Spaniard in the Works, and in 1966, he appeared in Dick Lester&amp;#039;s comedy How I Won the War. He didn&amp;#039;t pursue a musical career outside of the group until 1968, when he recorded the experimental noise collage Unfinished Music, No. 1: Two Virgins with his new lover, avant-garde artist Yoko Ono. Two Virgins caused considerable controversy, both because of its content and its cover art, which featured a nude photograph of Lennon and Ono. The couple married in Gibraltar in March 20, 1969. For their honeymoon, the pair staged the first of many political demonstrations with their &quot;Bed-In for Peace&quot; at the Amsterdam Hilton. Several months later, the avant-garde records Unfinished Music, No. 2: Life With the Lions and The Wedding Album were released, as was the single &quot;Give Peace a Chance,&quot; which was recorded during the Bed-In. During September of 1969, Lennon returned to live performances with a concert at a Toronto rock &amp; roll festival. He was supported by the Plastic Ono Band, which featured Ono, guitarist Eric Clapton, bassist Klaus Voormann and drummer Alan White. The following month, Lennon and the Plastic Ono Band released &quot;Cold Turkey,&quot; which was about his battle with heroin addiction. When the single failed to make the Top Ten in Britain and America, Lennon sent his MBE back to the Queen, protesting Britain&amp;#039;s involvement in Biafra, America&amp;#039;s involvement in Vietnam and the poor chart performance of &quot;Cold Turkey.&quot;\n\nBefore the release of &quot;Cold Turkey,&quot; Lennon had told the Beatles that he planned to leave the group, but he agreed not to publicly announce his intentions until after Allen Klein&amp;#039;s negotiations with EMI on behalf of the Beatles were resolved. Lennon and Ono continued with their campaign for peace, spreading billboards with the slogan &quot;War Is Over! (If You Want It)&quot; in 12 separate cities. In February of 1970, he wrote, recorded and released the single &quot;Instant Karma&quot; within the span of the week. The single became a major hit, reaching the Top Ten in both the U.K. and the U.S.. Two months after &quot;Instant Karma,&quot; Paul McCartney announced that the Beatles were splitting up, provoking the anger of Lennon. Much of this anger was vented on his first full-fledged solo album, John Lennon/Plastic Ono Band, a scathingly honest confessional work inspired by his and Ono&amp;#039;s primal scream therapy. Lennon supported the album with an extensive interview with Rolling Stone, where he debunked many of the myths surrounding the Beatles. Early in 1971, he released another protest single, &quot;Power to the People,&quot; before moving to New York. That fall, he released Imagine, which featured the Top Ten title track. By the time Imagine became a hit album, Lennon and Ono had returned to political activism, publicly supporting American radicals like Abbie Hoffman, Jerry Rubin and John Sinclair. Their increased political involvement resulted in the double-album Sometime in New York City, which was released in the summer of 1972. Recorded with the New York hippie band Elephant&amp;#039;s Memory, Sometime in New York City consisted entirely of political songs, many of which were criticized for their simplicity. Consequently, the album sold poorly and tarnished Lennon&amp;#039;s reputation.\n\nSometime in New York City was the beginning of a three-year downward spiral for Lennon. Shortly before the album&amp;#039;s release, he began his long, involved battle with U.S. Immigration, who refused to give him a green card due to a conviction for marijuana possession in 1968. In 1973, he was ordered to leave America by Immigration, and he launched a full-scale battle against the department, frequently attacking them in public. Mind Games was released in late 1973 to mixed reviews; its title track became a moderate hit. The following year, he and Ono separated, and he moved out to Los Angeles, beginning his year-and-a-half long &quot;lost weekend.&quot; During 1974 and 1975, Lennon lived a life of debauchery in Los Angeles, partying hard with such celebrities as Elton John, Harry Nilsson, Keith Moon, David Bowie and Ringo Starr. Walls and Bridges appeared in November of 1974, and it became a hit due to the inclusion of &quot;Whatever Gets You Through the Night,&quot; a song he wrote with Elton John. At the end of the year, John helped reunite Lennon and Ono, convincing the ex-Beatle to appear during one of his concerts; it would be Lennon&amp;#039;s last performance.\n\nRock &amp; Roll, a collection of rock oldies recorded during the lost weekend, was released in the spring of 1975. A few months before its official release, a bootleg of the album called Roots was released by Morris Levy, who Lennon later sued successfully. Lennon&amp;#039;s immigration battle neared its completion on October 7, 1975, when the U.S. court of appeals overturned his deportation order; in the summer of 1976, he was finally granted his green card. After he appeared on David Bowie&amp;#039;s Young Americans, co-writing the hit song &quot;Fame,&quot; Lennon quietly retired from music, choosing to become a house-husband following the October birth of his son, Sean Lennon.\n\nDuring the summer of 1980, Lennon returned to recording, signing a new contract with Geffen Records. Comprised equally of material by Lennon and Ono, Double Fantasy was released in November to positive reviews. As the album and its accompanying single, &quot;(Just Like) Starting Over,&quot; were climbing the charts, Lennon was assassinated on December 8 by Mark David Chapman. Lennon&amp;#039;s death inspired deep grief from the entire world; on December 14, millions of fans around the world participated in a ten-minute silent vigil for Lennon at 2 p.m. EST. Double Fantasy and &quot;(Just Like) Starting Over&quot; both became number one hits in the wake of his death. In the years after his death, several albums of unreleased recordings appeared, the first of which was 1984&amp;#039;s Milk and Honey; perhaps the most substantial was the 1998 four-disc box set Anthology, issued in conjunction with a single-disc sampler titled Wonsaponatime. ","torrent":{"xt":"urn:btih:e56762a5cee8f77702ca491b24b6ff10666a9267","amp;dn":"%23003+-+John+Lennon%2FPlastic+Ono+Band+%28John+Lennon%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e56762a5cee8f77702ca491b24b6ff10666a9267","infoHashBuffer":{"type":"Buffer","data":[229,103,98,165,206,232,247,119,2,202,73,27,36,182,255,16,102,106,146,103]},"announce":[],"urlList":[]}}