{"title":"Coolutils PDF Splitter 1.5.0.84 Multilingual Portable","uid":6453486,"size":20775143,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e5778f833816de2dd1af84d02e75ccceedb2cabc&amp;dn=Coolutils+PDF+Splitter+1.5.0.84+Multilingual+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1307516549,"description":"Coolutils PDF Splitter 1.5.0.84 Multilingual Portable\n\nA new most handy program that helps you to solve the problem of splitting different pages inside one multipage PDF file. All you have to do is to setup it and make several clicks. PDF Splitter is easy-to-use and has transparent interface. PDF Splitter will also combine split pages. So if you have a multipage PDF document and need to reorganize the pages our program will do the task. For example it will split 10-page PDF file and create a new document every 2 pages. So you get 5 two-page PDF documents instead of 1 ten-page file.\n\nPDF Splitter has a built-in flexible renamer to spare your effort. By default new pages will be renamed to this template [Name].page#.pdf (where # is the number of the page like Contract.page1.pdf). You can start enumeration from any digit. Besides, PDF Splitter has unique option of enumerating pages based on the number of pages already existing in destination folder. In other words, if there are 6 PDF files in your destination folder (like Contract.page1.pdf, Contract.page2.pdf - Contract.page6.pdf) and you want to place the newly split pages into that folder, PDF Splitter will automatically rename the new PDF files to Contract.page7.pdf, Contract.page8.pdf, etc.\n\nThe new unique option of PDF Splitter - splitting by blank pages. The program will create a new document every time it meets a blank page. Furthermore, PDF Splitter from CoolUtils can split by several blank pages in a row. For example, it will start a new PDF only if there are 3 blank pages in a row in the source document.\n\nPDF Splitter has two 2 ways of handling: you may either use the command line or have a nice user-interface. You press Split button - PDF Splitter will do the rest for you! Try it for free (30 days trial period, no limitations) and find out that it is really worth its money.\n\nIt can extract pages in different ways:\n- Extract all pages from PDF file\n- Extract only selected pages (i.e. 1,2,5,7-10)\n- Extract odd/even pages\n- Split PDF file by bookmarks\n- new! Split PDF by blank pages\n\nHome Page - http://www.coolutils.com/\n\n","torrent":{"xt":"urn:btih:e5778f833816de2dd1af84d02e75ccceedb2cabc","amp;dn":"Coolutils+PDF+Splitter+1.5.0.84+Multilingual+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5778f833816de2dd1af84d02e75ccceedb2cabc","infoHashBuffer":{"type":"Buffer","data":[229,119,143,131,56,22,222,45,209,175,132,208,46,117,204,206,237,178,202,188]},"announce":[],"urlList":[]}}