{"title":"Railworks TS2014 Class 2F Dock","uid":10583026,"size":402099464,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e61b7d836a29731bd939aabcc7b5d35eadefc05e&amp;dn=Railworks+TS2014+Class+2F+Dock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"StenioBlackHawnk","files":-1,"time":1405713792,"description":"The diminutive Class 2F Dock Tank is here for Train Simulator, developed by MeshTools. \n\nThe 0-6-0T short wheelbase tank engine was designed by Sir Henry Fowler for the London, Midland and Scottish Railway (LMS) who were responsible for operating lines on a number of docks. The short wheelbase of the locomotive made them an ideal candidate to traverse the sharp curves found on these docks, something other tank engines could not able do. \n\nOnly 10 of the Class were built between 1928 and 1929 at the Derby Works and their design was typical of other dock tanks, although unusually they incorporated outside cylinders. The Class saw service after nationalisation and some were allocated to Scottish depots, where they operated on branch lines as well as docks. However, withdrawals began in 1959 and by 1964 all had been removed from service. \n\nThe Class 2F Dock Tank for Train Simulator, developed by MeshTools, is available in a number of BR and LMS liveries, and features notched reverser with reverser catch, realistic steam brake and reverser dynamics, dynamic smoke and steam effects, exterior animations and animated brake rigging. Also included are a variety of freight wagons.","torrent":{"xt":"urn:btih:e61b7d836a29731bd939aabcc7b5d35eadefc05e","amp;dn":"Railworks+TS2014+Class+2F+Dock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e61b7d836a29731bd939aabcc7b5d35eadefc05e","infoHashBuffer":{"type":"Buffer","data":[230,27,125,131,106,41,115,27,217,57,170,188,199,181,211,94,173,239,192,94]},"announce":[],"urlList":[]}}