{"title":"Lee Goldberg - The Man With The Iron-On Badge","uid":5168876,"size":815990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e65459d2c854c3bb2bdf8534dbed66fe1979436e&amp;dn=Lee+Goldberg+-+The+Man+With+The+Iron-On+Badge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pigeye","files":1,"time":1258572175,"description":"Harvey Mapes is a twenty-nine-year-old security guard who spends his nights in a guard shack outside a gated community in Southern California, reading detective novels, watching TVLand reruns, and waiting for his life to finally start . . . which happens when Cyril Parkus, one of the wealthy residents, asks Harvey to follow his beautiful wife Lauren.\n\nThe lowly security guard jumps at the opportunity to fulfill his private eye fantasies and use everything he's learned from Spenser, Magnum, and Mannix. But things don't exactly go according to the books . . . or the reruns. As Harvey fumbles and stumbles through his first investigation, he discovers that the differences between fiction and reality can be deadly.\n\nWith the help of his mortgage-broker neighbor and occasional lover Carol, Harvey uncovers a blackmail plot that takes a sudden and unexpectedly tragic turn . . . plunging him into a world of violence, deception, and murder . . . and forcing him to discover what it really takes to be a private eye.","torrent":{"xt":"urn:btih:e65459d2c854c3bb2bdf8534dbed66fe1979436e","amp;dn":"Lee+Goldberg+-+The+Man+With+The+Iron-On+Badge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e65459d2c854c3bb2bdf8534dbed66fe1979436e","infoHashBuffer":{"type":"Buffer","data":[230,84,89,210,200,84,195,187,43,223,133,52,219,237,102,254,25,121,67,110]},"announce":[],"urlList":[]}}