{"title":"POtHS - SIN-ister Secrets - 95 - War on Cold Fusion - Hidden Tru","uid":7721965,"size":3792985554,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e66b5b6079696aaec72af8b4fce642fec3c11502&amp;dn=POtHS+-+SIN-ister+Secrets+-+95+-+War+on+Cold+Fusion+-+Hidden+Tru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"POtHS11","files":78,"time":1350095710,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 95 - War on Cold Fusion - Hidden Truth Exposed and Suppressed Tech\n\n\n\n\nPOtHS Comment: They having been holding back technology to sell us oil. Simple plan to rape our Pocketbooks!!!\n\nDescription:\n\nWar on Cold Fusion - The Hidden Truth Exposed:\nPresented by James Doohan, (&quot;Scotty&quot; on Star Trek) with Sir Arthur C. Clark (author - 2001 A Space Odyssey, inventor of the communications satellite).\nDespite the &quot;war on cold fusion&quot; waged by scientists and the media, Cold Fusion could still possibly become a practical reality and become the greatest energy revolution of the 21st century. This film examines the controversy following the discovery of Cold Fusion, a process by which abundant energy can be generated from simple materials.\n-----------------------------------------------------------\n\nSuppressed Science - Inventing the Impossible:\nFrom UFOTVÂ®, accept no imitations. Free Energy, German Anti-Gravity, Wireless Power Transmission, Cold Fusion and Rejuvenation Technology. In the 20th century, while Marconi, Henry Ford, Thomas Edison and George Westinghouse managed to capture most of the attention, others, with technological prowess bordering on the miraculous, have gone unnoticed. Men like Tesla, Moray, Riech, Russell, and Schauberger, largely rejected ridiculed and despised by the scientific establishment of their day, labored in nearly complete obscurity, achieving almost incomprehensible miracle like free energy, anti-gravity, transmutation of elements, physical rejuvenation technologies and more.\n\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:e66b5b6079696aaec72af8b4fce642fec3c11502","amp;dn":"POtHS+-+SIN-ister+Secrets+-+95+-+War+on+Cold+Fusion+-+Hidden+Tru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e66b5b6079696aaec72af8b4fce642fec3c11502","infoHashBuffer":{"type":"Buffer","data":[230,107,91,96,121,105,106,174,199,42,248,180,252,230,66,254,195,193,21,2]},"announce":[],"urlList":[]}}