{"title":"Electra (1962) w. Irene Papas  spoken Greek, EN, FR, SP subs","uid":13441266,"size":798279073,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e671b12a5d8ef715981318fa323153324fe6e14d&amp;dn=Electra+%281962%29+w.+Irene+Papas++spoken+Greek%2C+EN%2C+FR%2C+SP+subs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"loninappleton","files":2,"time":1454706940,"description":"Electra (1962) by Euripides\r\n\r\nstarring Irene Papas\r\nDirected by  Mihalis Kakogiannis \r\n\r\nOriginal Greek with easy to read English, French and Spanish subtitles \r\nselectable  from your VLC player\r\n\r\nNominated for 3 Oscars. Another 11 wins &amp; 12 nominations\r\n\r\nrun time: 1 hr 52 minutes \r\n\r\nIMDb number:  tt0055950\r\n\r\nIMDb description:\r\n\r\n   This excellent adaptation by Michael Cacoyannis (whose name varies in \r\nspelling over his long career of doing Greek drama) of the famous tragedy by \r\nEuripides garnered him his first international success and an award at the \r\n1962 Cannes Film Festival. Irene Papas plays Electra, the daughter of King \r\nAgamemnon and sister of Orestes, caught up in an uncontrollable need for \r\nrevenge. After the king returns from the battlefield, Clytemnestra (his wife) \r\njoins with her lover in murdering the hapless ruler while he bathes. Orestes \r\nis sent away immediately, and Electra is left to simmer in her growing hatred \r\nof her mother until one day, she and Orestes manage to get together and hatch \r\na scheme to avenge Agamemnon's death.\r\n--\r\nmy notes on the new recode\r\n\r\n  I have gone back to this drama several times lately just for the look of it.\r\n\r\nWhen I did I saw that the subs were not showing and no one ever \r\npointed it out.  This recode is to correct that.  Use your VLC player to \r\nselect the subtitles from English, French, or Spanish.  A fourth item listed \r\nis not modern Greek.  It is of the kind of captions for hearing impaired in \r\nEnglish and appears in white rather than the easy to read yellow. \r\n\r\n  The black and white style resembles the post war work of Rosselini's Open \r\nCity.  Papas appears with here hair shorn as an outcast and has the hard look \r\nof someone betrayed. \r\n\r\n  These treatments of ancient Greek drama are all too rare and they are a \r\ntrademark of Cacoyannis throughout his career.  Look for Iphegenia as well.  \r\n\r\n  As an added observation it is interesting to see this Electra and then the \r\nIphigenia with Papas first in the role of Electra at a young age and then as \r\nthe mother of Iphegenia in the next generation of the Greek story.\r\n  \r\nI got the dvd of Electra locally and it is the best source around that I \r\nknow of.  The DVD is currently available at the usual sources.  Please encourage your library to acquire it in order that more viewers learn from and enjoy the history of the drama.\r\n\r\nNew Notes written February 5 2016","torrent":{"xt":"urn:btih:e671b12a5d8ef715981318fa323153324fe6e14d","amp;dn":"Electra+%281962%29+w.+Irene+Papas++spoken+Greek%2C+EN%2C+FR%2C+SP+subs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e671b12a5d8ef715981318fa323153324fe6e14d","infoHashBuffer":{"type":"Buffer","data":[230,113,177,42,93,142,247,21,152,19,24,250,50,49,83,50,79,230,225,77]},"announce":[],"urlList":[]}}