{"title":"The Duel (2000)","uid":6823134,"size":1467830966,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e67302e51d982a0afc2c222a5b7169eaec736aef&amp;dn=The+Duel+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dragonmastershow","files":-1,"time":1321469707,"description":"This amazing fantasy centers around two supreme swordsmen, played by Andy Lau (Savior of Souls, God of Gamblers) and Ekin Cheng (The Storm Riders), who are set to fight a duel on the roof of the royal palace of China, known as the Forbidden City. Only eight witnesses to the battle will be allowed; imperial agent Dragon 9--also known as &quot;Four Eyebrows&quot; because of his thin mustache--is assigned to choose these witnesses. But as Dragon 9 goes about his business, he begins to uncover evidence of a sinister conspiracy that may threaten the life of the emperor himself. Part action epic, part mystery, part romance, The Duel careens wildly from wacky comedy to heroic passion to sweet tenderness, often in the same scene--but the movie is so visually lush, propulsively filmed (with action sequences choreographed by Ching Siu-tung, the man responsible for the kinetic dynamism of Dragon Inn and Swordsman II), and engagingly acted that you'll be swept up in every twist of tone and plot. Movies like The Duel make American action movies seem pale and simplistic; if you're unfamiliar with Hong Kong's unique and dazzling action cinema, The Duel will provide an excellent, thrilling introduction. \n\nDirector: Wai-keung Lau\nWriters: Jing Wong, Manfred Wong\nStars: Andy Lau, Ekin Cheng and Nick Cheung","torrent":{"xt":"urn:btih:e67302e51d982a0afc2c222a5b7169eaec736aef","amp;dn":"The+Duel+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e67302e51d982a0afc2c222a5b7169eaec736aef","infoHashBuffer":{"type":"Buffer","data":[230,115,2,229,29,152,42,10,252,44,34,42,91,113,105,234,236,115,106,239]},"announce":[],"urlList":[]}}