{"title":"Gaia 2: Irresistible Silvie (1997) - anal, Silvia Saint","uid":4755688,"size":734895813,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e6c94149c109b8f2436136e838f8bfd1aa2921b9&amp;dn=Gaia+2%3A+Irresistible+Silvie+%281997%29+-+anal%2C+Silvia+Saint&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pure_screens","files":2,"time":1236444217,"description":"Gaia 2 - Irresistible Silvie\n \n\n\n\n\n8 screens (+ DVD-covers):\n &lt;a href=&quot;\nhttp://wide.blogbugs.org/7595012/Irresistible-Silvie---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wide.blogbugs.org/7595012/Irresistible-Silvie---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nSilvia is the daughter of a rich French playboy whom she has never met. When her mother dies she sets out to find him so that she can make him suffer as much as possible, taking advantage of his best friends and his most important business partners. She knows full well that her father will not be able to bear the discovery that the Irresistible Silvie can never be his.\n\n\nProduced in 1997, when Silvia was a relative newcomer, it remains one of her best - she looks amazing here. French dialogue with English voice-over, quite well done. And surprise, surprise &quot;acting&quot; carries the film, a small element perhaps in a porn flick, but nice; rounding up a very good video of the incomparable Silvia Saint. A progressive porn starlet for her time, there was little Silvia could not, did not or would not do, taking facials, performing orgies and anal with the best. In the same year, Silvia won the &quot;People's Choice Adult Best Newcomer&quot; &amp; &quot;AVN Best Tease Performance&quot; awards.\n\n\n\nActresses\n\n    * Amanda Steel [Anal Facial]\n    * Katarina Martinez [Anal Facial]\n    * Paula Wild [Facial]\n    * Silvia Saint [Anal Facial]\n\n\n   \nScene Breakdowns\n\n    * Scene 1. Amanda Steel, Philippe Dean\n    * Scene 2. David Perry, Silvia Saint\n    * Scene 3. Paula Wild, Philippe Dean\n    * Scene 4. Amanda Steel, Silvia Saint\n    * Scene 5. Jean-Yves Le Castel, Katarina Martinez\n    * Scene 6. Katarina Martinez, Silvia Saint, Tony Toscany\n    * Scene 7. Silvia Saint\n    * Scene 8. Amanda Steel, Philippe Dean\n    * Scene 9. David Perry, Silvia Saint\n    * Scene 10. Richard Langin, Silvia Saint\n    * Scene 11. Katarina Martinez, Philippe Dean\n\n\n\n\n\nCategory:  Anal, DP/double penetration, Straight/lesbian\nAKA:       Gaia 2\nStudio:    Private \nReleased:  1997\n\nCodex: DivX4 (open) \nFrame size: 640x480 \nRuntime: 01:22:23\n\n\n\n\nReview:\n\nThe sex in &quot;Irresistible Silvie&quot; reflects the couples-oriented intent of this DVD (although each B/G scene, save the second coupling between Amanda and Phillipe, has an oral cumshot); it isn't as nasty as you'll find in the average Private offering. The sex scenes are on the short side (with some lasting only a couple of minutes), but some of them are good, despite their brevity. The action's mixed-up, not the same old &quot;position transitions&quot;, and generally has a moderate-to-good heat level. There's an odd tendency for the men to keep their clothes on during sex, too, but this some might consider this more of a recommendation.\n\nThe first scene has Amanda and Phillipe going at it in his home office; I'd describe her as a nondescript brunette, but I liked her performance here. She takes a brief anal penetration, too, and finishes him off orally.\n\nFor the next scene, the action is cut between Silvie and David outside (blowjob only), and Kikki and Phillipe inside, in his bedroom. Silvie keeps her clothes on (as does David), but gives an energetic BJ (the oral cumshot is in slow motion). Kikki didn't interest me much, although I have to admit the sex between her and Phillipe was pretty good, short as the scene was.\n\nNext is a lesbian scene between Amanda and Silvie (with Katarina briefly looking on); Silvie looks delicious when she's dressed in blue lingerie at the top of the scene. I'd rate the sex here as only moderate, though; lesbian scenes need to be more convincing than this was for me to like them, and the action here wasn't as hot as I had hoped it would be.\n\nEncouraged by Silvie's uninhibited ways, Katarina seduces the handyman, Jean. I found the sex here quite good (it's mostly oral; there's intercourse, but it's brief), hampered only by some of the action being in the shadows.\n\nKatarina and Silvie pick up Tony, and have a three-way with him back at the house. The sex here is most typically what one would associate with a Private feature; Katarina takes it anally, and there's a bit of cum-swapping between the ladies at the end (after the slow-motion cumshot, that is). It's a hot scene, too, with both of the women performing well (I especially liked seeing Silvie rub herself on Tony's thigh while Katarina gave him a blowjob).\n\nUpstairs, Silvie partially strips down and engages in a little masturbation while Phillipe looks on (doesn't anyone ever close their door in this house?). It's a short scene, only a couple of minutes long, and isn't very explicit, almost softcore.\n\nAnother brief scene follows this, as Phillipe performs cunnilingus on Amanda. That's the extent of the scene, but I liked that it wasn't typical, and enjoyed seeing Amanda's reactions.\n\nIn the next scene, there's a party downstairs, and Silvie and David do a little indiscreet fucking at the wet bar, with a blowjob finish; only Phillipe seems to notice the two of them. I found this set-up kind of silly (Phillipe and David exchange smarmy looks during the latter's involvement with Silvie), and didn't think much of this scene.\n\nThe next day, Richard comes over, and he and Silvie do the wild thing on the couch downstairs, with Amanda looking on and masturbating a little (this isn't really explicit). Silvie takes him anally in reverse cowgirl (looking great all the while, I might add), and jerks him off to a finish (she cleans him off a little afterward with her tongue). A good scene; a little shorter than I would have liked, but still my favorite of the disc.\n\nIn the final scene, Katarina and Phillipe get it on while Silvie looks on from an outside window. They get into doggy-style intercourse for a short time, and then she blows him to finish (as in her scene with Jean, she seems quite the willing fellatrix here). I felt this scene was anti- climactic in light of the previous one with Silvie, but made sense within the story. \n\n\n\n\n\n.","torrent":{"xt":"urn:btih:e6c94149c109b8f2436136e838f8bfd1aa2921b9","amp;dn":"Gaia+2%3A+Irresistible+Silvie+%281997%29+-+anal%2C+Silvia+Saint","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6c94149c109b8f2436136e838f8bfd1aa2921b9","infoHashBuffer":{"type":"Buffer","data":[230,201,65,73,193,9,184,242,67,97,54,232,56,248,191,209,170,41,33,185]},"announce":[],"urlList":[]}}