{"title":"Three_Little_Words_Astaire-Skelton_Reynolds_1950.avi","uid":6565369,"size":846030692,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e70d6fb6f4f8ca26bb5af588dc2b957151f68ebd&amp;dn=Three_Little_Words_Astaire-Skelton_Reynolds_1950.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"carabina","files":1,"time":1311661581,"description":"IMDB Synopsis:\n\nThe story of the successful Tin Pan Alley songwriting team of Bert Kalmar and Harry Ruby is told loosely and lightheartedly. \nSong-and-dance man Bert Kalmar can't continue his stage career after an injury for while, so he has to earn his money as a lyricst. Per chance he meets composer Harry Ruby and their first song is a hit. Ruby gets Kalmar to marry is former partner Jessie Brown, and Kalmar and Jessie prevent Ruby from getting married to the wrong girls. But due to the fact, that Ruby has caused a backer's withdrawal for a Kalmar play, they end their relation.\n\nAll Movie Synopsis:\n\nMGM's Three Little Words is a &quot;twin&quot; musical biopic, covering the lives and careers of songwriters Bert Kalmar and Harry Ruby. Fred Astaire plays Kalmar, a frustrated magician, while Red Skelton is cast as Ruby, a wannabe baseball player. After &quot;meeting cute&quot; during a disastrous vaudeville show, the oil-and-water Bert and Harry become a popular songwriting team, dashing off such favorites as Who's Sorry Now?, Nevertheless, So Long Oo-Long, I Wanna be Loved by You, All Alone Monday and the title song (the film unfortunately skimps on Kalmar and Ruby's Gilbert-and-Sullivan style novelty ditties, with the exception of Hooray for Captain Spaulding, Groucho Marx' signature tune in Animal Crackers). Adhering more to MGM formula than the facts, the script contrives to have Kalmar and Ruby split up over a trivial misunderstanding, only to be reunited by their wives for an &quot;all is forgiven&quot; radio broadcast hosted by bandleader Phil Regan. Vera-Ellen co-stars as Kalmar's vaudevillian wife Jessie Brown, while Arlene Dahl portrays Ruby's movie-star spouse Eileen Percy. Gloria DeHaven is seen as her own mother, Mrs. Carter DeHaven; and Debbie Reynolds plays &quot;boop-a-doop&quot; girl Helen Kane, her singing voice dubbed in by Ms. Kane herself. Though not quite as humorous as the subject matter would seem to dictate (Red Skelton gets his biggest laughs in the scenes wherein he, as Harry Ruby, participates in spring training with his favorite baseball club) Three Little Words is an excellent example of MGM's musical unit at the height of its powers.\n\n\nDirector : Richard Thorpe\nRuntime: 102 min\nGenres: Musical\n\nCast:\nFred Astaire .. Bert Kalmar\nRed Skelton ... Harry Ruby\nVera-Ellen ... Jessie Brown / Jessie Kalmar\nArlene Dahl ... Eileen Percy Ruby\nKeenan Wynn ... Charlie Kope\nGale Robbins... Terry Lordel\nGloria DeHaven ... Mrs. Carter De Haven\nPhil Regan ...Himself\nDebbie Reynolds\t... Helen Kane\nPaul Harvey ... Al Masters \n\nCountry: USA\nVideo Codec: XviD\nBitrate:901 kbps\nAudio Codec: AC3\nResolution: 640x480\nFrame Rate: 29970 FPS\nSize: 807 MB","torrent":{"xt":"urn:btih:e70d6fb6f4f8ca26bb5af588dc2b957151f68ebd","amp;dn":"Three_Little_Words_Astaire-Skelton_Reynolds_1950.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e70d6fb6f4f8ca26bb5af588dc2b957151f68ebd","infoHashBuffer":{"type":"Buffer","data":[231,13,111,182,244,248,202,38,187,90,245,136,220,43,149,113,81,246,142,189]},"announce":[],"urlList":[]}}