{"title":"222 Free Things To Do In The United Kingdom (2014) Gooner","uid":14676978,"size":30198785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7ba952cb170804291a51c74f55217f5201c90ba&amp;dn=222+Free+Things+To+Do+In+The+United+Kingdom+%282014%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1463955865,"description":"222 Free Things To Do In The United Kingdom (2014) (Pdf, Epub &amp; Mobi) Gooner\r\n\r\nLanguage: English\r\nASIN: B00FG9TFCY\r\n\r\nEngland, Scotland, Wales &amp; Northern Ireland. The seat of Western civilization and one of the most popular travel destinations in the world…but wow is the United Kingdom EXPENSIVE! \r\n\r\nSo, how can you see this diverse, energetic, historic yet modern region without paying through the nose? \r\n\r\nDid you know the famed Edinburgh Castle, a national symbol of Scotland (which usually costs £16.00 to enter), is free several days throughout the year? \r\n\r\nTurns out that the U.K. is literally overflowing with free activities, destinations, events, and music, festivals, and more. And that’s what this book is all about: having a good time without spending a dime.\r\n\r\nLiverpool for museums. Edinburgh for festivals. Armagh for public art (and the Gargoyle trail). There are so many free things to do in the United Kingdom that you can stretch your travel budget across four countries – if you know where to look! \r\n\r\nWhile thousands of tourists might spend the afternoon at the gates of Buckingham palace waiting for the changing of the guard, you could be in the know, doing 100% FREE, yet culturally rewarding, activities such as: \r\n\r\n•\tLearn to write your name in Ogham, the earliest form of Irish \r\n•\tScottish parliament and debates \r\n•\tA British Army museum formed in response to Napoleon \r\n•\tFirst edition of Gulliver’s Travels in Northern Ireland’s oldest library \r\n•\tViews from the second highest church tower in England \r\n•\tLunchtime recitals at a tiny medieval church \r\n•\tSpecimens from Captain James Cook’s voyages \r\n•\tFree comedy night at local pubs \r\n•\tParty at The City of London Festival \r\n\r\nWHY THIS E-GUIDEBOOK IS DIFFERENT \r\n\r\nThis book is not about discount travel. It’s about FREE travel. \r\n\r\n1)\tIt only includes free activities, events, locations &amp; attractions \r\n2)\tit’s exclusively formatted for the Kindle and Kindle App \r\n3)\tIt’s interactive, so you can easily access directions from your current location, reviews from other travelers, and more information entries in the book. \r\n\r\nWHAT YOU’LL FIND INSIDE \r\n\r\nThis e-guidebook grew out of the second edition of the Amazon best selling Free Travel Guide To London (ASIN: B009KVPCI0). Readers had been asking me for more free attractions across the U.K., and I realized that there was demand for an expanded book. \r\n\r\nInside you’ll find two books filled with attractions that are always free, sometimes free, or free for certain people. The first half includes 103 free things to do in the U.K. The second half is a full reproduction of The Free Travel Guide To London, with 119 free attractions. \r\n\r\nEach entry has a well-researched description, contact information (email, phone, website), and links to contextual information. Color photos too! \r\n\r\nIt works great with the Kindle App for your smartphone, so you can get directions from Google. \r\n\r\nThere’s an interactive map, showing you all the free activities and an appendix with free trip planning tools, apps, etc","torrent":{"xt":"urn:btih:e7ba952cb170804291a51c74f55217f5201c90ba","amp;dn":"222+Free+Things+To+Do+In+The+United+Kingdom+%282014%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7ba952cb170804291a51c74f55217f5201c90ba","infoHashBuffer":{"type":"Buffer","data":[231,186,149,44,177,112,128,66,145,165,28,116,245,82,23,245,32,28,144,186]},"announce":[],"urlList":[]}}