{"title":"Sinatra - Vegas (4cd Boxset) [V0]","uid":7881959,"size":371365780,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e82e572643e9aad30c976a26d08e7f19ee7b20a1&amp;dn=Sinatra+-+Vegas+%284cd+Boxset%29+%5BV0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1354522624,"description":"---------------------------------------------------------------------\n           Frank Sinatra - Sinatra: Vegas [Live]\n---------------------------------------------------------------------\n\nArtist...............: Frank Sinatra\nAlbum................: Sinatra: Vegas [Live]\nGenre................: Pop Standards\nSource...............: CD\nYear.................: 1987\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.97\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 226kbps)\nChannels.............: Joint Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3\nPlaying Time.........: 03:36:45\nTotal Size...........: 354.14 MB\n\n---------------------------------------------------------------------\n\nRelease Date: 11/7/2006\nUPC: 081227407520\nLabel: Reprise / Wea\nCatalog Number: 74075\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/sinatra-vegas-frank-sinatra/11582299&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/sinatra-vegas-frank-sinatra/11582299&lt;/a&gt;\n\nAll Music Guide - Stephen Thomas Erlewine\nFrank Sinatra accomplished so much in his career that the fact that he virtually created the swinging style that became known as the sound of Las Vegas at its peak seems like a mere footnote to his legacy. Perhaps it is a footnote, but it's a fascinating footnote and one that still holds sway over the popular imagination, both in their perception of Sinatra and Vegas. To many, Sinatra was the brassy, high-rolling Rat Pack leader that he was in the Vegas of the '60s, and that sound and image are still what people hope to experience when they visit Las Vegas. Rhino's four-CD, one-DVD box set Sinatra: Vegas was designed with those listeners in mind. It presents five concerts -- all previously unreleased -- from Sinatra's various engagements in Vegas over the decades. The first two discs are devoted to '60s performances at The Sands, a casino owned in part by Sinatra. The first disc captures a 1961 show and despite some goofing off by Frank -- pronouncing &quot;Imagination&quot; with a hard &quot;G,&quot; slipping in a &quot;goddamn&quot; in &quot;Moonlight in Vermont&quot; -- this is a pretty straight-ahead performance of standards and contemporary tunes, not nearly as swaggering as his reputation suggests. It is, however, a nicely nuanced performance, one that feels more suited for a concert hall than a casino. This is also partially true of the second disc, which is devoted to a 1966 concert with Count Basie and an orchestra conducted by Quincy Jones. This stint at The Sands has been previously documented on the excellent 1966 album Sinatra at the Sands, but this CD contains previously unreleased performances from these concerts, and right away it's clear why they weren't released: Sinatra immediately breaks into jokes on &quot;I've Got a Crush on You,&quot; swearing when he misses a line, and playing with the lyrics (&quot;my heart became active/when you became a Jew&quot;). Not the stuff for a 1966 LP, but a treasure for those wanting to hear the ribald Sinatra at his '60s peak, which this is because not only is he joking around, but he's in excellent form as a singer, backed by Basie's brilliant band. This is the highlight of the set, unquestionably. The next two discs are taken from '80s performances. Disc three captures a show at the Circus Maximus in 1982, while disc four is from a concert at the Golden Nugget in 1987. These concerts are not only tamer than the second disc, but they're a little bit show-bizzy -- Sinatra is not as off-the-cuff in his asides, it sometimes feels like he's done this show hundreds of times, which of course he had. But he was still a pro and even if he was in the later years of his performing career, he was still in good voice in both 1982 and 1987, so they're not only enjoyable discs, but they're also likely better representations of what the average audience saw at a Sinatra show in Vegas during the '70s and '80s than the sets at The Sands. Finally, the whole package is topped off by a complete concert at Caesar's Palace from 1978. Sinatra's entire performance was taped as part of the production of a CBS show called Cinderella at the Palace, which featured segments of other Vegas performers, but Sinatra's show has never been shown in its entirety until now. This, more than the CDs, gives the total experience of a Vegas show from Sinatra, plus it also fills in part of the story that's not told on the CDs. With this DVD, Sinatra: Vegas winds up sampling from all the decades Sinatra played Vegas -- two shows from the '60s, video from the '70s, two discs from the '80s -- and it shows both the myth and the reality of Sinatra in Sin City. And even if at times the box can show how show-business the whole shebang is, it's hard to listen to any part of the set and not get caught up in the myth of Vegas and Frank that it celebrates.","torrent":{"xt":"urn:btih:e82e572643e9aad30c976a26d08e7f19ee7b20a1","amp;dn":"Sinatra+-+Vegas+%284cd+Boxset%29+%5BV0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e82e572643e9aad30c976a26d08e7f19ee7b20a1","infoHashBuffer":{"type":"Buffer","data":[232,46,87,38,67,233,170,211,12,151,106,38,208,142,127,25,238,123,32,161]},"announce":[],"urlList":[]}}