{"title":"Zammuto - Anchor (2014) [FLAC]","uid":11003122,"size":272125117,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8476a82402a3f337076c3ed47a44d0d5a62adfb&amp;dn=Zammuto+-+Anchor+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1410136369,"description":"\n  Zammuto - Anchor (2014) [FLAC]\n\n  Genre: Electronic\n  Style: Experimental, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Good Graces\n  02 Great Equator\n  03 Hegemony\n  04 Henry Lee\n  05 Need Some Sun\n  06 Don't Be A Tool\n  07 Electric Ant\n  08 IO\n  09 Stop Counting\n  10 Sinker\n  11 Your Time\n  12 Code Breaker\n\n  Though the project technically existed in the form of a few CD-R albums of glitchy, experimental ambience in the early 2000s, Zammuto made a proper debut in 2012 when Nick Zammuto, founding member of indie collage duo the Books, was processing the dissolution of that long-running and highly accomplished band. Part of that process was the recording of the tense, sometimes claustrophobic self-titled album from Zammuto, a dizzying affair that went against all of the trademarks the Books had established for themselves and replaced folky, organic samples with layers of processed vocals, cold synthetic sounds, and a generally relentless songwriting style that was anything but easy to digest. Burying a known style in clutter may have been an understandably reactionary move to intentionally set Zammuto apart from the Books, but the end result was more confusing than distinctive. Released in 2014, follow-up album Anchor sounds almost immediately like the work of a different entity altogether, or at very least the work of an artist in a very different place than before. Opening track &quot;Good Graces&quot; drifts in gracefully on a bed of ambient synths before truly beginning with a dusty electric piano riff, laid-back dubby grooves, and softly shimmering vocals from Daniela Gesundheit of indie act Snowblink. Compared to the album before this, the song is strikingly minimal and brimming over with cold confidence, where before there were only manic shifts from one extreme sound to the next. Much of Anchor follows this trend, with obtuse funk workouts like &quot;Hegemony&quot; consisting of little more than busy live drums, complex vocal harmonies, and the most skeletal of instrumental arrangements to keep the song glued together. Zammuto revisits some of the vocodered vocals and overcooked synth tones of the debut, but this time around there's more space around these sonic choices, allowing them to feel more natural and deliberate. The misguided rush of colors and nonstop sounds of the debut are replaced here with the subtlety of minimal techo-influenced beats on tracks like &quot;Your Time&quot; and","torrent":{"xt":"urn:btih:e8476a82402a3f337076c3ed47a44d0d5a62adfb","amp;dn":"Zammuto+-+Anchor+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8476a82402a3f337076c3ed47a44d0d5a62adfb","infoHashBuffer":{"type":"Buffer","data":[232,71,106,130,64,42,63,51,112,118,195,237,71,164,77,13,90,98,173,251]},"announce":[],"urlList":[]}}