{"title":"Save Me: An Atheist's Letter to the Christian Church - Barne Adl","uid":11773147,"size":121054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e88878c414ed52a79a38f67d2536145b7cd9b6fe&amp;dn=Save+Me%3A+An+Atheist%27s+Letter+to+the+Christian+Church+-+Barne+Adl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1427155720,"description":"Reviews:\n&quot;This is a refreshing, surprising change from the many Atheistic essays and publications of today. Instead of the angry author who condemns Christianity and those who believe it as foolish, this is the story of a man who misses Christianity. He wants what the church can offer; meaning, answers, a strong foundation. The problem is that he simply can't belive it, no matter how much he tries. His criticisms ring true. While still a believer, he longed to find a group that was passionate about Christ and the church.Many of his problems with Christianity stem from modern-day followers and practices as they have warped and changed from how he believes Christians are depicted in the bible. In his heart, he wants nothing more than to become a Christian once more. Unfortunately, as he says in the book, &quot;I cannot believe that which I do not think is true.&quot; Surprisingly pleasant book with many interesting points.&quot;\n\n&quot;I wasn't planning on reading this book, to tell you the truth, I'm sick of Atheists. They whine if we pray before football games, they can't stand &quot;God&quot; in the pledge of allegiance, the wage war on Christmas, they treat us Christians like second-class citizens. However, it would be arrogant of me not to welcome criticism from a man that envies our faith and wishes he could share it. Adler is no ignoramus, he spent four years studying to become a pastor in an evangelical college, so this book isn't the work of some hater like Dawkins or some ignoramus who thinks Jesus loves everyone and everything. There's a lot of truth in this book, some of it is hard to hear but it must be heard. Adler is encouraging us to live to a higher standard, to practice what we preach and be what we practice. My only disagreement with him is his Altruism, Salvation in the end is through a PERSONAL relationship with Jesus Christ. There's no collective salvation (sorry Obama), there's no &quot;I will learn to love Jesus because Christians are nice to me and I want to enjoy their company.&quot; Yes, we Christians can and should be more welcoming, we should create living churches as oppose to death churches where everything is routine and nothing more. In conclusion, if you want to learn to be a better missionary, if you want to know how people feel about our churches, then buy this book by all means.&quot;\n\n\nAbout the author:\nBarney Adler is a Christian enthusiast and lover of the Bible--despite his atheism. He graduated from an evangelical bible college in 2008 with a focus in pastoral theology and can be found frequenting the churches of Jacksonville, FL","torrent":{"xt":"urn:btih:e88878c414ed52a79a38f67d2536145b7cd9b6fe","amp;dn":"Save+Me%3A+An+Atheist%27s+Letter+to+the+Christian+Church+-+Barne+Adl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e88878c414ed52a79a38f67d2536145b7cd9b6fe","infoHashBuffer":{"type":"Buffer","data":[232,136,120,196,20,237,82,167,154,56,246,125,37,54,20,91,124,217,182,254]},"announce":[],"urlList":[]}}