{"title":"Larry Niven - The Ringworld Throne (Book 3)","uid":9901037,"size":749356008,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e8ef8a90c554b08d7c9b4e78dc90f7137325dcbc&amp;dn=Larry+Niven+-+The+Ringworld+Throne+%28Book+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Billyboy16","files":1,"time":1396769069,"description":"Come back to the Ringworld . . . the most astonishing feat of engineering ever encountered.  A place of untold technological wonders, home to a myriad humanoid races, and world of some of the most beloved science fiction stories ever written!\n\nThe human, Louis Wu; the puppeteer known as the Hindmost; Acolyte, son of the Kzin called Chmeee . . . legendary beings brought together once again in the defense of the Ringworld. Something is going on with the Protectors. Incoming spacecraft are being destroyed before they can reach the Ringworld.  Vampires are massing. And the Ghouls have their own agenda--if anyone dares approach them to learn.\n\nEach race on the Ringworld has always had its own Protector. Now it looks as if the Ringworld itself needs a Protector. But who will sit on the Ringworld Throne?\n\n--------------------------------------------------------------------------------\n\nI noticed that the only version of this audiobook floating around is very incomplete and has several misplaced and missing chapters. I uploaded the Audible version after applying for a free trial on their site, luckily they had a good copy, took me a lot of time to circumvent their DRM and many CD-RWs were used, but here it is, converted to MP3 so you can listen to it on any device. While I'm aware there are better quality formats than MP3 I wanted compatibility with as many devices as possible.\n\nInformation wants to be free. \n\nIF YOU'RE A FAN OF SCIENCE FICTION, PLEASE SEED SO THAT THIS COMPLETE COPY GETS AROUND.","torrent":{"xt":"urn:btih:e8ef8a90c554b08d7c9b4e78dc90f7137325dcbc","amp;dn":"Larry+Niven+-+The+Ringworld+Throne+%28Book+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ef8a90c554b08d7c9b4e78dc90f7137325dcbc","infoHashBuffer":{"type":"Buffer","data":[232,239,138,144,197,84,176,141,124,155,78,120,220,144,247,19,115,37,220,188]},"announce":[],"urlList":[]}}