{"title":"King Khaled International Airport, Riyadh, Saudi Arabia. (OERK)","uid":10119900,"size":66254980,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e949a33b58032a4fe1a707836046e6b6d3a2e429&amp;dn=King+Khaled+International+Airport%2C+Riyadh%2C+Saudi+Arabia.+%28OERK%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bbob1980","files":1,"time":1399656839,"description":"Payware Scenery by ARMI Project.\n\nKing Khalid International Airport (IATA: RUH, ICAO: OERK) is located 35 kilometres (22 mi) north of Riyadh, Saudi Arabia, designed by the architectural firm HOK, and Arabian Bechtel Company Limited served as the Construction Manager on behalf of the Saudi government. \nThis airport consists of 4 passenger terminals (only three of which are in use) with eight aero-bridges each, a mosque, covered and uncovered parking for 11,600 vehicles, a Royal Terminal (for VIP's and Saudi Royal family use), a central control tower (one of the world's tallest), and two parallel runways, which are each 4,205 metres (13,796 ft) long. The land area allocated for this airport is among the largest in the world. \nThis airport was constructed to meet the increasing international and local air transport requirements for Riyadh. The airport that KKIA replaced, Riyadh Airport (close to the city center), is now a Royal Saudi Air Force airbase. King Khalid International Airport (KKIA) opened for operations in late 1982.\nIn addition to the airport support buildings, there are air operations building, facility buildings, General Aviation and Special Flight Service Complex. The airport also includes taxiways, an airfield, road system.\nFeatures\nMain terminal and concourses\nVIP Terminal\nFully detail jetways and bridge to concourse.\nCustom made lines, taxiway and taxi lights.\nCustom Gmax ground texture from satellite photos will make you feel like being in the real airport.\nRunway guard light\nSurrounding area including cargo building , Tank farm , military hangar ,maintenance hangar , Catering and Central Kitchen , etc..","torrent":{"xt":"urn:btih:e949a33b58032a4fe1a707836046e6b6d3a2e429","amp;dn":"King+Khaled+International+Airport%2C+Riyadh%2C+Saudi+Arabia.+%28OERK%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e949a33b58032a4fe1a707836046e6b6d3a2e429","infoHashBuffer":{"type":"Buffer","data":[233,73,163,59,88,3,42,79,225,167,7,131,96,70,230,182,211,162,228,41]},"announce":[],"urlList":[]}}