{"title":"David Stannard - American Holocaust (pdf)","uid":10465763,"size":10621391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e96d49a08ed503fe7fa11a7c8eaf364b2b5f5027&amp;dn=David+Stannard+-+American+Holocaust+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1404189328,"description":"David E. Stannard - American Holocaust: The Conquest of the New World (Oxford UP, 1992). 358 pp. + plates.\n\n\nThis is a completely reprocessed version of a found pdf file. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. The quality of the photos in the original scan was mediocre, so the photos at the end of this book are also only so-so. But the text is above average and quite readable.\n\ndescription:\n\nFor four hundred years -- from the first Spanish assaults against the Arawak people of Hispaniola in the 1490s to the U.S. Army's massacre of Sioux Indians at Wounded Knee in the 1890s -- the indigenous inhabitants of North and South America endured an unending firestorm of violence. During that time the native population of the Western Hemisphere declined by as many as 100 million people. Indeed, as historian David E. Stannard argues in this stunning new book, the European and white American destruction of the native peoples of the Americas was the most massive act of genocide in the history of the world.\n\nStannard begins with a portrait of the enormous richness and diversity of life in the Americas prior to Columbus's fateful voyage in 1492. He then follows the path of genocide from the Indies to Mexico and Central and South America, then north to Florida, Virginia, and New England, and finally out across the Great Plains and Southwest to California and the North Pacific Coast. Stannard reveals that wherever Europeans or white Americans went, the native people were caught between imported plagues and barbarous atrocities, typically resulting in the annihilation of 95 percent of their populations. What kind of people, he asks, do such horrendous things to others? His highly provocative answer: Christians. Digging deeply into ancient European and Christian attitudes toward sex, race, and war, he finds the cultural ground well prepared by the end of the Middle Ages for the centuries-long genocide campaign that Europeans and their descendants launched -- and in places continue to wage -- against the New World's original inhabitants. Advancing a thesis that is sure to create much controversy, Stannard contends that the perpetrators of the American Holocaust drew on the same ideological wellspring as did the later architects of the Nazi Holocaust.\n\nReview\n\n&quot;A splendid antidote to those many books on American Indian policy that tend to ignore the realities of the subject.&quot;--Journal of American Ethnic History\n\n&quot;An important work that will have [Stannard] canonized by some and pillored by others by the end of the Quincentennial Year. It is the product of massive reading in the important sources, years of pondering, and fury at what Europe hath wrought in America....His convincing claim is that what happened was the worst demographic disaster in the history of our species, that Old World diseases and Old World brutality reduced the number of Indians enormously and drove away many Native American peoples over the brink of extinction. How convincing are his evidence and reasoning? Very, I am unhappy to say....Nothing can be done to improve the past, but we can at least face it. David Stannard insists that we do.&quot;--Alfred Crosby, The Boston Sunday Globe\n\n&quot;Offers a much-needed counterbalance to centuries of romantic confabulation about the explorer.&quot;--The Los Angeles Times\n\n&quot;Honest, factual, painful, powerful, inspiring!&quot;--Zaher Wahab, Lewis and Clark College\n\n&quot;Vivid and relentless, combining a formidable array of primary sources with meticulous analysis--a devastating reassessment of the Conquest as nothing less than a holy war.&quot;--Kirkus Reviews\n\n&quot;We need to be reminded, again and again, of what Stannard speaks of as 'the treasure of a single life.' Stannard gives us a fine review of recent literature and a rousing, effective call to define our terms,'racism,' 'genocide,' and use them to describe what happened and still happens.&quot;--Ellen Nore, Southern Illinois University, Edwardsville\n\n&quot;A fascinating book, enormously impressive in its research and engaging in its style....Puts the Columbus story in philosophical and historical perspective. Further, it makes connections with our own time which are unsettling and profoundly important.&quot;--Howard Zinn, author of A People's History of the United States\n\n&quot;A shattering realization is brought home: the German holocaust was not unique in history. There is a holocaust in our American past. We owe it to its victims, and to our own future, to reflect on Stannard's merciless book.&quot;--Hans Koning, author of Columbus: His Enterprise\n\n&quot;In a thoroughly documented narrative, David Stannard demolishes a score of historical myths, and turns American Holocaust into a searing account of what happened in the Americas after the arrival of Columbus. It is a stirring and troubling book &quot;--Dee Brown, author of Bury My Heart at Wounded Knee\n\n&quot;A landmark of necessary remembering, American Holocaust acutely dissects the demons driving the European invaders and presents the most compelling answer yet to the horrifying question of what it was like to be 'discovered.'&quot;--Richard Drinnon, author of Facing West: The Metaphysics of Indian-Hating and Empire-Building\n\n&quot;The book to read to understand the last five hundred years. Stannard has courageously documented the initial and continuing genocide of natives of the western hemisphere in an irrefutable and convincing manner.&quot;--Vine Deloria, Jr., author of God is Red and Custer Died for Your Sins\n\n&quot;A much needed corrective to the centuries of heroizing regarding the impact of European expansion and colonization on the New World. No one can read this book and not be ashamed of the Janus face of the West's cultural and religious roots!&quot;--Dr. Thomas B. Andersen, St. Michael's College","torrent":{"xt":"urn:btih:e96d49a08ed503fe7fa11a7c8eaf364b2b5f5027","amp;dn":"David+Stannard+-+American+Holocaust+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e96d49a08ed503fe7fa11a7c8eaf364b2b5f5027","infoHashBuffer":{"type":"Buffer","data":[233,109,73,160,142,213,3,254,127,161,26,124,142,175,54,75,43,95,80,39]},"announce":[],"urlList":[]}}