{"title":"The Cambridge History of Greek and Roman Warfare (2 vol)","uid":4686046,"size":18145040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9b11c6b4a5b998d3623640d3769ca7f64d3927d&amp;dn=The+Cambridge+History+of+Greek+and+Roman+Warfare+%282+vol%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":2,"time":1233236557,"description":"Warfare was the single biggest preoccupation of historians in antiquity. In recent decades fresh textual interpretations, numerous new archaeological discoveries and a much broader analytical focus emphasising social, economic, political and cultural approaches have transformed our understanding of ancient warfare. This two-volume History reflects these developments and provides a systematic account, written by a distinguished cast of contributors, of the various themes underlying the warfare of the Greek world from Archaic Greece to the Arab conquests of the seventh century AD. For each broad period developments in troop-types, equipment, strategy and tactics are discussed. These are placed in the broader context of developments in international relations and the relationship of warfare to both the state and wider society. Numerous illustrations, a glossary and chronology, and information about the authors mentioned supplement the text. This will become the primary reference work for specialists and non-specialists alike. \n\n2008, \n1300 pages.","torrent":{"xt":"urn:btih:e9b11c6b4a5b998d3623640d3769ca7f64d3927d","amp;dn":"The+Cambridge+History+of+Greek+and+Roman+Warfare+%282+vol%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b11c6b4a5b998d3623640d3769ca7f64d3927d","infoHashBuffer":{"type":"Buffer","data":[233,177,28,107,74,91,153,141,54,35,100,13,55,105,202,127,100,211,146,125]},"announce":[],"urlList":[]}}