{"title":"Furia.De.Titanes.2010.SPANISH.TELESYNC.XVID [www.SoloEstreno.com","uid":5479147,"size":1186224128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e9b4e8a66c9594a8e0be1fe6190e4eb7d6ef4562&amp;dn=Furia.De.Titanes.2010.SPANISH.TELESYNC.XVID+%5Bwww.SoloEstreno.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Morck22","files":1,"time":1270310860,"description":"Estreno en cines el miÃƒÂ©rcoles 31 de marzo de 2010\n\nClash of the Titans (2010)\n\nLouis Leterrier\ncolor / 2.35:1 / FantÃƒÂ¡stico, aventuras, familiar\nEE. UU. [PelÃƒÂ­cula sin calificar]\nLiam Neeson, Ralph Fiennes, Sam Worthington, Gemma Arterton, Alexa Davalos, Danny Huston, Nicholas Hoult, Mads Mikkelsen, Jason Flemyng, Izabella Miko, Polly Walker, Pete Postlethwaite, Vincent Regan, Tamer Hassan, Liam Cunningham, Hans Matheson, Nathalie Cox, Ian Whyte, Luke Evans, Luke Treadaway, William Houston, Jamie Sives, Martin McCann\nCuenta la historia de cÃƒÂ³mo la lucha por el poder enfrenta a los hombres contra los reyes y a los reyes contra los dioses. Pero la guerra entre los dioses podrÃƒÂ­a destruir el mundo. Nacido como un dios pero criado como un hombre, Perseo (Sam Worthington) se ve incapaz de salvar a su familia de Hades (Ralph Fiennes), el dios vengativo del inframundo. Al no tener ya nada que perder, Perseo se ofrece a liderar una misiÃƒÂ³n peligrosa para derrotar a Hades, antes de que ÃƒÂ©ste pueda arrebatar los poderes a Zeus (Liam Neeson) y pueda desatar el infierno en la tierra. Encabezando a un grupo de guerreros valientes, Perseo inicia un viaje peligroso hacia el fondo de los mundos prohibidos. Combatiendo a demonios y a bestias terribles, sÃƒÂ³lo podrÃƒÂ¡ sobrevivir si es capaz de aceptar sus poderes como dios, de vencer a su destino y de crearse un destino propio. Remake de Clash of the Titans (Furia de Titanes).\n\nProducida por Legendary Pictures, Thunder Road Pictures, Warner Bros. Pictures. Distribuida en EspaÃƒÂ±a por Warner Home Video.\n\nTiempo de espera desde el estreno oficial hasta que ha llegado a EspaÃƒÂ±a: nunca antes se ha proyectado en salas comerciales.\n","torrent":{"xt":"urn:btih:e9b4e8a66c9594a8e0be1fe6190e4eb7d6ef4562","amp;dn":"Furia.De.Titanes.2010.SPANISH.TELESYNC.XVID+%5Bwww.SoloEstreno.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b4e8a66c9594a8e0be1fe6190e4eb7d6ef4562","infoHashBuffer":{"type":"Buffer","data":[233,180,232,166,108,149,148,168,224,190,31,230,25,14,78,183,214,239,69,98]},"announce":[],"urlList":[]}}