{"title":"(R.I.P.) Keith Donnellan - Essays on Reference, Language, and Mi","uid":11713757,"size":782301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea46e986193c3b5294b368b6dec25c9003bced34&amp;dn=%28R.I.P.%29+Keith+Donnellan+-+Essays+on+Reference%2C+Language%2C+and+Mi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"philosophi","files":1,"time":1424446117,"description":"Keith Donnellan - Essays on Reference, Language, and Mind\n\nKeith Donnellan is one of the major figures in 20th century philosophy of language and mind, a key member of the highly influential group that altered the course of philosophy of language and mind around 1970. An innovative philosopher, Donnellan's primary contributions were published in article form rather than books. This volume presents a highly focused collection of articles by Donnellan, beginning with his 1966 groundbreaking &quot;Reference and Definite Descriptions,&quot; historically the first move in the direct reference direction.\n\nIn the late sixties and early 1970's, the philosophy of language and mind went through a paradigm shift, with the then-dominant Fregean theory being questioned by what has come to be known as &quot;the direct reference turn.&quot; Donnellan played a key role in this shift, focusing on the relation of reference--a touchstone in the philosophy of language--and the relation of &quot;thinking about&quot;--a key idea in the philosophy of mind. The debates about the metaphysical and epistemological foundations of direct reference ended up forming the agendas of the philosophies of language and mind. Donnellan's ideas are the heart of such ongoing debates.\n\nThis volume, which collects his key contributions dating from the late 1960's through the early 1980's alongside an introduction by one of the editors, Joseph Almog, disseminates the work to a new audience and for posterity. This collection will be of interest to philosophers of language and mind, and of contemporary metaphysics and epistemology, as well as of linguistics and cognitive psychology","torrent":{"xt":"urn:btih:ea46e986193c3b5294b368b6dec25c9003bced34","amp;dn":"%28R.I.P.%29+Keith+Donnellan+-+Essays+on+Reference%2C+Language%2C+and+Mi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea46e986193c3b5294b368b6dec25c9003bced34","infoHashBuffer":{"type":"Buffer","data":[234,70,233,134,25,60,59,82,148,179,104,182,222,194,92,144,3,188,237,52]},"announce":[],"urlList":[]}}