{"title":"Stone of Tears (Sword of Truth, #2) - Terry Goodkind.epub","uid":9074396,"size":1015564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea99215fd1ed27c044978514157f8c0da33b8414&amp;dn=Stone+of+Tears+%28Sword+of+Truth%2C+%232%29+-+Terry+Goodkind.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1382261154,"description":" &lt;a href=&quot;http://d202m5krfqbpi5.cloudfront.net/books/1354899988l/234184.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://d202m5krfqbpi5.cloudfront.net/books/1354899988l/234184.jpg&lt;/a&gt;\n\nKirkus called Wizard's First Rule, Book One of The Sword of Truth, &quot;a wonderfully creative, seamless, and stirring epic fantasy debut.&quot; Piers Anthony lauded it as &quot;a phenomenal fantasy, endlessly inventive, that surely marks the commencement of one of the major careers in the genre. It starts in early and keeps hitting you with new magical wonders, building into a truly gripping adventure.&quot;\n\nIn Wizard's First Rule, Richard Cypher's world was turned upside down. Once a simple woods guide, Richard was forced to become the Seeker of Truth, to save the world from the vile dominance of Darken Rahl, the most viciously savage and powerful wizard the world had ever seen. He was joined on this epic quest by his beloved Kahlan, the only survivor among the Confessors, who brought a powerful but benevolent justice to the land before Rahl's evil scourge. Aided by Zedd, the last of the wizards who opposed Rahl, they were able to cast him into the underworld, saving the world from the living hell of life under Rahl.\n\nBut the veil to the underworld has been torn, and Rahl, from beyond the veil, begins to summon a sinister power more dreadful than any he has wielded before. Horrifying creatures escape through the torn veil, wreaking havoc on the unsuspecting world above.\n\nIf Rahl isn't stopped, he will free the Keeper itself, an evil entity whose power is so vast and foul that once freed, it can never again be contained.\n\nRichard and Kahlan must face Rahl and the Keeper's terrible minions. But first, Richard must endure the ministrations of the Sisters of the Light, or die from the pain of magic that is his birthright and his curse. While Richard undertakes the arduous journey to the forbidden city of the Sisters, Kahlan must embark upon a long and dangerous mission to Aydindril, citadel of the old wizards, where she hopes to find Zedd and the help only he can lend to their desperate cause.\n\nWar, suffering, torture, and deceit lie in their paths, and nothing will save them from a destiny of violent death, unless their courage and faith are joined with luck and they find the elusive...Stone of Tears.","torrent":{"xt":"urn:btih:ea99215fd1ed27c044978514157f8c0da33b8414","amp;dn":"Stone+of+Tears+%28Sword+of+Truth%2C+%232%29+-+Terry+Goodkind.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea99215fd1ed27c044978514157f8c0da33b8414","infoHashBuffer":{"type":"Buffer","data":[234,153,33,95,209,237,39,192,68,151,133,20,21,127,140,13,163,59,132,20]},"announce":[],"urlList":[]}}