{"title":"The Companion Bible, pdf. Collection .","uid":7254768,"size":691364325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb6c4b2c499202fba259fbc647c87d50753342e3&amp;dn=The+Companion+Bible%2C+pdf.+Collection+.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"McCoffee","files":1,"time":1336553774,"description":" This Torrent has in it :\n\n\nA Full version PDF. of The Companion Bible by E. W. Bullinger. \n\nA separate PDF. containing only the Appendixes of Companion bible.\n\nA PDF. Scan of the notes of OT &amp; NT in The Companion Bible. \n\nAnd the condensed notes of The Companion Bible ,in Modern PDF style, meaning, not scanned.  This will help get your barrings when trying to read the other versions i have in there.\n\n\nThe Companion Bible is the KJV 1611 Bible, with the scholarly notes of E. W. Bullinger. He out lines the subject, also giving you valuable information about the structure and outlines each book as a whole. \n\n\nThe 198 Appendixes of Bullinger gives you a wealth of information not found in any, bible today.  Bullinger was a great Biblical scholar  . and His notes are clear and easy to understand. \n\nHe compiled these notes at a time when there where no computers. And it still is one of the best notes for the Bible ever. \n\n\nBullinger covers topics that many Bible teachers will not touch, nor less talk about. They Are as the bible states. \n\n&quot; wolf in sheep's clothing &quot; . Why ? because when you hold back information that God would have Christian's know., that hurts Christians, and it hurts everyone .\n\n\nBullinger brings your attention to many valuable truths that , perhaps God would have you know now. \n\n\nBullinger is not perfect. But His notes are far superior to most if not all bible notes out there.     This is public domain, seed please. so that others have a chance to have these files as well.","torrent":{"xt":"urn:btih:eb6c4b2c499202fba259fbc647c87d50753342e3","amp;dn":"The+Companion+Bible%2C+pdf.+Collection+.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb6c4b2c499202fba259fbc647c87d50753342e3","infoHashBuffer":{"type":"Buffer","data":[235,108,75,44,73,146,2,251,162,89,251,198,71,200,125,80,117,51,66,227]},"announce":[],"urlList":[]}}