{"title":"Dusty Springfield - Dusty In Memphis (Deluxe Edition FLAC) TNT V","uid":9762802,"size":494662357,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb7501b795aa0127b310795ce3b0cf6f6c205b50&amp;dn=Dusty+Springfield+-+Dusty+In+Memphis+%28Deluxe+Edition+FLAC%29+TNT+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"l.diliberto","files":25,"time":1394837502,"description":"Dusty Springfield - Dusty In Memphis (Deluxe Edition FLAC) TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=390266&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=390266&lt;/a&gt;\n\nAnno: 31 March 1969\nGenere: Soul, Rhythm &amp; Blues, pop\n\nJust when you thought that the perfect album and its CD equivalent couldn't get any better, along comes Rhino with this 25-song deluxe edition of Dusty in Memphis. The new transfers on the original Dusty in Memphis material are sharper and brighter, but also warmer than the original 1992 CD -- the finely nuanced richness of Dusty Springfield's voice on the softer numbers, such as &quot;In the Land of Make Believe&quot; and &quot;Windmills of Your Mind,&quot; is captured perfectly on this new edition, where the old CD had a colder, harder texture. Among the bonus tracks, &quot;What Do You Do When Love Dies&quot; comes from the same sessions as the Memphis album, and its noninclusion on the original is difficult to explain, being one of the singer's more exuberant performances and tracks. The highlight of the bonus tracks, however, are the songs left over from sessions for the unfairly underrated Gamble- and Huff-produced Brand New Me album, and the unissued 1971 Jeff Barry-produced sides for a never-released third Atlantic album. If anything, she's more confident and bold on this material than on Dusty in Memphis. The sound is lusher, and heavier as well, but no less seductive and captivating, and the presence of treasures such as her covers of David Gates' &quot;Make It With You&quot; and Carole King's &quot;You've Got a Friend,&quot; the gospel-flavored &quot;Love Shine Down,&quot; and the hard-rocking &quot;Natchez Trace&quot; all serve to make this a must-own CD, even for those who already have the previous versions. One other nice feature of the new edition is that the clarity of the remastering brings the backing instruments out as never before, which makes one appreciate the production and arrangements as well as her performance. \n\n.: Locandina :.\n\n\n.: Tracklist :.\n\n1 Just A Little Lovin'\n2 So Much Love\n3 Son Of A Preacher Man\n4 I Don't Want To Hear It Anymore\n5 Don't Forget About Me\n6 Breakfast In Bed\n7 Just One Smile\n8 The Windmills Of Your Mind\n9 In The Land Of Make Believe\n10 No Easy Way Down\n11 I Can't Make It Alone\n12 What Do You Do When Love Dies\n13 Willie &amp; Laura Mae Jones\n14 That Old Sweet Roll (Hi-De-Ho)\n15 Cherished (Previously unissued Version)\n16 Goodbye (Previously unissued mix/LP Version)\n17 Make It With You (Previously unissued Version)\n18 Love Shine Down (Previously unissued Version)\n19 Live Here With You (Previously unissued Version)\n20 Natchez Trace (Previously unissued Version)\n21 All The King's Horses (Previously unissued Version)\n22 I'll Be Faithful (Previously unissued Stereo Version)\n23 Have A Good Life Baby (Previously unissued Version)\n24 You've Got A Friend (Previously unissued Version)\n25 I Found My Way (Previously unissued Version)","torrent":{"xt":"urn:btih:eb7501b795aa0127b310795ce3b0cf6f6c205b50","amp;dn":"Dusty+Springfield+-+Dusty+In+Memphis+%28Deluxe+Edition+FLAC%29+TNT+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb7501b795aa0127b310795ce3b0cf6f6c205b50","infoHashBuffer":{"type":"Buffer","data":[235,117,1,183,149,170,1,39,179,16,121,92,227,176,207,111,108,32,91,80]},"announce":[],"urlList":[]}}