{"title":"Debbie Does Dallas: The Next Generation (1998, xvid)","uid":4626667,"size":725991424,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ec33923f2d6ba30076d19544e8a576f9326ba345&amp;dn=Debbie+Does+Dallas%3A+The+Next+Generation+%281998%2C+xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"g0tmail","files":1,"time":1231242829,"description":"512x336\nAVI\n01:12:54\n\n\n\n\n\n\n\nscreens + DVD-covers:\n &lt;a href=&quot;\nhttp://mainx.blogbugs.org/4602206/Debbie-Does-Dallas-The-Next-Generation---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mainx.blogbugs.org/4602206/Debbie-Does-Dallas-The-Next-Generation---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nThe most anticipated sequel of the decade!\nOne of the most popular X-Rated films of all times has been re-filmed by Vivid Interactive. Lex stars in the classic adult film. Debbie gets sick and tired of stripping at the local club. She decides to try out for the local basketball cheerleading squad. Debbie and her mother will stop at nothing and do everyone to get her on the squad\n\n\n\nActresses\n\n    * Donna Warner          [NonSex]\n    * Lexus Locklear\n    * Lil Bit\n    * Micki Lynn\n    * Shane                 [LezOnly]\n    * Sharon Mitchell       [Facial]\n    * Stephanie Swift       [LezOnly]\n    * Toni James\n\nActors\n\n    * Billy Glyde\n    * Jon Dough\n    * Tony Tedeschi\n    * Vince Vouyer\n\n \n   \nScene Breakdowns\n\n    * Scene 1. Jon Dough, Lexus Locklear\n    * Scene 2. Shane, Stephanie Swift\n    * Scene 3. Billy Glyde, Lil Bit\n    * Scene 4. Lexus Locklear, Toni James, Vince Vouyer\n    * Scene 5. Jon Dough, Lexus Locklear\n    * Scene 6. Sharon Mitchell, Tony Tedeschi\n\n\nContent:      Cheerleader, Straight, Lesbian, Strap-on, Smoking, Classic, 1990s\nDirector:     Paul Thomas\nDistributor:  Vivid \nReleased:     1998\n\n\n\nREVIEW #1:\n\nMiss Sharon Mitchell is the real star of this video. \nShe is seen smoking a cigarette in very scene. \nOne of her best roles in years.               \n\n1&gt; Lexus &amp; Jon Dough. Kissing, screwing, solo using a dildo.            8.70\n2&gt; Shane &amp; Stephanie. Making out, Shane eating Stephanie. Titty sucking,    \n   fingering, eating. Stephanie uses strap-on on Shane. Shane uses it on    \n   Stephanie. Stephanie gives Shane a mild spanking.                    8.70\n3&gt; Lil' &amp; Billy Glide. Titty play, on her knees BJ/handjob. Micki watch-    \n   ing. Les eating &amp; safe screwing. Dildo play. He jacks off on tits.   8.80\n4&gt; Toni &amp; Lexus &amp; Vince Voyeur. Kissing, making out. Titty sucking, BJ      \n   handjob, eating Lexus as Toni gives BJ. Safe screwing Lexus on her       \n   back, doggie style as she eats Toni. Screwing Toni. Cums on tits.    8.60\n5&gt; Lexus &amp; Jon. No hands BJ in shower. He eats her. Safe screwing on her    \n   back, doggie style, on her back. He jacks off on her tits.           8.60\n6&gt; Sharon &amp; Tony Tedeschi. Kissing, titty sucking, eating her out. BJ &amp;     \n   handjob, no hands BJ, 69 as he 2-3 fingers her ass &amp; eats her. Safe      \n   screwing on her back with legs up, doggie style. Facial.             8.80\n   Note: Good couples tape. \n\n\nREVIEW #2:\n\nQuick, name a porn movie that just about everyone has heard of. Chances are most of you said 'Debbie Does Dallas'. The story of a cheerleader gone wild has become part of the American vernacular like no other adult film. Now, as the millennium approaches, Vivid has plugged blonde cover girl Lexus in the lead role. To be honest, in spite the rather incredible box shot, it was not Lexus I was dying to see when I picked this video up. Instead is was the impressive secondary cast members like Stephanie Swift, Reyna (Lil Bit) and course Shane in her one movie between Seymore and her own stuff. With a cast of women far hotter than could have been imagined when the original Debbie strutted her stuff, let's see what Paul Thomas can add to the mix.\n\nLexus plays Debbie, a successful but unsatisfied stripper. She wants to be a model, but her mother, Sharon Mitchell has other plans. Sharon wants her to be a Texas Tiger cheerleader, so she can get all the right exposure. While Sharon can handle the dialog, and she certainly is old enough to play Debbie's mom, I have to wonder if poor Lexus feels like South Park's Eric Cartman. Is her mom really a dude? Sure looks that way to me. Mom convinces Debbie to try out and joins a bevy of young hotties trying out to make the top notch squad. She feels she can't possibly make the team and is about to bolt when she runs into the Tigers' star player, Dallas (Jon Dough). One look at him, and Lexus has her mind set on making the team more than ever.\n\nLater at home, Lexus winds down after a hard say of trying out by getting to know her vibrator pretty well as she fantasizes about fucking Dallas. (Debbie Does Dallas, get it?) (And is that a fucking pom pom on he handle of her vibe?) It's mostly a solo scene with some fucking in the background. If you use the multi angle feature, you get some hot close ups, otherwise, it's very softcore.\n\nSharon is set on getting Debbie on the team, and sets in motion, a plan to assure success. There is a bit of a twist to her scheming. The coach of the team is the same coach who kept her off the squad when she was in college. (Pardon me, Vince Vouyer is the coach and I don't even think he was born when Sharon was in college.) Debbie introduces Dallas to her mom, but for some reason tells him she is her aunt. While mom is trying to gather info on the competition, she finds Stephanie Swift, trying to win favor with the team coordinator, (Shane) by making her body available in all ways. Shane with Stephanie is a great sight and has even a non lesbian scene fan like me ready to sing the praises of veggie sex. After sampling her tasty twat, Shane lets Steph wear a strap on, which she thankfully sucks before riding. I don't care if it is just a plastic dick, Shane with anything phallic in her mouth is a nut buster of a sight. Shane ends up wearing the strap on and delivers a fantastic plastic fuck. This really is a great pairing, which should mean something since it's not what is normally up my alley.\n\nSteph would be on the team for sure, were it not for an unfortunate incident with some broken glass in her boots. An unfortunate accident that leads us to one of the funniest lines in an adult movie in a long time. (Any fuck you to Nancy Kerrigan is good in my book.) Later that night, the girls have Dallas over for dinner and in spite Debbie's obvious come ons, he seems more interested in Sharon. I guess eye sight is not important to basketball players.\n\nSharon enlists the help of fellow wanna be squad member Mickey Lynn to snap some comprising photos of Reyna as she fucks Billy Glide. Cheerleaders fucking is scandalous? (Only if you're at Notre Dame and the football players get caught watching.) Mickey gets very turned on watching as they grope each other and by the time Reyna gets her lips around his big cock, she is fingering her pussy a few feet away. Who can blame her. This little cutie looks incredible with her mouth stretched around a fat pole. By the time Billy starts working on her pussy, Reyna invites Mickey to join them and a three way breaks out. Hell, I'd take either one of these cuties over most girls, so both of them has Billy looking pretty happy. So happy in fact, that he drops a load on Micky so Reyna can rub it into her chest.\n\nDallas shows up to see Sharon, ignoring all logic known to heterosexual man, to get her to go out with him. When Debbie comes home, they cover by saying he wants to go out with her. (And why wouldn't he?) The plot thickens. The cheerleading practices are pretty fun to watch. It's pretty easy to see which girls have had some experience and which ones are totally clueless. The pranks continue as Sharon tries to scare off the other girls.\n\nMeanwhile, Debbie uses another pal, Toni James to try and get some dirt on coach Vouyer. He offers to help them get on the team, and in turn, they offer themselves up. Toni takes charge from the start and upstages Lexus big time. While both women are great to look at, Ms. James just exudes far more heat. Before you think I am bagging on Lexus, I do have to say this is the best scene I have seen her do. Toni is just one of those great blends of looks and heat that are tough for anyone to beat. Vince moves them over to a small couch where he takes turns fucking one girl while the other sucks pussy. This way everyone gets happily filled and drilled. Vince drops this wad on Lexus' tits and Toni licks it off.\n\nDebbie finally finds out that Dallas is messing with her mother. Now it's time for the hunter to become the hunted. (What?)\n\nWhen Sharon gets caught pulling some of her stunts, she finds herself at the home of team owner Tony Tedeschi. She has some big news for the billionaire, that leads us to a very unfortunate occurrence. Tony has to actually fuck Sharon. Don't get me wrong, she is in incredible shape, better than women a third her age, but she never did a thing for me fifteen years ago and some things just don't get better with age.(Memo to PT. Two words, Sharon Kane.)\n\nWith a few loose ends tied up, things come to a halt. On one hand, I liked the light hearted comedy of the script. On the other, how do you explain using both Shane and Stephanie in just one, all girl scene? Lexus deserves credit for giving what is by far, her best performance to date. She fucks nearly as good as she looks in this video. Mickey Lynn and Reyna are hot as always. Paul Thomas gets credit for a well shot and fairly hot sex vid. Sure, it's more of a couples film that a raincoater, but there is enough reason for just about anyone to check it out. One thing though, Sharon Mitchell must not get sex roles again, please. I'll be humming 'Dude, Looks Like a Lady&quot; and &quot;Lola&quot; all day.\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:ec33923f2d6ba30076d19544e8a576f9326ba345","amp;dn":"Debbie+Does+Dallas%3A+The+Next+Generation+%281998%2C+xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec33923f2d6ba30076d19544e8a576f9326ba345","infoHashBuffer":{"type":"Buffer","data":[236,51,146,63,45,107,163,0,118,209,149,68,232,165,118,249,50,107,163,69]},"announce":[],"urlList":[]}}