{"title":"The End of Biblical Studies - Hector Avalos","uid":14385622,"size":6782338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecfc06e9ffd2399c51a990a9fa0616c41e9c501c&amp;dn=The+End+of+Biblical+Studies+-+Hector+Avalos&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"twp6045","files":3,"time":1461273307,"description":"In this radical critique of his own academic specialty, biblical scholar Hector Avalos calls for an end to biblical studies. He outlines two main arguments for this surprising conclusion. First, academic biblical scholarship has clearly succeeded in showing that the ancient civilization that produced the Bible held beliefs about the origin, nature, and purpose of the world and humanity that are fundamentally opposed to the views of modern society. The Bible is thus largely irrelevant to the needs and concerns of contemporary human beings. Second, Avalos criticizes his colleagues for applying a variety of flawed and specious techniques aimed at maintaining the illusion that the Bible is still relevant in today’s world. In effect, he accuses his profession of being more concerned about its self-preservation than about giving an honest account of its own findings to the general public and faith communities.\r\n\r\nIn a controversial conclusion, Avalos argues that our world is best served by leaving the Bible as a relic of an ancient civilization instead of the &quot;living&quot; document most religionist scholars believe it should be. He urges his colleagues to concentrate on educating the broader society to recognize the irrelevance and even violent effects of the Bible in modern life.\r\n\r\nHector Avalos (Ames, IA) is associate professor of Religious Studies at Iowa State University, the author of four books on biblical studies and religion, the former editor of the Journal for the Critical Study of Religion, and executive director of the Committee for the Scientific Examination of Religion.\r\n\r\n\r\nAs with all my eBook uploads, this is the DRM-free Kindle version. Enjoy!","torrent":{"xt":"urn:btih:ecfc06e9ffd2399c51a990a9fa0616c41e9c501c","amp;dn":"The+End+of+Biblical+Studies+-+Hector+Avalos","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecfc06e9ffd2399c51a990a9fa0616c41e9c501c","infoHashBuffer":{"type":"Buffer","data":[236,252,6,233,255,210,57,156,81,169,144,169,250,6,22,196,30,156,80,28]},"announce":[],"urlList":[]}}