{"title":"Harry Potter And The Deathly Hallows Part 2multi5R.free[sneak_sh","uid":6525417,"size":7287739631,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ed2310eee1c252c1a5f97fa65ceb94caa97d84cc&amp;dn=Harry+Potter+And+The+Deathly+Hallows+Part+2multi5R.free%5Bsneak_sh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sneak_shot","files":76,"time":1310140924,"description":"presenting s n e a k _ s h o t\n\n\n\nrelease date:07-07-2011\n\n\n\ndescription:\n\n\nHarry Potter and the Deathly Hallows - Part 2 is the second part of a two-part action-adventure video game developed by EA's Bright Light Studio and published by Electronic Arts.\n\n\n\nHarry, Ron and Hermione continue their quest to destroy the remaining Horcruxes. Harry must face Lord Voldemort for the last time and defeat him.\n\n\n\nThe gameplay of Deathly Hallows - Part 2 will differ from Part 1, in order to address complaints made with the previous game.[2][3][4] The game will progress linearly, through cutscenes but will not include side missions like the previous game.[2] Combat in Deathly Hallows - Part 2 involves button presses which initiates spell-casting as an attack. Three face buttons, usually with a symbol or a letter, on the controller will have two spells each, and by pressing a button twice the player can access the buttons second spell.[2] A new feature is the ability to &quot;Apparate&quot;, which allows the player to teleport in and out of battles, as a form of defence.[2] The player will be able to control several characters from a third person over-the-shoulder camera including Harry Potter, Ron Weasley, Hermione Granger, Neville Longbottom, Minerva McGonagall, Seamus Finnigan, Ginny Weasley and Molly Weasley.\n\n\nthe 1st time buster release for you guys...!  \n\n\n\n\nseed comment n enjoy...!!!","torrent":{"xt":"urn:btih:ed2310eee1c252c1a5f97fa65ceb94caa97d84cc","amp;dn":"Harry+Potter+And+The+Deathly+Hallows+Part+2multi5R.free%5Bsneak_sh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed2310eee1c252c1a5f97fa65ceb94caa97d84cc","infoHashBuffer":{"type":"Buffer","data":[237,35,16,238,225,194,82,193,165,249,127,166,92,235,148,202,169,125,132,204]},"announce":[],"urlList":[]}}