{"title":"Bowling For Soup - When We Die","uid":4711911,"size":146767876,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ed97b984466949d5e03dd98b67cede8c6eee4a57&amp;dn=Bowling+For+Soup+-+When+We+Die&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1234060180,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;When We Die&quot; is the second single from The Great Burrito Extortion Case, by Bowling for Soup. It was first released in the U.S. officially, during this time &quot;I'm Gay&quot; was released in the U.K only. In October 2007 When We Die was released in the U.K. but on download sales only. The song is unusual for the band because it is a serious song, unlike their previous songs, which are mainly comedy-based.\n\nThis song was #68 on MTV Asia's list of Top 100 Hits of 2007.\n\nIn the video the soloist's (Jaret Reddick) relationship with his father (played by Lee Majors) since he was a young boy, until this time is seen. At the beginning of the video Jaret is seen sleeping with his pregnant girlfriend in his bed, while waking he is seeing that the day is his father's birthday, and after a few hesitations he makes a phone call. In the phone call his mother answers, and his father refuses to talk with him. After a few scenes some scenes from their past are seen. The young elementary-schooler Jaret, and the high-schooler Jaret. In the first scene Jaret is seen asking his father, while his father is fixing the car, to come and play basketball with him. However, his father refuses and tells him to play by himself. Jaret accidentally hits his father with the basketball while playing and his father immediately shouts at him to leave. In the second scene, Jaret's father is seen sitting on the front porch inviting his son to come and drink cold lemonade with him. Jaret was about to accept the invitation but is interrupted by his band's van pulling over and inviting him in. Jaret leaves his father and enters the band's van. In the ending of the video clip, Jaret had gone with his band back home to make a performance. His parents come to visit him and his girlfriend that just had the baby. Jaret and his father first give each other a long stare until Jaret's father sees his new grandchild and is proud of his son. Jaret and his father then give each other a hug.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ed97b984466949d5e03dd98b67cede8c6eee4a57","amp;dn":"Bowling+For+Soup+-+When+We+Die","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed97b984466949d5e03dd98b67cede8c6eee4a57","infoHashBuffer":{"type":"Buffer","data":[237,151,185,132,70,105,73,213,224,61,217,139,103,206,222,140,110,238,74,87]},"announce":[],"urlList":[]}}