{"title":"SimCity BuildIt v1.10.11.40146 mod and data","uid":13498091,"size":100781593,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ee89643839ba635b3eb496b1cb4cdaa9f77ca0f4&amp;dn=SimCity+BuildIt+v1.10.11.40146+mod+and+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tiropitaki","files":10,"time":1455171697,"description":"Ring in the Lunar New Year with fun festivals and parks. Plus, get a 40% discount on the limited-time Monkey Statue!\r\n\r\nWELCOME MAYOR!\r\nBuild your own beautiful, bustling city where your citizens will thrive. The larger and more intricate your city gets, the more needs your citizens have, and it’s up to you to keep them happy. This is an all-new SimCity game – re-imagined for mobile!\r\n\r\nBUILD YOUR CITY\r\nWith countless buildings and vivid, 3D-quality graphics, this is the most realistic city builder on mobile. Place buildings strategically to keep the taxes flowing and your city growing. Pinch, zoom, and rotate 360 degrees as you manage and expand your city on the go – both online and offline.\r\n\r\nBRING YOUR CITY TO LIFE\r\nCreate resources and build up your skyline. Then trade resources with friends and other cities. Complete boat orders and ship cargo from your airport. Build Tokyo-style neighborhoods and unlock exclusive buildings like the Empire State Building and the Arc de Triomphe. Expand along the beach with a marina, waterpark, and more. Even unleash natural and not-so-natural disasters, like UFOs!\r\n\r\nKEEP YOUR CITIZENS HAPPY\r\nSolve real life challenges like traffic, fires, and pollution. Provide services like power plants and police departments to meet your citizens’ needs, and boost your population with parks and education. Keep traffic moving with grand avenues and streetcars. Complete fun challenges to shape your society.\r\n\r\nWatch your city come to life – night and day!\r\n\r\nWhat's new:\r\nFor three weeks only, celebrate world-famous events in your city! Delight your citizens and add colorful fun with limited-time festivals, including:\r\n• Rio Carnival: Start the party and light up your streets with the Carnival Gate and Carnival Parade.\r\n• Lunar New Year: Embrace the Year of the Monkey with fun and festive parks.\r\n• Valentine’s Weekend: Ignite love in your city with charming new ways to customize.\r\nThanks for playing and enjoy the celebration!\r\n\r\nRequires Android: 2.3.3 and Up\r\nInstall APK,Place data folder in SDCard/Android/Data/ and play","torrent":{"xt":"urn:btih:ee89643839ba635b3eb496b1cb4cdaa9f77ca0f4","amp;dn":"SimCity+BuildIt+v1.10.11.40146+mod+and+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee89643839ba635b3eb496b1cb4cdaa9f77ca0f4","infoHashBuffer":{"type":"Buffer","data":[238,137,100,56,57,186,99,91,62,180,150,177,203,76,218,169,247,124,160,244]},"announce":[],"urlList":[]}}