{"title":"The Death Kiss (1932) Xvid 1cd - Bela Lugosi [DDR]","uid":11544293,"size":765442048,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eea87782362af2878fa4723e69d00d6311e9edec&amp;dn=The+Death+Kiss+%281932%29+Xvid+1cd+-+Bela+Lugosi+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SaM","files":-1,"time":1416704597,"description":"The Death Kiss (1932) Xvid 1cd - Bela Lugosi [DDR]\n\nThe Death Kiss (1932) is a mystery film starring David Manners as a crusading studio writer, Adrienne Ames as an actress, and Bela Lugosi as a studio manager. The comedy thriller features three leading players from the previous year's Dracula (Lugosi, Manners, and Edward Van Sloan), and was the first film directed by Edwin L. Marin.\n\nThe movie was produced by KBS Productions at Tiffany Pictures and released by Sono Art-World Wide Pictures. The film is currently in the public domain.\n\n    CAST:-\n    David Manners as Franklyn Drew\n    Adrienne Ames as Marcia Lane\n    Bela Lugosi as Joseph Steiner\n    John Wray as Detective Lieut. Sheehan\n    Vince Barnett as Officer Gulliver \n    Alexander Carr as Leon A. Grossmith \n    Edward Van Sloan as Tom Avery \n    Harold Minjir as Howell\n    Barbara Bedford as Script Girl\n    Al Hill as Assistant Director\n    Harold Waldridge as Charlie \n    Wade Boteler as Sergeant Hilliker\n    Lee Moran as Todd \n\nDirected by Edwin L. Marin\nProduced by E. W. Hammons\nRunning time 75 minutes\n\nMOVIE PLOT:- The Death Kiss (1932)\nDuring the filming of a death scene of The Death Kiss, leading man Myles Brent is really shot and killed. Tonart Studios manager Joseph Steiner (Lugosi) is assigned to handle the situation. The studio wants to pass it off as a simple accident, but screenwriter Franklyn Drew (Manners) digs a bullet out of a wall and tells Homicide Detective Lieutenant Sheehan that it is a .38 caliber, while the guns used in the film are all .45s.\n\nSheehan finds a letter in the dead man's pocket, in which Brent wrote to his lawyer that Marcia Lane (Ames), his co-star and ex-wife, would not sign a release as beneficiary of his $200,000 life insurance policy. Chalmers, an alcoholic extra with a self-admitted grudge against Brent for getting him fired as head gaffer (electrician), is spotted trying to dispose of a loaded .38, but Drew points out that the gun has not been fired.\n\nDrew suggests they view the footage of the fatal scene for clues, but somebody knocks out the projectionist and burns the print using a cigarette with rouge on it. It is a special rouge normally used by only two women. One was away on location, making Lane the prime suspect. Before another print can be made, the negative is destroyed with acid.\n\nWhile snooping around on the set, Drew finds a derringer mounted inside a lamp and electrically wired to be fired remotely, but he is knocked out and the gun taken. He goes to question Chalmers, but finds him dead beside a glass of poison and a written confession. However, Drew finds several clues that make him suspicious. Through more detective work, he discovers that the new battery of Lane's car is dry, and battery fluid is poisonous. Meanwhile, Goldsmith comes to see Lane; she rejects his advances once again.\n\nIn Brent's dressing room, Drew finds a letter from a love-stricken married woman named &quot;Agnes&quot; and a hotel room key. Later, in Steiner's office, Sheehan takes Lane into custody; Drew spots a photo of a woman on the desk; the inscription reveals that Steiner's wife is named Agnes. When Drew goes to the hotel, he finds out from a bellhop that Brent had been there with a woman; her husband was waiting, and the two men got into a fight.\n\nThe studio decides to finish the film (only the last, fatal scene needs to be shot), using a double for Brent and arranging for Lane's temporary release. Drew finds out from the prop man that the guns were originally supposed to be .38s, but he made an unauthorized substitution. Drew takes him to Sheehan. Just as he is about to reveal who ordered the guns, the lights go out. (The murderer had overheard the conversation through a studio microphone.) After a gunfight and chase, the killer falls to his death. It is Avery, the director.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 984 kbps\nVideo Resolution: 640x272\nVideo Aspect Ratio: 1.3333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 75 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:eea87782362af2878fa4723e69d00d6311e9edec","amp;dn":"The+Death+Kiss+%281932%29+Xvid+1cd+-+Bela+Lugosi+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea87782362af2878fa4723e69d00d6311e9edec","infoHashBuffer":{"type":"Buffer","data":[238,168,119,130,54,42,242,135,143,164,114,62,105,208,13,99,17,233,237,236]},"announce":[],"urlList":[]}}