{"title":"Langenscheidt.Vokabeltrainer.Spanisch.3.0.nrg","uid":5166807,"size":597946524,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ef520cb4abf4a5c0d5be0928f3c8000c48f13efa&amp;dn=Langenscheidt.Vokabeltrainer.Spanisch.3.0.nrg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ghostbiker","files":-1,"time":1258454507,"description":"Die Vokabeltrainer von Langenscheidt werden seit Jahren erfolgreich von Hunderttausenden Anwendern eingesetzt - SchÃƒÂ¼lern ebenso wie Erwachsenen. FÃƒÂ¼r Version 3 wurden Inhalte, Funktionen und Gestaltung noch einmal erheblich erweitert und ÃƒÂ¼berarbeitet.\n\nUmfangreicher Vokabelbestand\nDer Vokabeltrainer enthÃƒÂ¤lt gleich mehrere Langenscheidt-WortschÃƒÂ¤tze: einen thematisch geordneten Basis- und Aufbauwortschatz mit Vertonungen aller spanischen und deutschen Vokabeln und SÃƒÂ¤tze; die WortschÃƒÂ¤tze &quot;Der Spanisch-Kurs&quot; und &quot;El Nuevo Curso&quot;, die genau auf die gleichnamigen Langenscheidt-Lehrwerke abgestimmt sind - insgesamt ÃƒÂ¼ber 10.000 Vokabeln und 5.000 SÃƒÂ¤tze!\nWem das noch nicht reicht, der klickt auf &quot;Download&quot; und bedient sich bei den Vokabeldateien der Anwender-Community - die haben kein Langenscheidt-GÃƒÂ¼tesiegel, sind dafÃƒÂ¼r aber komplett kostenlos. GegenwÃƒÂ¤rtig stehen ÃƒÂ¼ber 325.000 Vokabeln in 60 verschiedenen Sprachen bereit: Englisch, FranzÃƒÂ¶sisch, Italienisch, Spanisch, Russisch, TÃƒÂ¼rkisch, Arabisch, HebrÃƒÂ¤isch, Chinesisch, Esperanto, Bayrisch, Plattdeutsch, ...\nDoch damit nicht genug! Da sich der Vokabeltrainer zum Lernen auf allen Gebieten eignet, gibt es auch Downloads, mit denen Sie Kopfrechnen trainieren kÃƒÂ¶nnen, die neue Rechtschreibung, HauptstÃƒÂ¤dte, chemische Elemente, den Morsecode usw. Alles kostenlos, und die Sammlung wÃƒÂ¤chst weiter! NatÃƒÂ¼rlich kÃƒÂ¶nnen Sie auch selbst Vokabeln eingeben, aber dazu spÃƒÂ¤ter mehr.\n\nVielseitige Trainingstypen und -varianten\nJeder Mensch lernt auf individuelle Weise und reagiert unterschiedlich auf verschiedene Lernanreize. Diesem motivationspsychologischen Grundsatz muss eine Lernsoftware entsprechen, damit die Lernmotivation erhalten bleibt. Dementsprechend bietet Ihnen der Vokabeltrainer eine FÃƒÂ¼lle von Trainings-MÃƒÂ¶glichkeiten:\nSie kÃƒÂ¶nnen sich die Vokabeln per Superlearning mit Hintergrundmusik vorspielen lassen. Sie kÃƒÂ¶nnen die Vokabeln abfragen lassen und dabei die LÃƒÂ¶sung eintippen, Fehler streicht die Rechtschreibkorrektur Ihnen rot an; oder Sie sprechen die LÃƒÂ¶sung ins Mikrofon und lassen Ihre Aussprache von der Spracherkennung bewerten.\nIm Trainingstyp Multiple Choice mÃƒÂ¼ssen Sie unter mehreren Alternativen die richtige ÃƒÅ“bersetzung erkennen und per Mausklick oder Mikrofon auswÃƒÂ¤hlen; beim Zuordnen verbinden Sie &quot;durcheinander geratene&quot; VokabelhÃƒÂ¤lften; das Diktat von Vokabeln oder ganzen SÃƒÂ¤tzen trainiert Ihr HÃƒÂ¶rverstehen und Ihre Rechtschreibung.\nDer RÃƒÂ¤tsel-Generator erstellt Ihnen aus jeder Vokabelauswahl KreuzwortrÃƒÂ¤tsel oder &quot;Buchstabensuppen&quot; beliebiger GrÃƒÂ¶ÃƒÅ¸e, die Sie am Bildschirm lÃƒÂ¶sen oder ausdrucken kÃƒÂ¶nnen; im Memo-Spiel suchen bis zu 4 Spieler nach zusammengehÃƒÂ¶rigen Kartenpaaren. ÃƒÅ“berall werden die Vokabeln nicht nur angezeigt, sondern auch vorgesprochen; bei Bedarf kÃƒÂ¶nnen Sie auch die Lautschrift einblenden. Im PrÃƒÂ¼fungsmodus lÃƒÂ¤uft die Uhr, wÃƒÂ¤hrend Sie versuchen, mÃƒÂ¶glichst viele Aufgaben zu beantworten; am Ende wird alles korrigiert und benotet. Und wenn Sie beim Training den Text ausblenden lassen, mÃƒÂ¼ssen Sie die Aufgaben rein nach Ihrem HÃƒÂ¶rverstehen lÃƒÂ¶sen.\nUnd das Beste: All diese Funktionen stehen auch fÃƒÂ¼r alle geladenen und eigenen Vokabeln zur VerfÃƒÂ¼gung; auÃƒÅ¸erdem natÃƒÂ¼rlich in beiden Sprachrichtungen (Fremdsprache Deutsch) und fÃƒÂ¼rs Vokabel- ebenso wie fÃƒÂ¼rs Satztraining!\n\nVokabeln mitnehmen: gedruckt oder als MP3-HÃƒÂ¶rlektion!\nAuch ohne Computer kÃƒÂ¶nnen Sie weiterlernen: Dazu kÃƒÂ¶nnen Sie VokabelkÃƒÂ¤rtchen, Vokabellisten, Vokabeltests oder KreuzwortrÃƒÂ¤tsel drucken (sehr nÃƒÂ¼tzlich auch fÃƒÂ¼r Sprachlehrer!) - und mit &quot;Smart-Audio&quot; HÃƒÂ¶rlektionen erstellen, die Sie auf Ihrem MP3-Player / iPod mitnehmen oder auf eine Audio-CD brennen kÃƒÂ¶nnen. Sie bestimmen dabei die genaue Vokabelauswahl, Sprachrichtung, Wiederholungsrate, Sprechpausen zum Nachsprechen usw.!\n\nEffektives Lernen mit Karteikartensystem, Tutor und Terminplanung\nDer Vokabeltrainer folgt den modernen lernpsychologischen Prinzipien, die ein bestimmten Zeitintervallen folgendes, mehrmaliges Wiederholen des Gelernten fordern. Nur dies stellt sicher, dass das Gelernte dauerhaft im LangzeitgedÃƒÂ¤chtnis gespeichert wird und von dort aktiv aufrufbar ist. Implementiert sind diese GrundsÃƒÂ¤tze durch ein sehr variabel und individuell einstellbares Karteikartensystem: Richtig beantwortete Vokabeln werden in wachsenden ZeitabstÃƒÂ¤nden immer seltener abgefragt, falsch beantwortete Vokabeln werden dagegen in kurzen AbstÃƒÂ¤nden wiederholt, bis sie ins GedÃƒÂ¤chtnis ÃƒÂ¼bergehen. Dieses Karteikartensystem wirkt auf zweifache Weise: Die &quot;Lernsysteme&quot; steuern die Abfrage und die Wiederholungen innerhalb der einzelnen Lernsitzung; die &quot;Tutorsysteme&quot; verwalten grÃƒÂ¶ÃƒÅ¸ere Lernmengen ÃƒÂ¼ber mehrere Wochen und Monate. Das macht das Lernen fÃƒÂ¼r Sie ganz einfach: Sie legen den zu lernenden Wortschatz und ein Zieldatum fest (z.B. einen PrÃƒÂ¼fungstermin) und bestimmen das Ihrem Lerntyp am besten entsprechende Lernsystem fÃƒÂ¼r die tÃƒÂ¤glichen Lernsitzungen. Der Tutor berechnet daraus eine detaillierte Zeitplanung. Sie mÃƒÂ¼ssen dann nur noch jeden Tag das vom Tutorsystem angegebene Tagespensum erfÃƒÂ¼llen, und das Tutorsystem steuert Ihren Lernprozess automatisch so, dass der gewÃƒÂ¤hlte Wortschatz rechtzeitig zum Zieldatum dauerhaft im LangzeitgedÃƒÂ¤chtnis aufgenommen ist.\nDa jeder Menschen einen ganz individuellen Lernrhythmus hat, stehen Ihnen 10 verschiedene Lern- und Tutorsysteme zur Auswahl, z.B. &quot;GrÃƒÂ¼ndliches Tutorium fÃƒÂ¼r schwierige Vokabeln&quot;. ZusÃƒÂ¤tzlich kÃƒÂ¶nnen Sie ganz einfach eigene Lern- und Tutorsysteme (mit 1-16 &quot;FÃƒÂ¤chern&quot;) erstellen, um das Training perfekt auf Ihre BedÃƒÂ¼rfnissen abzustimmen.\n\nAnwenderspezifische Lernergebnisse\nBeim Trainieren erstellt der Vokabeltrainer eine detaillierte Lernstatistik fÃƒÂ¼r jede einzelne Vokabel. Diese Statistik kÃƒÂ¶nnen Sie zum Filtern von Vokabeln nutzen, um z.B. eine HÃƒÂ¶rlektion aus allen Vokabeln zu erstellen, die unter 60% bewertet und mehr als 4 Wochen &quot;alt&quot; sind.\nSie kÃƒÂ¶nnen im Vokabeltrainer beliebig viele &quot;Benutzerkonten&quot; erstellen - z.B. fÃƒÂ¼r jedes Familienmitglied eines. Alle Lernergebnisse und Einstellungen werden benutzerspezifisch gespeichert.\n\nEigene Vokabeln zusammenstellen und vertonen\nUmfangreiche Funktionen stehen Ihnen auch zur Eingabe eigener Vokabeln zur VerfÃƒÂ¼gung. Ganz einfach geht das mit der VokabelÃƒÂ¼bernahme aus dem WÃƒÂ¶rterbuch: Sie geben ein spanisches oder deutsches Suchwort ein, sehen den passenden WÃƒÂ¶rterbuch-Eintrag, klicken auf &quot;ÃƒÅ“bernehmen&quot; - fertig! So kÃƒÂ¶nnen Sie die ÃƒÂ¼ber 40.000 EintrÃƒÂ¤ge des integrierten Langenscheidt-WÃƒÂ¶rterbuchs und die mitgelieferten Vokabeln nach Belieben zusammenstellen. SÃƒÂ¤tze und Vertonungen werden dabei natÃƒÂ¼rlich mit ÃƒÂ¼bernommen.\nOder Sie tippen die Vokabeln selbst ein - ÃƒÂ¼brigens dank Unicode in jeder Schriftart von Kyrillisch bis Chinesisch. MÃƒÂ¶glich ist die Eingabe von Vokabeln, SÃƒÂ¤tzen, LÃƒÂ¼ckentexten, Tabellen, Zusatzinfos, MerksÃƒÂ¤tzen, Wissensfragen usw.\nAlle mitgelieferten Vertonungen stehen Ihnen auch dabei automatisch zur VerfÃƒÂ¼gung. In einem integrierten Tonstudio kÃƒÂ¶nnen Sie weitere Vertonungen selbst aufnehmen und vollautomatisch schneiden, normalisieren und im MP3-Format speichern lassen. Auch Bilder, Videos, Textdateien und Lautschrift lassen sich mit den Vokabeln verknÃƒÂ¼pfen.\nDie Importfunktion erlaubt das Importieren von Vokabeln aus Textdateien; und Sie kÃƒÂ¶nnen Ihre Vokabeln strukturieren: Nach Wortschatz, Thema, Kapiteln, Lektionen usw. Und damit wiederum alle Trainings-, Druck- und Exportfunktionen des Vokabeltrainers nutzen ...\n\nFazit\nSie suchen eine Lernsoftware, die\n* lernpsychologisch fundiert ist,\n* sich Ihren ganz individuellen BedÃƒÂ¼rfnissen anpasst,\n* langfristig SpaÃƒÅ¸ und Freude am Lernen bereitet,\n* sorgfÃƒÂ¤ltig konzipierte Lerninhalte bereithÃƒÂ¤lt,\n* einer durchdachten und ausgeklÃƒÂ¼gelten Lernmethodik folgt\n* und Sie gezielt und sicher zum Lernerfolg fÃƒÂ¼hrt ... Bitte sehr, Sie haben gefunden, wonach Sie suchen. Geben Sie sich nicht mit weniger zufrieden. ","torrent":{"xt":"urn:btih:ef520cb4abf4a5c0d5be0928f3c8000c48f13efa","amp;dn":"Langenscheidt.Vokabeltrainer.Spanisch.3.0.nrg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef520cb4abf4a5c0d5be0928f3c8000c48f13efa","infoHashBuffer":{"type":"Buffer","data":[239,82,12,180,171,244,165,192,213,190,9,40,243,200,0,12,72,241,62,250]},"announce":[],"urlList":[]}}