{"title":"SIN-ister Secrets - 05 - 2012 and Beyond - Doc Marquis","uid":15715307,"size":3414516601,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0805c35abf3049beb6d0c81bd943a480ca87eb7&amp;dn=SIN-ister+Secrets+-+05+-+2012+and+Beyond+-+Doc+Marquis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"POtHS11","files":46,"time":1472611646,"description":"SIN-ister Secrets - 05 - 2012 and Beyond - Doc Marquis\r\n\r\n\r\n\r\nDoc's best DVD yet! Now that you have read and heard the noise and chatter about the year 2012, you will be pleased to know the truth of the Illuminati Plan for 2012, from a man who knows the Plan thoroughly, former Illuminati Luciferian, Doc Marquis!\r\nAfter watching this 'One of a Kind' DVD set, you will no longer wonder what will happen after December 21, 2012!\r\n\r\nIs the New Age Christ ready to appear? Is the end of the world near? Are we doomed to destruction? Do we have any hope for tomorrow beyond the year 2012? In this new, exciting and riveting 2 part DVD set renowned author and former Illuminati witch Doc Marquis takes up the daunting task of revealing the truth behind December 21, 2012.\r\n\r\nFinal Pope Prophesied -- Number 112. In 1595, St. Malachy wrote of a vision where he was shown that 111 Popes would arise and serve before the final Pope, 'Peter The Roman', or 'Petrus Romanus', Pope 112.\r\n\r\nDoc reports that the description Malachy presents for each 111 Popes is eerily accurate; the characteristics of Petrus Romanus label him the False Prophet (Rev 13:11-18), the Pope who will be in office when Antichrist destroys the Papacy and the Vatican by fire (Rev 17:16)\r\n\r\nThe current Pope, Benedict XVI, is Pope 111. The world trembles as this very elderly Pope falters in the performance of his office.\r\n\r\nAt the end, through a unique series of question and answers along with comparisons of the Holy Scriptures Doc Marquis shall begin to reveal the final truth behind the mystery of 2012, a task he completes in Volume 2.\r\n\r\n2-DVD Set, Nearly 4 hours \r\n\r\nThis trailer below is a short segment from the section of this video about Mother Shipton.\r\n\r\n \r\n\r\nQty:\t\r\n1\r\nSubmit","torrent":{"xt":"urn:btih:f0805c35abf3049beb6d0c81bd943a480ca87eb7","amp;dn":"SIN-ister+Secrets+-+05+-+2012+and+Beyond+-+Doc+Marquis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0805c35abf3049beb6d0c81bd943a480ca87eb7","infoHashBuffer":{"type":"Buffer","data":[240,128,92,53,171,243,4,155,235,109,12,129,189,148,58,72,12,168,126,183]},"announce":[],"urlList":[]}}