{"title":"The iPhone Book, (covers iPhone 4 and iPhone 3GS): How to Do the","uid":6190073,"size":22459111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f10d74fc52b815f91e399752ca239eb45506824b&amp;dn=The+iPhone+Book%2C+%28covers+iPhone+4+and+iPhone+3GS%29%3A+How+to+Do+the&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MANTESH","files":3,"time":1298246586,"description":"\n\n\n\n\n\n\nThe iPhone Book, (covers iPhone 4 and iPhone 3GS)\n\n\n\nPeachpit Press | \nScott Kelby &amp; Terry White\nEnglish\n2010 \nISBN: 0321714776 \n312 pages \nPDF\n21.4 MB\n\n\n\nIf you're looking for a book that focuses on just the most important, most useful, and most fun stuff about your iPhone 4--you've found it. There are basically two types of iPhone books out there: (1) The &quot;tell-me-all-about-it&quot; kind, which includes in-depth discussions on everything from wireless network protocols to advanced compression codes. (2) Then there's this book, which instead is a &quot;show-me-how-to-do-it&quot; book that skips all the confusing techno-jargon and just tells you, in plain, simple English, exactly how to use the iPhone features you want to use most.\n\nThe iPhone Book is from Scott Kelby, the award-winning author of the smash bestseller, The iPod Book, who takes that same highly acclaimed, casual, straight-to-thepoint concept and layout and brings it to learning Apple's amazing iPhone. Scott teams up once again with gadget guru and leading iPhone authority Terry White to put together a book that is an awful lot like the iPhone itself--simple to use and fun to learn. The book's layout is brilliant, with each page covering just one single topic, so finding the information you need is quick and easy, with a large full-color photo on each page so you can see exactly how it works.\n\nScott and Terry added even more tips and tricks than the previous editions, and made it even easier by focusing on just the most useful and most requested iPhone 4 features, so you can start really using your iPhone today!\n\n\n\n","torrent":{"xt":"urn:btih:f10d74fc52b815f91e399752ca239eb45506824b","amp;dn":"The+iPhone+Book%2C+%28covers+iPhone+4+and+iPhone+3GS%29%3A+How+to+Do+the","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f10d74fc52b815f91e399752ca239eb45506824b","infoHashBuffer":{"type":"Buffer","data":[241,13,116,252,82,184,21,249,30,57,151,82,202,35,158,180,85,6,130,75]},"announce":[],"urlList":[]}}