{"title":"RiffTrax - Swamp Of The Ravens","uid":9234396,"size":1441901160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1428e38b4263e01291433606d39077c832fc832&amp;dn=RiffTrax+-+Swamp+Of+The+Ravens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"saybis","files":1,"time":1385143148,"description":"Yes, it's an utterly baffling horror film about a mad doctor who believes death is simply an evolution and that every woman wants to sleep with him. Yes, he is laughed out of the academy and moves his decency-defying research to a swamp in Ecuador, as one does. Yes, he's investigated by a sheriff who can only be described as a chunk of swarthy walking meat, and who also believes that every woman wants to sleep with him.\n\nBut MORE THAN ANY OF THIS, Swamp of the Ravens is a vehicle for an original song about being in love with a dead robot that will change the way you view songs, movies, songs in movies, robots, dead robots, living robots, and love itself. Seriously, we haven't been so infatuated with a song since Damien Carter taught us all about &quot;Hangin' Out With (His) Family&quot; in Birdemic, and we know you'll love it just as much as we do. You poor souls.\n\nOh and also, there are no ravens in the titular raven swamp. Just buzzards. Really, it's a heck of a movie.\n\nSo grab the dead robot you love most and join Mike, Kevin, and Bill for Swamp of the Ravens! No ravens required!","torrent":{"xt":"urn:btih:f1428e38b4263e01291433606d39077c832fc832","amp;dn":"RiffTrax+-+Swamp+Of+The+Ravens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1428e38b4263e01291433606d39077c832fc832","infoHashBuffer":{"type":"Buffer","data":[241,66,142,56,180,38,62,1,41,20,51,96,109,57,7,124,131,47,200,50]},"announce":[],"urlList":[]}}