{"title":"Shadowrun.Returns.Update.1-3DM","uid":8747228,"size":281987639,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f1b7366f093c834b239695b3d4841a7294e15b20&amp;dn=Shadowrun.Returns.Update.1-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1374951542,"description":"Works with the FLT version!\nExtract in game directory!\n\nChangelog:\nFix for issue with final battle occasionally not advancing.\nFix for issue with AI occasionally not using self-buffs and IC Charge.\nVersion number is listed inside your PDA\n\nKeep saves:\n\nGo to :\nQuote:\nC: Users  YOUR USERNAME  AppData  Local  EMU  Steam  234650\n\n\nCopy evrything from there , now search for for 3DM save directory\nmaybe it is in game directory\nlook for folder SAVE , 3DMGAME , PROFILE etc or\nQuote:\nC: Users  YOUR USERNAME  AppData  Local  SKIDROW  234650\n\n\n3DM is usung somethimes SKIDROW steam emu, or RLD emu for PAYDAY 2 they used ALI213 steam emu\n\n-----------------------------------\n &lt;a href=&quot;\nhttp://store.steampowered.com/app/234650/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/234650/&lt;/a&gt;\n\nMAN MEETS MAGIC &amp; MACHINE. The year is 2054. Magic has returned to the world, awakening powerful creatures of myth and legend. Technology merges with flesh and consciousness. Elves, trolls, orks and dwarves walk among us, while ruthless corporations bleed the world dry. You are a shadowrunner - a mercenary living on the fringes of society, in the shadows of massive corporate arcologies, surviving day-by-day on skill and instinct alone. When the powerful or the desperate need a job done, you get it done... by any means necessary.\n\nIn the urban sprawl of the Seattle metroplex, the search for a mysterious killer sets you on a trail that leads from the darkest slums to the city s most powerful megacorps. You will need to tread carefully, enlist the aid of other runners, and master powerful forces of technology and magic in order to emerge from the shadows of Seattle unscathed.\n\nThe unique cyberpunk-meets-fantasy world of Shadowrun has gained a huge cult following since its creation nearly 25 years ago. Now, creator Jordan Weisman returns to the world of Shadowrun, modernizing this classic game setting as a single player, turn-based tactical RPG.\nKey Features\nGripping Tactical Combat: When you re running the shadows, every turn matters. Choose your actions wisely - move to better cover, charge into melee, or lob a fireball into a crowd of enemies. With the variety of weapons and spells at your disposal, every turn is filled with meaningful choices. A successful run requires commanding a team of runners with the right balance of combat, tech, and magical abilities.\nSkill-Based Character Progression: Choose a starting character archetype and build from there! Street Samurai and Physical Adepts use advanced combat skills to dominate the battlefield, Shamans and Mages summon powerful allies and cast deadly spells, while Riggers and Deckers provide critical technological support, projecting their consciousness directly into drones and computer systems. Shadowrun Returns  classless skill system allows you to grow your character in any direction you choose. Want to start summoning spirits as an ork Shaman and evolve into a cybered-up weapon specialist? Do it!\nEngaging 2D/3D Art Style: Shadowrun Returns mixes dynamic 3D characters and lighting with a vibrant, hand-painted environment. Illustrated character portraits bring every conversation to life. Explore a world filled with detail, from the slums of the Redmond Barrens to the extravagant offices of powerful corporations.","torrent":{"xt":"urn:btih:f1b7366f093c834b239695b3d4841a7294e15b20","amp;dn":"Shadowrun.Returns.Update.1-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b7366f093c834b239695b3d4841a7294e15b20","infoHashBuffer":{"type":"Buffer","data":[241,183,54,111,9,60,131,75,35,150,149,179,212,132,26,114,148,225,91,32]},"announce":[],"urlList":[]}}