{"title":"Wrapped in Color by Deborah Tomasello","uid":9621241,"size":4944701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1fab23614614617f51bbe9ba11c12bde1bf2871&amp;dn=Wrapped+in+Color+by+Deborah+Tomasello&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1392500980,"description":"\nSo many knitterseven seasoned onessee colorwork as something complex and beyond their abilities. I was quite intimidated by the idea of stranding, and books that I looked at on the technique did not allay my fears. My book shows all knitters that stranded knitting is far easier than they might think, and that even very complicated-looking designs are simple to knit. \n\nMy illustrations and easy-to-follow explanations give even the most hesitant knitters the confidence to create beautiful garments and accessories. By using the knit stitch alone (because I design in the round, my patterns for the most part do not require purling), even the most inexperienced knitters can create pieces that comprise intricate colowork ideas. Stranded knitting is deceptively easy. Wrapped in Color offers a fresh and welcome approach to stranded knitting. It is a total departure from traditional stranding style. \n\nWith a choice collection of my new-fashioned colorwork-in-the-round patterns, accompanied by many attractive photos, there is something in this book that will appeal to young knitters, as well as those who are young at heart. I have replaced the traditional ideas of what colorwork is with new designs that have never been done before. While any text included is informative, it is also light, interesting, casual and entertaining. \n\nThe book is long on visuals, tutorials and charts and short on written text. Wrapped in Colors covers all that color can accomplish in a knitted piece. Color can convey mood. Color can be lace. Color can be cables. In short, color can be anything, and anyone and knit it.\n\nGenre: Non Fiction ","torrent":{"xt":"urn:btih:f1fab23614614617f51bbe9ba11c12bde1bf2871","amp;dn":"Wrapped+in+Color+by+Deborah+Tomasello","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1fab23614614617f51bbe9ba11c12bde1bf2871","infoHashBuffer":{"type":"Buffer","data":[241,250,178,54,20,97,70,23,245,27,190,155,161,28,18,189,225,191,40,113]},"announce":[],"urlList":[]}}