{"title":"Golf.Resort.Tycoon - T-PLAGUE","uid":5150958,"size":800630456,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f2522f0ef85db195941231cf57e5541acaba04ac&amp;dn=Golf.Resort.Tycoon+-+T-PLAGUE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TPLAGUE","files":4,"time":1257553030,"description":"*******************************************************************************\n                          Golf Resort Tycoon by T-PLAGUE\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: Game\nPlatform.............: Windows 9x/ME/2000/XP/Vista/Win7\nImage Format.........: .cue &amp; .bin\n\n\n\n\n-------------------------------------------------------------------------------\n                               Post Information\n-------------------------------------------------------------------------------\nPosted by............: T-PLAGUE\nPosted on............: 11/6/2009\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nGolf Resort Tycoon\n\nGameplay\nThere are two options of play: instant action and challenges. The challenges give a specific objective you need to achieve. If you like to play with a goal in mind, this is a great way to go. Instant action allows you to choose the type of environment you build the resort in. The choices are regular, desert, island, mountain, or autumn (my favorite). You'll also get to choose the difficulty level, which is determined by how much money you get in the start of the game. Then it's time for fun.\n\nYou'll need to build lots of maintenance buildings, and don't forget pest control. Gophers have a nasty habit of showing up on the best courses. Gophers are hardly your own problem. You'll need to supply your visitors with rental shops, restaurants, at least one inn, and maybe a chance to get lessons from a professional golfer. There are lots of building options, for everything a golf resort could need.\n\nDesigning the courses is fun, but can be constraining. You can add hazards to the course. Like ponds (tiny and big) and sand traps. There are landscaping options so you can easily add lots of flowers and trees around the course and near other buildings. It's an easy way to make your resort appealing and pleasant to look at.\n\nAs fun as &quot;Golf Resort Tycoon&quot; is, it does have a flaw that can ruin the gaming experience. There is no way to change the speed of the game. Like all tycoon games, money management is the key. Well, sometimes, money gets a little low, and you have to sit and wait for what seems like days for the cash to build up again.\n\nSound\nThe sound leaves a lot to be desired. You can listen to some of the golfers talk. But usually it's about how well, or not well, they are playing. Occasionally, they'll make comments about the course design. Overall, the sound isn't bad, but it's not great either.\n\nGraphics\nThe graphics have a cartoonish feel to them. However, it does feel right for the game. The graphics look good even in the closest view. You can also walk around the golf resort in a 1st person 3D view. Fog is added in some views. This is a very neat perspective of the resort, but can become boring.\n\nOverall\n&quot;Golf Resort Tycoon&quot; is a great game for getting away from the world, or taking a break from more serious sims. The one thing this game doesn't have is a lack of building and landscape options. There is a big enough variety, so each of your golf resorts will have a different look to it. It's a fun game that will keep you entertained as long as you have plenty of money to spend.\n\nSystem Requirements\n\n    * 200 MHz or faster\n    * Windows 95/98/ME\n    * 8X CD-ROM\n    * 2 MB DirectX 8 compatible video card\n    * DirectX 8 compatible sound card\n    * Mouse\n    * Keyboard\n    * 450 MB available hard disk space\n    * 300 MB swap space \n\n\n-------------------------------------------------------------------------------\n                                 Install Notes\n-------------------------------------------------------------------------------\n1. Mount \n2. Install\n3. Copy crack into games dir and apply\n4. Have fun!\n5. You MUST run the .exe under WinXPSP2/256 colors AND as admin or it will crash! \n\n\n\nPlease help SEED this rare torrent. If sharing, please give credits to me.\n\nThanks,\nT-PLAGUE    \t\t","torrent":{"xt":"urn:btih:f2522f0ef85db195941231cf57e5541acaba04ac","amp;dn":"Golf.Resort.Tycoon+-+T-PLAGUE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2522f0ef85db195941231cf57e5541acaba04ac","infoHashBuffer":{"type":"Buffer","data":[242,82,47,14,248,93,177,149,148,18,49,207,87,229,84,26,202,186,4,172]},"announce":[],"urlList":[]}}