{"title":"The Certainty of the Words - Kyle Stephens","uid":11773425,"size":702728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2d293689febe7caad1421cf916faf226dbd3dbd&amp;dn=+The+Certainty+of+the+Words+-+Kyle+Stephens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427167447,"description":"\nThose who love and appreciate the Authorized Version of 1611, The King James Bible, very likely also know that there is a battle that still ages among its adherents as to the extent of the accuracy and sanctity of its words. Even among those scholars, writers and pastors that promote and defend it, there remains a great deal of contention and disputation as to the degree of sacredness of its individual words. There has been no shortage of name-calling, misrepresentation and acrinomy regarding the subject. The subtitle of this book expresses the theme of the author's examination of the issues and his conclusions found whithin these pages.\n\nThis book is not merely a reshuffling of King James Bible defenses and arguments, but it shows how the words of the AV 1611 itself decimate the semantics, rhetoric and errant reasoning of the King James Bible critics, as well as its oft disingenuous &quot;defenders&quot;.\n\n\nAbout the author:\nKyle Stephens was born in 1961 and was reared in northeast Texas on a dairy farm and ranch. Having trusted Christ at 10 years old and lost his way, he returned to the Father during his college years at the University of Texas-Arlington. Having been introduced to the King James Bible controversy at that time he followed the Lord's leading to Pensacola, Florida, where he graduated from Pensacola Bible Institute with a Bachelor of Divinity in 1987. He married his wife, Marcia, in 1986 while in Bible school and they have 4 children. Upon graduation he answered the Lord's call to Minneapolis, Minnesota to start a Bible Believing Baptist Church. He still pastors Blessed Hope Baptist Church in the Minneapolis area. He earned his Master of Theology degree from PBI in 2011","torrent":{"xt":"urn:btih:f2d293689febe7caad1421cf916faf226dbd3dbd","amp;dn":"+The+Certainty+of+the+Words+-+Kyle+Stephens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2d293689febe7caad1421cf916faf226dbd3dbd","infoHashBuffer":{"type":"Buffer","data":[242,210,147,104,159,235,231,202,173,20,33,207,145,111,175,34,109,189,61,189]},"announce":[],"urlList":[]}}