{"title":"The Dave Elman Induction","uid":8886002,"size":7243982848,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f44e7eb7f72fc89b01aa000ce278d9cf2d3f07b1&amp;dn=The+Dave+Elman+Induction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"acer47x","files":-1,"time":1378461963,"description":"Country : USA\nCategory : Hypnosis  \nDuration : 112 minutes \nYear : 2009 \nLanguage : English \nTranslation : None \n\nDescription : \n\nThese are the full DVDs. Feel Free to Download and RIP to assuage the Inevitable requests &quot;This is the Most powerful, adaptable and Effective Hypnosis induction in the World. Developed by Legendary hypnotist Dave Elman, this rapid induction Will Produce somnambulism in less than four minutes and Will Hypnotize over 85 % of subjects. &quot; This is FACT. Will There be no further horn-Blowing, and there Will definitely be no hard-sell pitch Usually accompanies That Hypnosis A Product Launch. According to Dave Elman's son, &quot;Dad has become a cult figure, a fate he would not aspire to.&quot; I respect that. Dave Elman His life Dedicated to Teaching Medical Doctors and dentists how to Heal Their Patients. It is Easy to Understand how Dave Elman Could Become A Cult Figure. His induction reliably produces deep trance in over 85% of subjects when used in its most basic &quot;script&quot; form by a novice hypnotist. Most professional hypnotists who do not use the Dave Elman induction will admit (if they are totally honest) that they are nowhere near as successful. When the Parts of the Dave Elman induction are Understood (as Explained in the DVD) the induction Becomes even more powerful so you can Hypnotize That Virtually anyone. ... So, What Makes this Product different from Hypnosis Other products? This 2-DVD set explains in-depth how to use the most effective hypnosis induction ever developed. It takes you through, step-by-step from the moment you meet the subject, all the way through deepening the trance and emerging the subject. The Level of Detail Will Ensure That you can Perform this induction This set includes never before Published Information About Dave Elman and His induction. Elman's sole surviving son tells how the induction was developed, how it was taught and why it is still the most effective induction ever.","torrent":{"xt":"urn:btih:f44e7eb7f72fc89b01aa000ce278d9cf2d3f07b1","amp;dn":"The+Dave+Elman+Induction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f44e7eb7f72fc89b01aa000ce278d9cf2d3f07b1","infoHashBuffer":{"type":"Buffer","data":[244,78,126,183,247,47,200,155,1,170,0,12,226,120,217,207,45,63,7,177]},"announce":[],"urlList":[]}}