{"title":"Dr. Andrew Weil - SPONTANEOUS HAPPINESS (2011)  6 CD mp3 + bonus","uid":8511965,"size":422776895,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f4889da1d47b6059a082b0f89cd32bb813e7be25&amp;dn=Dr.+Andrew+Weil+-+SPONTANEOUS+HAPPINESS+%282011%29++6+CD+mp3+%2B+bonus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"leopardog","files":97,"time":1369600576,"description":"SPONTANEOUS HAPPINESS (2011)\nby Andrew Weil, M.D. \n6 CDs in mp3 format\n+ bonus pdf\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/B00CC6DP6Q/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/B00CC6DP6Q/4353-20&lt;/a&gt;\n\nEveryone wants to be happy. But what does that really mean? Increasingly, scientific evidence shows us that true satisfaction and well-being come only from within.\n\nDr. Andrew Weil has proven that the best way to maintain optimum physical health is to draw on both conventional and alternative medicine. Now, in Spontaneous Happiness, he gives us the foundation for attaining and sustaining optimum emotional health. Rooted in Dr. Weil's pioneering work in integrative medicine, the book suggests a reinterpretation of the notion of happiness, discusses the limitations of the biomedical model in treating depression, and elaborates on the inseparability of body and mind.\n\nDr. Weil offers an array of scientifically proven strategies from Eastern and Western psychology to counteract low mood and enhance contentment, comfort, resilience, serenity, and emotional balance. Drawn from psychotherapy, mindfulness training, Buddhist psychology, nutritional science, and more, these strategies include body-oriented therapies to support emotional wellness, techniques for managing stress and anxiety and changing mental habits that keep us stuck in negative patterns, and advice on developing a spiritual dimension in our lives. Lastly, Dr. Weil presents an eight-week program that can be customized according to specific needs, with short- and long-term advice on nutrition, exercise, supplements, environment, lifestyle, and much more.\n\nWhether you are struggling with depression or simply want to feel happier, Dr. Weil's revolutionary approach will shift the paradigm of emotional health and help you achieve greater contentment in your life.","torrent":{"xt":"urn:btih:f4889da1d47b6059a082b0f89cd32bb813e7be25","amp;dn":"Dr.+Andrew+Weil+-+SPONTANEOUS+HAPPINESS+%282011%29++6+CD+mp3+%2B+bonus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4889da1d47b6059a082b0f89cd32bb813e7be25","infoHashBuffer":{"type":"Buffer","data":[244,136,157,161,212,123,96,89,160,130,176,248,156,211,43,184,19,231,190,37]},"announce":[],"urlList":[]}}