{"title":"Poke That Tranny In The Fanny Vol. 4 XXX 2015 WEB-DL","uid":12237802,"size":7236523148,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f5c412bab610387a2bdbbb41e252f622a85b525f&amp;dn=Poke+That+Tranny+In+The+Fanny+Vol.+4+XXX+2015+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Ctrlme","files":18,"time":1439697678,"description":"Poke That Tranny In The Fanny Vol. 4 XXX 2015 WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/N2c&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2c&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2d&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2d&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2w&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2w&lt;/a&gt;\n\nDescription: The movie opens with Christian talking with his wife on the phone trying to convince her that she's working and on business and that he isn't cheating. Unfortunately for her, Nelly is there. Christian blows her and then she goes down on him. Christian eats out her ass and then fucks her doggy style, on her back and laying side by side. Nelly blows him some more and then hops on him cowgirl. Christian stands up and fucks her while carrying her. Then he goes back down so she can ride him cowgirl more. Then she turns around to do it reverse and Christian finishes by coming in her mouth. In the next scene, Chad Diamond is on the couch calling for Khloe Hart to get her phone. She's taking a shower and steps in the bathroom to see that she has a cock. Next we see Chad sitting in a chair looking catatonic until Khloe walks in in her cheerleader outfit. He shames her for having a cock and threatens to tell everyone on the cheerleading squad that she is trans. Chad blackmails her into hooking up. He turns down the offer to get a blowjob and instead insists on having her pull out her cock. She shortly after starts blowing him. After a long blowjob, Chad goes down on her and eats out her ass. He fucks her doggy style and then she hops on him reverse cowgirl while she strokes herself. Then she fucks Chad while he lays on his back. Chad blows her some more then Khloe rides him reverse cowgirl some more. Chad fucks her on her back and then gives her a nice facial. Following that we see Smith modeling Johanna B in a photo shoot. She shows off all her assets and then Smith steps in the shot as he receives a blowjob. He blows her a little then Johanna fucks him in the ass while he's on his back stroking himself. Then he fucks her doggy style while standing and then reverse cowgirl. Johanna stops to blow him some more and then fucks him doggy in the same position he fucked her. Then it switches to her blowing him while she strokes herself to orgasm and he comes in her mouth. Next we see Christian sitting in a chair waiting for Carmen Moore. She sits on the bed and strips and strokes herself for Christian. Then he comes over to her and feels her up and starts getting blown. He eats her ass out, fucks her doggy style, on her back and side, cowgirl, and reverse cowgirl. Then he finishes in her mouth. The next scene opens with Chip a fratboy talking on the phone bragging about how shittily he and his friends were treating some cheerleaders. Jesse Flores steps in to scold him for him and his friends being disgusting and treating the cheerleaders like garbage. All he can think to do is stare at her tits to which Jesse takes offense. But she's obviously not that turned off because she dares him to try and handle her tits. He immediately starts sucking on them and then he goes down on her. Then Jesse eats him out some and he rides her cowboy. Then he lays on his back and gets fucked by her. The scene finishes with him taking a load in his mouth and the two making out. (Hey she never gets her fanny poked wtf?). In scene 6 we see Smith lounging outside. Brittany St. Jordan his babysitter walks up to let him know his ex picked up the kids. He invites her to stay around and enjoy the pool. She doesn't have a bathing suit, but that's okay with him. She somewhat apprehensively strips down to her underwear. Smith notices she's got a cock and begins to blow her. Then she blows him while stroking herself. They trade blowjobs back and forth and then she rides him cowgirl, reverse cowgirl, doggy, on her back and then cowgirl again while she strokes herself. Then it switches to Smith throat fucking her until he comes down her throat and in her mouth. Next we see Eva Lin practicing her cheerleading skills outside. She walks over to Smith chilling in the jacuzzi. She steps in with him and they chat. Then Smith starts sucking her tits and kissing her all over. He blows her and eats her out, and then she fucks him doggy style. Then she blows him. They step out the pool and Smith goes down on her again. Then Eva fucks him on his back while he strokes himself until he comes. Then it switches to Eva sitting on his face while she strokes herself and she eventually comes. In the last scene, we see Natalie Foxx nervously talking on the phone with her mother. She's concerned that her boyfriend Jay Huntington for whom she babysits will leave her when he finds out she's trans. She breaks the news to him and he takes it well. After some foreplay, she goes down on him. He fucks her on her back, she rides him reverse cowgirl while she strokes herself until she squirts for the camera. Then he fucks her doggy style and finishes with a loud facial.\n\nLength: 3:44:52\n\nScene 1: Nelly\nScene 2: Khloe Hart\nScene 3: Johanna B\nScene 4: Carmen Moore\nScene 5: Jesse\nScene 6: Brittany St. Jordan\nScene 7: Eva Lin\nScene 8: Natalie Foxx\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:f5c412bab610387a2bdbbb41e252f622a85b525f","amp;dn":"Poke+That+Tranny+In+The+Fanny+Vol.+4+XXX+2015+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5c412bab610387a2bdbbb41e252f622a85b525f","infoHashBuffer":{"type":"Buffer","data":[245,196,18,186,182,16,56,122,43,219,187,65,226,82,246,34,168,91,82,95]},"announce":[],"urlList":[]}}