{"title":"Slip-HI2U","uid":10167004,"size":1461868473,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f65e670e0cc0c2b7d0b6d8a1041246c2b05a5fb4&amp;dn=Slip-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1400353098,"description":"\nHI2U!\n\nSlip (c) Handsome Games\n\nRelease Date : 17th of May, 2014\nProtection   : Steam\nType         : Action/Indie\nSize         : 30 x 50mb\n\nDescription:\n~~~~~~~~~~~~\n\nSlip is a fast paced side scrolling platformer that utilizes a two-color\nswap mechanic to allow the player to evade danger. Slip is not for the\nfaint of heart. It has an immense focus on timing and features devilishly\ntricky level design. Utilizing your two colors, absorb damage from incoming\nprojectiles of the same color, or be destroyed immediately by the opposite\ncolor. Additionally, Slip features colored Geometry that you only interact\nwith when you share its color. This is perfect when you need a place to\nstand, but can result in instant death if you land on a set of spikes\nsharing your color. In addition to color based obstacles, Slip is also host\nto numerous Color driven props. Sharing the color of a launch-ring will\nshoot you in the direction it faces. Match the color of a gravity well to\nget sucked in and color swap again to have it launch you in which ever\ndirection you are spinning. Lastly, utilize the phase shift platforms to\nshift vertically in the direction of your color.\n\nGame Progression:\nSlip is split up into 12 levels with an overworld connecting them. Game\nprogression is linear with each level being unlocked when the level before\nit is beaten. Each level features a plethora of deadly obstacles that\nresult in instant death. However, since the game can be quite difficult,\nthere are frequent checkpoints laid throughout each level. Lives are NOT\nlimited. You can press on until your thumbs are weary.\n\nAt the end of every level there is a mini-boss or boss encounter. During\nthese sequences the game switches to an autorun mode where the player can\nadjust their position on screen by moving left or right. Here, positioning\ncan mean the difference between life and death.\n\nInstall:\n~~~~~~~\n\nUnrar, mount/burn, install the game, copy crack, and play\n","torrent":{"xt":"urn:btih:f65e670e0cc0c2b7d0b6d8a1041246c2b05a5fb4","amp;dn":"Slip-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f65e670e0cc0c2b7d0b6d8a1041246c2b05a5fb4","infoHashBuffer":{"type":"Buffer","data":[246,94,103,14,12,192,194,183,208,182,216,161,4,18,70,194,176,90,95,180]},"announce":[],"urlList":[]}}