{"title":"StarCrawlers - Early Access (Build 22.3.15 Hotfix 1)","uid":11772409,"size":531321512,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f799b7e2c5aabc1a206f2af9ab38275f1eaee816&amp;dn=StarCrawlers+-+Early+Access+%28Build+22.3.15+Hotfix+1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1427123727,"description":"Fixed an issue where older saves with corrupted ability trees could not be loaded. You should now be able to load these saves without issue.\nFixed an issue where attempting to equip an item that a character did not meet the level requirement for would cause it to dissappear.\n\n    Interface\n    Enable permanent free-look option added to Controls menu. This has not been extensively tested - good luck!\n    Added reticle to free-look mode.\n    You can now define a keybinding for free-look mode.\n    Removed option to lock cursor when free-looking - this now happens automatically when free-look is activated or enabled permanently.\n    Fixed an issue with some class abilities displaying the wrong amount of AP invested.\n    Fixed an issue with the keybindings menu not displaying nicely after loading a game.\n    Fixed an issue where you could duplicate an item while using the upgrade machine.\n    Fixed an issue where you could populate you inventory with phantom icons.\n    Fixed an issue where you could duplicate equipped items.\n\n    Gameplay\n    New crawlers start with 50 credits to spend.\n    Improved stats on starting gear in line with weapon stat changes.\n    Reduced base price of medkits. Vendors will still markup the price though. Jerks.\n    Fixed an issue with AutoCiphers not being recognized by trap panels.\n    Fixed an issue with the weapon generator creating rifles with long shot cooldowns, resulting in abilities executing extremely slowly.\n    Improved shot cooldown speeds for several weapon types.\n\n    Combat\n    Reduced damage of Force Psyker's Aegis Strike to 30/50/80% weapon damage and each bounce reduces damage by 50/30/15% of initial hit. Threat generation remains unchanged.\n    Reduced barrier strength of Force Psyker's Warding Blow to 10/30/50% of damage.\n    Reduced damage Force Psyker's Warden's Wrath to 10/30/50% of weapon damage and increased bonus damage from barrier's to 50/100/150% weapon damage.\n    Reduced damage of Void Psyker's Ignite to 20/30/50% weapon damage per shield destroyed. Destroys 1 to 2/4/6 shields. Burn damage remains unchanged.\n    Reduced damage of Void Psyker's Miasma to 0.5/1/2% weapon damage per point of Void Energy consumed. Lasts 2/4/6 turns.\n    Mob hitpoints adjusted. Health scaling based on mob / game / mission difficulty adjusted.\n    - WARNING Mob hp on high game difficulties is probably crazy high! Nerf planned.\n\n    Items\n    Adjust damage ranges for all weapons types to reduce extreme lows","torrent":{"xt":"urn:btih:f799b7e2c5aabc1a206f2af9ab38275f1eaee816","amp;dn":"StarCrawlers+-+Early+Access+%28Build+22.3.15+Hotfix+1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f799b7e2c5aabc1a206f2af9ab38275f1eaee816","infoHashBuffer":{"type":"Buffer","data":[247,153,183,226,197,170,188,26,32,111,42,249,171,56,39,95,30,174,232,22]},"announce":[],"urlList":[]}}