{"title":"Rammstein 24 Bit Vinyl Pack","uid":8736224,"size":9665131023,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f81e1ac1928023646d9cc8567e23868cc0306cd7&amp;dn=Rammstein+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1374687737,"description":"\n  Rammstein 24 Bit Vinyl Pack\n\n  Genre: Electronic, Pop/Rock\n  Styles: Alternative Metal, Industrial, Progressive Metal\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  Herzeleid \n  Sehnsucht\n  Reise, Reise\n  Rosenrot\n  Mutter (two versions)\n  Liebe Ist Fur Alle Da\n  Keine Lust\n  Haifisch\n  Mein Herz Brennt\n  Amerika \n  Ich Tu Dir Weh\n  Keine Lust\n  Pussy\n\n  Rammstein were formed in 1993 by an assembly of factory-weary proletarians raised in East Germany. They took their name (adding an &quot;m&quot;) from the location of a German tragedy where 80 people were hurt and killed as the result of a crash during an American Air Force flight show. (The literal translation of &quot;ram stein&quot; is a battering ram made of stone.) Word of Rammstein's horror/romanticist blend of theater and music -- one-time Olympic swimmer Till Lindemann would sing entire songs engulfed in flame from head to toe -- spread quickly. The band's first album, Herzeleid (Heartache), built on the grounds created by the band's live reputation. Scaling the German charts (and remaining there until the release of the second Rammstein LP some two years later), the album also introduced the band to the world outside of the Germany/Switzerland/Austria region.\n\n  As Rammstein's second album, Sehnsucht (Longing), was released, the band was headlining throughout Europe to crowds of 10,000 to 30,000 people. Sehnsucht entered the German charts at number one immediately upon its release and came very close to doing the same in Austria and Switzerland. Within weeks, entries on other countries' charts had Sehnsucht rubbing elbows with the Prodigy, Radiohead, and the Rolling Stones on Billboard's cumulative Eurochart. From there the fever spread, transcending any perceived language barrier. Mutter followed in 2001, Reise, Reise in 2004, and the live collection Volkerball in 2006. Liebe Ist fur Alle Da followed in 2009. A limited edition of the album was packed in a metal suitcase that also housed six sex toys, one for each member of the band.","torrent":{"xt":"urn:btih:f81e1ac1928023646d9cc8567e23868cc0306cd7","amp;dn":"Rammstein+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f81e1ac1928023646d9cc8567e23868cc0306cd7","infoHashBuffer":{"type":"Buffer","data":[248,30,26,193,146,128,35,100,109,156,200,86,126,35,134,140,192,48,108,215]},"announce":[],"urlList":[]}}