{"title":"Frank Sinatra &amp; Bing Crosby - Happy Holidays (Christmas TV Speci","uid":3939288,"size":357662720,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f948fb78202e0d571d26457a99806e9029549473&amp;dn=Frank+Sinatra+%26+Bing+Crosby+-+Happy+Holidays+%28Christmas+TV+Speci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thats567","files":1,"time":1198027453,"description":"Happy Holidays with Bing and Frank - DVD Review\n\nBy Jonathan Boudreaux\n\nIn the fall of 1950, The Frank Sinatra Show joined CBS&amp;#039; schedule. At the time, Sinatra was at the top of his career, so the show&amp;#039;s success was practically a given. CBS saddled the series with tough timeslots against the hits Your Show of Shows and Milton Berle&amp;#039;s Texaco Star Theater, though, and the series was cancelled after only two seasons.\n\nSinatra was lured back to television in 1957 by ABC. With his film career in full swing, Sinatra decided that his new The Frank Sinatra Show would follow a loose format. Some weeks it would be a variety show, other weeks a dramatic show, and some weeks he would simply introduce episodes in which he would not appear. This show, too, was a failure, and was cancelled after one season.\n\nIn 2001, Sinatra&amp;#039;s daughter Nancy, herself a pop veteran with the variety special Movin&amp;#039; with Nancy under her belt, began to examine old film canisters as part of her role as family archivist. While trying to determine which parts of the family&amp;#039;s large film library were in danger of decomposition, she stumbled upon a theretofore unknown color print of Happy Holidays with Bing and Frank, the 1957 series&amp;#039; Christmas special. Happy Holidays was broadcast for the first time in over forty years on the cable channel Trio in December of 2001, and now it is available on DVD.\n\nThe show begins with Sinatra decorating a Christmas tree and singing Christmas tunes in his cool bachelor pad. Or trying to, anyway - he drops one of his decorations and merely shrugs it off. No second takes for Frank Sinatra! Soon Leon, Sinatra&amp;#039;s Polynesian manservant, is showing in Bing Crosby. Sinatra and Crosby exchange drinks, Christmas presents - each gives the other a copy of the giver&amp;#039;s Christmas album - and hep cat banter before launching into a swinging version of &quot;Jingle Bells.&quot;\n\nBefore you can say &quot;kitsch,&quot; the two are interrupted by the doorbell. On the doorstep they discover a group of carolers performing &quot;Deck the Halls&quot; in front of what looks like a giant Christmas card depicting a bucolic snow-filled scene. Inexplicably, all of the carolers are dressed in ye olde English costumes. The crooners join the carolers, which causes a rift in the time/space continuum, sending Frank and Bing back in time, complete with ye olde English costumes of their own. While singing such chestnuts as &quot;God Rest Ye Merry Gentlemen&quot; and &quot;O Come All Ye Faithful,&quot; the group wanders around an extraordinarily fake Victorian England set, much to the delight of two old crones who watch from second story windows and who can barely muster the energy to clap. Frank and Bing seem more concerned with getting sloshed than singing - each peasant seems to be holding a drink from them.\n\nBack home in groovy pad, the men sing to each other between drinks - Frank takes on &quot;It Came Upon a Midnight Clear&quot; while Bing interprets &quot;Away in a Manger.&quot; Then they duet on &quot;Little Town of Bethlehem&quot; before it&amp;#039;s time for a round of secular songs - &quot;Rudolph&quot; for Bing and &quot;Santa Claus is Coming to Town&quot; for Frank. Afterwards, they duet on &quot;The Christmas Song&quot; while sitting around the fireplace-cum-barbeque pit.\n\nBing begins to sing &quot;White Christmas&quot; while staring contemplatively out of the window. Frank, of course, is fetching more booze. When both safely have their scotches in hand, Frank joins Bing for the rest of the song. Once the song is over, they wish us a merry Christmas and walk away just as - thanks to the miracle of a stagehand and a broom - it begins to snow.\n\nAs the credits begin to roll, we then learn the kookiest thing about the show - it was directed by none other than Francis Albert Sinatra!\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Happy-Holidays-Bing-Frank-Crosby/dp/B00009QGEG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Happy-Holidays-Bing-Frank-Crosby/dp/B00009QGEG&lt;/a&gt;\n\n\nscreenshots:\n &lt;a href=&quot;\nhttp://aycu13.webshots.com/image/35492/2000035897339732154_rs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aycu13.webshots.com/image/35492/2000035897339732154_rs.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://aycu16.webshots.com/image/36335/2000094979407359855_rs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aycu16.webshots.com/image/36335/2000094979407359855_rs.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://aycu12.webshots.com/image/38411/2000096373570417269_rs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aycu12.webshots.com/image/38411/2000096373570417269_rs.jpg&lt;/a&gt;\n\n\nI got very slow connection, it will take some time until the file gets another seeder, so please be patient :-)\n\n\n... and Merry Xmas Everyone :-))))","torrent":{"xt":"urn:btih:f948fb78202e0d571d26457a99806e9029549473","amp;dn":"Frank+Sinatra+%26+Bing+Crosby+-+Happy+Holidays+%28Christmas+TV+Speci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f948fb78202e0d571d26457a99806e9029549473","infoHashBuffer":{"type":"Buffer","data":[249,72,251,120,32,46,13,87,29,38,69,122,153,128,110,144,41,84,148,115]},"announce":[],"urlList":[]}}