{"title":"Lightning Fast AnimationinElement3D(epub){Zzzzz}","uid":11053035,"size":33115586,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9d0b27583e19a0eff683375fde031f5c1a7486a&amp;dn=Lightning+Fast+AnimationinElement3D%28epub%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1411052412,"description":"Element 3D is a plugin for Adobe After Effects, used to create basic, yet stunning 3D visual effects. Some may find 3D to be tricky and downright complex. Element 3D allows actual 3D models to be created from scratch or exported to Adobe After Effects, and rendered and composited at a high level of quality and impressive speed.\n\nThis practical guide will lift the veil of mystery around 3D animation. It will teach you everything from modeling, preparing, and exporting from various 3D programs to match-motion, texturing, and complex animations using Element 3D.\n\nThis book is a comprehensive guide to using Element 3D and is appropriate for users of all levels. It will walk you through the basics of modeling objects for Element 3D. Then, you ll learn how to texture, light, and animate as well as optimize your scenes for quick render times.\n\nYou will discover some of the limits of Element 3D, and learn how to break through those barriers to create virtually any 3D scene imaginable. You will also learn how to take advantage of other 3D programs such as Maya and Blender to create content and create stunning abstract scenes in relatively no time, and how to composite 3D animation into motion-tracked live action scenes.\n\nBy the time you complete this book, you will have all the information you need to effectively create professional 3D graphics using Element 3D.\n\nPublisher: Packt Publishing - ebooks Account (March 26, 2014)\nLanguage: English\nISBN-10: 1783559381\nISBN-13: 978-1783559381\n\nEditorial Reviews\nAbout the Author\nTy Audronis has over 20 years of experience in 3D animation, cinematography, and videography. He has also been teaching 3D animation for nearly 20 years. He s been a Special Effects Producer on award-winning films, and worked with leaders in technology associated with the entertainment industry. His special effects and 3D knowledge was utilized heavily in fields such as VFX, and science visualization at companies such as frog Design, California Academy of Sciences, Bay Area Video Coalition, and San Francisco School of Digital Film. Ty is also a regular contributor to Videomaker Magazine, and has been writing for this magazine since 2001. \n\n","torrent":{"xt":"urn:btih:f9d0b27583e19a0eff683375fde031f5c1a7486a","amp;dn":"Lightning+Fast+AnimationinElement3D%28epub%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9d0b27583e19a0eff683375fde031f5c1a7486a","infoHashBuffer":{"type":"Buffer","data":[249,208,178,117,131,225,154,14,255,104,51,117,253,224,49,245,193,167,72,106]},"announce":[],"urlList":[]}}