{"title":"Bo Dollis &amp; The Wild Magnolias - 1313 Hoodoo Street@320","uid":4192731,"size":172044915,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f9d7d04c15efe407b1f9d60b30c0b41f2954d42c&amp;dn=Bo+Dollis+%26+The+Wild+Magnolias+-+1313+Hoodoo+Street%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alekow1","files":23,"time":1211047468,"description":"First off, this is a fresh recording by this Mardi Gras Indian crew, recorded in New Orleans with its regular backing band, not some Australian greatest-hits collection or a minimally different version of Life Is a Carnival under a different name. More than just reinterpreting a selection of the usual Indian standards, Big Chief Bo and company focus on homeboy songwriters who know their distinctive turf, be it a pair of Allen Toussaint tunes or drawing from Dr. John&amp;#039;s early-&amp;#039;70s funky phase. The latter&amp;#039;s &quot;I Been Hoodooed&quot; kicks off with psychedelic mystery; between the song and CD title and &quot;Walk on Gilded Splinters&quot; and &quot;Voodoo&quot; also among the songs, there seems to be a theme here. &quot;Angola Bound&quot; is a traditional Indian story-song cum street boast, all vocal chants and modified Diddley beat menace. Bo Dollis&amp;#039; hoarse, expressive vocal style fits &quot;Run Joe&quot; like a glove over an in-the-pocket arrangement with sharp horns and that jump-up calypso backbeat. Both are fairly standard Mardi Gras Indian/New Orleans R&amp;B song fare, but Randy Newman&amp;#039;s &quot;Louisiana&quot; isn&amp;#039;t, and this pretty faithful version with mournful blues guitar and strings is a masterstroke. Dollis displays great dynamic command in his singing, which is a fancy way of saying he feels the lyrics and makes you feel the emotion, and the extra words about Martin Luther King bring a whole new dimension of racism to the &quot;Louisiana/They&amp;#039;re trying to wash us away&quot; line. It also makes a great transition to the muted, mysterioso opening of &quot;Walk on Gilded Splinters&quot; (check), since that&amp;#039;s part of New Orleans culture the powers-to-be would love to wash away, too. The Wild Magnolias totally nail the rockin,&amp;#039; high-steppin&amp;#039; groove to the Neville Brothers&amp;#039; &quot;Voodoo&quot; with the bassline on overdrive, but a nondescript version of &quot;Quitters Never Win&quot; is a misstep, since going singles bar prowling is a too-jarring departure from the whole thrust of the disc. Toussaint&amp;#039;s &quot;Mighty Mighty Chief&quot; references &quot;Fire on the Bayou&quot; funk with a wah-wah guitar undercurrent and solid horns, and resurrects the Magnolias&amp;#039; old &quot;Handa Wanda&quot; chant. His &quot;I Know You Mardi Gras&quot; pays homage with a &amp;#039;50s R&amp;B feel that succeeds on energy and verve, second-line drums and a brass band jamming New Orleans jazz style. &quot;Hey, Hey, Indians Coming,&quot; &quot;Injuns Here They Come,&quot; and &quot;Indian Red&quot; are all solid performances of traditional Mardi Gras Indian material. But what makes 1313 Hoodoo Street such a strong Wild Magnolias album is the way it reflects the heritage it sprang from but adds in surprising, very fresh twists rather than just revisit past glories one more time. (AMG)\n\n\n01. I Been Hoodood                                                                                                 \n02. Run Joe                                                                                                        \n03. Angola Bound                                                                                                   \n04. Might Mighty Chief                                                                                             \n05. Hey Hey                                                                                                        \n06. Louisiana                                                                                                      \n07. Walk On Gilded Splinters                                                                                       \n08. Voodoo                                                                                                         \n09. Quitters Never Win                                                                                             \n10. I Know You Mardi Gras                                                                                          \n11. Injuns Here They Come                                                                                          \n12. Indian Red (Chant)  \n\n\nLabel: AIM Rec.\nReleased: 1996\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:f9d7d04c15efe407b1f9d60b30c0b41f2954d42c","amp;dn":"Bo+Dollis+%26+The+Wild+Magnolias+-+1313+Hoodoo+Street%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9d7d04c15efe407b1f9d60b30c0b41f2954d42c","infoHashBuffer":{"type":"Buffer","data":[249,215,208,76,21,239,228,7,177,249,214,11,48,192,180,31,41,84,212,44]},"announce":[],"urlList":[]}}