{"title":"American Experience  - John And Abigail Adams","uid":10489843,"size":1018691431,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb637d842dfc2121ba360d4d94750da0a2280acb&amp;dn=American+Experience++-+John+And+Abigail+Adams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1404527870,"description":"American Experience  - John And Abigail Adams\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 971 MiB\nDuration                                 : 1h 56mn\nOverall bit rate                         : 1 167 Kbps\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 718 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 16:9\nBit depth                                : 8 bits\nScan type                                : Progressive\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://image.bayimg.com/acb04f4dccc954d25263f2eb10e989c2c5c1f8b9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/acb04f4dccc954d25263f2eb10e989c2c5c1f8b9.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0496601/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0496601/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/amex/adams/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/amex/adams/&lt;/a&gt;\n\nJohn Adams was brilliant, argumentative, sometimes irascible. Abigail Adams was a savvy observer of the tumultuous political scene, not afraid to speak her mind in an age when women were excluded from politics. Together they forged one of the greatest partnerships in American history. In the tradition of its award-winning Presidents series, American Experience's John &amp; Abigail Adams chronicles both an inspiring political marriage and the birth of a nation.\n\n&quot;The Adams story provides a strikingly intimate look inside a marriage of true companions,&quot; says writer-producer Elizabeth Deane (Reconstruction: The Second Civil War, The Kennedys, Nixon), &quot;for whom life included not just the great events memorialized in textbooks, but also laughter, loneliness, and family tragedy. &quot;\n\nUnder the direction of Peter Jones (Bataan Rescue, The Great Transatlantic Cable), two formidable actors -- Simon Russell Beale (John Adams), recipient of the 2003 Laurence Olivier Theatre Best Actor Award for his performance in &quot;Uncle Vanya,&quot; and Linda Emond (Abigail Adams), an accomplished stage actress who previously portrayed Abigail in the Broadway rendition of &quot;1776&quot; -- bring the couple to life. Historians, including David McCullough, author of the bestselling John Adams and the recent 1776, Joanne Freeman, and Joseph Ellis, provide insight on the couple and their legacy.\n\nTo present the Adamses' story in their own words, Deane drew extensively on their revealing, often deeply personal correspondence, borne of their lengthy time apart while Adams served his country at the Continental Congress in Philadelphia and as a diplomat in Europe.\n\nA visionary and gifted political thinker, Adams moved a reluctant colonial Congress to declare independence from England, and single-handedly secured millions of dollars in loans to keep the American army from collapse. He penned the Massachusetts constitution, which served as the basis for the U.S. Constitution. He was the nation's first ambassador to England, its first vice president, and its second president. Through it all, Abigail remained his most trusted political advisor and confidante.\n\n&quot;She was a better judge of people than he was,&quot; says McCullough. &quot;She was a much more insightful politician, if you will. She adored him and he adored her. It's a great love story. And it's all in their letters.&quot;\n\nDespite his accomplishments, Adams was racked with self-doubt and convinced that he would be forgotten. &quot;Statues and monuments will never be erected to me,&quot; he wrote near the end of his life, &quot;nor flattering orations spoken, to transmit me to posterity in brilliant colors.&quot;\n\n&quot;To a great extent, Adams' fears that his contributions would be forgotten were realized,&quot; says American Experience executive producer Mark Samels. &quot;This film will play a role in allowing John and Abigail take their place among the other great leaders of our nation.&quot;","torrent":{"xt":"urn:btih:fb637d842dfc2121ba360d4d94750da0a2280acb","amp;dn":"American+Experience++-+John+And+Abigail+Adams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb637d842dfc2121ba360d4d94750da0a2280acb","infoHashBuffer":{"type":"Buffer","data":[251,99,125,132,45,252,33,33,186,54,13,77,148,117,13,160,162,40,10,203]},"announce":[],"urlList":[]}}