{"title":"Super Eagles - Senegambian Sensation [FLAC] TQMP","uid":6369258,"size":288892060,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fb9db57a84187931e78a2338a7d5829480d418d5&amp;dn=Super+Eagles+-+Senegambian+Sensation+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pastafari","files":-1,"time":1304619608,"description":"Super Eagles - Senegambian Sensation\n1965-1972\nRelease 2001\n\nAn out of print classic from RetroAfric. This compilation does justice to the Super Eagles. The influence they had on the music scene during the late 60s and early 70s in Senegal is rather evident here. If you like the selection featured on Senegal 70 - Musical Effervescence, from the African Pearls series, you will enjoy this one. I'm guessing fans of early Orchestra Baobab will be pleased too.\n\nOnce you've heard the psychedelic classic Love's a real thing, you'll be craving for more.\n\nLaf is a rrreeeeal ting!\n\n* * * * * * * * * * * * * * * * * * *\n\nThe Gambian band Super Eagles were pioneers of popular music in the Senegambian region at the end of the 1960s/start of the 70s, delivering a progressive blend of afrocuban, pop, soul, bluebeat, Congolese rumba, highlife and ndagga music. Using Wolof lyrics &amp; rhythms, ndagga is the basis of what was to become 'mbalax'. During their five year existence, the Super Eagles became one of the best travelled bands in West Africa.\n\nIn Bathurst (now Banjul), the capital of this ex-British colony, the first modern dance band was a loose collection of musicians who played under the name African Jazz. Members included Badou jobe, Paps Touray, Laba Sosseh (later to join Afrocuban outfits such as Africando), Modou Cham and Oussou Njie. \n\nJobe, Cham and Njie had started their careers with the Foyer Jazz Band, formed by veteran, partly classically trained musicians, which provided a rich cocktail of European &amp; Latin ballroom music, light classical, old jazz and the hugely popular morna from Cape Verde. The popular music scene, catered for by modern dance bands, had no connection with traditional music, which remained the exclusive domain of the hereditary musicians' caste known as griots.\n\nIn 1965 seven of the African Jazz musicians turned full-time professionals as The Eagles of Banjul. They played regularly in Banjul's dancehalls and throughout the country and their patron Malick Seck took them on international tours to Senegal and Sierra Leone. After Sammy Ndami left, Badou Jobe took over as bandleader, and increasingly defined the band's repertoire by composing original music.\n\nEventually the core members regrouped in 1967 as the Super Eagles. Helped with a generous gift from diamond dealer Solo Darboe, they ordered instruments, amps and a PA from England. This independence enabled them to travel and play what they liked for whom they liked.\n\nThe front men of the new Super Eagles were solo guitarist/band leader Badou Jobe, lead vocalists Paps Touray and Dauda Njie (aka Edu Haffner) and guitar/keyboard wizard Francis 'Senami' Taylor. Other members were Modou Cham (tenor sax and congas), Oussou Njie (singer and lyricist), Charles Valentine (bass) and Malan Gassama (drums, percussion), who was one of The Gambia's finest drummers.\n\nJobe assisted by Taylor formed the creative team behind most of the compositions and arrangements. The songs were mostly in Wolof or (broken) English with Touray providing some belting vocals in the style of Otis Redding - he was voted best soul singer of Africa - and the band's compositions melded elements from the indigenous music of The Gambia, specifically Wolof and Mandinka.\n\nThe Super Eagles' use of amplifiers, effects and electric keyboards to interpret African music laid the foundation for mbalax, which was popularised a decade later by Youssou N'Dour. In 1968, while touring all over the larger neighbouring country, the band earned acclaim as the top group in Senegal.\n\nThe same year they spread their pan-African influence even wider when they toured and recorded in Ghana. An eyewitness [Papa J Mensah], recalls the impression they made in Accra:\n\n&quot;The Tip-Toe Gardens, the venue for the group's appearance was fully packed for a special big, live music performance with seven of the best big bands in the country, including the African Brothers and Uhuru Dance Band. It was the equivalent of America's Night at the Apollo, with the Gambian band's performance being the finale of the whole show. And when they finally stepped up to hit a note, their presentation of their latest, brand-new, all red Marshall amplifiers and other top range equipment, together with their stage costumes, one could sense the band meant real business.\n\n&quot;By the end of the second song, the fully packed dance floor was at a standstill. Awe struck audience, dancers and groovers had all been captivated by this band. Super Eagles were truly super. A bunch of highly talented Gambian musicians tight as a live unit that played a repertoire ot all styles with unquestionable precision. I count myself one of the lucky ones at the time to have encountered the Super Eagles band from Gambia; a great African band that made a huge impact on countless swinging Ghanaian ravers and musicians alike.&quot;\n\nIn Ghana they recorded several 45rpms [tracks 1, 2 and 15, 16] including the megahit Mandal Ly which became a hit again in the 21st century at the hands of Africando.\n\nIn 1969 they visited Europe and were the first Senegambian band to tour England, where they recorded their album Viva Super Eagles, the title track of which (track 3) called on Gambians to unite in support of the group. At a memorable concert at the Commonwealth Institute in London the band was joined by Teddy Osei and Mac Tontoh, founders of Osibisa. The album was a hit throughout West Africa but, typically, the musicians claim never to have seen a penny of the royalties.\n \nJobe &amp; Touray deliberately disbanded the Super Eagles in 1972 at the height of their popularity, As pan-Africanists and music pioneers they felt the urgent need for an authentic African identity which led to the creation of the seminal roots band Ifang Bondi (Be Yourself), since grown into one of West Africa's leading bands. \n\nIn 1999 Badou lobe won the prestigious Kora All Africa Music Award - the African equivalent of the Grammy - for Best Arranger in Africa. \n-- CD liner notes.\n\n* * * * * * * * * * * * * * * * * * *\n\nSuper Eagles' Love's a real thing\n(This track is also available on the excellent compilation World Psychedelic Classics, Vol. 3: Love's A Real Thing - The Funky Fuzzy Sounds Of West Africa. Go find this comp now. You won't be disappointed!)\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n01 - Mandal Ly\n02 - Su Nous Harit\n03 - Viva Super Eagles\n04 - Dohi Gudi Bahut\n05 - Gambia Su Nous Raew\n06 - Aduna Poti Ndala\n07 - Love's A Real Thing\n08 - Hey Jude\n09 - Gambia Zambia\n10 - Don't Do That To me\n11 - Tagu Nein Lein\n12 - Aliou Gori-Mami\n13 - False Love\n14 - Gail Gain Chi Rabi\n15 - Bada Tourey\n16 - Dauda Sarge\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:fb9db57a84187931e78a2338a7d5829480d418d5","amp;dn":"Super+Eagles+-+Senegambian+Sensation+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb9db57a84187931e78a2338a7d5829480d418d5","infoHashBuffer":{"type":"Buffer","data":[251,157,181,122,132,24,121,49,231,138,35,56,167,213,130,148,128,212,24,213]},"announce":[],"urlList":[]}}