{"title":"Certain Death in Sierra Leone - The SAS and Operation Barras 200","uid":5723385,"size":19207388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbfa0b1b55f01f2449f994a8683796365d46210e&amp;dn=Certain+Death+in+Sierra+Leone+-+The+SAS+and+Operation+Barras+200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1280366863,"description":"In September 2000, eleven British soldiers were captured by a notorious militia gang in Sierra Leone. Originally deployed to fulfill peace-keeping duties in a country ravaged by civil war, the soldiers had been kidnapped by the so-called 'West Side Boys' who had already subjected the region to a reign of terror, murder and mutilation.\n\nWhen negotiations stalled, the British government decided to launch Operation Barras as a joint rescue operation by D Squadron 22 SAS and A Company 1 Para. Two four-man SAS reconnaissance patrols were inserted by boat into the villages where they provided key information about the location of the hostages and the routines, if any, of the frequently stoned and extremely volatile West Side Boys. Then, just before dawn on Sunday, September 20 2004, three Chinooks supported by two army Lynx helicopters lifted the Paras and SAS into the two villages that straddled Rokel Creek. The Lynx helicopter attacked a heavy machinegun in the southern village of Magbeni as the SAS fire teams and a hostage rescue team fast roped down from the two Chinooks. The hostages were quickly located and evacuated to safety. The SAS endured a sustained firefight with the West Side Boys, killing some and capturing their leader, &quot;Brigadier&quot; Foday Kallay, a 24-year-old former sergeant in the Sierra Leone Army.\n\nTo the south of the village, the Paras fought through the village of Magbeni driving off the remaining gang members and recovering the Royal Irish Land Rovers that had been abandoned by the kidnapped soldiers. The operation was over by late morning and the Paras completed the mission by destroying any vehicles, ammunition or equipment that had been abandoned by the gang. In the words of one SAS veteran, &quot;This was not a clinical, black balaclava, Princess Gate-type operation: it was a very grubby, green operation with lots of potential for things to go wrong.&quot;\n\nFor the first time, this daring raid is brought to life with specially commissioned artwork, detailed maps and overhead shots to recreate one of the greatest hostage-rescue success stories in recent history.\nAbout the Author\nWill Fowler has worked in journalism and publishing since 1972, reporting for European, American, Asian and Arabic magazines from Europe, the USA, the Middle East, China and SE Asia. Among his more than 30 published books is the best-selling MAA 133 Battle for the Falklands: Land Forces. A TA soldier for 30 years, he was commissioned from the ranks in 4th Bn Royal Green Jackets, and volunteered for Operation 'Granby' in the Gulf, 1990-91. In 1993 he graduated from the French Army reserve staff officers course at the Ãƒ","torrent":{"xt":"urn:btih:fbfa0b1b55f01f2449f994a8683796365d46210e","amp;dn":"Certain+Death+in+Sierra+Leone+-+The+SAS+and+Operation+Barras+200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbfa0b1b55f01f2449f994a8683796365d46210e","infoHashBuffer":{"type":"Buffer","data":[251,250,11,27,85,240,31,36,73,249,148,168,104,55,150,54,93,70,33,14]},"announce":[],"urlList":[]}}