{"title":"Osho_Bodhidharma The Greatest Zen Master-02.avi","uid":15220463,"size":158643962,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fd450d7e65e1f936a1260062d672039e39e1e116&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-02.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467731416,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #2\r\nChapter title: A pilgrimage to your own being\r\n5 July 1987 pm in Chuang Tzu Auditorium\r\nBELOVED Master,\r\nBODHIDHARMA'S BLOODSTREAM SERMON\r\nEVERYTHING THAT APPEARS IN THE THREE REALMS LEADS BACK TO THE MIND. HENCE, BUDDHAS OF THE PAST AND FUTURE TEACH MIND TO MIND WITHOUT BOTHERING ABOUT DEFINITIONS.\r\nBUT IF THEY DON'T DEFINE IT, WHAT DO THEY MEAN BY MIND?\r\nYOU ASK. THAT'S YOUR MIND. I ANSWER. THAT'S MY MIND. IF I HAD NO MIND, HOW COULD I ANSWER? IF YOU HAD NO MIND, HOW COULD YOU ASK? THAT WHICH ASKS IS YOUR MIND. &quot;THROUGH ENDLESS KALPAS WITHOUT BEGINNING, WHATEVER YOU DO, WHEREVER YOU ARE, THAT'S YOUR REAL MIND, THAT'S YOUR REAL BUDDHA. THIS MIND IS THE BUDDHA, SAYS THE SAME THING. BEYOND THIS MIND YOU'LL NEVER FIND ANOTHER BUDDHA. TO SEARCH FOR ENLIGHTENMENT OR NIRVANA BEYOND THIS MIND IS IMPOSSIBLE. THE REALITY OF YOUR OWN SELF-NATURE, THE ABSENCE OF CAUSE AND EFFECT, IS WHAT'S MEANT BY MIND. YOUR MIND IS NIRVANA. YOU MIGHT THINK YOU CAN FIND A BUDDHA OR ENLIGHTENMENT SOMEWHERE BEYOND THE MIND, BUT SUCH A PLACE DOESN'T EXIST.\r\nTRYING TO FIND A BUDDHA OR ENLIGHTENMENT IS LIKE TRYING TO GRAB SPACE. SPACE HAS A NAME BUT NO FORM. IT'S NOT SOMETHING YOU CAN PICK UP OR PUT DOWN. AND YOU CERTAINLY CAN'T GRAB IT. BEYOND THIS MIND, YOU'LL NEVER SEE A BUDDHA. THE BUDDHA IS A PRODUCT OF YOUR MIND. WHY LOOK FOR A BUDDHA BEYOND THIS MIND?\r\nBUDDHAS OF THE PAST AND FUTURE ONLY TALK ABOUT THIS MIND. THE MIND IS THE BUDDHA. AND THE BUDDHA IS THE MIND. BEYOND THE MIND THERE'S NO BUDDHA. AND BEYOND THE BUDDHA THERE'S NO MIND. IF YOU THINK THERE'S A BUDDHA BEYOND THE MIND, WHERE IS HE? THERE'S NO BUDDHA BEYOND THE MIND, SO WHY ENVISION ONE? YOU CAN'T KNOW YOUR REAL MIND AS LONG AS YOU DECEIVE YOURSELF. AS LONG AS YOU'RE ENTHRALLED BY A LIFELESS FORM, YOU'RE NOT FREE. IF YOU DON'T BELIEVE ME, DECEIVING YOURSELF DOESN'T HELP. IT'S NOT THE BUDDHA'S FAULT. PEOPLE, THOUGH, ARE DELUDED. THEY'RE UNAWARE THAT THEIR OWN MIND IS THE BUDDHA. OTHERWISE, THEY WOULDN'T LOOK FOR A BUDDHA OUTSIDE THE MIND.\r\nBUDDHAS DON'T SAVE BUDDHAS. IF YOU USE YOUR MIND TO LOOK FOR A BUDDHA, YOU WON'T SEE THE BUDDHA. AS LONG AS YOU LOOK FOR A BUDDHA SOMEWHERE ELSE, YOU'LL NEVER SEE THAT YOUR OWN MIND IS THE BUDDHA. AND DON'T USE A BUDDHA TO WORSHIP A BUDDHA. AND DON'T USE THE MIND TO INVOKE A BUDDHA. BUDDHAS DON'T RECITE SUTRAS. BUDDHAS DON'T KEEP PRECEPTS. AND BUDDHAS DON'T BREAK PRECEPTS. BUDDHAS DON'T KEEP OR BREAK ANYTHING. BUDDHAS DON'T DO GOOD OR EVIL.\r\nTO FIND A BUDDHA, YOU HAVE TO SEE YOUR NATURE. WHOEVER SEES HIS NATURE IS A BUDDHA. IF YOU DON'T SEE YOUR NATURE, INVOKING BUDDHAS, RECITING SUTRAS, MAKING OFFERINGS AND KEEPING PRECEPTS ARE ALL USELESS. INVOKING BUDDHAS RESULTS IN GOOD KARMA. RECITING SUTRAS RESULTS IN A GOOD MEMORY. KEEPING PRECEPTS RESULTS IN A GOOD REBIRTH. AND MAKING OFFERINGS RESULTS IN FUTURE BLESSINGS. BUT NO BUDDHA","torrent":{"xt":"urn:btih:fd450d7e65e1f936a1260062d672039e39e1e116","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-02.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd450d7e65e1f936a1260062d672039e39e1e116","infoHashBuffer":{"type":"Buffer","data":[253,69,13,126,101,225,249,54,161,38,0,98,214,114,3,158,57,225,225,22]},"announce":[],"urlList":[]}}