{"title":"Railworks TS2014 BR Class 27 Loco Add-On","uid":10442987,"size":78339896,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fe5799417f945935a0f1e03bb35a4f326eba32ff&amp;dn=Railworks+TS2014+BR+Class+27+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tygn547","files":-1,"time":1403921835,"description":"The mid-sized Class 27 diesel locomotive is now here for Train Simulator in British Rail Green livery. \n\nBuilt for British Rail between 1961 and 1962 by the Birmingham Railway Carriage and Wagon Company, the 69 models in the Class initially saw use around London and in Scotland. Later in their life, the majority of the Class were permanently located in Scotland to replace ageing DMUs and the older Class 17s. \n\nWith a top speed of 90mph (145 km/h), a number of Class 27s were converted to operated push-pull services between Edinburgh and Glasgow, although they were also used for freight services as well. \n\nThe intensive, high speed running of push-pull services saw reliability begin to suffer, and the Class began to be phased out of revenue generating services from 1980 onwards. The last example was withdrawn from service in 1987, although eight Class 27s have been preserved on various heritage railways in the UK. \n\nThe Class 27 for Train Simulator is available in British Railways green livery and is a former Iron Horse House model, which has been updated to TS2014 standard, including new scenarios and improved exterior modelling. Features include engine on/off buttons, AWS sunflower and reset, instrument and cab lighting, and BR Mk1 coaches in maroon livery. ","torrent":{"xt":"urn:btih:fe5799417f945935a0f1e03bb35a4f326eba32ff","amp;dn":"Railworks+TS2014+BR+Class+27+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe5799417f945935a0f1e03bb35a4f326eba32ff","infoHashBuffer":{"type":"Buffer","data":[254,87,153,65,127,148,89,53,160,241,224,59,179,90,79,50,110,186,50,255]},"announce":[],"urlList":[]}}