{"title":"Backbone.JS Blueprints (2014)","uid":10398453,"size":85009970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fec3023e4e32db8f18b7d076774995ebc3a82b64&amp;dn=Backbone.JS+Blueprints+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Johny333","files":-1,"time":1403308866,"description":"Title: Backbone.JS Blueprints\nAuthor: Andrew Burgess\nLanguage: English\nPublisher: PacktPub\nRelease Date : May 2014\nISBN : 1783286997\nISBN 13 : 9781783286997\nQuality: WebRip\nFormat: PDF\n\n[b]What you will learn from this book[/b]\nDiscover seven different ways to create your own frontend Backbone.js applications\nCreate complex interfaces while keeping the code adaptable through Backbone Views\nControl your applications' screens with simplicity through a Backbone router\nUtilize Marionette and Chaplin, the Backbone extension frameworks\nBuild a Node.js server to manage the models your frontend application sends to it and requests from it\nWork with templates that manage the heavy lifting of your view\nPrecompile your view for extra efficiency\nUse Backbone extension libraries to create effective applications with less coding\n\n[b]In Detail[/b]\nBackbone.js is an open source, JavaScript library that helps you to build sophisticated and structured web apps. It's important to have well-organized frontend code for easy maintenance and extendability. With the Backbone framework, you'll be able to build applications that are a breeze to manage.\n\nIn this book, you will discover how to build seven complete web applications from scratch. You'll learn how to use all the components of the Backbone framework individually, and how to use them together to create fully featured applications. In addition, you'll also learn how Backbone thinks so you can leverage it to write the most efficient frontend JavaScript code.\n\nThrough this book, you will learn to write good server-side JavaScript to support your frontend applications. This easy-to-follow guide is packed with projects, code, and solid explanations that will give you the confidence to write your own web applications from scratch.\n\n[b]Approach[/b]\nThis book is an easy-to-follow guide which is full of examples that will take you through building seven very different web applications with Backbone. The code is broken down into manageable bites and then thoroughly explained.\n\n[b]Who this book is for[/b]\nIf you are ready to learn about building frontend applications in Backbone, this is the book for you. Perhaps you've dipped your toe into Backbone and are ready to take the plunge. Even if you haven't, this book will teach you everything you need to know to build solid frontend apps with Backbone. You'll need to be pretty good at JavaScript and have a working knowledge of HTML and CSS, but other than that, you're good to go!","torrent":{"xt":"urn:btih:fec3023e4e32db8f18b7d076774995ebc3a82b64","amp;dn":"Backbone.JS+Blueprints+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fec3023e4e32db8f18b7d076774995ebc3a82b64","infoHashBuffer":{"type":"Buffer","data":[254,195,2,62,78,50,219,143,24,183,208,118,119,73,149,235,195,168,43,100]},"announce":[],"urlList":[]}}