{"title":"The Wrens - The Meadowlands [2003] [EAC/FLAC]","uid":10487541,"size":400807925,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ff16166609eccdbc8d995bdb2a2c9122ff80ea59&amp;dn=The+Wrens+-+The+Meadowlands+%5B2003%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":-1,"time":1404497101,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Absolutely Kosher #9\nCountry: USA\nYear: September 9, 2003\nGenre:Indie rock\nFormat: CD,Album\n\n\n01 - The House That Guilt Built\n02 - Happy\n03 - She Sends Kisses\n04 - The/This Boy Is Exhausted\n05 - Hopeless\n06 - Faster Gun\n07 - Thirteen Grand\n08 - Boys, You Won't\n09 - Ex Girl Collection\n10 - Per Second Second\n11 - Everyone Chooses Sides\n12 - 13 Months In 6 Minutes\n13 - This Is Not What You Had Planned\n\n\n\n\nThe Wrens' third album, The Meadowlands, is a sprawling, shifting affair, perhaps reflecting the fact that it took four years to create. It's easy to take the sweet, slightly alt-country &quot;13 Months in 6 Minutes&quot; at face value -- the song's epic feel suggests the passing of a considerable chunk of time, and at The Wrens' pace, it's possible that it did take over a year to craft. Rather fittingly, the album itself is also long, and the way that its songs jump and shift in tone and mood suggests a series of journal entries strung together, connected loosely by an overall brokenhearted feeling. A pair of bitterly pretty songs open The Meadowlands after the interlude &quot;The House That Guilt Built&quot; sets the tone with its early summer evening atmosphere: on &quot;Happy,&quot; The Wrens sing &quot;Are you happy?/You got what you want/I'm over it now,&quot; revealing their true feelings before shimmering guitars carry the song off on another tangent; &quot;She Sends Kisses&quot; goes from whispery, late-night anguish to high drama. Like Secaucus, most of the album trades in a classic indie rock sound -- just this side of accessible, but not overly experimental either. &quot;This Boy Is Exhausted&quot; and the new wavey &quot;Faster Gun&quot; are deceptively simple, bright, and shiny but with underlying complexities that provide a sharp contrast to the album's gentler moments, such as the shambling beauty of &quot;Thirteen Grand&quot; and the sweetly twangy &quot;Ex-Girl Collection.&quot; The Meadowlands saves some of its most rock moments for the end of the album: &quot;Per Second Second,&quot; an angular, Pixies-esque bit of punk, and the anthemic &quot;Everyone Chooses Sides&quot; send the album out in a blaze of glory that initially seems a little at odds with the melancholy tone of the rest of the album but, after a few listens, reveals itself as strangely appropriate. It's possible that The Meadowlands might be a &quot;better&quot; album if it were more focused and logical, but there's something to be said for its immersive, stream-of-consciousness approach. It's also tempting to say that hopefully it won't take The Wrens as long to make their next album as it did to make The Meadowlands, but when the results are this good, the time it took to make the album is more than justified.","torrent":{"xt":"urn:btih:ff16166609eccdbc8d995bdb2a2c9122ff80ea59","amp;dn":"The+Wrens+-+The+Meadowlands+%5B2003%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff16166609eccdbc8d995bdb2a2c9122ff80ea59","infoHashBuffer":{"type":"Buffer","data":[255,22,22,102,9,236,205,188,141,153,91,219,42,44,145,34,255,128,234,89]},"announce":[],"urlList":[]}}