{"title":"Jorma Kaukonen &amp; Vital Parts-Live At Rockpalast-1980-2009","uid":4991452,"size":109419110,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff64cd0ddd768e9847a87ee58826324e2af6d3f8&amp;dn=Jorma+Kaukonen+%26+Vital+Parts-Live+At+Rockpalast-1980-2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1247066988,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nVA-The Motown Story-25 Years Of Great Original Hits-cd 1-6\n\nJorma Ludwik Kaukonen Jr. (born December 23, 1940 in Washington, D.C.) is an American blues, folk and rock guitarist.\nBorn to a Finnish American father and a Jewish American mother, employed by the U.S. foreign service, Kaukonen was a founding member of the popular psychedelic San Francisco-based band Jefferson Airplane, which scored two Top 10 radio hits in 1967 with &quot;Somebody to Love&quot; and &quot;White Rabbit.&quot;\nKaukonen learned to play guitar as a teenager in Washington, D.C. But before moving to the DC area, Jorma and family lived in the Philippines and other locales as he followed his father's career from assignment to assignment before returning to the place of his birth. As a teenager in Washington he and future Jefferson Airplane bassist Jack Casady (who at the time played six-string guitar) formed a band named The Triumphs. Kaukonen departed Washington for studies at Antioch College where friend Ian Buchanan taught him fingerstyle guitar playing. Buchanan also introduced Kaukonen to the music of Reverend Gary Davis, whose songs have remained important parts of Kaukonen's repertoire throughout his career.\nIn 1962 Kaukonen moved to the San Francisco Bay Area and enrolled in Santa Clara University. During this time he taught guitar lessons at Benner Music Company in San Jose. As a self-described blues purist, Kaukonen never had any ambition to play in a rock band. He played as a solo act in coffee houses and can be heard accompanying a young Janis Joplin on acoustic guitar on an historic 1964 recording (known as &quot;The Typewriter Tapes&quot; because of the obtrusive sound of Kaukonen's first wife Margareta typing in the background). Invited to attend a Jefferson Airplane rehearsal by founding member Paul Kantner, Kaukonen found his imagination excited by the arsenal of effects available to electric guitar and later said, &quot;I was sucked in by technology.&quot;\nJorma Kaukonen is a member of the Rock'n'Roll Hall of Fame.\n\n","torrent":{"xt":"urn:btih:ff64cd0ddd768e9847a87ee58826324e2af6d3f8","amp;dn":"Jorma+Kaukonen+%26+Vital+Parts-Live+At+Rockpalast-1980-2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff64cd0ddd768e9847a87ee58826324e2af6d3f8","infoHashBuffer":{"type":"Buffer","data":[255,100,205,13,221,118,142,152,71,168,126,229,136,38,50,78,42,246,211,248]},"announce":[],"urlList":[]}}