{"title":"Payday 2 - All DLC - All Patches - Lan enabled - Tunngle ready","uid":10836466,"size":8467424100,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ffd23ff6a56fad4c5d0edeb1e4d311339db19b22&amp;dn=Payday+2+-+All+DLC+-+All+Patches+-+Lan+enabled+-+Tunngle+ready&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Zatirri","files":-1,"time":1408699389,"description":"Payday 2 With all DLC, patches and Tunngle ready.\nReadme.txt on how to get it started included.\n\n\n--------------------------------------------------------------------------------\n\n\n1- Download the torrent\n2- Extract the torrent to anywhere on your PC\n3- Read the Readme.txt\n4- Change your name by following the instructions in the readme.txt\n5- Continue to seed the torrent so others can get and join the game also.\n      *The more people who have it running, the more games you'll be able to join/play :)\n6- Make sure you have Tunngle on your PC\n7- Follow Tunngle's instructions to port forward the Tunngle port\n8- Join the Payday 2 [10.x.x.x] network]\n9- Run both Tunngle and the Launcher.exe as administrator (Giving them both access to both public and private networks)\n10- select offline/LAN once you've ran the Launcher.exe\n11- Go onto crime.net\n12- Join a game\n13- Die horrendously because you're new to the game and have no decent items or armour\n14- Eventually get used to the game and start getting better and bringing in items and perks.\n15- Spend all of the money you needed to buy your next perk on a mask that's totally cool.\n16- Get bored of your mask (Must be done immediately after step 15)\n17- Regret buying the mask\n18- Spend the rest of your life grinding missions.\n\n\n--------------------------------------------------------------------------------\n\n\nI compressed the file down as much as I could in order to make the download as quick as possible, sorry if the unpacking takes a while. \nIf you have any issues, leave a comment and I'll get back to you ASAP.\nI MAY be able to help with things not directly to do with this torrent (That still hinder your ability to play via Tunngle) but I cannot stress how much help the Tunngle community will be more than myself. \n\n\nIF THIS TORRENT WORKS FOR YOU THEN MAKE SURE YOU SEED IT FOR OTHERS.\nAnd always remember, shooting a civilian in the head is not only practical at times, but fun. \n\nThis game is also playable via local connection if your're not interested in Tunngle. No additional files required.\n\nTried and tested on 5 machines, all working with no effort beyond changing the name. (Windows 7, Windows 8, Windows 8.1)\n\nIf you're on a MAC, if it doesn't work, try buying a new MAC, repeat until you run out of money or the game works.\n\nHit me up on Tunngle - Zantonny\nOr in game           - Zanton\n\nI did not create any of the individual parts of this Torrent, I only put them together for ease of use. All credit should go to the great minds that put these things together for our use.","torrent":{"xt":"urn:btih:ffd23ff6a56fad4c5d0edeb1e4d311339db19b22","amp;dn":"Payday+2+-+All+DLC+-+All+Patches+-+Lan+enabled+-+Tunngle+ready","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffd23ff6a56fad4c5d0edeb1e4d311339db19b22","infoHashBuffer":{"type":"Buffer","data":[255,210,63,246,165,111,173,76,93,14,222,177,228,211,17,51,157,177,155,34]},"announce":[],"urlList":[]}}