{"title":"Rogue Touch by Christine Woodward","uid":9739993,"size":1318680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fff24bf5684010e32d72264006a7d037b6fb0eea&amp;dn=Rogue+Touch+by+Christine+Woodward&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":3,"time":1394496832,"description":"\nTwenty-year-old Anna Marie was just fired for the third time--this time from a bakery. Why can't she hold a job? Well, for starters, she dresses . . . differently. She looks like a Goth girl to the extreme, her shock of white hair contrasting with her head-to-toe black garb, her face the only skin she chooses to reveal. But Anna Marie doesn't have a choice. \n\nHer skin, her touch, is a deadly weapon that must be concealed. She accidentally put her first boyfriend, Cody, in a coma when they kissed. Horrified, she ran away to Jackson, Mississippi, where she's been living alone in a cramped apartment and scraping by on food stamps.\n\nThen she meets otherworldly James and everything changes. He's just like her--completely alone and also on the run. To elude James's mysterious and dangerous family, the pair takes to the highway. As they cross the country, their simmering attraction intensifies and they both open up about their secretive pasts. \n\nJames reveals that his true name is Touch and he christens Anna Marie Rogue. But with danger at their heels, they know they can't run forever. Rogue must decide if she'll unleash her devastating powers once again, which she swore never to do, in order to save the only person who seems truly to understand and accept her.\n\nGenre: Fantasy | Romance | Young Adult | Superhero","torrent":{"xt":"urn:btih:fff24bf5684010e32d72264006a7d037b6fb0eea","amp;dn":"Rogue+Touch+by+Christine+Woodward","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fff24bf5684010e32d72264006a7d037b6fb0eea","infoHashBuffer":{"type":"Buffer","data":[255,242,75,245,104,64,16,227,45,114,38,64,6,167,208,55,182,251,14,234]},"announce":[],"urlList":[]}}